[{"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Today my 2018 Pilot ex-l suddenly started displaying these warnings: - trailer stability assist (tsa) problem - hill start assist problem - vehicle stability assist (vsa) problem - power steering system (eps) problem looking at Honda Pilot forums, it seems like it is a very common problem and has to do with fuel injectors as described https://static. Nhtsa. Gov/odi/tsbs/2021/mc-10187289-0001. . Read more...\n", "fail date": "  11/30/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Problem with start-stop system. Engine shuts off when vehicle is stopped but engine does not restart at times. Dealership could not find a problem and said they’ve never heard of it happening to anyone else, but a simple online search shows that it is a problem and NHTSA has an open investigation. Very dangerous when the vehicle doesn’t restart at a stop light or in stop and go traffic. Honda needs to step up and rectify immediately!.", "fail date": "  11/24/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "On at least three occasions after being stopped at a light the engine suddenly died (not simply auto idle stop). After putting in park and shutting off ignition (button start) and waiting some time the vehicle could be restarted. Battery is good. Fuel is good. Injectors already replaced. Dangerous as vehicle may be unexpectedly on powered while in traffic.", "fail date": "  11/17/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Car does not turn on after stopping at a red light with auto start/off on. Turns on after being jump started. Also windows automatically come down without pressing any buttons after opening or turning off car. Dealer reports no issues. Battery has been changed with no solution. Car is inoperable with concern for pedestrian safety and personal safety.", "fail date": "  11/17/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Car won’t start after auto stop engages at red lights. I was on a busy road at a red light when my car wouldn’t restart. I had to sit a few embarrassing minutes (felt longer) turning the car off and on until it finally restarted. I noticed the issue occurred a few months ago as well, but because it only happened once I wasn’t concerned. This time was on a very busy road with cars coming 45mph towards me. Since the first incident, I did notice when it auto starts 9/10 times it turns my radio off and my cabin lights cut on then off (as if I’m starting the whole car again). Sometimes it will flash lights on the dash as well but I cannot recall which ones (I know battery is one). I try to remember to turn the feature off every time I get in my car, because you can’t turn it off and leave it off.", "fail date": "  11/03/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I was stopped at a red light, the engine cycled down because of the environmentally friendly option. My foot was on the break. The transmission shifted to neutral and turned orange. I could not get it to shift back to drive. I had to turn the car off and restart it. At that point I was able to put it in drive and move the car. This was very dangerous because I was on a busy highway and could have been rear ended by a driver not noticing the car was stopped and off.", "fail date": "  11/02/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "At 50,000 miles the car started to make a clanking noise. The car was checked no issued were found. At 60,000 oil change was preformed vehicle was checked no issued were found. At 63,000 the following lights came on at once: check engine, tsa, hill start problem. Took the car again to get checked and now they have stated the car needs a new engine no lights had previously came on.", "fail date": "  10/22/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I was driving on a city street, during traffic I came to a complete stop and the car turned off the engine automatically by the idle-stop feature. When traffic was moving, I lifted my foot off the brake pedal expecting the engine turn back on and move forward but the engine never started and I tried to start the engine manually stepping on the brake and press the engine start button but in didn't work either, all the while I could have easily gotten rear-ended by driver behind me. Luckily other drivers were paying attention but nonetheless I was pressure to move my car. After struggling for 5 minutes, I finally manage to restart the engine again. I am the original owner and service my car at the dealer and the car only have 39160 miles on it. This problem happened before but is happening more often now, which is causing more safety concerns for me.", "fail date": "  10/19/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The vehicle routinely shuts off at intersections and is unable to restart. This often causes traffic to back up behind the vehicle and vehicles around us having to make sudden stops. This occurs during normal driving conditions about 3 times/month. It seems to be attributed to the automatic shut-off feature but does not restart as it should when operating properly.", "fail date": "  10/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "On September 27, 2022 the vehicle start/stop failed at georgetown texas highway 195/i35 overpass stop light. When the light changed the vehicle started to move forward then stalled in the left lane. I engaged the emergency flashers, stopped the vehicle, put it in park and proceeded to restart the vehicle. During this event, there were several near misses including a gravel truck. I believe a review of service orders will conclude the vehicle’s engine start/stop feature has been problematic for a few years.", "fail date": "  09/27/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The engine stop feature did not allow the car to restart at multiple stops. I was not able to immediately restart the car. It did restart after some time. This was concerning, since I was stuck on the middle of an intersection. There are no problems if we immediately disable this feature when starting the car.", "fail date": "  09/26/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Was in the middle of an intersection and pressed the button to turn off engine idle mode as I have had instances where it was very slow to go when this mode is on and it delays getting out of the way of other drivers. When I pressed the idle off button - the car “shut down” and went into neutral. I could not get it out of neutral. Pressed d, r, p. Multiple times. Didn’t work. Had to press the turn off car button twice to turn off car then it finally restarted. I was stranded in the intersection and almost got hit by several cars. Once it started I pulled into a gas station and the radio stopped working. I turned off the car and restarted. Then the engine wasn’t shifting properly. Shut off the car again and went to the dealer. Dealer ran diagnostics and couldn’t find a problem. Checked the battery and all other items - no issues. Somebody is going to get killed and now I’m scared to drive my car.", "fail date": "  09/16/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I was on a six lane highway at a traffic light. The idle stop engaged while I was sitting for the light to turn green. I released the break and the car didn’t start. I tried to put the car in park and push the start button and the car wouldn’t start. I sat through a couple light cycles in the middle lane with my hazards on. I turned off all accessories and the car did start and I was able to drive off.", "fail date": "  09/10/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Sitting at stoplight with the auto start on (turns off at light to save emissions). Light turned green took foot off brake, the car died, had to push the start button a few times before car would turn back on. This has happened to us twice.", "fail date": "  09/04/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The engine engages the auto-idle feature but fails to restart at stopping points in the roadway or at intersections. This leaves the occupants stranded in the roadway in traffic congestion. There were no warning indicator lights on the dashboard before the incident indicating a potential issue.", "fail date": "  08/31/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "We are original owners of the vehicle. At busy intersections, including when in the middle of the intersection for a left turn, the car has shot off with the auto-off feature. Upon removing our foot from the brake the truck shut off completely (engine should have restarted). To restart the vehicle we had to ensure we were in park and restart the engine. This catches the driver off guard and creates a panic which is not safe. This has happened about 10 times since owning the vehicle. During my last service appointment I reported the incident, and they checked the battery to ensure it was not a battery related issue. Since that appointment in February we have had this happen ~3-4 times. There is no option to just disable the auto off. Se we are doing our best to remember to DE-activate it every time we start the engine. I'm taking the car in for service again within the next week and will have them recheck the battery.", "fail date": "  08/26/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "This has happened to me about 10 times in this vehicle: I am at a stoplight or stopsign and my \"idle-stop\" system in the Honda shuts down my engine and then when my foot comes off the brake it does not restart like it is supposed to leaving me stranded in the middle of traffic with a non moving vehicle. I think this is extremely dangerous and I am scared this will cause a terrible accident if not fixed. The only way the engine restarts is after about 30 seconds to a minute it finally is able to power back on. Please have Honda issue a recall for this issue.", "fail date": "  08/23/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "On multiple occasions / almost daily the engine auto shut off kills the engine completely. The vehicle needs to be restarted to get moving. This poses as a significant safety hazard. This delay is going to get someone killed. The engine dies at stop lights, stops signs, off ramps and sitting in traffic. A complaint was made to the Honda dealer on 4 or more occasions with them informing us they can not replicate the issue and there isn’t a safety recall on it yet. This issue has gotten so bad that I am thinking about selling this car do to a safety issue. Honda is usually a trustable brand and stand by their brand, but some reason they will not admit to this reoccurring problem in the Honda Pilots.", "fail date": "  08/22/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The automatic stop-start feature has had multiple issues in the last two years on my 2018 Honda Pilot elite. The lesser issue has resulted in all systems turning off when the brake pedal is pushed all the way down. While the usual, expected result is just the engine cutting off, many times the entire electrical system shuts down. On two (seemingly random) cases, however, the car did not restart for quite some time. Once was at an interaction, the other was in stop/go traffic in the rain on the highway. Here is where it could have been catastrophic as I could not even turn on my flashers to warn (in low visibility) that I was stopped while all other traffic was flowing. In neither case did I require a jump start and I have never had any reason to blame the battery. Even in the winter, the car starts right up (here in virginia). My local Honda dealership is claiming that I need a new battery and a software update. I have a claim in to Honda customercare (even have a case manager assigned), but I have not heard from them in the last 3 days.", "fail date": "  08/18/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "On 8/15/22 I was driving my Honda Pilot. I came to a stop and when I proceeded to accelerate the car got stuck in low gear and would not pick up speed. It made a strange sound and I could feel a hard bang and it kept getting stuck in low gear. I took the car to the dealer immediately and was told the 5th gear pressure switch had failed. The transmission has a 60000 mile warranty but I was told this part was not under warranty since even though it controls the transmission it is not part of it. This is a very dangerous situation because if I was trying to accelerate to go on a freeway the car would not have been able to pick up speed and I could have been in an accident. Honda has not helped me at all even though I filed a complaint with them and they only offered me a $300 voucher instead of covering a known defect in their vehicle. I feel this car should be recalled for this defect.", "fail date": "  08/15/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Routinely if the auto stop is on the car will stall out when you try to accelerate from a stop. It will completely die, multiple errors will flash on the board. The car will be completely unresponsive. Eventually I have thus far been able to restart the car but it frequently happens at intersections and I am constantly concerned about getting rear ended. The dealership denies there is a problems. I have replaced the car battery and even with a brand new battery the same things happens. Only way to prevent it, is to disengage the idle/stop every single time you enter the car.", "fail date": "  08/09/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Auto start stop function is activated at stop light. Upon releasing the brake to accelerate, the car shuts off completely and am unable to restart vehicle immediately. Requires me to push on/off button a few times to get vehicle back on and running.", "fail date": "  08/06/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Our Honda Pilot began stalling four years after purchasing the vehicle. When the Honda was stopped, the engine shut off but the engine wouldn't automatically restart when the accelerator was pressed. I fortunately was able to get the Honda to restart after a couple tries.", "fail date": "  08/02/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The engine stop start function fails to \"start\" the truck in traffic when the failure happens 60% of the time you can follow on dash instructions and restart the truck - the remaining 40% it will only restart after you jump start the vehicle with another car. This has left my wife stranded 2 times in a busy intersection and we had to get jump started in the busy intersection while in this state we also could not put the vehicle in neutral to move it from the intersection trapping it where it was until it was jump started.", "fail date": "  08/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The automatic stop/start for the engine is failing. It stops at inopportune times, and it is very slow to restart. Sometimes I have to put it in park and push the start button. This has been problematic at intersections and it has been happening more and more frequently. The SUV only has 24,000 miles on it.", "fail date": "  08/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The automatic engine stop-start feature of the car is having serious issues, the car engine shuts off automatically after stopping the car at stop signs/red lights etc and does not restart automatically after releasing the brake. This has been an intermittent issue and has happened noticeable number of times till now. When the system does not restart its asks to pull over without having engine turned on which is conflicting message. I have spoke to the dealership and they say there is no known issues with the system which says otherwise based on my research multiple customers are facing this issue. Though not a huge safety risk, unable to start a car in busy intersection induces some amount of safety hazard.", "fail date": "  07/30/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "After the car was stoped at a red light with the auto-idle feature on, the car stalled out when I pressed the gas petal to drive. The radio and a/c shut off and a park warning displayed. It took several attempts to turn the car back on. After the car started it took several minutes for the radio to start working again. None of the touch buttons for radio, phone or navigation would respond. This happened when I was at a light after getting off the highway. It almost caused a car accident with the drivers around me who were coming off the highway. Since this happened, every time I turn on the car, the radio stations can not be found. I have to turn the radio off/on once or twice for the car to find the stations. Frequently, when I go from stop to drive at lights or stop signs, the radio and ac will turn off for a second. This seems to only happen when the auto idle feature is on. The car transmission is also having lurching when going from 1st to 2nd gear.", "fail date": "  07/16/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "While stopped at a red light and stopped at a 4-way intersection my 2018 Honda Pilot turned completely off. It was not in engine idle mode. A message flashed up on my dash saying to put my car in park.", "fail date": "  07/15/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Engine unable to restart after stopping at traffic light. When auto engine is enabled I have faced this problem multiple times and it was unable to restart. Traffic backed up because I could not go forward. I had to literally shut down everything and then start the engine again. I have already seen this news that you guys are investigating this issue with Honda. Now I disable my engine before I start my journey.", "fail date": "  07/12/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I was stopped at a stop light and the car was in auto engine idle. After releasing the brake when the light turned green, the engine shut off and the dash told me to put the car in park and restart by pushing the brake and hitting the engine start button. This process took about 30 seconds for the car to finally restart and I was sitting in the middle of traffic with cars behind me that had anticipated me moving forward when the light changed. Several warning symbols popped up including the collision mitigation system. This is an easy way to get rear-ended. In other instances, I have had issues where the radio and engine shuts off after releasing the brake when in auto engine idle at a stop light or driving in slower traffic but it kicks back on in just a second with no need to stop and restart. Both of these issues are very concerning. Battery life is fine, so that is not the issue. Issue stops when auto engine idle is disabled.", "fail date": "  07/06/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The auto off/on is dangerous. Multiple time the car does not turn back on and everything turns off. A few times the car started to roll backwards, when on a hill and I took my foot of the break. The car didn't start, I had to reapply the break and push the start button again.", "fail date": "  07/05/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The contact owns a 2018 Honda Pilot. The contact stated while driving in stop and go traffic, the vehicle would engage the engine stop/start fuel saving feature while stopped. The contact stated that whenever she depressed the accelerator pedal the message \"place vehicle in park\" displayed. The contact stated that the vehicle failed to restart, with several unknown warning lights illuminated. The contact attempted to start the vehicle using the push to start button. The vehicle was restarted but failed to respond after shifting into drive. The vehicle was restarted several times before resuming normal operation. The contact had not taken the vehicle to a local dealer or independent mechanic. The vehicle was not diagnosed nor repaired. The contact stated that the failure recurred. The manufacturer had not been informed of the failure. The failure mileage was approximately 50,000.", "fail date": "  07/04/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "On multiple occasions over the past month or so, my wife has experienced engine issues associated with what we believe is the auto start/stop function on our 2018 Honda Pilot (touring edition). Upon coming to a complete stop, the auto stop function disables the engine. Upon releasing the brake, the system is supposed to restart the engine. However, on at least five occasions the engine has not restarted, and it has required her to turn the vehicle off and completely restart it as if starting from cold. This has occurred at stop lights, which obviously could cause safety issues/implications. On at least a couple of the occasions, she had to attempt to restart the vehicle multiple times by applying the brakes and pressing the main start/stop button). I frequently drive the vehicle and always turn off the auto start/stop function. I have never run into these issues whatsoever. The vehicle is scheduled for routine maintenance at a Honda dealership in two days; the vehicle is serviced solely at this same dealership. The issue will be brought to their attention as well.", "fail date": "  07/03/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Car when in the idle stop has not restarted for several minutes. Some times it starts back up within 5 seconds. Other times it shuts the engine down and tells me to hit the start button to turn vehicle on, but then nothing happens. I am not even able to put car in neutral. Most recently this happened while exiting off a highway on the ramp. A bus driver pulled over in attempts to help me get the car off the ramp. However, a minute into trying to get it into neutral, the car popped back into drive and the engine on so I could get home. Car has been brought in multiple times and the dealership says they cannot find anything wrong with the car.", "fail date": "  06/28/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I was at the red light stop, when I got green light, I moved my feet off of brake, engine did not wake up or restart. I pushed gas pedal but the car would not move, then it showed all kinds of lights on dashboard. Afterwards, the car showed a sign asking to shift into parking, which I did. The engine start button could not restart or turn the car comepletely for a minute. After 2 minutes the card started it again and there was no light on dashboard.", "fail date": "  06/27/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Numerous restart issues when car in in idle mode stopped at a traffic light or stop sign. Car does not idle but completely powers off. I'm required to place car into \"park\", turn on power, shift to drive in order to accelerate.", "fail date": "  11/21/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "On at least three occasions after being stopped at a light the engine suddenly died (not simply auto idle stop). After putting in park and shutting off ignition (button start) and waiting some time the vehicle could be restarted. Battery is good. Fuel is good. Injectors already replaced. Dangerous as vehicle may be unexpectedly on powered while in traffic.", "fail date": "  11/17/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Car does not turn on after stopping at a red light with auto start/off on. Turns on after being jump started. Also windows automatically come down without pressing any buttons after opening or turning off car. Dealer reports no issues. Battery has been changed with no solution. Car is inoperable with concern for pedestrian safety and personal safety.", "fail date": "  11/17/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "I was stopped at a red light, the engine cycled down because of the environmentally friendly option. My foot was on the break. The transmission shifted to neutral and turned orange. I could not get it to shift back to drive. I had to turn the car off and restart it. At that point I was able to put it in drive and move the car. This was very dangerous because I was on a busy highway and could have been rear ended by a driver not noticing the car was stopped and off.", "fail date": "  11/02/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The vehicle routinely shuts off at intersections and is unable to restart. This often causes traffic to back up behind the vehicle and vehicles around us having to make sudden stops. This occurs during normal driving conditions about 3 times/month. It seems to be attributed to the automatic shut-off feature but does not restart as it should when operating properly.", "fail date": "  10/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Was in the middle of an intersection and pressed the button to turn off engine idle mode as I have had instances where it was very slow to go when this mode is on and it delays getting out of the way of other drivers. When I pressed the idle off button - the car “shut down” and went into neutral. I could not get it out of neutral. Pressed d, r, p. Multiple times. Didn’t work. Had to press the turn off car button twice to turn off car then it finally restarted. I was stranded in the intersection and almost got hit by several cars. Once it started I pulled into a gas station and the radio stopped working. I turned off the car and restarted. Then the engine wasn’t shifting properly. Shut off the car again and went to the dealer. Dealer ran diagnostics and couldn’t find a problem. Checked the battery and all other items - no issues. Somebody is going to get killed and now I’m scared to drive my car.", "fail date": "  09/16/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "On multiple occasions the idle stop feature will engage and upon re-engage it will stall my vehicle. When I place the vehicle in park, press the brake and press the ignition start, nothing happens. Upon multiple attempts to restart the car it will either do nothing or making a chug without restarting. Continuing my attempts to restart the vehicle it will finally restart. During these times I will be stalled at a stop sign or traffic light with impatient drivers going around me. All the dashboard lights come on. I have taken it to the dealership, they stated they couldn’t duplicate the problem. This is unsafe for motorists or pedestrians. If this happens while I'm in an intersection or other location with moving traffic it could be very unsafe for myself, other motorists and/or pedestrians.", "fail date": "  09/15/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Multiple incidences of vehicle power shutting off unexpectedly including at a stop light in busy major downtown causing a dangerous situation and requiring police assistance. Start will fail unexpectedly requiring a period of time before another attempt or a jump start.", "fail date": "  08/23/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "On multiple occasions / almost daily the engine auto shut off kills the engine completely. The vehicle needs to be restarted to get moving. This poses as a significant safety hazard. This delay is going to get someone killed. The engine dies at stop lights, stops signs, off ramps and sitting in traffic. A complaint was made to the Honda dealer on 4 or more occasions with them informing us they can not replicate the issue and there isn’t a safety recall on it yet. This issue has gotten so bad that I am thinking about selling this car do to a safety issue. Honda is usually a trustable brand and stand by their brand, but some reason they will not admit to this reoccurring problem in the Honda Pilots.", "fail date": "  08/22/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The automatic stop-start feature has had multiple issues in the last two years on my 2018 Honda Pilot elite. The lesser issue has resulted in all systems turning off when the brake pedal is pushed all the way down. While the usual, expected result is just the engine cutting off, many times the entire electrical system shuts down. On two (seemingly random) cases, however, the car did not restart for quite some time. Once was at an interaction, the other was in stop/go traffic in the rain on the highway. Here is where it could have been catastrophic as I could not even turn on my flashers to warn (in low visibility) that I was stopped while all other traffic was flowing. In neither case did I require a jump start and I have never had any reason to blame the battery. Even in the winter, the car starts right up (here in virginia). My local Honda dealership is claiming that I need a new battery and a software update. I have a claim in to Honda customercare (even have a case manager assigned), but I have not heard from them in the last 3 days.", "fail date": "  08/18/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Auto start stop function is activated at stop light. Upon releasing the brake to accelerate, the car shuts off completely and am unable to restart vehicle immediately. Requires me to push on/off button a few times to get vehicle back on and running.", "fail date": "  08/06/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The engine stop start function fails to \"start\" the truck in traffic when the failure happens 60% of the time you can follow on dash instructions and restart the truck - the remaining 40% it will only restart after you jump start the vehicle with another car. This has left my wife stranded 2 times in a busy intersection and we had to get jump started in the busy intersection while in this state we also could not put the vehicle in neutral to move it from the intersection trapping it where it was until it was jump started.", "fail date": "  08/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The automatic stop/start for the engine is failing. It stops at inopportune times, and it is very slow to restart. Sometimes I have to put it in park and push the start button. This has been problematic at intersections and it has been happening more and more frequently. The SUV only has 24,000 miles on it.", "fail date": "  08/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The automatic engine stop-start feature of the car is having serious issues, the car engine shuts off automatically after stopping the car at stop signs/red lights etc and does not restart automatically after releasing the brake. This has been an intermittent issue and has happened noticeable number of times till now. When the system does not restart its asks to pull over without having engine turned on which is conflicting message. I have spoke to the dealership and they say there is no known issues with the system which says otherwise based on my research multiple customers are facing this issue. Though not a huge safety risk, unable to start a car in busy intersection induces some amount of safety hazard.", "fail date": "  07/30/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "After the car was stoped at a red light with the auto-idle feature on, the car stalled out when I pressed the gas petal to drive. The radio and a/c shut off and a park warning displayed. It took several attempts to turn the car back on. After the car started it took several minutes for the radio to start working again. None of the touch buttons for radio, phone or navigation would respond. This happened when I was at a light after getting off the highway. It almost caused a car accident with the drivers around me who were coming off the highway. Since this happened, every time I turn on the car, the radio stations can not be found. I have to turn the radio off/on once or twice for the car to find the stations. Frequently, when I go from stop to drive at lights or stop signs, the radio and ac will turn off for a second. This seems to only happen when the auto idle feature is on. The car transmission is also having lurching when going from 1st to 2nd gear.", "fail date": "  07/16/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "I was stopped at a stop light and the car was in auto engine idle. After releasing the brake when the light turned green, the engine shut off and the dash told me to put the car in park and restart by pushing the brake and hitting the engine start button. This process took about 30 seconds for the car to finally restart and I was sitting in the middle of traffic with cars behind me that had anticipated me moving forward when the light changed. Several warning symbols popped up including the collision mitigation system. This is an easy way to get rear-ended. In other instances, I have had issues where the radio and engine shuts off after releasing the brake when in auto engine idle at a stop light or driving in slower traffic but it kicks back on in just a second with no need to stop and restart. Both of these issues are very concerning. Battery life is fine, so that is not the issue. Issue stops when auto engine idle is disabled.", "fail date": "  07/06/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "When vehicle comes to a stop, vehicle start/stop feature engages, then vehicle stalls. Vehicle then indicates that it should be shifter into park before it can be re-started. This has happened numerous times. Vehicle was brought into dealer, they are aware an investigation is underway with Honda but had no known solution besides updating the main computer program. They also recommended replacing the batter which tested ok. The fact that the vehicle stalls when you come to a stop is a very big safety concern.", "fail date": "  07/05/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Car when in the idle stop has not restarted for several minutes. Some times it starts back up within 5 seconds. Other times it shuts the engine down and tells me to hit the start button to turn vehicle on, but then nothing happens. I am not even able to put car in neutral. Most recently this happened while exiting off a highway on the ramp. A bus driver pulled over in attempts to help me get the car off the ramp. However, a minute into trying to get it into neutral, the car popped back into drive and the engine on so I could get home. Car has been brought in multiple times and the dealership says they cannot find anything wrong with the car.", "fail date": "  06/28/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Auto idle system failed and the car stalled at a streetlight. The auto-idle kicks in when car comes to a stop like it’s supposed to but when I release my foot off the break and the car is supposed to start back up it stalls. It can take anywhere from 45 seconds to 1 minute to get it into park and get the car to restart. During which time I’ve been honked at by other cars but thankfully haven’t been hit yet. I worry about it happening and I get hit because I’ve been in the way of traffic and unable to move. Very scary situation to be in. This has happened on 4 separate occasions over the last couple months, the most recent one was June 19th. I now try to remember to turn the system off every time I get into the car to drive. Dealership tested battery and it came back fine.", "fail date": "  06/19/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Car shuts off and does not turn back on properly when stopping while driving. It does not happen all of the time, but when stopping at light/stop sign the car will turn off like it is supposed to but fails to start back up. When it fails to start it will not start back up, because the car is not in park, so the push button will not work until you hit the park button.", "fail date": "  05/23/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The contact owns a 2018 Honda Pilot. The contact stated that while stopped at a traffic light, however, the brake pedal was not fully depressed; the contact then depressed the accelerator pedal and the vehicle stalled without warning. The contact restarted the vehicle soon after the failure and resumed normal driving. The vehicle was taken to the dealer where a diagnostic test was performed; however, the mechanic was unable to duplicate the failure or determine the cause of the failure. The manufacturer was notified of the failure and informed the contact that the VIN was not under recall. The vehicle was not repaired. The failure mileage was approximately 52,500.", "fail date": "  04/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The contact owns a 2018honda Pilot. The contact stated that while driving at approximately 40 mph, she depressed the brake and noticed that her vehicle was not slowing down. The contact stated that as she was approaching another vehicle , she looked to make sure she was indeed depressing the brake pedal , however it would not allow her to press down and seemed to be accelerating faster than 40 mph. The contact stated that her vehicle then caused her to crash into the back of another vehicle, however the vehicle still seemed to be accelerating, even though it had crashed. The contact stated that she attempted to power the vehicle off , however the vehicle powered itself back on. The contact stated that she powered it off 3 times before the vehicle would remain off. The contact stated that the airbags did deploy, however she, nor the other driver sustain any injuries due to the failure. The contact stated a police report was made , but medical attention was not required. The contact stated she then had her vehicle towed to a tow yard where it was deemed a total loss. The contact stated that she has not contacted the dealer ,or the manufacturer at this time. The failure mileage was 50,000.", "fail date": "  02/27/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The auto-idle feature will unexpectedly over-engage while coming to a stop and the entire vehicle will shut off. I am unable to shift, steer, etc. It will also completely shut the engine down when at a complete stop. To be clear, this is not the normal auto-idle. When the full engine disengage happens, the entire vehicle loses power and the dash flashes. The vehicle states, \"put into p\". Once in \"p\" for park, the vehicle still will not restart. It is as if the vehicle has to \"reset\" itself. It has taken upwards of 4 minutes for the vehicle to restart. This has happened on a highway during construction traffic, approaching a stop sign, slowing at a red light on multiple occasions. I have almost been rear-ended as a result on mutiple occasions. I am not even able to put the vehicle in neutral to move it to a safe spot. Honda informed me that I \"just need to disengage this feature each and every time I start the vehicle\" . That is not the solution. This feature should be permanently disabled by Honda. Immediately.", "fail date": "  02/06/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The auto engine idle \"feature\" automatically shuts the engine off when the car comes to a stop. This \"feature\" is supposed to improve gas mileage, however, I believe it is very dangerous. This \"feature\" has caused my vehicle to stall numerous times in stop and go traffic, requiring me to completely stop the vehicle, place it in park, and then restart the vehicle. This sequence has created several scary and dangerous situations where I was completely stopped on a busy freeway. This \"feature' will cause accidents if it has not already caused them. This feature currently cannot be permanently disabled. It must be disabled manually every time I drive the car. I have also contacted Honda directly to notify them of this defect.", "fail date": "  02/02/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Stopped at a traffic light and car didn’t restart. Battery completely drained and left my wife stuck in a main busy road. Auto start feature is causing this to happen.", "fail date": "  12/01/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Driver side window malfunctioned. Honda has attempted to repair 5 times but it continues to malfunction after working for 2-3 days max.", "fail date": "  11/20/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "To whom it may concern: I writing in regards to a possible defect with my 2018 Honda Pilot. It is having internal electrical issues stated by the dealership and needs a keyless control module unit replaced. However, my car has been in the dealership since November 15, 2021 due to Honda not being able to get the part needed to repair. American Honda has failed to remedy the defect in my vehicle within a reasonable time period. Can someone please assist me on how I rectify this situation. Thanks [xxx] information redacted pursuant to the freedom of information act (foia), 5 u. S. C. 552(b)(6).", "fail date": "  11/14/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The contact owns a 2018 Honda Pilot. The contact stated while driving 55 mph, the keyless control module unit would shut off. The contact stated no warning light was illuminated. The contact was able to drive to her residence. The contact took the vehicle to the local dealer, where it was diagnosed with needing the keyless control module unit to be replaced. The vehicle was not repaired but was pending repairs. The manufacturer had been informed of the failure. The failure mileage was 60,372.", "fail date": "  10/01/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The auto engine idle feature does not work properly. When the car is at a light, the engine idle is activated and the car is put into a slumber mode, when the brake is depressed. On occasion, when it is time to go, the car then turns off when the gas is depressed. This is extremely dangerous as then you are stuck at an active intersection and need to turn the car back on. I've discovered a wealth of other owners with this issue here. My issue is consistent with their reports. . Read more...\n", "fail date": "  09/24/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "As I was coming to a stop light and started to slow down the automatic start/stop system engaged, but the light turned green and when I tried to accelerate the car was not running anymore lights I the dashboard where flashing that I needed to put vehicle in park to start back up. Our vehicle was almost impacted by the truck behind us because he assumed I would be able to speed up instead of having to come to a complete stop. This has happened at least 20 more times since then when I forget to turn off the automatic start/stop feature. It's always when I'm coming to a stop, the SUV will not turn back on mostly its inconvenient to drivers behind me that feel I just didn't see the light turn green but a couple of times it has happened when approaching metering lights in the freeway where the cars behind me or in the lane next to me are ready to accelerate not knowing that my car will have to come to a complete stop because of this issue before I car start the car again.", "fail date": "  08/07/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Push start does not work, says wireless key issue. Car does not start up (crank) and it does not turn completely off (it's stuck in start/ignition on, car is not running). Alarm would randomly discharge and have to relock the car, but would go off again. The ignition would flicker on and off constantly draining the battery. Doors would eventually unlock and stay unlock.", "fail date": "  06/29/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "While stopped at a stop light/sign the engine stalls, dies, shifts to neutral (push button shift) leaving me disabled in the middle of the road. This issue has also occurred while slowing to take a sharp corner. The engine died at approximately 25 mph while slowing for the corner. I had taken it to the dealership and they claimed they could not reproduce the problem. I took the vehicle home, then later that day I drove it approximately 17 miles to a racetrack that I work at part time. At 12:30 am, I was leaving to head home, and while idling in the parking lot, it had died yet again and took several minutes to restart. Once it did restart, I had no throttle response in park, neutral or in drive. I shut the vehicle off and restarted it with no other issues for the 17 mile trip back home. The dealership suggested that I take picture/video when it happens, which poses another safety concern to do that in the event I am driving when this event occurs. This is a severe safety concern as there is the potential for the engine to die/stall during a hard braking event in which I could lose power brakes. Only the dealership has inspected the vehicle, and the only lights that have been illuminated on the dash was the battery light and the caution light. This issue has been going on for approximately a month and a half. After completing some research, I have noticed there is a large collection of this or very similar complaints.", "fail date": "  05/25/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Auto engine on/off option- when on and at a stop the whole vehicle shuts down I have to hold brakes down press engine on/off to correctly shut it down the start the vehicle.", "fail date": "  01/12/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Failure to start. My car was located in my driveway. As soon as I pushed the start button the car completely shut off no power to any part. No lights were working, nothing, couldn't even lock it with key fob. The car was completely dead. With only 17k mile on a almost 3 year old car this should not be happening. After I few minutes, checking the battery, and many attempts to start, it eventually started with a sputter and the gauges jumping.", "fail date": "  09/15/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Vehicle is not starting on first attempt. Several times the push start button needs to be pressed before it does.", "fail date": "  07/07/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Today my 2018 Pilot ex-l suddenly started displaying these warnings: - trailer stability assist (tsa) problem - hill start assist problem - vehicle stability assist (vsa) problem - power steering system (eps) problem looking at Honda Pilot forums, it seems like it is a very common problem and has to do with fuel injectors as described https://static. Nhtsa. Gov/odi/tsbs/2021/mc-10187289-0001. . Read more...\n", "fail date": "  11/30/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "I was stopped at a red light, the engine cycled down because of the environmentally friendly option. My foot was on the break. The transmission shifted to neutral and turned orange. I could not get it to shift back to drive. I had to turn the car off and restart it. At that point I was able to put it in drive and move the car. This was very dangerous because I was on a busy highway and could have been rear ended by a driver not noticing the car was stopped and off.", "fail date": "  11/02/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Was in the middle of an intersection and pressed the button to turn off engine idle mode as I have had instances where it was very slow to go when this mode is on and it delays getting out of the way of other drivers. When I pressed the idle off button - the car “shut down” and went into neutral. I could not get it out of neutral. Pressed d, r, p. Multiple times. Didn’t work. Had to press the turn off car button twice to turn off car then it finally restarted. I was stranded in the intersection and almost got hit by several cars. Once it started I pulled into a gas station and the radio stopped working. I turned off the car and restarted. Then the engine wasn’t shifting properly. Shut off the car again and went to the dealer. Dealer ran diagnostics and couldn’t find a problem. Checked the battery and all other items - no issues. Somebody is going to get killed and now I’m scared to drive my car.", "fail date": "  09/16/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "On multiple occasions the idle stop feature will engage and upon re-engage it will stall my vehicle. When I place the vehicle in park, press the brake and press the ignition start, nothing happens. Upon multiple attempts to restart the car it will either do nothing or making a chug without restarting. Continuing my attempts to restart the vehicle it will finally restart. During these times I will be stalled at a stop sign or traffic light with impatient drivers going around me. All the dashboard lights come on. I have taken it to the dealership, they stated they couldn’t duplicate the problem. This is unsafe for motorists or pedestrians. If this happens while I'm in an intersection or other location with moving traffic it could be very unsafe for myself, other motorists and/or pedestrians.", "fail date": "  09/15/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "While driving, the transmission would not gear up to any higher gears and could only drive 40mph with 3000+ rpms. The mil lights showed \"check engine,\" \"emissions system problem,\" \"transmission system problem,\" and \"blind spot info system problem,\" all at once. When pressing the \"p\" button for park, it did not always want to engage in park. The engine would sometime stutter on acceleration. The \"p\" and \"d\" for park and driver on the mil would constantly blink. This action placed the driver and occupants at risk of injury because of the stutter and slow speeds on the highway. Also, when the \"park\" button did not engage, the car was at risk of rolling into person or property. Currently, service has been scheduled for the dealership to diagnose the issue. There were no warning signs prior to all of these warning lights showing up all at once.", "fail date": "  09/11/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "This has happened to me about 10 times in this vehicle: I am at a stoplight or stopsign and my \"idle-stop\" system in the Honda shuts down my engine and then when my foot comes off the brake it does not restart like it is supposed to leaving me stranded in the middle of traffic with a non moving vehicle. I think this is extremely dangerous and I am scared this will cause a terrible accident if not fixed. The only way the engine restarts is after about 30 seconds to a minute it finally is able to power back on. Please have Honda issue a recall for this issue.", "fail date": "  08/23/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "When vehicle comes to a stop, vehicle start/stop feature engages, then vehicle stalls. Vehicle then indicates that it should be shifter into park before it can be re-started. This has happened numerous times. Vehicle was brought into dealer, they are aware an investigation is underway with Honda but had no known solution besides updating the main computer program. They also recommended replacing the batter which tested ok. The fact that the vehicle stalls when you come to a stop is a very big safety concern.", "fail date": "  07/05/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The contact owns a 2018 Honda Pilot. The contact stated while driving in stop and go traffic, the vehicle would engage the engine stop/start fuel saving feature while stopped. The contact stated that whenever she depressed the accelerator pedal the message \"place vehicle in park\" displayed. The contact stated that the vehicle failed to restart, with several unknown warning lights illuminated. The contact attempted to start the vehicle using the push to start button. The vehicle was restarted but failed to respond after shifting into drive. The vehicle was restarted several times before resuming normal operation. The contact had not taken the vehicle to a local dealer or independent mechanic. The vehicle was not diagnosed nor repaired. The contact stated that the failure recurred. The manufacturer had not been informed of the failure. The failure mileage was approximately 50,000.", "fail date": "  07/04/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "On multiple occasions over the past month or so, my wife has experienced engine issues associated with what we believe is the auto start/stop function on our 2018 Honda Pilot (touring edition). Upon coming to a complete stop, the auto stop function disables the engine. Upon releasing the brake, the system is supposed to restart the engine. However, on at least five occasions the engine has not restarted, and it has required her to turn the vehicle off and completely restart it as if starting from cold. This has occurred at stop lights, which obviously could cause safety issues/implications. On at least a couple of the occasions, she had to attempt to restart the vehicle multiple times by applying the brakes and pressing the main start/stop button). I frequently drive the vehicle and always turn off the auto start/stop function. I have never run into these issues whatsoever. The vehicle is scheduled for routine maintenance at a Honda dealership in two days; the vehicle is serviced solely at this same dealership. The issue will be brought to their attention as well.", "fail date": "  07/03/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "When stopped in traffic the car will switch to neutral by itself. It will turn off and will have to be restarted. This has happened about 12 times since last July. After the first time it happened I brought the car to the dealership. They were not able to replicate the issue and it has continued since then with greater frequency. (2x last week in 3 days) this has happened when in econ mode, regular mode, right after a tune up, no pattern detected. Sometimes before it happens there would be a spluttering sound of the engine, sometimes a clicking sound, sometimes a collision warning sign flashes right before it happens, sometimes no warning- the car just shuts off and needs to be restarted. When the car is idling there are frequent reminders about pressing the break to shut off the engine. Googling this issue shows other people have the same problem with their 2018 Honda Pilots and other models as well. I believe these incidents are related to odi investigation pe 22-005 just opened on 06/03/22.", "fail date": "  05/18/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Transmission kind of jerks when accelerate especially when you do it nice and easy(more like fluctuating up and down) I did some research on line a lot of people having same issues on this year model vehicles.", "fail date": "  04/08/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The contact owns a 2018 Honda Pilot. The contact stated that while stopped at a traffic light, however, the brake pedal was not fully depressed; the contact then depressed the accelerator pedal and the vehicle stalled without warning. The contact restarted the vehicle soon after the failure and resumed normal driving. The vehicle was taken to the dealer where a diagnostic test was performed; however, the mechanic was unable to duplicate the failure or determine the cause of the failure. The manufacturer was notified of the failure and informed the contact that the VIN was not under recall. The vehicle was not repaired. The failure mileage was approximately 52,500.", "fail date": "  04/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "We bought the Honda Pilot to tow a nucamp 2019 tab 320 bookdock trailer, which has a gross dry weight of 1,848 pounds (well below the 3,500-pound Pilot published towing capacity). We tow the trailer dry, which is without water in the black, gray and fresh tanks. We do not load any items of significant weight in the trailer (two lightweight camp chairs, a 3-inch thick foam mattress topper and pillows). We have towed the trailer from akron, ohio, to twentynine palms, CA, in 2020 and to glacier national park, mt, in 2021. We have also towed it to several ohio state parks. In the fall of 2021, the vehicle’s transmission began to exhibit unusual performance that manifested itself as gear shifting hesitation in the range of 1,500 – 2,000 rpms. With that issue, we took it to great lakes Honda which changed the transmission fluid (great lakes did not flush the transmission) at 28,000 miles. On April 3, 2022, the transmission hesitation began again. I took it to apple tree Honda in arden, nc, (we had moved to waynesville, nc, in late 2021) on April 5, 2022, a technician found no error codes, but performed a transmission flush and fill. . My issue with this is that the transmission fluid should not degrade in 7,000 miles of normal driving, causing transmission malfunction. The vehicle does seem capable of towing a weight near the published owner's manual maximum of 3,500 pounds. With this interval, I am concerned that the Honda stated operational guidelines are false, and the vehicle’s transmission might continue to degrade as many other Honda Pilots’ transmissions have as reported by many owners. The apple tree Honda technician who worked on the Pilot, advised me to add an auxiliary automatic transmission cooler, which is necessary if towing more than 3500 lbs. Since the April service, I have not towed the trailer. I am fearful that the transmission will fail when I am towing the trailer.", "fail date": "  04/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Engine misfires randomly causing car to go into limp mode. Car was unable to go pass 40 mph on while trying to merge highway. It was very dangerous and scary as cars came very close to my bumper. Honda is aware of an injector issue and has extended the warranty, but this should be a safety recall.", "fail date": "  02/14/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The contact owns a 2018 Honda Pilot. The contact stated that occasionally the vehicle would hesitate while driving. Additionally, the vehicle occasionally lost motive power and stalled without warning. The contact stated that while idle at a stop light and attempting to accelerate, the vehicle independently shifted to neutral and stalled. The contact shifted into park(p) and restarted the vehicle after several attempts. The vehicle had not been diagnosed or repaired. The manufacturer was made aware of the failure. The approximate failure mileage was 80,000.", "fail date": "  12/31/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The contact owns a 2018 Honda Pilot. The contact stated that while driving at an undisclosed speed, the vehicle hesitated to accelerate and then lunged forward. The contact sustained whiplash from the vehicle lunging forward abruptly. The vehicle was taken to an independent mechanic, but the independent mechanic could not duplicate the failure. The dealer was made aware of the failure. The vehicle was not repaired. The manufacturer was made aware of the failure and referred the contact to file a complaint with NHTSA. The failure mileage was approximately 43,000.", "fail date": "  11/29/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "I was driving my kids to school when I stopped at the school intersection. I go to press on the accelerator as I normally would and it would not drive, so I pressed on it a little harder as I was turning left since there were cars approaching. My vehicle suddenly jolted, making myself and the kids shift/jump from the force. I then proceeded driving down the road and let go of the accelerator, and my SUV suddenly started to feel like it was slowing itself down instantaneously. It felt like it was trying to make the vehicle's speed go down to 0. I then pressed on the accelerator again to prevent it from happening, but it continued to do so whenever I let go. I had to stop at the school's parking lot and turn off the SUV completely. When I turned it on again and began to drive, it was functioning normally. Since then, it has happened about 3 or 4 times, 1 of which happened on the expressway, which was way scarier. I had to get out of the expressway as it was dangerous. Just yesterday, I had a separate issue with the SUV that may seem related in retrospect. My SUV did not want to turn on. I experienced all of the dashboard lights flickering, and being unable to start it. It was not the battery because at some times, the radio would turn on, the lights, and the windows/locks would function normally. I was unable to get the vehicle to go to neutral, or anything then on. When the lights were not flickering, it presented me with the Smart entry system light problem. Soon after, all the lights on my dashboard turned on and stated there were air bag problem, brake problem, abs problem, and etc. . . My vehicle is currently being looked at.", "fail date": "  10/11/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "My transmission is having problems. During acceleration the car will jolt forward, also when using the brakes. The dealer did recognize the problem but said it is not covered by warranty and that transmission needed to be flushed. . Which was going to cost $500. He said had it been flushed before they may cover it, yet Honda doesn’t recommend a flush before 45000 per my owners manual. Very dangerous. . Could cause an accident with speed going up and down at a moments notice without you doing it.", "fail date": "  10/01/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "There is a noticeable 'chirp' noise when taking curves when I slow for the curve and accelerate out of the curve. Yes, it is available to be inspected. Had this in my 2016 Honda Pilot touring awd and we had to replace the entire transmission due to failure with the gears. Unsure if will be a risk other than being stranded somewhere if it fails. No police. No system errors or warnings.", "fail date": "  05/25/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "While stopped at a stop light/sign the engine stalls, dies, shifts to neutral (push button shift) leaving me disabled in the middle of the road. This issue has also occurred while slowing to take a sharp corner. The engine died at approximately 25 mph while slowing for the corner. I had taken it to the dealership and they claimed they could not reproduce the problem. I took the vehicle home, then later that day I drove it approximately 17 miles to a racetrack that I work at part time. At 12:30 am, I was leaving to head home, and while idling in the parking lot, it had died yet again and took several minutes to restart. Once it did restart, I had no throttle response in park, neutral or in drive. I shut the vehicle off and restarted it with no other issues for the 17 mile trip back home. The dealership suggested that I take picture/video when it happens, which poses another safety concern to do that in the event I am driving when this event occurs. This is a severe safety concern as there is the potential for the engine to die/stall during a hard braking event in which I could lose power brakes. Only the dealership has inspected the vehicle, and the only lights that have been illuminated on the dash was the battery light and the caution light. This issue has been going on for approximately a month and a half. After completing some research, I have noticed there is a large collection of this or very similar complaints.", "fail date": "  05/25/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "When accelerating from an idle position there is a 2-3 second delay. Very slow to bet moving and very dangerous in high volume traffic. The car often times jerks when I am accelerating in to a higher gear.", "fail date": "  04/17/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The SUV jolts and decreases speed . It takes a long time to take off again. The jolting can be strong and it has decreased on the freeway. This is not safe for a family vehicle. This has happened for a couple of months. I was told at the dealer I just needed a new battery I did change it and it still does it then I was told they found nothing.", "fail date": "  04/06/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "1. When accelerating gradually on the 2018 Honda Pilot touring awd from complete stop, the car jerks hard after the car starts moving - probably from 1st to 2nd gear. The car is in automatic drive mode. 2. The 2018 Honda Pilot touring awd turns off engine unexpectedly. When slowing down to traffic, sometimes the car turns off the engine. This is especially bad when on a uphill and in heavy traffic, causing panic. The sudden engine stops also happen occasionally when stopping to shift to reverse into my garage- this causes a dangerous situation as cars are coming and can get into t-bone collision.", "fail date": "  03/06/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "First when I bought the vehicle new after one month a message popped up saying �transmission problem� on the dashboard and the car only had 2,000 miles on it. I took the car to Honda dealer. They didn't do anything and said don't know what happed and they were able to remove the message without doing any repair. Now the 2018 Honda Pilot has 24,000 miles on it , the vehicle jerks and I felt the transmission flared and hard shift in gear 2nd to 3rd. It does not feel safe to drive the car. It keeps on jerking when you are driving at 30 miles of hour.", "fail date": "  02/01/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "On 11/2/19, while driving at approximately 25 mph, the vehicle showed the message \"transmission problem\" on the dashboard. After this message was displayed, the vehicle would only stay in first gear. I was able to safely park the vehicle in a parking lot. The vehicle was just under 16 months old and had approximately 20,000 miles on it. After turning the vehicle off and then back on, I was able to change the gears once again. I immediately called Honda roadside assistance to have the vehicle towed to the nearest Honda dealership, which was ourisman Honda in tyson's corner virginia. I received a call from a service advisor at ourisman Honda on 11/4/19. He refused to acknowledge that there was a problem with the transmission and no repair was made. When I told him what happened, the service advisor stated that it is likely that the vehicle experienced a \"computer glitch\" and that simply restarting the vehicle would fix the problem if it happened in the future. I told him that it is a serious safety issue to have to restart a vehicle while driving. The transmission often exhibits a \"sticky clutch\", delayed gear shifting (sometimes as much as 2 seconds of delay before the gear is shifted), and often times a \"clunk\" is heard when the gear is changed. The problem usually occurs in early gears (3rd, 4th, and 5th gear) when I lift my foot off the accelerator at approximately the time the transmission is ready to shift to the next highest gear.", "fail date": "  11/02/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Tl-the contact owns a 2018 Honda Pilot. The contact stated that the vehicle experienced jerking, lunging, and a loss of power while driving at various times. The contact stated that she would need to turn the vehicle off and back on for the vehicle to resume back to normal. The dealer dch Honda of temecula 26755 ynez rd, temecula, CA 92591 (951) 268-9197 was contacted and schedule an appointment for the contact to have a diagnoses test done. The vehicle was not repaired. The failure recurred multiple time. The manufacturer was not notified of the failure. The failure mileage was approximately 31,000. Ck.", "fail date": "  09/18/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I have, on several occasions, been driving my vehicle and when I stop and try to start again the engine fails to start again. This most recently happened when I got off the highway and had to stop suddenly and then had difficulty getting my car started back up in almost the middle of the intersection. This could have ended up being a really dangerous situation. This has occurred now several times. I brought my car in because I was concerned about it and they just told me that I would need to replace the battery. The battery worked fine except for this, so I am unsure why they aren't helping us understand this all better. They did confirm the issue was happening and said that they have seen it a lot. Lots of warning lots would pop on and back off when this happened.", "fail date": "  11/25/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Upon stopping for a red light, the car turned off the engine and is supposed to restart when the brake is released. However my car stalled out and wouldn't auto start. After 20 seconds it then prompted to restart the car. This was on a busy road and I was lucky no one rear-ended me or got into an accident themselves while trying to avoid my car that should have been moving with traffic but was just sitting idle at a green light. I called the Honda dealership and they weren't alarmed by this or even interested in looking at the car. The told me to select the \"disable auto stop\" when starting the car so the engine won't idle. This is ok as a short-term solution but remembering this every time we start the car isn't a sufficient solution. On instances when I forgot, the car stalls out, and now occurs at least once a week. I'm now resorted to adding a post-it note to remind myself (and anyone else that uses me car) to turn the auto stop off. This isn't practical solution for a defective, default feature that Honda added to their cars. There needs to be a permanent override for this unnecessary feature that compromises safety, not only for the vehicle occupants but for those trying to avoid the stalled vehicle.", "fail date": "  11/19/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "On at least three occasions after being stopped at a light the engine suddenly died (not simply auto idle stop). After putting in park and shutting off ignition (button start) and waiting some time the vehicle could be restarted. Battery is good. Fuel is good. Injectors already replaced. Dangerous as vehicle may be unexpectedly on powered while in traffic.", "fail date": "  11/17/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "At 50,000 miles the car started to make a clanking noise. The car was checked no issued were found. At 60,000 oil change was preformed vehicle was checked no issued were found. At 63,000 the following lights came on at once: check engine, tsa, hill start problem. Took the car again to get checked and now they have stated the car needs a new engine no lights had previously came on.", "fail date": "  10/22/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The auto stop and start has almost caused multiple accidents. When I remove my foot from the break the vehicle will not always start. Sometimes it dies and I must restart it and sometimes the vehicle rolls backwards before it starts.", "fail date": "  09/20/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "On multiple occasions the idle stop feature will engage and upon re-engage it will stall my vehicle. When I place the vehicle in park, press the brake and press the ignition start, nothing happens. Upon multiple attempts to restart the car it will either do nothing or making a chug without restarting. Continuing my attempts to restart the vehicle it will finally restart. During these times I will be stalled at a stop sign or traffic light with impatient drivers going around me. All the dashboard lights come on. I have taken it to the dealership, they stated they couldn’t duplicate the problem. This is unsafe for motorists or pedestrians. If this happens while I'm in an intersection or other location with moving traffic it could be very unsafe for myself, other motorists and/or pedestrians.", "fail date": "  09/15/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "On multiple occasions the idle stop feature will engage and upon re-engage it will stall my vehicle. When I place the vehicle in park, press the brake and press the ignition start, nothing happens. Upon multiple attempts to restart the car it will either do nothing or making a chug without restarting. Continuing my attempts to restart the vehicle it will finally restart. During these times I will be stalled at a stop sign or traffic light with impatient drivers going around me which I believe is unsafe for motorists or pedestrians. If this happens while I'm in an intersection or other location with moving traffic it could be very unsafe for myself, other motorists and/or pedestrians.", "fail date": "  09/14/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Auto start/stop failure - vehicle stops, engine shuts off as usual. However, when brake is released the engine does not start back up. It then needs to be put in park and takes several takes to start again.", "fail date": "  09/13/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "On 8 August 2022, 1220 pm chester, virginia. I was driving my SUV and I heard a loud boom, I thought it was an back fire from another car. When, arrived home, checked my SUV for any possible damages. I noticed there was a slight budge on the sunroof. I opened the sliding portions of the sunroof and I noticed the entire glass had shattered with a large hole in the middle of the sunroof. I inspected the area and didn’t notice anything that could have shattered the glass. In my opinion, with increasing temperatures, the sunroof glass shattered because extremely hot weather. The outside temperature was 97 degrees fahrenheit which the inside temperature was much higher.", "fail date": "  08/08/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I have had multiple (5 times) over the past month where when stopped at a stop light or other stopping point my Pilot failed to re-start on it's own. In all 5 instances I had to put the car in park and restart the vehicle. It is August (warm weather) in chicago and there were no other weather/local environmental issues that should have caused this issue. There were no warning messages prior to the automatic re-start failure. I have not yet reported this issue to Honda but plan to do so.", "fail date": "  08/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "When vehicle comes to a stop, vehicle start/stop feature engages, then vehicle stalls. Vehicle then indicates that it should be shifter into park before it can be re-started. This has happened numerous times. Vehicle was brought into dealer, they are aware an investigation is underway with Honda but had no known solution besides updating the main computer program. They also recommended replacing the batter which tested ok. The fact that the vehicle stalls when you come to a stop is a very big safety concern.", "fail date": "  07/05/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I was driving on highway in a stop and go traffic with \"auto idle\" on. The engine was completely shut down when at a complete stop and the vehicle was stalled in the middle of a highway with all kinds dash flashes. I was unable to press the brake and \"start\" button to restart car or put car in neutral to move the car. Had local Honda dealer's tech on line for about 10 minutes to help restart the car with no success. Contacted insurance company requested a road service. About 55 minutes later the tow truck come and the tow truck drive successfully start the car. Feel unsafe to drive the car and towed the car to local Honda dealer and they could not find any error code in system and failed to repeat the situation.", "fail date": "  06/02/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "My vehicle was stopped at a red light in a busy turning lane. When I pressed on the brakes to stop the vehicle the \"idle-stop\" automatically came on. As my vehicle was idling, I waited for the light to turn green to go. Once I pressed on the gas to go my vehicle went haywire. I couldn't drive forward or put the vehicle in any park mode. Every light started flickering on the dash, my hazards wouldn't come on, the car wouldn't start and every time I tried attempting to turn on the car it continued to do the same. I was stalled at a very busy intersection with no hazard lights with two kids, this was frightening. My husband had to restart the vehicle with a battery pack. After getting the car checked, there were no signs of any battery issues or any other problems, the car seemed perfectly fine. Now we have to completely turn off the \"idle-stop\" before driving or the car will stall, shut off and go haywire. We have to constantly restart the vehicle with a battery pack in order to continue driving. I asked several people and apparently this is a huge issue and problem for many with no help from Honda dealerships to fix it.", "fail date": "  05/09/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The engine had failed to restart multiple times on its own from a complete stop at a traffic light and in the middle of an intersection with the auto start/stop function engaged. I am very concerned for the safety of myself and occupants because the inability of the vehicle to restart and move forward to clear through the intersection creates a very high risk for a potential collision that could be life threatening. The vehicle has not been inspected by the dealer, manufacturer or any appropriate organization. There have been no warning signs alerting me to a potential problem. I started to experience the problems commencing last month (may 2022).", "fail date": "  05/04/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "My car has been put in parking on its own and won't allow me to put it back in drive or reverse. I can't turn it off when this happens (I pressed the start/stop push button, and nothing happens) and the steering wheel locked up and the brakes too. This has happened to me on two occasions: one time when I stopped in a red light. When the light changed to green and I released the brake to move, the car went into parking and locked up itself, note: when I stopped in the red light the car went into auto idle engine mode (April 19 2022). My safety was put in risk because it happened in a busy road. On another occasion it happened when I was entered the garage slowly and I pressed the brake to completely stop, the car went into auto idle engine mode and then changed its own to parking (April 7). The car just like \"turned off\" although everything seems on without warning messages. I couldn't start it until a few minutes later. After this event happened the \"cruise control\" and \"lane keeping assist\" features stopped working. I went to a place, and they checked the battery and the battery is not the issue.", "fail date": "  04/19/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The auto-idle feature will unexpectedly over-engage while coming to a stop and the entire vehicle will shut off. I am unable to shift, steer, etc. It will also completely shut the engine down when at a complete stop. To be clear, this is not the normal auto-idle. When the full engine disengage happens, the entire vehicle loses power and the dash flashes. The vehicle states, \"put into p\". Once in \"p\" for park, the vehicle still will not restart. It is as if the vehicle has to \"reset\" itself. It has taken upwards of 4 minutes for the vehicle to restart. This has happened on a highway during construction traffic, approaching a stop sign, slowing at a red light on multiple occasions. I have almost been rear-ended as a result on mutiple occasions. I am not even able to put the vehicle in neutral to move it to a safe spot. Honda informed me that I \"just need to disengage this feature each and every time I start the vehicle\" . That is not the solution. This feature should be permanently disabled by Honda. Immediately.", "fail date": "  02/06/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Transmission temperature too hot seems like every 8k miles I have this pop up. Only been serviced at Honda.", "fail date": "  06/26/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The car shut off when trying to recover from idle stop mode. All lights turned off. The car becomes invisible when dark.", "fail date": "  04/27/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Unknown component or system malfunction. There is sometimes a delay in acceleration when I press on the gas. Most of the time it's when I'm accelerating from a stop but can happen at any time. Once I press the gas and the car doesn't accelerate for about 2or 3 second I'll then have a surge of acceleration. This is very dangerous when I'm trying to pull out in to traffic or turn at a light as I end up dead stopped with oncoming traffic. I did take my SUV to be seen at a dealership but they could not reproduce the problem, someone needs to drive the car longer than 10 min to try and reproduce issue. Stop and go traffic is the best way to try and reproduce this issue. This issue began soon after purchasing in 2019.", "fail date": "  12/15/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "We've had our Pilot for 8 or 9 months and we've already had to have the home link button replaced, the alignment done twice and now the master cylinder is failing. We are taking it in today to have the master cylinder replaced. It was not properly pressurizing the brake lines and was causing a wobbling in the brakes at higher speeds. The dealership has been a real pain to work with and did not diagnose the issue until months later when it happened on a ridgeline. Last Honda I'll ever buy.", "fail date": "  07/30/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The navigation screen of the vehicle blacks out intermittently and without warning when I turn on the vehicle. I have called the nearest dealer at least 3 times over the past 3 months and they keep telling me that Honda is supposedly working on the issue- but nothing so far. Sometimes the problem clears when I turn off the engine and restart but I never know when it is going to work or not. Contacted Honda customer service- no satisfaction.", "fail date": "  06/30/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Side door glass spontaneously exploding. We were in motion 65 mph on the highway. No other cars around us or around any houses. Window went boom and just exploded.", "fail date": "  02/15/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Sudden acceleration while pulling into a parking space in covered parking garage. Car engine revved while pulling into space. Brakes applied leaving skid marks on concrete. Car was damaged be hitting concrete retaining wall.", "fail date": "  02/04/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "In may 2018 I purchased a new 2018 Honda Pilot. Unfortunately during this first winter I have found out that this vehicle does not have a functioning heater. As soon as the weather turned cold I noticed that this new Honda Pilot did not have sufficient heat. While driving at highway speeds the heater functions ok but during city driving, or especially at idle, the temperature falls well below any acceptable minimum requirements. Below is a chart showing a comparison between a functioning heater in a 2014 crv versus this new 2018 Honda Pilot. Please note the differences in outside air temperatures: the crv measurements were taken at an outside air temp of -8� while the Pilot data was recorded with an outside air temp of + 8�. The vent temperature varies considerably based on the engine rpm. While accelerating the temperature is warm / hot but while driving in traffic or stopped the temperature can drop 80 degrees or more in 1-2 minutes. Based on this data, I made two separate appointments to have the Pilot serviced under warranty at my local Honda dealer. The weather on the 2nd visit was cold (-17 degrees f). They �verified the complaint� and found that the vent temperature from a fully warmed up engine was 28 degrees (yes, below freezing!). They said they have another Pilot in their shop that does the same thing therefore there is nothing wrong with mine and considered mine as functioning �normal�. They did not do any diagnostic work and refused to do any work, even simple work such as trying to flush the heater core or remove any air from the system. They stated that Honda put in an undersized heater core in the Pilot and therefore they were not going to waste their time trying to fix. Since I live in chicago there are 5 months of cold weather so I do not consider a lack of heat a minor inconvenience nor an acceptable to live with.", "fail date": "  01/01/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Vehicle auto locked with keys in car and could not unlock. Fortunately, car was in my garage and did not create a safety issue. However, had this occurred in the summer with a small child or pet inside, it could have been an extreme safety hazard, possibly leading to fatal consequences. This vehicle is never supposed to lock with keys in the car.", "fail date": "  12/28/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "While driving on a state highway, travelling at approximately 60 mph, I heard a loud 'pop' and saw debris fly in my rear view mirror. At first I thought it was a tire, but found my sunroof had exploded. There were no rocks, projectiles, etc, and no overhead structures where something could have fallen. The glass blew out as it may have been under stress and not in as if something may have hit it.", "fail date": "  11/15/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "I took my Pilot to gerald jones Honda in augusta to have recall of hood latch fixed. It has gotten worse and loose and almost blows up when I pass large trucks. I took it back to gerald jones and they said they couldn't do anything, in the mean time I have contacted Honda, sent them a video of the moving hood and I have been waiting on an answer of what to do. I am am scared when I drive it that the hood it going to fly up. My next step it to turn this over to my attorney.", "fail date": "  05/06/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "I had the hood latch recall fixed at gerald jones Honda and a week the next day I notice my hood would shake when I would pass by cars. I took it back and they said it was fixed. Currently is shakes and rises when I pass cars. I am afraid to drive with my small children. I have contact the dealership who repaired it and american Honda. By next step is to get an attorney.", "fail date": "  05/05/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "When I purchased the vehicle in June 2018 I noticed that the hood vibrated excessively at highway speed. I brought it to the attention of the dealership the day after purchase and again at the first oil change. Both times I was informed that due to the lighter metals used in the hood to save weight, the vibration was normal. On March 5, 2021, while driving on the highway at about 65mph, I noticed a loud \"slapping\" noise coming from under the hood. Upon inspection, it was discovered that the aluminum around the hood side latch (metal hook) mechanism had torn about 75% of the way around the attachment points (three bolts). In order to keep the hood shut, and from separating, it had to be taped to the vehicle body. I drove it to the dealership it was purchased from and all who inspected it agreed that it was a manufacturers' defect and a serious safety issue. Honda corporate representatives agreed.", "fail date": "  03/05/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "My fianc� was driving to my doctor to follow up surgery, two blocks from 2 blocks from the house we approached to traffic light was on red and she was applying the brakes when we were just about at light suddenly the car accelerated girlfriend had her foot on the brake but the car kept going we strike a car and hit a parked car bad accident, 3 people got hurt. Every time I watch the video I am more convinced that something when wrong with car systems this happens on kennedy boulevard and audobon st on 12/11/2020 around 11:05 am sunny clear day. I have a video.", "fail date": "  12/11/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "The contact owns a 2018 Honda Pilot. The contact stated that while driving various speeds, the vehicle suddenly shifted into park. An unknown dealer was contacted and informed the contact that as a safety feature in the vehicle, debris may cause the feature to activate independently. The contact they bought a special vacuum to consistently and constantly remove debris from the area however, the failure persisted. The vehicle was not diagnosed. The manufacturer was made aware of the failure and informed the contact that the VIN was not under recall. The approximate failure mileage was 30,700.", "fail date": "  07/01/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "The sunroof shattered/exploded while driving down the highway at 65mph. There was a loud noise. No explanation for why.", "fail date": "  03/02/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Sudden acceleration while pulling into a parking space in covered parking garage. Car engine revved while pulling into space. Brakes applied leaving skid marks on concrete. Car was damaged be hitting concrete retaining wall.", "fail date": "  02/04/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Tl- the contact owns a 2018 Honda Pilot. The VIN was not provided. The contact stated that all the windows went down when the unlock button on the key fob was touched, while the key was in the contact's pocket. The failure recurred four times. The contact called the autonation Honda 104 dealer (303-578-6112, located at 2999 west 104th avenue, westminster, CO 80234) where it was stated that the failure was a design flaw without a fix. The manufacturer was made aware of the failure and stated that nothing could be done. The vehicle was not repaired. The failure mileage was approximately 4,500. Fe.", "fail date": "  01/30/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "While driving on a state highway, travelling at approximately 60 mph, I heard a loud 'pop' and saw debris fly in my rear view mirror. At first I thought it was a tire, but found my sunroof had exploded. There were no rocks, projectiles, etc, and no overhead structures where something could have fallen. The glass blew out as it may have been under stress and not in as if something may have hit it.", "fail date": "  11/15/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "The moonroof shattered exploding glass. The vehicle was on a highway traveling at 60mph. There was just a loud noise and boom. We owned the car just four months and it has only 6,200 miles on it at the time of this incident.", "fail date": "  08/16/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "On my 2018 Honda Pilot - exl, the sunroof exploded twice (shattered). The first time was on Feb 2018 and the second time was on July 2018.", "fail date": "  07/31/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "I was driving my kids to school when I stopped at the school intersection. I go to press on the accelerator as I normally would and it would not drive, so I pressed on it a little harder as I was turning left since there were cars approaching. My vehicle suddenly jolted, making myself and the kids shift/jump from the force. I then proceeded driving down the road and let go of the accelerator, and my SUV suddenly started to feel like it was slowing itself down instantaneously. It felt like it was trying to make the vehicle's speed go down to 0. I then pressed on the accelerator again to prevent it from happening, but it continued to do so whenever I let go. I had to stop at the school's parking lot and turn off the SUV completely. When I turned it on again and began to drive, it was functioning normally. Since then, it has happened about 3 or 4 times, 1 of which happened on the expressway, which was way scarier. I had to get out of the expressway as it was dangerous. Just yesterday, I had a separate issue with the SUV that may seem related in retrospect. My SUV did not want to turn on. I experienced all of the dashboard lights flickering, and being unable to start it. It was not the battery because at some times, the radio would turn on, the lights, and the windows/locks would function normally. I was unable to get the vehicle to go to neutral, or anything then on. When the lights were not flickering, it presented me with the Smart entry system light problem. Soon after, all the lights on my dashboard turned on and stated there were air bag problem, brake problem, abs problem, and etc. . . My vehicle is currently being looked at.", "fail date": "  10/11/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "My transmission is having problems. During acceleration the car will jolt forward, also when using the brakes. The dealer did recognize the problem but said it is not covered by warranty and that transmission needed to be flushed. . Which was going to cost $500. He said had it been flushed before they may cover it, yet Honda doesn’t recommend a flush before 45000 per my owners manual. Very dangerous. . Could cause an accident with speed going up and down at a moments notice without you doing it.", "fail date": "  10/01/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "\"sua, sudden unwanted acceleration\". I was in the process of parking on the 6th floor of a parking ramp in rochester mn, I had selected my parking slot and drove very slowly half way into my parking slot. As I was stationary about 3 meters from the front wall and getting ready to reverse for a bit in order to better align in between the white lines in my slot and before I shifted gears to reverse and while my foot was still on the brake, the vehicle experience a sudden full-speed acceleration crashing the vehicle against the wall with full force, the dashboard showed a message that the airbag malfunctioned and could not deploy. Had not there been a wall but just rails in front of my parking slot, I am afraid the vehicle would have flown from the sixth floor into the ground. The insurance company deemed the vehicle a total loss. The vehicle is still under my name but in possession of geico, available for inspection, but because it was a total loss I was not able to bring it to the Honda dealership where I bought it. There were no warning signs that this would happen.", "fail date": "  07/15/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "When accelerating from an idle position there is a 2-3 second delay. Very slow to bet moving and very dangerous in high volume traffic. The car often times jerks when I am accelerating in to a higher gear.", "fail date": "  04/17/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "The SUV jolts and decreases speed . It takes a long time to take off again. The jolting can be strong and it has decreased on the freeway. This is not safe for a family vehicle. This has happened for a couple of months. I was told at the dealer I just needed a new battery I did change it and it still does it then I was told they found nothing.", "fail date": "  04/06/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "I was pulling into a parking space at my church with my foot on the brake. As I neared the end of the space, the car suddenly surged forward. It went over the concrete barrier at the end of the space and came to a stop when the right front tire hit a tree and was knocked to a perpendicular position to the axle. I believe this is the only thing that caused the car to stop. The airbag did not deploy. The car surged forward about 5-6 feet at a high rate of speed even though my foot was still on the brake and I was slowly moving into the parking space.", "fail date": "  09/20/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Honda Pilot adaptive speed control (acc) works well on freeway following another vehicle and maintaining a safe distance until the car ahead slows to approx 22 mph when the acc braking feature stops working and the Honda Pilot continues coasting creating a hazardous situation and potential to ram the car ahead. This feature is corrected with a low speed follow feature in other Honda and later Honda Pilot models, and should be retroactively added to the 2018 Honda Pilot to prevent rear ending the car ahead.", "fail date": "  05/10/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Car starts to stall when accelerating and when I let go of the acceleration pedal ## #vpic# 1 - check digit (9th position) does not calculate properly #vpic#.", "fail date": "  04/09/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Lane keep assist will trigger multiple times on two lane roads. It will activate with the \"brake\" message in the cluster. The system is totally unusable and unsafe. It has been into the dealership multiple times with a no problem found answer. During a one and a half or two hour drive the system will trigger fifteen times or more. Average speed is about 50 to 55 miles per hour. It happens on straight or curved roadways. Clear weather and in the sun or shade.", "fail date": "  07/28/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Tl the contact owns a 2018 Honda Pilot. While driving 30 mph, the vehicle accelerated without warning. The contact applied the brakes, but the vehicle lunged forward violently and made a loud noise. Also, the rpms increased. The vehicle was towed to headquarter Honda (17700 FL-50, clermont, FL 34711, (407) 395-7500) where it was diagnosed that an unknown part attached to the transmission was faulty. The dealer stated that they would notify the manufacturer. The vehicle was being repaired under the warranty. The VIN was unknown. The failure mileage was 14,200.", "fail date": "  05/07/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "My 2018 Honda Pilot elite turns on the \"auto idle stop\" feature each time I start the vehicle. Basically, this means that the engine shuts off when I'm at a complete stop. When I release the brake, the engine starts again. However, there is lag time between the time I release the brake and acceleration. This has nearly caused a deathly accident on more than a dozen occasions during the past 6 months at intersections. I've nearly been t-boned each and every time because the vehicle will simply not accelerate at the precise moment when I need it to. There is over a 1 second lag before acceleration occurs. Perhaps this is meant to be an emissions control feature, but it comes at the price of safety. This \"auto idle stop\" feature makes the vehicle completely unsafe to drive for families. There should be a permanent on/off switch rather than having to turn this feature off each and every time I start the vehicle. Completely unsafe!.", "fail date": "  12/30/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "2018 Honda Pilot elite-- while driving on a small, congested, curvy two-lane road, in a popular tourist destination, my frontal impact sensors alerted me to frontal impact multiple times by shaking my steering wheel. The dash lights also flashed the word \"brake\" in orange and black. This so-called \"safety\" feature almost cause me to lose control of the vehicle several times on this road because of the shaking steering wheel. This frontal impact alert always occurred when a large RV type of vehicle passed by me. Although I later discovered an \"off\" switch for this frontal impact alert system, I shouldn't have to turn off multiple \"safety\" sensors every time I start the vehicle. If you do not turn off these \"safety\" sensors, they will actual create unsafe conditions by shaking your steering wheel.", "fail date": "  12/30/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Auto start stop function is activated at stop light. Upon releasing the brake to accelerate, the car shuts off completely and am unable to restart vehicle immediately. Requires me to push on/off button a few times to get vehicle back on and running.", "fail date": "  08/06/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "I was stopped at a stop light and the car was in auto engine idle. After releasing the brake when the light turned green, the engine shut off and the dash told me to put the car in park and restart by pushing the brake and hitting the engine start button. This process took about 30 seconds for the car to finally restart and I was sitting in the middle of traffic with cars behind me that had anticipated me moving forward when the light changed. Several warning symbols popped up including the collision mitigation system. This is an easy way to get rear-ended. In other instances, I have had issues where the radio and engine shuts off after releasing the brake when in auto engine idle at a stop light or driving in slower traffic but it kicks back on in just a second with no need to stop and restart. Both of these issues are very concerning. Battery life is fine, so that is not the issue. Issue stops when auto engine idle is disabled.", "fail date": "  07/06/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "My transmission is having problems. During acceleration the car will jolt forward, also when using the brakes. The dealer did recognize the problem but said it is not covered by warranty and that transmission needed to be flushed. . Which was going to cost $500. He said had it been flushed before they may cover it, yet Honda doesn’t recommend a flush before 45000 per my owners manual. Very dangerous. . Could cause an accident with speed going up and down at a moments notice without you doing it.", "fail date": "  10/01/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "As I was coming to a stop light and started to slow down the automatic start/stop system engaged, but the light turned green and when I tried to accelerate the car was not running anymore lights I the dashboard where flashing that I needed to put vehicle in park to start back up. Our vehicle was almost impacted by the truck behind us because he assumed I would be able to speed up instead of having to come to a complete stop. This has happened at least 20 more times since then when I forget to turn off the automatic start/stop feature. It's always when I'm coming to a stop, the SUV will not turn back on mostly its inconvenient to drivers behind me that feel I just didn't see the light turn green but a couple of times it has happened when approaching metering lights in the freeway where the cars behind me or in the lane next to me are ready to accelerate not knowing that my car will have to come to a complete stop because of this issue before I car start the car again.", "fail date": "  08/07/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Tl- the contact owns a 2018 Honda Pilot. The contact stated that while in reversed out of the driveway to go on the main road, while depressing the brake pedal, the vehicle accelerated independently. The contact also stated that when he depressed the emergency brake pedal, the vehicle continue to accelerated and was unable to stop, the contact lost control the vehicle went up on the shoulder of the road and crashed into a pole on the passenger side braking the passenger side window. The contact did not sustained injuries but stated that the next day he experienced dizziness and back pained. The contact did not seek medical attention. A police report was filed. The vehicle was towed to a tow yard. The vehicle was not taken to a dealer or an independent mechanic for a diagnostic testing. The manufacturer was contacted and they informed the contact that they will get back to him. The contact stated that the manufacturer have not yet contact him. The failure mileage was approximately 35,000. Aw.", "fail date": "  01/05/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Lane keep assist will trigger multiple times on two lane roads. It will activate with the \"brake\" message in the cluster. The system is totally unusable and unsafe. It has been into the dealership multiple times with a no problem found answer. During a one and a half or two hour drive the system will trigger fifteen times or more. Average speed is about 50 to 55 miles per hour. It happens on straight or curved roadways. Clear weather and in the sun or shade.", "fail date": "  07/28/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "The driver side sun visor fails to swing down. Dangerous to drive in bright sun replace commercially and mechanic said this is a common Pilot failure why is this not a recall?.", "fail date": "  08/16/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "After only a few months of ownership and roughly 6,500 miles my windshield has two large cracks in it from rocks hitting it. It just seems a bit ridiculous that these windshields are so susceptible to damage in such a small amount of time.", "fail date": "  10/14/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "Since the transmission was replaced at 12,181 miles in June 2019 on a 2018 Honda Pilot elite, other issues have popped up. The forward collision system has gone off twice on a 2 lane state highway. In both cases, I was on a 2 lane highway going about 50 miles an hour with no cars in front of me for at least a mile or two, no vehicles coming the other way, on a straight part of the road, nothing in the road and nothing on the side of the road. The dealer said that it didn't happen to them when driving the car, so there's nothing to fix & Honda corporation said the dealer couldn't find anything to fix. One night when driving on the interstate it it stopped raining but was very muggy and there was moisture on the windshield the automatic wipers did not come on and the defrost did not work - this was over the course of several hours of driving trying different temperatures on defrost and nothing helped. Even with the wipers on manually, visibility was poor. Also, one day after the car had been sitting all day I drove it 20 miles and the car did not cool down - I had to run the air conditioner on full blast the whole time. The car is not cooling like it should! of course, when they tried it out it had actually already been driven 20 miles to the dealership with the air in early morning and then the Honda service department tested it out, there was cool air and said it's blowing just fine now.", "fail date": "  07/04/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "Highway driving, apparently a small stone hit the windshield. (picture attached) and the windshield cracked. The stone in barley 1/4 inch in size. This is not unusual situation, a windshield should not crack, this is a normal driving situation. The ism's windshield is on back order, and will take 4 weeks to receive, as only Honda can recalibrate this at this time, they will only recalibrate an oem windshield.", "fail date": "  11/28/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2018 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "Driver's seat sinks and changes the seat/mirror field of vision of the rear view mirrors. This \"sink\" happens slowly (and without notice) causing dangerous blind spot situations while driving and parking. The \"sink\" began on first day of ownership but I didn't realize it and almost caused an accident because of the change in seat vs rear view mirror position. I am the only driver of SUV. Male, 69 years old. 180 lbs. Driver's seat slowly sinks over time. Approximately 2-5\" per day. While driving, in all instances. Also when the SUV is sitting parked and empty of passengers, but sink is slower. Dealer and Honda main phone complaint site say it is normal. Service woman at local betten-baker Honda said she has 2016 Pilot with the same seat and issue. Said the sink is normal. I believe it is possibly a leaking air bladder. Cause unknown. Lx model with 5000 miles.", "fail date": "  08/17/2018"}]