[{"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Burning to much oil and engine light turn and just put 2 quarts and iwas looking at complaints anf few people have the same issue I really take care of my truck.", "fail date": "  11/02/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Excessive oil consumption which led to engine misfire while driving and trying to merge onto the freeway. This cause a significant loss of power and poor performance by the vehicle. Fortunately the roadway was not busy, but this issue could have caused an accident. Took the vehicle to local mechanic, affordable automotive (chico, CA). They ran a diagnostic and it revealed a p0301 and p0175 code. They removed the spark plugs which showed excessive fouling and they replaced them. The specific cylinder effected was cylinder 1. I have contacted Honda and filed a claim (case #12234271). They opened a case and initially had good communication, but have since stopped responding and have not provided me with a conclusion. Honda initially responded on may 21, 2021.", "fail date": "  05/19/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Tl the contact owns a 2012 Honda Pilot. The contact stated while driving 60 mph on the highway, the vehicle jerked while shifting gears. Additionally, there was an abnormal vibration in the steering wheel. There were no warning lights illuminated. The vehicle was taken to an independent mechanic where the spark plugs were replaced however, the failure recurred. The contact stated that the vehicle was not taken to a dealer due to the distance of the nearest dealer. The vehicle was not repaired. The manufacturer was notified of the failure and suggested that the vehicle be taken to an authorized dealer for assistance. The failure mileage was approximately 137,000.", "fail date": "  11/11/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "As I proceed to accelerate onto a highway or road my vehicle is very hesitant no matter how far you push down on the gas pedal it will not go and then all of the sudden it lurches accelerating the speed very fast as if it's trying to catch up. This has caused me to almost I have three accidents now. I have to be very cautious when entering an intersection or pulling onto a freeway as my vehicle declines to accelerate as it needs to causing people to run into me almost. It is a pretty significant delay for the vehicle to catch up on its own and could be very dangerous for anyone. I have read several columns where customers with Honda Pilots have experienced this same ordeal and yet it's hard to take to a dealership and explain what's going on and then get in the car and it not happen right away but my car does it almost every single time you try to accelerate on to any road. This should be addressed as soon as possible before it causes a life.", "fail date": "  09/10/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I recently buy this car and it has 79000 miles on the odo meter and when I check the carfax miles came out 186000 miles it means they rollback the odometer and I want to report a claim because it is really a safety concern.", "fail date": "  07/22/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The contact owns a 2012 Honda Pilot. The contact stated while at a stop light, the engine shuddered and the vehicle was unable to accelerate. The check engine, battery, traction control, and variable torque management 4-wd system (vtm-4) warning lights were illuminated. The vehicle was taken to the local dealer and diagnosed with piston and piston ring failure mentioned in Honda bulletin 13-082. The vehicle was repaired; however, the failure reoccurred. The manufacturer was notified of the failure. The approximate failure mileage was 85,000.", "fail date": "  08/22/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Excessive oil usage - fouling plugs - reduced gas mileage - vcm fault dtc 3400 technical service bulletin (TSB #11-033).", "fail date": "  11/01/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Vehicle developed a vibration around 45000 miles in rear and thought tires needed rebalancing. That didn't help and after vibrating on a 1600 mile trip had dealer replace tires with original brand and size after discussing problem with them. $1000 later I took the car back to dealer and complained about vibration. They rebalanced tires on hi tech balancer. 275 miles on new tires and still vibration is there. Went back today because of vibration and they did software update and replaced right rear tire. Service manager and then general both rode with me I vehicle and they agreed the vibration is still apparent. They think it's inherent with the Honda Pilot. It obviously is not something that is normal. Who what's to drive a car vibrating all the time.", "fail date": "  12/20/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Purchased the vehicle used from a franchise dealer and am the second owner. The engine hesitates at low speeds (approx. 10 mph) when accelerating. This becomes apparent when attempting accelerate from a stop light, accelerating from a turn, merging onto a freeway, changing lanes, etc. It does happen periodically and I am unable to reproduce the issue on-demand, but it seems to happen daily whenever the car feels like it. I am surprised there is no recall issued for this, as I have already had a couple of near missing when trying to merge onto the freeway with steady flowing traffic and when crossing an intersection from one side of the street to the other. I have yet to take the vehicle to the dealer, as it is out of warranty and there does not appear to be a solution to this issue, so I want to understand what my options are. I'll be reaching out to american Honda soon.", "fail date": "  03/24/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Problem: while trying to accelerate, there is a resistance/hesitation that is felt in the gas pedal and the engine has trouble increasing rpm's. This is an intermittent issue. Case I: while in a parking lot, trying to pick up a little speed. Gas pedal has resistance and engine won't pick up speed. I keep my foot steady on the accelerator and then Pilot picks up speed in a unexpected rush. High level of danger due to people present in the area; as there was an unexpected amount of speed. Case road type: three lane road in each direction of traffic. While in the legal u-turn lane, I observe that there is enough distance to make a u-turn. From a stop I try to pick up speed (I was aiming for 5k rpm's, I know how far to press the gas pedal to get that response). A great resistance and lack of response from the gas pedal was felt. There was minimal acceleration happening and then after about 6 to 8 seconds, the engine was able to get to 6k rpm's. As the cars approached faster I almost got rear ended. As there have been more cases, these are to two most dangerous ones. *note: the resistance/hesitation of the gas pedal happens under any temperature in the cabin.", "fail date": "  07/24/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I have a 2012 Honda Pilot- I purchased used with 9k miles. I have put approximately 5k miles on the vehicle and immediately noticed an engine vibration similar to being in the wrong gear in a manual transmission. I took the car into the Honda dealership and asked them to check the transmission- as I initially thought that it was a \"hunting\" issue with the transmission- the dealer indicated that it was normal. The more I drive the vehicle, the more it appears to be related to the engine and not the transmission. The vibration is very annoying and not normal. Honda needs to step-up and take care of the problem. Too many issues out there with others with same complaints. If Honda does not correct soon it will tell me a lot about the quality status of their brand. This is my 4th Honda and will certainly be my last that if Honda fails to solve the problem. Let's see it Honda- clock is ticking. . .", "fail date": "  12/18/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I have had issues with a strange engine vibration at various speeds. I emailed Honda 3 times and never received any response. I finally called Honda and was told I have to contact a local dealer. I have brought my vehicle in to Honda 3 times and it has not been fixed. The second time I dropped it off I was told they \"did some adjustments\", but they did not indicate what they did and it did not fix the problem. The last time I brought it in and took the main mechanic on the freeway to show him the noise. He acknowledged the noise and said that it was vibration from the motor mounts and that the motor mounts are managed electronically so they can not fix it. He told me that I will have to wait until Honda hopefully comes out with a software update that will fix the problem.", "fail date": "  11/29/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "SUV vibrates abnormally at 30-45 mph. Can feel it in the seat of your pants, floor and center counsel. Had a wheel alignment and wheel balancing done, no help. Was told it is normal, nothing could be done. This problem is very distracting and could cause an accident.", "fail date": "  11/01/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Car is having vibrations coming from the engine while going in and out of vcm - variable cylinder management system. Happens regularly at 70 mph while on cruise control, on flat highway going up a slight hill the vibration starts. This comes and goes, and I could not yet replicate with the dealer. Many people with v6 engines with vcm in it from Honda are complaining about this issue. Looks like it started in the Pilot and is happening with the odyssey as well. Honda whould be forced to look into what is causing this vibration as it appears pretty wide spread.", "fail date": "  08/13/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Intermitent accellerator response delay. Sometimes when you need to accellerate, as when making a left turn in traffic, the response delays and then responds. This is a safety issue. You cannot depend upon response to the accellerator when you may need it. Honda upgraded a program earlier and there was improvement, but the problem still persists.", "fail date": "  06/25/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "2012 Honda Pilot. Consumer writes in regards to vehicle sudden vibration at any speed. The dealer informed the consumer, that Honda was aware of the problem, and they were in the process of trying to find a fix. The consumer stated several months have gone by, with no results.", "fail date": "  06/03/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "At various times at slower speeds the vehicle will not accelerate for approximately 3 seconds. This seems to occur when turning or beginning to travel uphill. I took it to dealer and the dealer mechanic could not replicate this occurrence. This happens about every two or 3 days. I believe it is dangerous when traveling through an intersection of merging lanes. There are several posts on a Honda owner's website with others experiencing the same problem but Honda can't find the problem.", "fail date": "  05/27/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Driving back from illinois to texas and started to feel vibration when the engine's vcm would activate. I was going about 65mph and slowly eased off of the gas, when I slowly pushed on the gas to speed up again I felt a vibration on the floor board that would not stop until I gave it more gas. This has been going on ever since. Even yesterday when I drove to san antonio and today when I drove back to houston, I have taken the car to the dealership 4 times in 2013. It has not been fixed even though the head mechanic did a ride along and agreed there was vibration. The dealership states they cannot fix the problem. They say they are waiting on Honda to give them instructions on how to fix it.", "fail date": "  12/27/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The contact owns a 2012 Honda Pilot. The contact stated that while driving 50 mph, the vehicle started to vibrate. The vehicle was taken to the dealer where the technician advised that the vehicle was performing to standards and the vibration was normal for the eco mode. The manufacturer was made aware of the failure and offered to extend the contact's warranty on the vehicle. The vehicle was not repaired. The VIN was not available. The failure mileage was 300 and the current mileage was 2,200. Kmj.", "fail date": "  12/19/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "My 2012 Honda Pilot ex-l has had issues with vibration when driving at consistent speeds between 40-50 and 60-70 (I. E. Not accelerating). Local dealer initially tried to update control software with no impact, then replaced the torque converter under warranty, also with no impact. Honda service manager now says that this is a known issue with the variable cylinder management program that is designed to increase fuel economy - and the only way to correct this is to drive with the overdrive turned off (thereby significantly lowering fuel economy). The vibration can be best described as a sort of \"stuttering\" that typically occurs during highway driving while moving at a consistent speed, almost as if it were misfiring and goes away once the accelator is pushed harder, only to return once consistent speeds are again reached. The issue has been non-stop since purchase in January 2012, and the vehicle now has approximately 55,000 miles. Had Honda initially explained the issue I would have applied for the north carolina lemon law program, but instead they were less than up front about a known issue.", "fail date": "  08/01/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "2012 Honda Pilot touring- vehicle is having vibrations coming from the engine while going in and out of vcm - variable cylinder management system. Happens regularly at various speeds. The vibration/shuttering is both felt and heard. The dealer has said this is normal with this engine and vcm technology. I had a 2005 Pilot without the vcm system and was very happy, I bought this one without a test drive. Had I known this problem existed, I would not have purchased it.", "fail date": "  05/26/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I purchased my 2012 Honda Pilot on Tuesday March 27, 2012 with 113 miles on it. Within 2 days I experienced for the first time when trying to start the vehicle it times out after 7-10 seconds and I have to try again. Now, 8 days after the purchase it has happened 6 times. I did research on the new model and it seems to have been a known issue since the fall of 2011. If I would have known I would have never signed on the dotted line and I want the issue rectified. I contacted the dealership immediately and they said it was a new issue that has no fix currently. After a the 3rd incident I filed a formal complaint with Honda in California and I haven't heard anything. No offer to take the car back, no offer for a safer vehicle that works properly. I just want a working car-- I am paying money for a vehicle that is known to be faulty and no one seems to know what to do about it. I was told I was the 5th person in the dealerships district to have this issue but still I have this faulty vehicle that is unreliable.", "fail date": "  03/29/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "When accelerating from a low speed, such as entering a parking lot from the roadway or entering a roadway from a parking lot, the engine does not respond to my pressing on the accelerator. After a few seconds, the car lurches forward. This only happens when accelerating from a very low speed, about 10 mph. The vehicle was taken to the dealer twice and an accelerator module was replaced, but there has been no change, the problem still exists. The danger is very serious when trying to enter the flow of traffic from a lot or side street. Very often, it takes much too long to reach the speed of the existing traffic. The dealer explained that there is no longer a cable connection between the accelerator pedal and the engine, it is now \"fly by wire\". There seems to be a disconnect between my pressing the accelerator at a low speed and the engine responding immediately.", "fail date": "  02/01/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "I recently buy this car and it has 79000 miles on the odo meter and when I check the carfax miles came out 186000 miles it means they rollback the odometer and I want to report a claim because it is really a safety concern.", "fail date": "  07/22/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "My car suddenly accelerated for no known reason and the brakes would not stop the car. This has happened 2 time in one week. First time it was moving at a very slow rate as I was coming to a stop at a stop light. The second time I was sitting in line at a drive thru, waiting to move forward, when I took my foot off the brake the car suddenly accelerated and when I pushed on the brake pedal it went to the floor and would not stop the car. I took the car to my garage and they said they could not find anything wrong. I don't know what is causing this but I am not sure if I should keep this car, after I repair the damage or get another car? please check carcomplaints. Com.", "fail date": "  10/23/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Brake rotors warping again for third time, 80,000 miles. No hard braking. Mechanic tells me he sees this a lot with this make and model. Very severe steering wheel shaking and almost loss of control on highway when even slightly braking at 60+ mph.", "fail date": "  09/01/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "My 2012 Honda Pilot rotor warp prematurely resulting in loss of control and increased risk for crash when driving at moderate to high speeds. After being shook to death after heavy breaking, I took my Pilot to the dealership. They said they are aware of the problem but rotors carry a 12k mile warranty. They say that the rotors are not properly designed for the weight of the vehicle. In fact, they updated the new Pilots because of this issue. Also, the have a replacement for the Honda odyssey because of this issue but nothing for the Honda Pilot. Thus, I am force to change out my rotors every 15k miles because of Honda's poor design. Loss of control of the vehicle due to improperly design rotor should be recalled. This on top of Honda knowingly and admitting that there is a problem that affects safety, is pure negligence.", "fail date": "  12/22/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "On may 17, 2016, in my driveway, I was trying to move my 2012 Pilot from beside my husband's vehicle to behind it so my son could pull into the driveway. I pressed the gas pedal to move behind my husband's truck and it moved up a little before it accelerated to a high speed slamming his truck into the garage and crushing it. I hit the brakes, but it didn't help. The engine was revving and tires were spinning as fast as they could. The airbag hit me in the face causing me to jerk the steering wheel to the right, which then caused the Pilot to drive across my front yard at a high speed crashing into my neighbor's tree with my foot still on the brake! the engine only stopped when my husband ran out of my house and turned off the Pilot. At that point, I didn't know what was happening because I had been hit so hard in the face by the airbag. The Pilot was inspected today by Honda corporate at a Honda dealership against my better judgment. Of course after a thorough inspection, \"no cause was found for unintentional acceleration. \" there seems to be a pattern of this same thing happening to other people and Honda not taking responsibility. Something needs to be done before someone is seriously hurt!.", "fail date": "  05/17/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "I am so tired of my front brakes shaking. I have had the rotators turned,or rotated twice and it keeps on happening. I bought this car brand new. The whole car shakes and it is the most frustrating and annoying thing to deal with. 98% of the time when I go to brake, my car shakes, shimmers, and just seems to be unsafe. Just braking at stop lights can change my mood. This is my second Honda Pilot and my first 2008 Pilot did not do this. Something needs to be done. I will not buy another Honda Pilot.", "fail date": "  04/07/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "2012 Honda Pilot certified pre owned purchased from hendricks Honda, bradenton, FL. I purchased 1/27/2015. Original in service 4/19/2012. In florida. Vehicle has not been in winter weather or on salted roads since original in service date. Appr. 1 week after purchase I brought to the attention of used car dept. Personel that all 4 brake rotors were showing rust on all non braking surfaces. I was told this was normal and they would not address this issue. I subsequently returned with vehicle to my home in mass. Rust on rotors progressed to point of looking like it would affect the integrity of the rotor. Upon rreturning to my home in mass. I brought it to the service dept of orleans auto, as subsidiary of the authorized Honda dealer; hyannis Honda,and was told that Honda would not address this issue. Aug 4. 2015, I brought the vehicle to hyannis Honda to be inspected by service manager; norman lamarre, and service director, rene eansereau. Both confirmed that this is a commonly seen problem on recent Honda vehicles and a known Honda problem, they have dealt with many times over many years and have had many complaints. However american Honda will not cover rust on rotors as a warranty. This is unacceptable as this is a safety issue that american Honda is refusing to address. I am requesting your assistance in the matter. I am convinced that the the integrity of these brake rotors is presently compromised, in the cooling van area and the hub area. I am requesting your assistance in the matter.", "fail date": "  02/04/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "2012 Honda Pilot has vibration/shaking in the steering wheel when braking from 50+ mph. Not noticeable at lower speeds, but very noticeable above 50mph. Steering wheel shakes and makes it seem as if the car wants to lose control or not brake as it should.", "fail date": "  01/26/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "I have been driving my Honda Pilot 2012 lx since Nov 2012, though have been visited Honda about 03 times for breaks, the current miles are approx 37400 miles and already resurfaced the front brake rotors 2 times, this is due to the vehicle weight per Honda, it seems the issue is with rotors, even after driving driving really conservatively the rotors get uneven really fast, I sincerely believe the rotors need to be of better quality and hence replaced by Honda.", "fail date": "  12/17/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Warped rotors due to issues with front suspension rear lower arm bushings that are currently leaking and crached. I took my car into the dealership several times and was never told about this issue, but did complain of vibrating, yet nothing was said or done. Had to go to another mechanic to find out what was wrong. Honda needs to cover this issue as I can see from the other complaints that I am not the only one with this issue. These are faulty parts on a vehicle that costs over $30,000. 00. This is my second Honda Pilot and I did not have this issue with the last Pilot. Car violently shakes when braking. It however the whole front end vibrates when driving. Now my window rattles and I believe it is loose because I can hear the air.", "fail date": "  12/04/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The check engine light and vtm4 light come on after over an hour of driving. Sometimes the whole inside of the car smells has while driving and the fuel consumption is not efficient. In addition when the car sits in the garage for a few days, maybe 2-3, and I start driving, the wheels make some deep brushing noise. This gets worst when I brake. Sometimes it smells like something is burning under the hood or around the engine,.", "fail date": "  07/04/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "On April 30 2014 my wife lisa kettig entered the children¿s hospital of philadelphia campus in the 2012 Honda Pilot. She approached the guard booth and came to a complete stop. This can be verified as the guard stopped her and they had a brief conversation about where to park. Lisa then accelerated out of the guard booth while making an immediate low speed right turn down a ramp into a parking garage. From this point the Honda Pilot continued to accelerate down the ramp as she applied the brakes. The car accelerated out of control and failed to brake. It jumped a small median and eventually hit a concrete block wall at the bottom of the ramp. Lisa maintains that she was applying the brakes during the descent down the ramp up the moment of impact and the car was still continuing to accelerate and brakes did not respond. I contacted Honda and submitted a written request that the event data recorder (edr) be tested. A representative from Honda called me on September 6 (I was only given a first name of reggie) he explained that on or about August 19 a technician examined the vehicle and determined that no pre accident data could be recovered. He explained that while the 2012 Honda Pilot has an edr only some of these vehicles have the ability to record pre accident data and that mine did not have this ability. He also said that I would not receive a report or any confirmation in writing about the incident or subsequent examination of the vehicle. The owner manual indicates that edrs has the ability to record data up to 30 seconds prior to the accident it will report if the accelerator or brake was being activated at the moment of impact. It will also indicate the vehicle speed. My request is that Honda follow through and test the edr to determine if the brakes and or accelerator malfunctioned as lisa maintains and supply the results to me.", "fail date": "  04/30/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Power went down, all doors not operative, trunk also non operative, could trap passenger and driver and cause death. All windows are not operative, all doors are non operative, trunk is not opperative.", "fail date": "  02/19/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Purchased this vehicle in January 2012. We hardly driven this car till this year in 2013. As of June 28th of 2013, the Pilot has 7046 miles. In early June we took it down to baltimore when I noticed that there is something wrong with the brakes or steering problems when I applied some braking over 65mph and going down hill was extremely apparent. The steering would vibrate when applying the brakes. I took it to the dealership on 28th. The dealership told me I was \" hard braking\" and that was causing the rotors to warp. I asked them to clarified \" hard braking. \" it was just a general answer that no abrupt force on the brakes. I have driven Toyota, Buick, oldsmobiles, and chevy. I never had a rotor warped that early in mileage. I believed there is a major defects in the Pilot 2012 braking mechanism. I wish some agency can perform more rigid tests to confirm this. I am no expert mechanic, but I have driven many miles due to my sales position both in highway and mostly city driving. And I know that a rotor should not warped that much due to \" hard braking. \" I am a parent of two children, age 2 and 1. And I fear this is going to be an ongoing problem with the Pilot brakes/ rotors problems and it is not cover under warranty cause the company/ dealership thinks it normal wear and tear. So if anyone that has Pilot 2009 or newer, please pay attention and file a complaint to dealership and the company before a tragic might occur. Being proactive is much better than the latter. In the end, after I got my car back from the dealership. I drove and I realized when I apply the brakes under 20mph less than 20 yards to ease the braking, I feel the Pilot \"jerk\" back and forth. This is not normal after a re-surfaced of the rotors. I guess back to the dealership again.", "fail date": "  06/14/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The contact owns a 2012 Honda Pilot. The contact stated that while driving approximately 40 mph and depressing the brakes, she felt a vibration without warning. The vehicle was taken to a dealer where it was advised that the brake rotors needed to be replaced. The manufacturer was notified of the failure. The vehicle was not repaired. The approximate failure mileage was 18,500 and the current mileage was 19,000.", "fail date": "  04/10/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Brakes are very soft from new. Dealer never fix problem. Always said is normal.", "fail date": "  12/03/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Purchased the vehicle on 9/10/12. Over the next week, noticed that brake pedal travel was excessive and the feel was soft - like there was air somewhere in the brakes lines. Took the vehicle back to the dealership. The service manager drove the car and then indicated that he had received similar complaints from other customers; that on some of the other vehicles with the same complaint, they had bled the brake system with no resultant improvement; that my particular vehicle was not abnormal in this regard; and that Honda had not issued any service bulletins on this subject to date. Wrote a complaint on this to Honda USA, customer service on 10-09-12. Received a phone call from a Honda USA customer service case manager on 10-26-12 to say that they were not aware of this problem on other 2012 Honda Pilot vehicles, that they had contacted the dealership where I purchased the vehicle and concluded that my vehicle was operating per design, and that if I was unsatisfied I should contact the local Honda district parts/service manager. Will attempt to do this next week, but this sounds bogus to me since there are at least two other NHTSA complaints already on the same issue.", "fail date": "  09/10/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Traveling at low or at highway speeds the brake pedal has excessive travel and causes an excessively long delayed stop. Also, when coming to a stop and waiting with the brake pressed for several minutes, I. E. , 3-5 minutes at a red light or longer time at a railroad stop, the brake paddle will slowly start traveling to the floor. Have to pump the brake to bring it back up, then, the problem keeps repeating. Several trips to the dealer trying to resolve the issue. They bled the brake system and contacted Honda's main technical department, they claimed this was normal operation and compare it to other Pilot's. Not an acceptable answer. There should be a recall.", "fail date": "  04/23/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The contact owns a 2012 Honda Pilot. The contact stated that while driving at various speeds, the brake pedal would depress too far downward before the brakes actually engaged. The contact also stated that the vehicle would intermittently not start. The vehicle was taken to an authorized dealer, who was unable to diagnose the failure. The manufacturer was made aware of the failure and offered no assistance. The vehicle was not repaired. The failure and current mileages were 1,450.", "fail date": "  12/23/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "I got this car as a loan from a 3rd party dealer ship and they never told me it had a recall days after the airbag light pops up in the dashboard I took it to get service and they stated that the problem was fixed. The light on the dashboard was gone. A couple days ago the light came back and it makes a weird noise when you turn it on and the car gets humidity so fast the windows fog up and I have to turn the ac on. It doesn’t feel safe to drive it at times but I have to for work. I just want to make sure it’s safe to drive from la to sylmar I’m afraid if it gets to hot or humid that the airbag will go off, and I’m paying way more than I expected each month for the car and it doesn’t feel safe.", "fail date": "  08/31/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2012 Honda Pilot. The contact received notification of NHTSA campaign number: 18v661000 (air bags). The contact stated while her husband was driving at an undisclosed speed, he crashed into another vehicle. The front driver’s side air bag deployed, with a powder that caused a burn to the driver’s right hand. A police report was not filed. Medical attention was not received on the scene but the contact's doctor later prescribed burn cream for the driver’s right hand. The contact notified an independent mechanic of the failure, but the vehicle was not diagnosed nor repaired. The manufacturer was not made aware of the failure. The failure mileage was 128,000.", "fail date": "  07/07/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "I am currently stationed in germany and returning to us in the end of August. I have been trying to get Honda to help me correct the safety recall on the rivets since June and they have not help me. I cannot ship my vehicle back to the us unless all the safety recalls have been corrected. I even paid the local german Honda dealer to conduct the inspection on the rivets for the air bag and they said all was ok. But Honda has not cleared the database.", "fail date": "  06/01/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "I received a letter that said that I need to call to take my vehicle to an Honda dealer to repair the passage air bag.", "fail date": "  04/12/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall.", "fail date": "  09/27/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall received notice in mail that I had a vehicle with one or more takata airbags.", "fail date": "  10/09/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2012 Honda Pilot. The contact stated that the vehicle was taken to sierra Honda of sylacauga (40941 us-280, sylacauga, al 35150 (256) 245-5000) regarding NHTSA campaign number: 17v03000 (air bags). The mechanic noticed that the left bushings leaked fluid. It was diagnosed that the left compliance bushing needed to be replaced. The vehicle was not repaired. The manufacturer was not notified of the failure. The failure mileage was 83,000.", "fail date": "  10/04/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "I got an accident on 06/30/2016 and still waiting for my Honda Pilot 2012 airbag (passenger side) since month and a half. I opened a case with american Honda to provide me an alternative transportation as they are not able to deliver the airbag within reasonable timeframe but it ended up with a moment of disappointment. After three weeks of hassle, the american Honda said we cannot provide you alternate transportation as the air bag is not part of recall. However, the case manager said \"the part is on critical backorder, it¿s on the highest level and there is no eta\". The disappointment does not end here! I ask the case manager to send me this decision in black and white so I can discuss this matter with legal experts but all I hear no, they are not allowed to do so. Moreover, I asked american Honda to talk to supervisor of my case manager and its almost a week since I am waiting, waiting and waiting. Just so you know, for me it's a big waste of time and I found Honda service reps really unprofessional.", "fail date": "  06/30/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Air bag manufacturer recall on Honda Pilot.", "fail date": "  05/19/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Husband was driving my 2012 Honda Pilot and passenger curtain air bag ruptures. Patty pack Honda manager states they are not responsible for fixing my vehicle. Geico insurance company is stating there investigation determined that Honda is responsible for repairs. Either party is trying to repair my vehicle. Honda states its my insurance company responsibility and geico states its Honda responsibility. After conducting research on my vehicle, I even called Honda and spoke with manager and told them that they have a air bag recall on this vehicle. They never once offered to fix my vehicle! I have/am going through hell just to get try to get my vehicle fixed.", "fail date": "  03/21/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Airbag was recalled/replaced in 2012-2013. Husband was in an accident with another vehicle. His airbag deployed and left a nasty burn on his arm. He was told it was due to the powder. Accident occurred in town while turning so relatively slow speed. I felt he should report the incident back in October 2014 before I had heard about these recent airbag recalls. My concern is there may be problems with the replacement airbag if that is what he received - I dont have access to his VIN number right now.", "fail date": "  10/16/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata r4call.", "fail date": "  05/10/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "While trying to stop at a red light on a regular city street last night my car kept on moving even when pushing really hard on the brakes!! I switched the gear to neutral and the engine made a very loud noise and I kept on moving the gear between neutral park and so till the gas pedal got disengaged and car went back to normal . Luckily no cars were in front of me and no one got hurt.", "fail date": "  04/16/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "I was in stop and go traffic in rush hour, traveling in the middle lane of a 3 lane interstate highway. One of my daughters was traveling in the front passenger seat and the other one was I seated behind me. I had been traveling for about 45 minutes at a maximum speed of approximately 20 mph, as traffic would clear and then become congested again. I was maintaining about 5 car lengths between my car and the car ahead of me. I tapped my accelerator to move up which caused my Pilot to shoot forward. I thought to myself it was lucky I had maintained a good distance with the car in front and applied the brakes to slow down. The car continued to surge, and I could hear the engine revving. I began screaming, and my daughter in the front seat was yelling for me to hit the brakes. I told her I was pressing the brakes, but the car continued to accelerate, despite my applying with great pressure on the brake. My daughter could also hear the engine revving. We slammed into the car in front of us, and continued moving. This car rear ended a pick up truck which finally stopped my Pilot. Both front seat airbags deployed, and my car became attached to the car I rear ended. Luckily, everyone involved in the accident was able to walk away, but if the driver I had struck had passengers, there definitely would have been severe injuries. I received a ticket from a state trooper for failure to maintain a safe driving distance for an accident that was not my fault.", "fail date": "  08/25/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "On may 17, 2016, in my driveway, I was trying to move my 2012 Pilot from beside my husband's vehicle to behind it so my son could pull into the driveway. I pressed the gas pedal to move behind my husband's truck and it moved up a little before it accelerated to a high speed slamming his truck into the garage and crushing it. I hit the brakes, but it didn't help. The engine was revving and tires were spinning as fast as they could. The airbag hit me in the face causing me to jerk the steering wheel to the right, which then caused the Pilot to drive across my front yard at a high speed crashing into my neighbor's tree with my foot still on the brake! the engine only stopped when my husband ran out of my house and turned off the Pilot. At that point, I didn't know what was happening because I had been hit so hard in the face by the airbag. The Pilot was inspected today by Honda corporate at a Honda dealership against my better judgment. Of course after a thorough inspection, \"no cause was found for unintentional acceleration. \" there seems to be a pattern of this same thing happening to other people and Honda not taking responsibility. Something needs to be done before someone is seriously hurt!.", "fail date": "  05/17/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Two occurrences of car lunging forward 10-20 feet acting like being rear-ended. Foot was firmly pressed on the brake pedal and car lunges many feet, this occurred two times in one day. Two days prior to this incident, I was unable to successfully stop at an intersection as the engine would not rev down and braking was impossible to accomplish. Honda cars of mckinney TX is unable to diagnose the issue. Honda headquarters sent out a specialized technician who also can¿t replicate or diagnose the issue.", "fail date": "  12/29/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Purchased the vehicle used from a franchise dealer and am the second owner. The engine hesitates at low speeds (approx. 10 mph) when accelerating. This becomes apparent when attempting accelerate from a stop light, accelerating from a turn, merging onto a freeway, changing lanes, etc. It does happen periodically and I am unable to reproduce the issue on-demand, but it seems to happen daily whenever the car feels like it. I am surprised there is no recall issued for this, as I have already had a couple of near missing when trying to merge onto the freeway with steady flowing traffic and when crossing an intersection from one side of the street to the other. I have yet to take the vehicle to the dealer, as it is out of warranty and there does not appear to be a solution to this issue, so I want to understand what my options are. I'll be reaching out to american Honda soon.", "fail date": "  03/24/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Good morning, this seems to be a frequent problem on our vehicle. When we come do a stop and then try to accelerate, the vehicle hesitates (2-3 sec. ). In the meantime, I'm still pressing the accelertor down trying to get the vehicle to go. Eventually, the vehicle catches, but then wants to take off (accelerate fast). Recently, my wife said she came to a stop, went to cross the street, and as the vehicle started to move, she couldn't get the vehicle to go and eventually had to stomp the pedal to avoid an oncoming vehicle. I have attached a link to a Honda forum. This seems to be a farely common problem and it doesn't seem Honda has a solution. . Read more...\n", "fail date": "  08/04/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Problem: while trying to accelerate, there is a resistance/hesitation that is felt in the gas pedal and the engine has trouble increasing rpm's. This is an intermittent issue. Case I: while in a parking lot, trying to pick up a little speed. Gas pedal has resistance and engine won't pick up speed. I keep my foot steady on the accelerator and then Pilot picks up speed in a unexpected rush. High level of danger due to people present in the area; as there was an unexpected amount of speed. Case road type: three lane road in each direction of traffic. While in the legal u-turn lane, I observe that there is enough distance to make a u-turn. From a stop I try to pick up speed (I was aiming for 5k rpm's, I know how far to press the gas pedal to get that response). A great resistance and lack of response from the gas pedal was felt. There was minimal acceleration happening and then after about 6 to 8 seconds, the engine was able to get to 6k rpm's. As the cars approached faster I almost got rear ended. As there have been more cases, these are to two most dangerous ones. *note: the resistance/hesitation of the gas pedal happens under any temperature in the cabin.", "fail date": "  07/24/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Intermitent accellerator response delay. Sometimes when you need to accellerate, as when making a left turn in traffic, the response delays and then responds. This is a safety issue. You cannot depend upon response to the accellerator when you may need it. Honda upgraded a program earlier and there was improvement, but the problem still persists.", "fail date": "  06/25/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "I purchased this vehicle from brickell Honda in miami with 7,000 miles. I had traded my 2010 Honda Pilot so I was very familiar with this vehicle in general. Immediatetly, I felt a hesitation when I pressed the gas pedal. At first I thought it was my imagination. However, after driving it for a week it became apparent that this was a huge safety issue as it continually hesitated when accelerating in traffic. I took it back to the dealer and expressed my safety concerns. They drove the car and told me that they could not duplicate the problem. Their \"master mechanic\" explained that it was a new feature with the Pilots's to save gas! I said, well this is very frightening when you press the gas and the gar does not move! they said there was nothing they could do as that is the way the car was made to run?! I have since seen many complaints identical to mine with the 2012 Honda Pilot. Frankly, I am not sure what to do but I wanted to be sure other owners knew of this issue.", "fail date": "  04/29/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "The contact owns a 2012 Honda Pilot. The contact stated that while driving at various speeds and attempting to accelerate, the vehicle hesitated and lunged forward abnormally. The vehicle was taken to the dealer who was unable to diagnose the failure. The manufacturer was not made aware of the failure. The vehicle was not repaired. The failure mileage was 200 and the current mileage was 55,000.", "fail date": "  04/27/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Problem: while trying to accelerate, there is a resistance/hesitation that is felt in the gas pedal and the engine has trouble increasing rpm's. This is an intermittent issue. Case I: while in a parking lot, trying to pick up a little speed. Gas pedal has resistance and engine won't pick up speed. I keep my foot steady on the accelerator and then Pilot picks up speed in a unexpected rush. High level of danger due to people present in the area; as there was an unexpected amount of speed. Case road type: three lane road in each direction of traffic. While in the legal u-turn lane, I observe that there is enough distance to make a u-turn. From a stop I try to pick up speed (I was aiming for 5k rpm's, I know how far to press the gas pedal to get that response). A great resistance and lack of response from the gas pedal was felt. There was minimal acceleration happening and then after about 6 to 8 seconds, the engine was able to get to 6k rpm's. As the cars approached faster I almost got rear ended. As there have been more cases, these are to two most dangerous ones. *note: the resistance/hesitation of the gas pedal happens under any temperature in the cabin.", "fail date": "  07/24/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "I brought my rain because of a woo king sound in 2014, 2015 Hondarepaired partially under warranty compliance bushings. While still under warranty the car needed tie rods replaced/tightened I paid for this has been an ongoing problem for the past three years posing a safety issue for me and my children. I've recently emailed and called Honda they are refusing to cover this because of the mileage deapitwthis has been an ongoing problem since the car was still under warranty. The front end is still wobbly after repairs which I believe is a defect in this model.", "fail date": "  01/01/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "I have a 2012 Honda Pilot- I purchased used with 9k miles. I have put approximately 5k miles on the vehicle and immediately noticed an engine vibration similar to being in the wrong gear in a manual transmission. I took the car into the Honda dealership and asked them to check the transmission- as I initially thought that it was a \"hunting\" issue with the transmission- the dealer indicated that it was normal. The more I drive the vehicle, the more it appears to be related to the engine and not the transmission. The vibration is very annoying and not normal. Honda needs to step-up and take care of the problem. Too many issues out there with others with same complaints. If Honda does not correct soon it will tell me a lot about the quality status of their brand. This is my 4th Honda and will certainly be my last that if Honda fails to solve the problem. Let's see it Honda- clock is ticking. . .", "fail date": "  12/18/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Intermitent accellerator response delay. Sometimes when you need to accellerate, as when making a left turn in traffic, the response delays and then responds. This is a safety issue. You cannot depend upon response to the accellerator when you may need it. Honda upgraded a program earlier and there was improvement, but the problem still persists.", "fail date": "  06/25/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The contact owns a 2012 Honda Pilot. The contact stated that while driving approximately 60 mph and attempting to decelerate, the vehicle suddenly began to vibrate and lose power before responding normally. The vehicle was taken to the dealer but no diagnosis was determined. No repairs were performed. The contact was informed that the vibration was caused by the motor mounts, which the dealer advised was normal. The vehicle continued to experience the failure. The manufacturer was notified and no solution was offered. The failure mileage was 15,000.", "fail date": "  04/01/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "After the break-in period, I took the vehicle to highway speed. Constant vibration under light throttle at constant speed (between 63-68 mph), eco mode. Only solution is to raise or reduce the speed which is a safety concern on the highway - running over people or get run over. The vibration is very annoying which cause the drivers (and the passengers) to lose focus on the road - another safety concern. Brought the car back to the dealer several times but no solution to fix it, currently driving this vehicle on the road and put my family and other cars on the road in danger as Honda thinks it's a characteristic of the vehicle.", "fail date": "  01/15/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The car started smoking, I was able to pullover and get out. The fire department came and removed the hood because it was too hot and appeares to be on fire. They disabled the battery. Car was towed to mechanic and inspected for cause. It was discovered that the alternator melted and the wire harness was burnt and plastic components melted. Car has been totalled.", "fail date": "  09/18/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Back up camera stop working. Apparently alot of Honda Pilot owners complain that the camera stops working.", "fail date": "  01/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "When backing up using the backup camera the camera display will sometimes go black on the screen. I have almost on two occasions almost hit someone backing out of a parking lot. This is a intermittent problem that comes and goes. I feel it's a safety issues to have your vision suddenly cut out with no warning.", "fail date": "  08/11/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Power went down, all doors not operative, trunk also non operative, could trap passenger and driver and cause death. All windows are not operative, all doors are non operative, trunk is not opperative.", "fail date": "  02/19/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The contact owns a 2012 Honda Pilot. The contact stated that the key fob would not function when attempting to access any of the doors. The vehicle was taken to an authorized dealer but was not repaired. The manufacturer was notified of the problem. The approximate failure mileage was 5,200.", "fail date": "  06/12/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "From a dead stop or slow roll, the engine fails to respond immediately to the accelerator pedal. There is a slight delay from the pressing of the accelerator to the engine responding, creating a very dangerous situation when trying to clear intersections, turning on to a highway, turning from a blind curve and many other situations. I have experienced several near crashes. The vehicle was taken back to the dealership for a computer update but the problem has not been corrected, leaving the vehicle in an unsafe condition.", "fail date": "  01/07/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "I purchased a Honda Pilot 2012 ex-l 4wd in Nov 2011. Since day one I noticed that there has been a problem with the vehicle's a/c system. Specifically, I hear a loud humming noise from the engine compartment when the a/c compressor turns on. The noise is very annoying and was dismissed by the dealer as \"normal\" without diagnostic works. Having owned many other vehicles over the years, my experience tells me that the noise definitely cannot be characterized as \"normal\". After online research, it seems that Honda is aware of the issue and had promised a solution since last year. To date, other Pilot owners and I have not received any official notification from corporate Honda regarding the fix on the issue. I'm hoping that more potential buyers are at least aware of this issue when they compare vehicles and that Honda hears our collective concerns and take responsible actions.", "fail date": "  12/21/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "My wife pulled the vehicle into our driveway and exited the car just a she noticed white smoke coming out from under the hood. She called me out of the house to look and I saw there was a fire in the engine compartment. I tried to put it out with a fire extinguisher but it spread too fast. The end result is the entire vehicle was burnt with not much left. I am assuming it was something electrical due to the nature of the initial smoke and the location of the fire origins.", "fail date": "  10/31/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "This is first summer for my brand new Honda Pilot 2012 lx car and I notice when ac in on and car is not moving there is some kind of moaning very loud noise coming from the engine. I took my car to the dealer from where I purchased this vehicle. I was informed that Honda motors is aware about this issue in 2012 Pilot. I am very surprise and upset that despite Honda motor is aware about this issue, till the date Honda motors did not solve this problem. The noise coming is very loud when ac is on and when car is not moving. This noise is very annoying. I am having migraine almost every day because of this very load moaning noise coming from the car. I already contacted Honda but they did not solve this problem as of yet or there is no recall. It is almost been one year Honda Pilot 2012 model came out. Please help urgently. Thanks.", "fail date": "  06/01/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "As I proceed to accelerate onto a highway or road my vehicle is very hesitant no matter how far you push down on the gas pedal it will not go and then all of the sudden it lurches accelerating the speed very fast as if it's trying to catch up. This has caused me to almost I have three accidents now. I have to be very cautious when entering an intersection or pulling onto a freeway as my vehicle declines to accelerate as it needs to causing people to run into me almost. It is a pretty significant delay for the vehicle to catch up on its own and could be very dangerous for anyone. I have read several columns where customers with Honda Pilots have experienced this same ordeal and yet it's hard to take to a dealership and explain what's going on and then get in the car and it not happen right away but my car does it almost every single time you try to accelerate on to any road. This should be addressed as soon as possible before it causes a life.", "fail date": "  09/10/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "My car suddenly accelerated for no known reason and the brakes would not stop the car. This has happened 2 time in one week. First time it was moving at a very slow rate as I was coming to a stop at a stop light. The second time I was sitting in line at a drive thru, waiting to move forward, when I took my foot off the brake the car suddenly accelerated and when I pushed on the brake pedal it went to the floor and would not stop the car. I took the car to my garage and they said they could not find anything wrong. I don't know what is causing this but I am not sure if I should keep this car, after I repair the damage or get another car? please check carcomplaints. Com.", "fail date": "  10/23/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Excessive oil usage - fouling plugs - reduced gas mileage - vcm fault dtc 3400 technical service bulletin (TSB #11-033).", "fail date": "  11/01/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Sometimes when starting out and making left or right hand turn after being stopped at a stop light or stop sign, the engine will hesitate and bog down for a few seconds before it \"kicks in\" and then there is a \"surge of power\". This is very annoying at the least and also very dangerous as one could easily get rearended or worse yet get caught in the intersection in oncoming traffic. This has happened on 3 occasions and each time I was barely able to accelerate enough to clear the intersection. There are several complaints to Honda dealers of this existing problem and they have failed to take any corrective action or acknowledge the problem. Someone's going to have to be killed before this gets their attention. See link below of complaints. . Read more...\n", "fail date": "  11/17/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "The check engine light and vtm4 light come on after over an hour of driving. Sometimes the whole inside of the car smells has while driving and the fuel consumption is not efficient. In addition when the car sits in the garage for a few days, maybe 2-3, and I start driving, the wheels make some deep brushing noise. This gets worst when I brake. Sometimes it smells like something is burning under the hood or around the engine,.", "fail date": "  07/04/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "On April 30 2014 my wife lisa kettig entered the children¿s hospital of philadelphia campus in the 2012 Honda Pilot. She approached the guard booth and came to a complete stop. This can be verified as the guard stopped her and they had a brief conversation about where to park. Lisa then accelerated out of the guard booth while making an immediate low speed right turn down a ramp into a parking garage. From this point the Honda Pilot continued to accelerate down the ramp as she applied the brakes. The car accelerated out of control and failed to brake. It jumped a small median and eventually hit a concrete block wall at the bottom of the ramp. Lisa maintains that she was applying the brakes during the descent down the ramp up the moment of impact and the car was still continuing to accelerate and brakes did not respond. I contacted Honda and submitted a written request that the event data recorder (edr) be tested. A representative from Honda called me on September 6 (I was only given a first name of reggie) he explained that on or about August 19 a technician examined the vehicle and determined that no pre accident data could be recovered. He explained that while the 2012 Honda Pilot has an edr only some of these vehicles have the ability to record pre accident data and that mine did not have this ability. He also said that I would not receive a report or any confirmation in writing about the incident or subsequent examination of the vehicle. The owner manual indicates that edrs has the ability to record data up to 30 seconds prior to the accident it will report if the accelerator or brake was being activated at the moment of impact. It will also indicate the vehicle speed. My request is that Honda follow through and test the edr to determine if the brakes and or accelerator malfunctioned as lisa maintains and supply the results to me.", "fail date": "  04/30/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "The contact owns a 2012 Honda Pilot. The contact stated that while refueling, fuel spewed from the filler neck. The manufacturer was contacted and informed the contact that the vehicle was not included in NHTSA campaign number 12v063000 (fuel system, gasoline). The vehicle was not diagnosed or repaired. The failure mileage was approximately 12,000.", "fail date": "  08/21/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "I purchased this vehicle from brickell Honda in miami with 7,000 miles. I had traded my 2010 Honda Pilot so I was very familiar with this vehicle in general. Immediatetly, I felt a hesitation when I pressed the gas pedal. At first I thought it was my imagination. However, after driving it for a week it became apparent that this was a huge safety issue as it continually hesitated when accelerating in traffic. I took it back to the dealer and expressed my safety concerns. They drove the car and told me that they could not duplicate the problem. Their \"master mechanic\" explained that it was a new feature with the Pilots's to save gas! I said, well this is very frightening when you press the gas and the gar does not move! they said there was nothing they could do as that is the way the car was made to run?! I have since seen many complaints identical to mine with the 2012 Honda Pilot. Frankly, I am not sure what to do but I wanted to be sure other owners knew of this issue.", "fail date": "  04/29/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "28000 mi estimate. Complaint report justification- research indicates Honda is recalling vehicles for fuel system errors including potential fires. Vehicle: Honda Pilot 2012 \"check fuel cap\" indicator light has been reported previously to dealership. Dealership: first texas Honda, 3400 steck, austin, TX, I reported the \"check fuel cap\" indicator light during prior service appointments for standard services such as tire rotate, oil chng etc. Dealership service department attending staff recommended that I get a new fuel cap. 12-8-2012 - I took vehicle to dealership for new fuel cap. Head service manager recommended audit of fuel system saying that the \"check fuel cap\" indicator does not pertain just to the cap but to the entire fuel system. Appointment scheduled for 12-14-2012. 12-14-2012 - vehicle taken to dealership. 12-15-2012 - received a call that the gas cap was not on properly and cap tether was wrapped around cap. I disputed leaving the cap in loose condition and stated that it had to have been left loose by a technician. 12-15-2012 - picked up vehicle. Invoice odometer 31646. Service invoice c51253 written up (1) concern 51 customer states loose fuel cap light comes on and goes off. Per check for fuel leaking. (2) cause gas cap loose, replaced gas cap per jeff smith. (3) correction - performed eval function text, vehicle is operating properly. (4) comment - 67d per jeff s __/ richard tr__see hard copy 12-15-12 part no hon 17670-tr0-a11. Questions see richard tr__. Complaint justification result: picked up vehicle after 5:00 pm prior to dealership 6:00 pm closing. Returned home. Odometer 31677. \"check fuel cap\" indicator light was on at 31677. Due to heavy traffic, I do not know mileage when indicator came on. 12-16-2012 - 10:15 am cold started vehicle at odometer 31677. \"check fuel cap\" indicator light came on immediately.", "fail date": "  12/15/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "The contact owns a 2012 Honda Pilot. The contact stated while parking the vehicle, he smelled an odor of gasoline fuel and noticed fuel leaking from under the vehicle. The fire department was contacted and advised the contact not to drive the vehicle. The vehicle was towed to the dealer but was not repaired. The manufacturer was also contacted and advised that they were going to further investigate the failure. The failure and current mileage was 6,700.", "fail date": "  06/09/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "I took my car in for regular maintenance. I was notified that both front lower compliance bushings were excessively worn and needed replacing soon. I researched and found that there had been an extended warranty for this problem however I'm past the 100,000 mile warranty. My mileage 136,648. I never received any warning about this serious safety concern from anyone including my dealership. This is very costly and I'm hoping I can get some help in getting this repair done ASAP since it such a safety issue.", "fail date": "  03/10/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "The contact owns a 2012 Honda Pilot. The contact stated that the vehicle was taken to sierra Honda of sylacauga (40941 us-280, sylacauga, al 35150 (256) 245-5000) regarding NHTSA campaign number: 17v03000 (air bags). The mechanic noticed that the left bushings leaked fluid. It was diagnosed that the left compliance bushing needed to be replaced. The vehicle was not repaired. The manufacturer was not notified of the failure. The failure mileage was 83,000.", "fail date": "  10/04/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "I brought my rain because of a woo king sound in 2014, 2015 Hondarepaired partially under warranty compliance bushings. While still under warranty the car needed tie rods replaced/tightened I paid for this has been an ongoing problem for the past three years posing a safety issue for me and my children. I've recently emailed and called Honda they are refusing to cover this because of the mileage deapitwthis has been an ongoing problem since the car was still under warranty. The front end is still wobbly after repairs which I believe is a defect in this model.", "fail date": "  01/01/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Vehicle pull to one side on flat surface. Honda dealer claim that it is due to road curve. They perform the following: wheel alignment and tire rotation. Did not fix the problem. When driving and hit a bump, vehicle shift from left to right or right to left. The blame the tire is bad but the vehicle is less then 1. 5 years old. They perform the following: wheel alignment and tire rotation. Did not fix the problem. Steering wheel is loose. I can turn the wheel more than 3 inches before the wheel turn. They perform the following: wheel alignment and tire rotation. Did not fix the problem. Knocking noise in front of vehicle when rocking the steering wheel left and right. Dealer apply grease. Vehicle vibration at around 40-45 mph and 20-25 mph. Feel like something with the drive train. They stated it was a common Pilot all of these issue the dealer dismiss because they stated it was all in Honda specific. I believe that for a vehicle that is less than 1. 5 years old, this is just [xxx]. Information redacted pursuant to the freedom of information act (foia), 5 u. S. C. 552(b)(6).", "fail date": "  09/09/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Driving back from illinois to texas and started to feel vibration when the engine's vcm would activate. I was going about 65mph and slowly eased off of the gas, when I slowly pushed on the gas to speed up again I felt a vibration on the floor board that would not stop until I gave it more gas. This has been going on ever since. Even yesterday when I drove to san antonio and today when I drove back to houston, I have taken the car to the dealership 4 times in 2013. It has not been fixed even though the head mechanic did a ride along and agreed there was vibration. The dealership states they cannot fix the problem. They say they are waiting on Honda to give them instructions on how to fix it.", "fail date": "  12/27/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Humming/whining noise and steering vibration coming from front wheels while driving at all speeds.", "fail date": "  08/05/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "The contact owns a 2012 Honda Pilot. While driving at 60 mph, the vehicle pulled to the right and the steering wheel jerked violently. The failure recurred numerous times. The vehicle was not diagnosed or repaired. The manufacturer was not made aware of the failure. The failure mileage was 45,047.", "fail date": "  04/30/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "When braking at speeds above 50 mph, there is a vibration at the steering wheel. I brought the vehicle to a Honda dealer and was told the front rotors should be refaced when the car needs new brake pads. I have had a 2006,2009, and 2012 Pilot. My driving habits have not changed, the mileage per year is consistent, and there has been no hard or excessive braking. I have not had this problem with the other model years. So, what's the problem? are the current rotors thinner or inferior?.", "fail date": "  11/20/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "Purchased this vehicle in January 2012. We hardly driven this car till this year in 2013. As of June 28th of 2013, the Pilot has 7046 miles. In early June we took it down to baltimore when I noticed that there is something wrong with the brakes or steering problems when I applied some braking over 65mph and going down hill was extremely apparent. The steering would vibrate when applying the brakes. I took it to the dealership on 28th. The dealership told me I was \" hard braking\" and that was causing the rotors to warp. I asked them to clarified \" hard braking. \" it was just a general answer that no abrupt force on the brakes. I have driven Toyota, Buick, oldsmobiles, and chevy. I never had a rotor warped that early in mileage. I believed there is a major defects in the Pilot 2012 braking mechanism. I wish some agency can perform more rigid tests to confirm this. I am no expert mechanic, but I have driven many miles due to my sales position both in highway and mostly city driving. And I know that a rotor should not warped that much due to \" hard braking. \" I am a parent of two children, age 2 and 1. And I fear this is going to be an ongoing problem with the Pilot brakes/ rotors problems and it is not cover under warranty cause the company/ dealership thinks it normal wear and tear. So if anyone that has Pilot 2009 or newer, please pay attention and file a complaint to dealership and the company before a tragic might occur. Being proactive is much better than the latter. In the end, after I got my car back from the dealership. I drove and I realized when I apply the brakes under 20mph less than 20 yards to ease the braking, I feel the Pilot \"jerk\" back and forth. This is not normal after a re-surfaced of the rotors. I guess back to the dealership again.", "fail date": "  06/14/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "Driving home from the dealer in a brand new 2012 Honda Pilot, 4wd, ex-l w/res on 6/26/12. At approximately 62 to 65 mph the transmission is lurching as it appears to be shifting back and forth between 4th and 5th gear. This causes a jerking motion and can be felt in the steering. Took vehicle back to dealer on 6/28/12 and a Honda technician drove the vehicle as I was in the passenger seat. The technician confirmed the issue and indicated it was exactly as I had described. He says this is a known problem but there is no fix. He said it's due to the torque converter. He said it is the same on the odyssey models but Honda released some software updates but they weren't successful. He said if it happens just speed up or slow down (he really said this). He said if Honda releases any software updates they'll contact me. Wow.", "fail date": "  06/27/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "As I proceed to accelerate onto a highway or road my vehicle is very hesitant no matter how far you push down on the gas pedal it will not go and then all of the sudden it lurches accelerating the speed very fast as if it's trying to catch up. This has caused me to almost I have three accidents now. I have to be very cautious when entering an intersection or pulling onto a freeway as my vehicle declines to accelerate as it needs to causing people to run into me almost. It is a pretty significant delay for the vehicle to catch up on its own and could be very dangerous for anyone. I have read several columns where customers with Honda Pilots have experienced this same ordeal and yet it's hard to take to a dealership and explain what's going on and then get in the car and it not happen right away but my car does it almost every single time you try to accelerate on to any road. This should be addressed as soon as possible before it causes a life.", "fail date": "  09/10/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I noticed a few months ago that the paint was peeling on my 2012 Honda Pilot. Paint should not peel on a car that is only 7 years old. I contacted Honda and the have refused to fix this.", "fail date": "  01/15/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "My paint is peeling on the roof between the windshield and the sunroof.", "fail date": "  01/05/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Bluetooth connection drops regularly, causing a distraction to the driver.", "fail date": "  09/17/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Power went down, all doors not operative, trunk also non operative, could trap passenger and driver and cause death. All windows are not operative, all doors are non operative, trunk is not opperative.", "fail date": "  02/19/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Vehicle is vibrating at high speeds (70. . . 75 mph). After numerous attempts at the dealership to correct vibration problems when running at highway speeds, only to have no correction done at all, I have decided to write to you about this issue. Honda will acknowledge there is a vibration problem at highway speeds but do not have a correction for it, other than charge the customers a new set of tires on a constant basis.", "fail date": "  01/29/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "The white pearl paint is peeling off, separating from the primer. I brought it to a body shop and they said it looked like a manufacturing defect and I should file a complaint because it will probably spread to the whole car.", "fail date": "  01/01/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "The paint is peeling off of the roof and hood of the vehicle. It is a white 2012 Honda Pilot.", "fail date": "  02/12/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "Paint is peeling off on the hood and roof.", "fail date": "  02/08/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "My paint is peeling on the roof between the windshield and the sunroof.", "fail date": "  01/05/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "I got this car as a loan from a 3rd party dealer ship and they never told me it had a recall days after the airbag light pops up in the dashboard I took it to get service and they stated that the problem was fixed. The light on the dashboard was gone. A couple days ago the light came back and it makes a weird noise when you turn it on and the car gets humidity so fast the windows fog up and I have to turn the ac on. It doesn’t feel safe to drive it at times but I have to for work. I just want to make sure it’s safe to drive from la to sylmar I’m afraid if it gets to hot or humid that the airbag will go off, and I’m paying way more than I expected each month for the car and it doesn’t feel safe.", "fail date": "  08/31/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "The sunroof of my 2012 Honda Pilot shattered for no reason after a very loud explosion sound (sounded like a fire cracker inside the SUV). This happened as my son, mother in law and I were driving at highway speeds. This abrupt explotion and breakage could have been deadly. I urge that Honda takes ownership of this issue. I read many blogs and for my surprise it seems to be a common issue due to poor quality material of choice by the manufacturers. Now the worst part is that this replacement is very expensive and neither the Honda dealer or geico wants to help and now I have to pay a deductible of $500. Definitely not a fair bargain for me after spending $40,000 for a Honda SUV.", "fail date": "  04/25/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "When backing up using the backup camera the camera display will sometimes go black on the screen. I have almost on two occasions almost hit someone backing out of a parking lot. This is a intermittent problem that comes and goes. I feel it's a safety issues to have your vision suddenly cut out with no warning.", "fail date": "  08/11/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2012 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "The contact owns a 2012 Honda Pilot. The contact stated the front passenger side wiper left streaks on the windshield when it was activated. The vehicle was taken to the dealer for diagnosis where the technician replaced the front passenger's wiper blade. After the vehicle was repaired the contact noticed the front passenger's side wiper blade also began to leave streaks. The vehicle was taken to the dealer three times to have the wiper blades, wiper inserts, and wiper arms replaced. The failure continued to occurred after the vehicle was repaired. The manufacturer was made aware of the failure. The vehicle was not repaired. The approximate failure mileage was 8,000.", "fail date": "  10/15/2012"}]