[{"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Trunk closed on my head and trapped me. It lifted and then closed on my hair trapping me by my braids. I had to get assistance to get free.", "fail date": "  11/04/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "My 2015 Honda Pilot white pearl paint is peeling off of my roof in large pieces. I have seen four of the same reported issue on the NHTSA site and many of the same color Honda Pilot vehicles with paint peel on the road. There was obviously a paint or application problem with this Honda white pearl paint.", "fail date": "  07/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Complaint - Honda no longer provides a maintenance schedule for the vehicles. It instead relies on a maintenance minder system. I change my oil more frequently than the recommended 7500 miles, which means that the maintenance minder no longer works, as it is thrown off by the more frequent oil changes, as well as by my low mileage. I have had my vehicle 5. 5 years, and received only one maintenance code during that time period - while I have had to change various fluids during that same time period to be on the safe side and in an effort to ensure proper maintenance of the vehicle. I believe manufacturers should be required to continue to provide a maintenance schedule for their vehicles. If I were to rely solely on the maintenance minder, I fear that necessary maintenance would not be performed. And no, I do not use a dealership to perform my maintenance - I use an independent shop. This lack of a maintenance schedule increases the risk for improper maintenance and poses a potential safety hazard.", "fail date": "  08/01/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "On 7/25/2020 I was driving on the highway at 9:00 pm center land of a 3 lane highway when I heard a loud bang on the roof of the vehicle. I pulled off the highway and discovered the sunroof glass had shattered, with no apparent damage to any other part of the vehicle. Nothing appeared to have struck the vehicle, only the glass appeared to have spontaneously exploded.", "fail date": "  07/25/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The spare tire fell off from under the vehicle while vehicle was in motion. Thankfully I was driving slowly in my driveway but the cable snapped and this could have happened seconds earlier while I was driving 50.", "fail date": "  12/20/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Both rear door windows intermittently are found open approximately 2-3 inches.", "fail date": "  04/04/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Within a few seconds and while applying the brakes, the brakes seem not to engage, but then engage, the engine revs up. The engine stays idled up until the brakes are released. Two occurences happened in one day and doesn't duplicate for the dealership. Two weeks pass and another occurrence happened. The incidents occur while already attempting to brake. The car skidded like the wheels were locked. The first occurrence was when I was stopped to enter a parking garage. The second occurrence happened on the same day and I could not have been going any more than 25 miles per hour when I applied brake, the vehicle fishtailed a little bit and eventually stopped. The third occurrence happened yesterday January 7th while going about 25 miles per hour and attempting to slow down in heavy traffic. The vehicle behaved as though it wasn't going to stop but eventually stopped( applying brake but no reduction in speed) and the engine revved up while my foot was on the brake. Each occurrence of the engine revving up happened while either stopped or attempting to stop.", "fail date": "  12/13/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The compass started flashing I call the dealership they said that to calibrate it back just drive in a circle on a parking lot. That would work but the flashing has appeared more often and now it won't go away. It flashes all the time and it is distracting while driving. It has the possibility of causing an accident specially at night. Please I need this defect recalled ASAP. Ps. I'm screenshooting this request for proof of reporting in case something happens.", "fail date": "  01/10/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Known problem with aluminum air condensers installed directly behind the vehicle grill. Suit settled in 2012 on other models. Honda refuses to cover under general warranty claiming road damage. We say faulty design that they have known about for a long time.", "fail date": "  07/30/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "While I was driving on I-5 south freeway, I heard an exploding sound on sunroof. I pulled over and saw the sunroof glass shattered. My car mileage is around 13,000 miles.", "fail date": "  01/30/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "While cranking my 2015 Honda Pilot on 11/22/15 it did not want to start. I turned the key and let it go and it continued to try to start on its own. I turned the key back to off and took it out of the ignition. After the third try of starting my vehicle it finnally started. It was not extremely cold out ide the temperature was 51 degrees. This is my 3rd Pilot I have owne and never had this issue before. My vehicle only has16,500 miles on it. Could this be the sign of a bigger issue?.", "fail date": "  11/22/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I have several issues with the 2015 Honda Pilot that I purchased in January 2015. The most recent one happened today July 15, 2015. (for some reason I could not populate the date field on the form. ) as I was driving, the car lost all power. Even the steering would not respond, although I was able to pull over with great difficulty before it completely stopped. I restarted the car and was able to drive the block to home. I contacted the dealer and was told there were no appointments until Friday but to take it in under the express service, which I plan to do this afternoon. I did search the internet to see if other Honda Pilot owners have had a similar problem and found that indeed it has been a problem for other Honda Pilot owners. Additionally, on two different tires, I had to have repairs due to nails in the tire causing slow leaks. I previously owned a 2013 Honda Pilot, same model (touring) and had the same tire problems. This is the car I use for business so I will put my business address below. I am using my personal email address.", "fail date": "  07/15/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "While driving on the beltway on a light rainy day, I drove through a couple of inches of sheeted water, on the road way. The water was pushed up over the top of the vehicle in a solid sheet, that was heavy enough to completely obscure vision for at least 3 seconds. This happened once while accelerating onto this toll road and again a mile or so further down the road when I was traveling at freeway speed. Visibility was completely lost while traveling in a very light rain in non flood conditions at entry ramp speeds and then again when we were cruising at about 65 mph, down the toll road. The rain was so light that the wipers were on delay and did not activate during the incident. This is obviously a very serious design flaw for this vehicle. I've noticed in the ads for the 2016 model, that the configuration was changed. I've also seen the notice in the paper that Honda received a 70 million dollar fine for lying about how many people that have been injured and killed in their vehicles. I'm positive this is one of the reasons why. The brakes don't seem to be very reliable, either, getting firmer in cooler weather and grabbing and getting mushy around 70 degrees. They also pump up when backing up.", "fail date": "  03/21/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Dear sir, I have had problem with engine light coming up along with shaking of my vehicle, this also turns on my traction light on my panel. This first happened in June 2019 in san antonio. I had warranty at the time. I took my car to hill country Honda for evaluation, the told me it was just a coil and they would replace it. The exact same issue has happened again repeatedly. It happened again 6 months later after I left san antonio, I now live in houston. I have met with many mechanics, one master mechanic told me he was sure it a was a defective piston ring . Most mechanics have just been changing the coil and spark plugs. He told me this was waste of my money since it is not the real issue. Up on his recommendation, I sought a second opinion at at Honda dealership since I felt it was strange for a piston ring needing to be changed. Without me saying anything descriptive about vehicle, they immediately told me, its the pistons, we can change them (6) for 4000. Did not tell me why or what caused this unusual defect. Upon researching I found Honda Pilots 2008-2013 models have same exact issue and were part of a recall to have them replaced. The same issue is happening to me. What is really unlawful is the Honda dealership in san antonio knew about the defective pistons in Honda Pilots and instead issued a temporary fix. Can someone please advise. I desperately need help in fixing this defect, I still owe vehicle and have take a great financial toll on me and my family. Thank you.", "fail date": "  09/10/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "My 2015 Honda Pilot ex-l hesitates to accelerate when turning. It mostly happen when turning right, when I turn and try to accelerate the gas pedal becomes non responsive. This is very unsafe. There's no acceleration while merging into traffic! I have taken the car to dealer in 3 occasion but they said they can't duplicate the issue. I wrote to Honda America inc. But they said the same thing. They can't help me with this issue. I am very concern about these intermittent problem because I feel very unsafe driving my car!.", "fail date": "  01/16/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Vehicle shudders (shakes) at speeds of 40-45 mph. Had conversation with Honda advisor (3/18) who said this was normal. Not sure, but want to report it anyway because it shouldn't be normal. I'm still noticing this (2/2019). Hopefully, vehicle will not stop dead in the middle of traffic.", "fail date": "  03/14/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "While stopped at a red light, smoke started coming out from under the hood. I immediately pulled into a parking lot and turned the engine off. A bystander yelled at me to get out of the car. She saw fire coming out from underneath the engine. Smoke continued to pour out and then the whole front of the car was engulfed in flames.", "fail date": "  02/17/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "At about 55000 miles my Pilot started jerking/hesitating at all speeds, any road, usually after shifting gears both up and down. Now I bought it in February 2017 certified pre-owned so all recommended scheduled maintenance should have been performed. So, I took it in for diagnosis and the dealer in dublin OH said the transmission fluid needed to be triple flushed flushed 3 times!!! since I needed a vehicle to drive to work, I couldn't argue and got the service done. After reading of other languages with similar issues with the jerking/stutter/hesitation I decided to file this complaint. The results of the tranny flush were good however I can still feel a very faint almost unnoticeable hesitation that should be addressed.", "fail date": "  12/28/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Almost immediately after purchase, notice car shuddering and shaking at 35-50mph and then even higher speed limits. Went to purchasing dealer service department and they told me this is a common problem associated with vcm system. Took car for three subsequent repairs over next year to another Honda dealer. Even after downloading new pcm and vcm / torque management software update provided by Honda, problem still exists. Honda states that they will continue to work on this fix, but corporate now states that this defect is within acceptable operating standards. On some days the shuddering seems unsafe and could pose a risk, I suspect, to driver and passenger safety. Have followed all lemon law guidance from state of georgia and Honda continues to produce lies and false statements to cover up a problem which has even been written about by edmunds. Com. Corporate rep met me at dealership to evaluate problem. He acknowledge problems during a test drive; stated that some cars just don't make it off the assembly line perfect, and that my vehicle is one of those vehicles. Honda corporate also states that the local dealership is in concurrence with their assessment, and I know for a fact that they are not based on discussions with them and with their service technicians who have worked on my vehicle. Honda should be ashamed of how they are ignoring an operating problem with this vehicle; expanding acceptable tolerance limits in order to call this vehicle normal and safe.", "fail date": "  06/01/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "I have never been in an accident other than being rear ended and it was not major. My air bag light would not go out. My seat belt alarms would no longer work and my locks would not work automatically. My air bag module(srs unit) needed replaced. It effected my airbags, seat belts and my power locks. The dealership did not know that the locks could even be effected but as soon as is was replaced the locks worked as they did prior to the malfunction. I have had a couple mechanics tell me that the module should not ever go bad unless I have been in an accident.", "fail date": "  02/18/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "While stopped at a red light, smoke started coming out from under the hood. I immediately pulled into a parking lot and turned the engine off. A bystander yelled at me to get out of the car. She saw fire coming out from underneath the engine. Smoke continued to pour out and then the whole front of the car was engulfed in flames.", "fail date": "  02/17/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Since December of 2016 the center console (heating/cooling settings, stereo, volume controls) have flashed, faded, or shut off completely while operating the vehicle. This is a driving distraction and hazard to the operator(s) of this vehicle. Since the purchase in November of 2014, I drive 10,000 miles over a 10 week period several times a year. When the issue occurred I immediately contacted the dealer, who responded the vehicle was out of warranty (3 years/36,000 miles) and would be a costly out of pocket repair to me. I had already replaced the wiper motors within two years out of pocket. I sought out second opinions from other Honda dealers and service providers who also gave a similar quote. I researched other online chats of similar complaints by other Honda owners. To this day I'm still having further issues with the center console system (air conditioning controls fluctuate, the stereo/bluetooth volume fluctuates from loud to soft, and I must manually adjust the temperature settings blindly. I love my 2015 Pilot but feel that this matter should be resolved by the dealership. Can you help me resolve this blinding defect in an otherwise wonderful vehicle?.", "fail date": "  11/02/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "My center console (nav/ac/radio) turns off every 30 seconds in my 2015 Pilot with 8k miles. It starts with a loud \"pop\" sounds through the speakers, followed by the entire center console going black, and reseting. It happens regardless of the radio and/or air conditioning being on/off. Honda has told dealerships to disconnect the battery for 30-45 minutes, to let the system reset, but it does not work. This is effecting every 1012-2016 Honda Pilot & Honda odyssey in the greater cincinnati area. Honda has done absolutely nothing to resolve the issue for consumers. This happens anytime the vehicle is turned on, including in motion. This has been ongoing for over a week, and Honda dealers have tried to do everything Honda instructs them to do to fix this, but nothing works. The 4 pictures below are screen shots from a video I took while documenting the problem. These are in order, and show screen going blank, followed by climate control lights, followed by radio/nav. This has been happening since 2/16, I reported it to Honda Friday 2. 19. 16.", "fail date": "  02/19/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "I have a 2015 Honda Pilot with navigation. The navigation system and radio have continuously rebooted on their own since Tuesday. Honda cororate refers me to the dealerships. The dealerships refuse to work on the car as they say it is a widespread issue and they hope it just resolves itself in a few days. The fix I was told to do didn't work. I am caught in the middle as are many others and no one knows what the problem is. The service manager refuses to look at the vehicle as he says it is a widespread issue so it has to be satellite problems and can't be a vehicle problem. I am scared to drive it. The reboot occurs whether driving or stationary. It turns out all lights and displays in the middle of the dash (radio, air indicators, time, navigation).", "fail date": "  02/16/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "2015 Honda Pilot. Consumer writes in regards to engine stalls while driving. The consumer stated the engine would generally stall while merging into traffic from a near stop. It seemed as though, the engine stopped for a few seconds and then re-started and surged forward. The problem was intermittent. The dealer informed the consumer, the issue was the computer controlling the variable valve timing and there was no current fix.", "fail date": "  12/01/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "While cranking my 2015 Honda Pilot on 11/22/15 it did not want to start. I turned the key and let it go and it continued to try to start on its own. I turned the key back to off and took it out of the ignition. After the third try of starting my vehicle it finnally started. It was not extremely cold out ide the temperature was 51 degrees. This is my 3rd Pilot I have owne and never had this issue before. My vehicle only has16,500 miles on it. Could this be the sign of a bigger issue?.", "fail date": "  11/22/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "A few times when I attempt to stop at a light or stop sign the vechicle would not stop even when I had the brakes on. I have to take my foot off the brake and push down again to get the car to stop, also a few times when I am at a complete stop the engine starts to revvs as if it wants to take off, I took my car to Honda and they could not duplicate the problem so they said they couldn't do anything about it.", "fail date": "  11/10/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Within a few seconds and while applying the brakes, the brakes seem not to engage, but then engage, the engine revs up. The engine stays idled up until the brakes are released. Two occurences happened in one day and doesn't duplicate for the dealership. Two weeks pass and another occurrence happened. The incidents occur while already attempting to brake. The car skidded like the wheels were locked. The first occurrence was when I was stopped to enter a parking garage. The second occurrence happened on the same day and I could not have been going any more than 25 miles per hour when I applied brake, the vehicle fishtailed a little bit and eventually stopped. The third occurrence happened yesterday January 7th while going about 25 miles per hour and attempting to slow down in heavy traffic. The vehicle behaved as though it wasn't going to stop but eventually stopped( applying brake but no reduction in speed) and the engine revved up while my foot was on the brake. Each occurrence of the engine revving up happened while either stopped or attempting to stop.", "fail date": "  12/13/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Breaks seem off & weak a year after ownership. Took into dealership look into problem. Said they looked great and completed multi point inspection. Gave me paperwork saying they were still good. Few months later vehicle would shake and break poorly. Took it back to dealship for service. Then said I need to replace all breaks and rotors. Two weeks later after replacing everything breaks still seem off and make screeching sound. Taking vehicle back third time for breaks in 6 months.", "fail date": "  11/13/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Brake pedal has been spongy since new. Selling dealer say there is nothing wrong with vehicle. They did nothing. A deer ran out in front of me, I hit the brakes and pedal when down and I hit deer $4,100 damage to front end? if I pump brake pedal one time I have a solid pedal!.", "fail date": "  04/09/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "While driving on the beltway on a light rainy day, I drove through a couple of inches of sheeted water, on the road way. The water was pushed up over the top of the vehicle in a solid sheet, that was heavy enough to completely obscure vision for at least 3 seconds. This happened once while accelerating onto this toll road and again a mile or so further down the road when I was traveling at freeway speed. Visibility was completely lost while traveling in a very light rain in non flood conditions at entry ramp speeds and then again when we were cruising at about 65 mph, down the toll road. The rain was so light that the wipers were on delay and did not activate during the incident. This is obviously a very serious design flaw for this vehicle. I've noticed in the ads for the 2016 model, that the configuration was changed. I've also seen the notice in the paper that Honda received a 70 million dollar fine for lying about how many people that have been injured and killed in their vehicles. I'm positive this is one of the reasons why. The brakes don't seem to be very reliable, either, getting firmer in cooler weather and grabbing and getting mushy around 70 degrees. They also pump up when backing up.", "fail date": "  03/21/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Bought new Honda Pilot 2015. Brakes are not safe. Braking while turning to driver side make sound and car won't stopping . It happened to me in parking lot as well as while driving on freeway exit. I drove many different cars during past 15 years but this is the one car where I feel so unsafe & unrelable while driving. Talked to technical people at Honda service station. Did a ride with them and able to replicate same issue. As per Honda service station its abs system make that sound and prevent Pilot to stop. They said that the Honda Pilot is heavy car, so thats why it make that much sound and wont stop easy. This is not a safety measure. They don't have any resolution for this issue. I spend a big amount of money for me and my family safety and this seems like much worse then any old cars. I don't know who do I complaint and get my money back.", "fail date": "  01/16/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "When first apply the brakes the pedal is spongie if you pump once the pedal becomes firm like it should be!.", "fail date": "  01/08/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Vehicle was put in park, passengers got off, driver tried to open trunk using side trunk button but it did not open. Driver went to trunk to open it manually but it still failed to open. Driver went in front to try opening the trunk again and that's when the car started rolling back. Gear was still in park but it rolled back. Driver tried to manage it since a baby was in the car. Car crashed after rolling 500 feet with a pole. Driver while trying to manage the car from outside, sustained a fracture to her tibia. No one else was injured but her. So in spite of putting the car in park, the car rolled back.", "fail date": "  12/03/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Engine would not accelerate/misfiring on highway nearly causing an accident certified mechanic replaced timing tensioner, timing belt and water pump also replaced variable timing tensioner, coil packs, spark plugs. Issue still persist with engine light coming on blinking clearing constantly also anti traction light. There are several other similar complaints is there a recall in process????.", "fail date": "  07/30/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "3rd time in 12 months that the check engine light begins flashing and the car begins to lose acceleration power and vibrates excessively. Recent issue happened while driving off of the freeway and at a stop light. The previous 2 occurrences it is determined to be an engine misfire. The last time oil spotted in spark plug indicating that the piston ring is faulty.", "fail date": "  01/09/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "My 2015 Honda Pilot ex-l hesitates to accelerate when turning. It mostly happen when turning right, when I turn and try to accelerate the gas pedal becomes non responsive. This is very unsafe. There's no acceleration while merging into traffic! I have taken the car to dealer in 3 occasion but they said they can't duplicate the issue. I wrote to Honda America inc. But they said the same thing. They can't help me with this issue. I am very concern about these intermittent problem because I feel very unsafe driving my car!.", "fail date": "  01/16/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Within a few seconds and while applying the brakes, the brakes seem not to engage, but then engage, the engine revs up. The engine stays idled up until the brakes are released. Two occurences happened in one day and doesn't duplicate for the dealership. Two weeks pass and another occurrence happened. The incidents occur while already attempting to brake. The car skidded like the wheels were locked. The first occurrence was when I was stopped to enter a parking garage. The second occurrence happened on the same day and I could not have been going any more than 25 miles per hour when I applied brake, the vehicle fishtailed a little bit and eventually stopped. The third occurrence happened yesterday January 7th while going about 25 miles per hour and attempting to slow down in heavy traffic. The vehicle behaved as though it wasn't going to stop but eventually stopped( applying brake but no reduction in speed) and the engine revved up while my foot was on the brake. Each occurrence of the engine revving up happened while either stopped or attempting to stop.", "fail date": "  12/13/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "At about 55000 miles my Pilot started jerking/hesitating at all speeds, any road, usually after shifting gears both up and down. Now I bought it in February 2017 certified pre-owned so all recommended scheduled maintenance should have been performed. So, I took it in for diagnosis and the dealer in dublin OH said the transmission fluid needed to be triple flushed flushed 3 times!!! since I needed a vehicle to drive to work, I couldn't argue and got the service done. After reading of other languages with similar issues with the jerking/stutter/hesitation I decided to file this complaint. The results of the tranny flush were good however I can still feel a very faint almost unnoticeable hesitation that should be addressed.", "fail date": "  12/28/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The contact owns a 2015 Honda Pilot. While driving 55 mph and activating the driver side seat heater, the gear shifter was encountered and shifted into neutral. As a result, the vehicle lost power and failed to accelerate. The contact placed the gear shifter back into drive and was able to resume normal operation. The failure recurred numerous times. The vehicle was taken to the dealer where the technician was unable to determine the failure. The vehicle was not repaired. The manufacturer was notified of the failure. The failure mileage was 46,000.", "fail date": "  10/12/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "On 8/24/2021 I visited a Honda dealer(planet Honda dealer located at 2285 route 22 west union NJ 07083) to fix my air bag recalls and met the service advisor/eric malheiro, and showed him the mailed letter regarding the recall on my vehicle , after the service crew get my vehicle n the shop, the service advisor told me that have to pay for diagnosis and after that I will pay for the parts needed modules and other stuff, I tried to explain to hi m that as per the federal law my car has a recall for a safety issue, s dealers or manufacturers should fix it free of charge, but he refused and return car from service ,I left and decided to file a complain, please respond thanks.", "fail date": "  08/24/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Tl the contact owns a 2015 Honda Pilot. While driving on the highway, the contact's wife adjusted the sun visor on the passenger side and the air bags suddenly deployed without warning. There were no injuries. The contact was able to pull the vehicle over to the side of the road. The contact drove to an unknown Chevrolet dealer to try to get the air bags to deflate. The contact was given a pair of scissors to puncture and completely deflate the air bags. The manufacturer was called and stated that they would call back in a few days. The contact was advised to take the vehicle to o'malley Honda (3405 stewart Ave, wausau, WI 54401, (715) 842-2131). The manufacturer called back and asked the contact if he struck something, to which the contact denied. The dealer stated that they found a mark on the undercarriage of the vehicle next to the rear passenger tire. The contact did not recall striking anything that would have caused the air bags to deploy. The dealer stated that they would send pictures to the manufacturer and call back. The failure mileage was 110,000. The VIN was unknown.", "fail date": "  12/19/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Vehicle backed out of an angled, on-street parking spot. Camera and visuals indicated all clear. An individual driving westbound struck my vehicle as I backed out. Point of impact was at driver's side bumper. Only the right side (passenger second and third row) curtain airbags deployed. Airbag deployment did not align with the damage. Low speed collision, no injuries.", "fail date": "  07/11/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The compass started flashing I call the dealership they said that to calibrate it back just drive in a circle on a parking lot. That would work but the flashing has appeared more often and now it won't go away. It flashes all the time and it is distracting while driving. It has the possibility of causing an accident specially at night. Please I need this defect recalled ASAP. Ps. I'm screenshooting this request for proof of reporting in case something happens.", "fail date": "  01/10/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall - I currently lease a 2015 Honda Pilot from virginia. Because of the military, my family and I are now in las vegas. After reading about the recalls, calling american Honda, and 3 different dealerships, I found out the recalled airbag part numbers are the same exact part numbers in my car. Not one of the places I called are willing to help fix it without there being an actual recall, so I'm driving a death trap with my children waiting around for the company to catch up and place a recall on the newer model vehicles as well. All it would take is one vehicle on the interstate to swerve into my lane and hit anywhere at the front end and those airbags will inflate and send the metal shrapnel through my neck and body and my passenger's. I'm willing to just give the vehicle back, but I can't get anyone associated with Honda to even try to help. I don't know if it matters or is true, but I read Honda has already been sued for lying about this matter. Also, the airbag manufacturer has until 2018 to phase out the airbag and more recalls will be implemented, but when and under what circumstances does there have to be for it to happen. Do people have to die specifically in a 2015 Honda Pilot before action will be taken?.", "fail date": "  08/24/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "We bought a \"white diamond pearl\" color Honda Pilot new from a Honda dealership. We noticed paint peeling from the roof a couple of years ago that has gotten progressively worse. Now, about 1/3 of the paint is gone from the roof as it just blows away in pieces when I drive. Recently we noticed a new spot of peeling on the hood that was being held in place by the clear bra. Last week while driving on the highway it came loose and flew toward my windshield. I am lucky there was no one next to me because I initially thought it was a large rock coming up from the road and swerved. There's now an additional large spot of missing paint on the hood. In doing some online research, there seems to be a problem with this specific paint color. There is no hail or other damage to the exterior of the car where the paint is peeling. We are now seeing small areas of peeling on the doors as well.", "fail date": "  12/16/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "Paint is peeling off in sheets on the roof above the windshield. There was no damage causing this and the paint is white pearl.", "fail date": "  08/16/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "The paint is peeling between the windshield and the moonroof. This vehicle is stored inside a garage and there is no reason why the paint should be peeling. The local dealership, cape girardeau Honda stated there is not extended recall for this issue and I've emailed Honda corporate customer service and have yet to get a response.", "fail date": "  06/05/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "The paint is peeling off my white Honda Pilot above the windshield between the moonroof and windshield. The car was sitting when I noticed it. The car has roughly 60,000 miles on it.", "fail date": "  04/11/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "After placing the gear shifter in reverse, from a stationary position, the reverse camera has stopped working, which keeps the driver from being able to safely see obstacles (pedestrians) when backing up. This safety feature is especially important in taller vehicles, like this Honda Pilot, as they don't allow you to see smaller people who's heads fall below the window line, which could result in an injury or fatality. After researching online, it appears many other 2nd generation Honda Pilot owners have complained of the same issue, which is a result of moisture getting into the camera unit itself.", "fail date": "  01/07/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "Several water leaks into interior of vehicle at different times of year. After third leak I took to dealership they discovered sunroof drain plugs were clogged. After cleaning so far no more interior leaks. Vehicle miles 22k - 31k.", "fail date": "  04/16/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "Windsheid wiper reservior started leaking. Unable to clean windshield. Leak was caused by crack in seam of reservior. May have been a manufacturing or design defect.", "fail date": "  07/14/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "Since December of 2016 the center console (heating/cooling settings, stereo, volume controls) have flashed, faded, or shut off completely while operating the vehicle. This is a driving distraction and hazard to the operator(s) of this vehicle. Since the purchase in November of 2014, I drive 10,000 miles over a 10 week period several times a year. When the issue occurred I immediately contacted the dealer, who responded the vehicle was out of warranty (3 years/36,000 miles) and would be a costly out of pocket repair to me. I had already replaced the wiper motors within two years out of pocket. I sought out second opinions from other Honda dealers and service providers who also gave a similar quote. I researched other online chats of similar complaints by other Honda owners. To this day I'm still having further issues with the center console system (air conditioning controls fluctuate, the stereo/bluetooth volume fluctuates from loud to soft, and I must manually adjust the temperature settings blindly. I love my 2015 Pilot but feel that this matter should be resolved by the dealership. Can you help me resolve this blinding defect in an otherwise wonderful vehicle?.", "fail date": "  11/02/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "While driving on smooth highway heard a cracking noise come from windshield. After parking vehicle I noticed a crack on windshield starting on passenger side at front post and traveling towards center of vehicle. Checked for stone chip and found none. Suspect damage came from stress on glass because there was nothing to indicate any foriegn object hitting the glass. After looking online, I noticed other complaints similar to mine. I suspect Honda has an issue with either the glass itself or with design and installation of the windshield.", "fail date": "  09/02/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "Rear window wiper blade became disengaged from wiper arm.", "fail date": "  01/05/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Suspension", "Sub Problem": "Front Suspension Control Arm problems", "description": "Front wheel lower control arm bushing leaking. Both front lower control arms replaced.", "fail date": "  04/27/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Suspension", "Sub Problem": "Front Suspension Control Arm problems", "description": "Compliance bushings on lowering control arm leaking. 51,000 miles.", "fail date": "  01/04/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Engine would not accelerate/misfiring on highway nearly causing an accident certified mechanic replaced timing tensioner, timing belt and water pump also replaced variable timing tensioner, coil packs, spark plugs. Issue still persist with engine light coming on blinking clearing constantly also anti traction light. There are several other similar complaints is there a recall in process????.", "fail date": "  07/30/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2015 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "My 2015 Honda Pilot ex-l hesitates to accelerate when turning. It mostly happen when turning right, when I turn and try to accelerate the gas pedal becomes non responsive. This is very unsafe. There's no acceleration while merging into traffic! I have taken the car to dealer in 3 occasion but they said they can't duplicate the issue. I wrote to Honda America inc. But they said the same thing. They can't help me with this issue. I am very concern about these intermittent problem because I feel very unsafe driving my car!.", "fail date": "  01/16/2019"}]