[{"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "1. Our 2014 Honda Pilot exl with only 70,000 miles on it needs a complete engine replacement. The cause was determined to be driving with low oil. The oil life gauge read 50% and we had an oil change only 3 months earlier. No check engine light or low oil light came on, so we had no way of knowing the oil was low unless someone qualified had done a manual inspection which ordinary drivers don't/can't do. In our view the warning lights and/or oil life gauge all failed to warn us of any issue of this nature, therefore letting it get to the point whereby the car needs a complete engine replacement. 2. Unknown. We were lucky that we noticed the smell of fuel/burning close to home so we were thankfully not left stranded on the side of the road. But we were left stranded 500 miles from home while on vacation with no car. It was an absolute nightmare. 3. Yes, we had to tow the vehicle 40 miles to the nearest Honda dealership who confirmed that the engine needs replacing. 4. Yes, the nearest Honda dealership inspected the vehicle. 5. No, and that is the issue. No warnings lamps appeared. The smell of fuel/burning coming from the engine alerted us to the fact that there was an issue and the engine fan carried on running even after the ignition was turned off. Prior to this we had no idea there was an issue with the vehicle. We took care of the vehicle, doing regular oil changes and fluid replacement, etc. Fyi - telling someone that they need to manually check the oil level as you should not rely on the oil life gauge and/or the various warning lights that are designed to detect this problem is both devoid from reality and is akin to telling people that they should manually dip the gas tank to check the gas level as you should not rely on the gas gauge etc. That makes no practical sense and the vast majority of car owners don't do it.", "fail date": "  07/07/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "3 engine piston rings failed. Wife was driving the vehicle. Yes, verified and repaired by Honda of fort worth. Engine light flashing when misfiring and rough idle before pulling over. Also needed timing belt kit replaced. 2009-2013 Pilots had same problem and were part of a class action suit. Same 3 pistons that the vcm and eco mode effects the operation of engine.", "fail date": "  03/24/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Check engine and vsa light on. Vehicle jerks and shakes/ rough when slowing down. Diagnosis misfire in cylinder two- foul plug ( that was just replaced), burning up oil rapidly. Piston rings are defective on a car with 75000 k miles. The repair is $5k after I just spent $2k on plugs, coils, replaced again, alternator. Undsafe and feels like car will crash. This was recall on 2013 and class action suit. Not on 2014 after they knew about issue!! wreckless.", "fail date": "  03/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "As I was driving home during rush hour, I smelt an odd smell. I thought that it was coming from the vehicle next to me but that vehicle turned and the smell remained. I looked down at my dashboard and the over heating warning light was bright yellow-- I immediately pulled over into a parking lot with my 2 young kids, got them out of the car, and began to try and figure out what was going on. Thank goodness I didn't ignore this issue and that I was able to pull off of the road when I did. This could have been a very unsafe situation for myself, my kids, and other motorists. Prior to this moment there were no indicators of anything being wrong with the vehicle, there was absolutely no warning of what I am about to describe either. Luckily, my husband was nearby and able to pick us up. There was a milky fluid leaking from underneath the car and when my husband opened the hood he said that oil and water had mixed--it looked like something had just exploded. Needless to say I had to have the vehicle towed to a shop. After taking the engine out and sending parts off to a machinist it was determined that the front cylinder head had cracked and the rear cylinder head had to be resurfaced due to the damage. Several mechanics have noted that there is no reasonable explination for the cylinder head to crack before 200,000 miles. I had just purchased this vehicle in September 2020, it had 72,000 miles on it then. It currently has around 80,000 miles on it. I purchased this vehicle because I thought it would be a safe family vehicle but now I'm not comfortable driving it because I'm worried that it will \"blowup\" on me. I contacted Honda customer service and they basically said that nothing can be done to assist me. I have seen an identical scenario posted on here and was shocked by it as well--because I thought that my mechanic wrote it but alas it was someone with the same situation! there is obviously something faulty here and it should be repaired/replaced by Honda!.", "fail date": "  04/08/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Consistent vibration when ecm engages culminating in engine bucking along with engine light flashing this occurred on rural road at 55mph. Mechanic changed oil and spark plugs which seemed to fix the problem. Two months later, engine light on and ecm not engaging at all. Vtm light on for a short while. Code indicates a cylinder problem. This waa also at approx. 50mph. The code is ambiguous but seems to indicate misfire of some sort. Research shows this to be a pervasive problem with this model. Why has this not been recalled?.", "fail date": "  01/05/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Front wheel bearings (left and right) went at 60k miles. Sunroof needed full replacement at 60k (rust was evident indicating signs of ongoing leak), engine bushing needed replaced at 60k miles. Alignment needed because engine bushing and wheel bearing replacement.", "fail date": "  09/24/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Check engine and vsa/vtm-4 lights appeared on dash. Took to Honda dealer and code returned issue with a misfire in cylinder #3 due to a piston ring failure. Known issue 2009-2013 Honda Pilots that resulted in class action lawsuit. Honda repaired those vehicles at no cost and extended engine warranty. Honda not willing to do the same for a known issue in a 2014 version.", "fail date": "  08/23/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "In may I had a problem with the #2 cylinder plug fouling it happened again on 7/25/18 & 1600 miles later on 9/8/18. Engine light comes on mechanic told me that it's a oil seal problem. I see that there was a recall on 2009-2013 Pilots why not on the 2014? same problem as complaint #11122936 there is obviously a problem with something.", "fail date": "  07/25/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "This car has a serious shaking issue when braking. This is well documented and Honda has not released any recalls for this. This car has a well known issue with consuming too much oil. My car consumes way too much oil which also causes issues with the variable cylinder management.", "fail date": "  09/08/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The head gasket on my 2014 Honda Pilot blew with only 23,000 miles on the vehicle. No warning lights appeared and I am worried about a safety issue despite the repairs being covered under warranty. I got the vehicle brand new and service records are maintained and up to date.", "fail date": "  09/03/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The problem started when my Pilot reached 15k miles. When driving I can feel the engine vibrate when accelerate around 35 -45 rpm speed. I did some researches online and a lot of people having the similar problem ( when eco/vcm kicks in car vibrates) it has something to do with the transition from 3 cylinders to 6 cylinders. I hope that Honda do something about this. I don't feel safe when the vibration kicks in when driving; felt like the engine would explode kinda scary feeling. Also if too much vibration, it would reduce the life the engine. Please help us on this issues.", "fail date": "  05/02/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "On April 17, 2016 at 3. 30 pm while forward parking my vehicle, I experienced a sudden uncontrolled acceleration, resulting in the vehicle impacting the wall in front of my parking spot. The wall was apx. 20 ft from the car at the time of this incident. I had my foot on the brake during the later stages of the parking maneuver and speed was minimal <5 km/h). Before coming to a standstill, the engine sprung to maximum rpm without me ever touching the accelerator. I didn't have time to control it and the brakes were also ineffective. Upon impact the driver front airbag deployed and the horn started. I switched off the engine and removed the keys. Several witnesses came forward for assistance, police, ambulance and fire department were on site. A police report was filed. This incident is very concerning; people could have been seriously injured had this happened in another location or if passersby where present.", "fail date": "  04/16/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "My Honda Pilot 2014 has vibration every time I drive the car. I worry that it will damage the engine. I think it happen when transition between 3 cylinder and 6 cylinder. Driving between 30 mph to 60 mph. I don't think the variable cylinder management (vcm) is working well at all. Honda please fix this issues.", "fail date": "  06/27/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "When cruising in my 2014 Honda Pilot ex-l at about 60 mph on relatively flat terrain, there is a low frequency vibration and rumble. I believe this is due to the vcm feature of the engine. It is possible this could get worse and cause some engine damage.", "fail date": "  03/04/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Two incidents of sudden unintended acceleration. The first on January 31, 2014, the second on March 25, 2014. Both incidents occurred at a very slow rate of speed of approximately five miles per hour. In both situations the car was coming to a stop with the brake being applied. Suddenly, the rpms increased and the car suddenly moved forward with the break unable to stop the car even though both feet were applied to the brake peddle. The car was stopped by putting the gear shift into neutral and turning off the engine. This has been reported to Honda of America as well as to the local Honda dealer. The car was brought to the dealer two times, but the dealer unable to diagnose the problem. Honda of America (800 999-1009) has opened a case number which n012014-03-2600701. This is a potentially very dangerous situation.", "fail date": "  01/31/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "When the variable cylinder management kicks in at 2000 rpm the engine vibrates. It does this constantly when the eco green light comes on. Very distracting and annoying. Also is a problem in my sisters 2013 Pilots. Dealer knew it was a problem but would not disclose until after I purchased the car.", "fail date": "  12/09/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "Paint peeling off and bubbling on hood. It's a manufacture defect. Honda will not take responsibility for the hood. I had the roof (repainted in 2018)and right passenger door panel (repainted 2021) repainted because of the same peeling problem since it's all the same original paint from when we bought it new in 2014.", "fail date": "  02/22/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "The paint is peeling on the roof of my 2014 taffeta white Honda Pilot. I was told that my VIN number is not eligible for the warranty. I am not sure how specific VIN numbers become eligible for the paint warranty extensions.", "fail date": "  07/09/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "2014 Honda Pilot white paint color, paint peeling from the middle of the top of windshield to sunroof.", "fail date": "  03/01/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "Paint started peeling off of hood and bubbling on roof. Honda certified collision expert say manufacture defect. Honda will not take responsibility for the hood. They will cover the cost to replace painting roof but refuse to repaint hood. Terrible customer service when you call corporate. Told me to wait until enough complaints come in and then they may consider it.", "fail date": "  12/14/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "White paint peeling off in chunks between windshield and roof. Noticed when parked. Dealer said its not under the 2019 issued extended warranty for 2014 Honda Pilots painted white.", "fail date": "  11/01/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "Paint is starting to peel on vehicle. Started on roof of car from the sunroof down to the windshield. Photo provided. Now the paint is peeling on front fender and on hood of car.", "fail date": "  02/02/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "Paint peeling from the roof in large chunks. Seems to be related to TSB apas09282017903.", "fail date": "  09/05/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "The exterior paint started peeling by the sunroof then the hood and now by the back window. I have seen a lot of 2014 Honda Pilots touring same as mine also peeling the same so that means there is something wrong with the paint. Its not just my Honda. I really think this should be fixed.", "fail date": "  01/10/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "Paint is peeling off down to bare metal on the roof between the windshield and sunroof.", "fail date": "  02/20/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "--what component or system failed or malfunctioned, and is it available for inspection upon request? p0302 Honda code - cylinder number 2 misfire detected is the error. The vehicle is available for inspection upon request also, the; \"vtm-4\", stability, and \"check engine\" lights are all flashing --how was your safety or the safety of others put at risk? car will not exceed 20 mph and it shakes. With young kids in the car, this issue is extremely unpredictable and has occurred several times resulting in us having to pay out of pocket for a clear manufacturer defect. We've had to take the car to the mechanic 4 times in the last 3 years -- service records can be provided. --has the problem been reproduced or confirmed by a dealer or independent service center? yes. There is a recall for the 2009-2013 models, but we have the 2014 and have been told by everyone (except the dealer) that this issue/year (2014) should be included in the recall. --were there any warning lamps, messages or other symptoms of the problem prior to the failure, and when did they first appear? yes, as noted above, the following warning lamps lit. . . \"vtm-4\", stability, and \"check engine\" lights are all flashing.", "fail date": "  02/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I was told by Honda to file a complaint with nhts a. For the pealing paint on my Honda. As I can see this is not the place to file such a report. But I am doing it anyway just so you can see how ridiculous Honda is. They will only cover the roof and lift gate. When there are many other parts of the vehicle that is doing the same thing. And they refuse to pay.", "fail date": "  01/13/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "We have 2014 Honda Pilot that had 68,072 miles on it. My wife believed that the automatic transmission for the vehicle was placed park in our driveway. According to the Honda owner's manuel there is a safety feature that prevents the ignition key from being removed unless the vehicle is in park. The vehicle rolled back into a tree causing over $3,000. 00 in property damage. This exact same problem has occurred in the past with the Honda Pilot (2003-2004) and the Honda odyssey (2003-2004) and the Acura mdx (2003-2006) which were the subject of a recall by Honda. Please see NHTSA action number pe12026. These recalled vehicles as well as our 2014 Honda Pilot are equipped with an automatic transmission. They have a safety interlock system that is supposed to prevent the ignition key from being removed from the ignition unless the transmission is in the park position. When the transmission is not in park, the vehicle may roll unexpectedly increasing the risk of a crash. This is exactly what happened to our 2014 Honda Pilot. I contacted Honda and they could have cared less about this problem even though the same product defect obviously exists again in the new model Honda vehicles. This product defect poses a high risk of danger and Honda should be required to remedy this defect. I have videos that document this defect.", "fail date": "  11/22/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I have expressed concern with both the Honda dealer and to Honda corporate about the interior flaw in my vehicle. Under the drivers seat, there is an open space/gap that allows anything that's on the rear floor to roll across and block your gas and brake pedal. I have never had this issue with with any other vehicle. I have almost gotten into several traffic accidents because of this. This should be corrected but Honda refuses to acknowledge that this is an issue and they tell me not to put anything on the floor. With 3 kids sitting in the back and driving to practices every day, it's hard to keep up with items not being left on the floor. This is not reasonable and everyone leaves items on floor. I am expressing concern because I shuttle my 3 kids around everyday and I am worried about their safety as well as mine. Please help. Thank you.", "fail date": "  11/01/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The auto was parked and started then the smokes were coming out. The result was the air condenser/compressor was damaged and need replace.", "fail date": "  10/14/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "This incident occurred on Feb. 5, 2016. Sudden unexpected acceleration. The car was pulling into a parking space at very slow speed with the right foot on the brake. The engine began to race and the car lurched forward. I was able to stop it by shifting into neutral and turning the engine off. Two very similar occurrences occurred with a 2012 Honda Pilot approximately two years ago. These were reported to the NHTSA.", "fail date": "  02/05/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I pulled my Honda Pilot into my driveway that only has a slight grade. I put the vehicle into park and shut if off, exited the vehicle and locked the doors. While standing in my driveway with my son, we both saw the Pilot rolling backwards slowly (not sliding). The tires were actually turning. I ran to the drivers door, opened the vehicle, jumped in and applied the brakes. I started the car to make sure the car was showing it was in park, and it was. I now have my tires chocked with bricks until I can get it to the dealer.", "fail date": "  03/05/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I had put my car in park, it was still running, I reached in and turned the key off and the car immediately started to roll. I attempted to get in the car to brake, but was unable to do this and then was thrown away from the vvehicle, hitting my head on my rock driveway. There was a slight incline where I parked but when it started to roll it reached a steeper incline and rolled down my driveway and hit a tree which caused the damage. I had to have it towed to the dealership---where they found no reason for the runnaway issue?? I then called Honda and was treated badly, but they confessed that there was no way of testing for this issue. I found that in the past years there was a issue \"runaway\" vehicles------but they would not acknowlede this as a possible continuing problem?? if anyone has had this same problem, would like to know.", "fail date": "  08/30/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "My 2014 Honda Pilot ex-l has a multi major issues. Starting with a major water leak inside the passenger compartment. Vehicle stalling in the middle of a left hand turn during the rain. Hesitation in the motor when traveling at 45 mph. This occurs all the time when driving. Lunging forward while the brake is engaged. Pulling to the right, the vehicle should be in alignment. This has been going on since the day of purchase. Whining in the power steering no matter which way you are turning. Lifters are tapping under the hood. The list goes on. Tried to have these issues addressed at the dealership and all I got was there is nothing wrong with the Pilot. It runs the way it should. And now they will not even look at the vehicle as they told me to never bring it back to their dealership. I do not feel safe driving this Pilot, I loved my 2012 Pilot.", "fail date": "  07/14/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I purchased a brand new Honda Pilot-navi 2014 on July 3 2014. 1 week after the purchase there was a major water leak inside the new 2014 vehicle!. . Water was leaking inside from a big rain storm and I do have a video and pics to show you. The next day space coast Honda was called where I purchased the new 2014 to get fixed. The service director said that I opened the moonroof which is not true!. He then told me leave the vehicle at the dealership for a technician to look where the water was coming from. The Honda dealership offered me a loaner at there cost for the day. The same day the Honda was taken there I was called around 5 pm to come pick up the new Honda. The service director told me he replaced the windshield and headliner inside and took all the water out from the leaking rain storm!!. . I did not get a copy of the service record and was told I have 3 years or 36,000 miles warranty. 2 days later it was taken back for more repairs! the new 2014 was stalling out,engine hesitating,riding ruff,engine fan keeps running,drivers door light not working and pulling to the right!. . Agian the service director tried to fix the problem and failed!. . I have called american Honda motor corp in California and told them the problems!. They told me go in my Honda Pilot handbook and fill out the form for consumer affairs!. . This new Honda has many issues and no 1 wants to help or take responsiblity to give me a new 2014 Honda or refund. August 28 2014 it was taken to space coast Honda again for the water leak and stalling out!. .", "fail date": "  07/13/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "When approaching a stop light,vehicle fails to stop, even with foot firmly on the brake. (as if the accelerator and brake were applied simultaneously) engine speed does not fall below approximately 2,000 rpm.", "fail date": "  05/05/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Takata recall, american Honda motor company never sent to me any notification of a national recall of or injury, death or damage by the takata airbag defective inflators. No notices were ever sent to me, and no telephone calls of anykind to warn me.", "fail date": "  10/31/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "\"takata recall\" unfortunately, before the recall both airbags deployed. The passenger side exploded leaving a burn on the passengers leg. The drivers side bag also exploded after deployment leaving a burn on thumb of right hand of driver. The deployment was due to accident involving a deer on a state highway.", "fail date": "  08/25/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "\"takata recall\" hi, I am just trying to find out if my airbag needs to be replace since it might be defected. I received a letter about recall on takata airbags. When I called the number provided, I was directed here. Thank you.", "fail date": "  04/16/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "No deployment of airbag upon head-on collision. Fitchburg mass. Police crash report # 16-1706-ac. Driver came into my lane of traffic and struck front end of my vehicle.", "fail date": "  01/13/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. Honda states that vehicle is a subject for recall which means that it has takata air bags. !!!! my complaint is, until it is recalled, I cannot feel safe driving it!!!!please investigate and help!!!!!!! this happened when I bought the car in 2014 but I was not told about possibly defective air bags at thattime even though Honda knew of the possibility at that time!!!!!!!!!!!.", "fail date": "  03/04/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "I have been noticing that when I brake my vehicle shakes - took it in to have the brakes done and the dealership told me that my brakes looked brand new and wanted to send me on my way. I asked well why is it shaking then and I was told that maybe the roaters needed machining a $207 service. This was after they did not bother to call me to tell me my vehicle was ready I just happened to show up an hour after my scheduled appt time so machining my roaters would have been another hour to 2 hour wait. (not happy) so I left and I am still dealing with the vibration. I also noticed within the past week after having to drive in heavy rainfall that when going above 45 mph I hydroplane badly - to the point where I almost hit a concrete barrier on the highway. The puddle of water was not, in my opinion, large enough to have created such hydroplaning, neither was my speed. Ended up driving my husbands Jeep until the rain subsided because now I'm scared of driving my car in the rain. I don't have documentation for the \"repair\" because they literally didn't even tag my vehicle. I will be taking it back this weekend considering I am not the only person having this issue apparently.", "fail date": "  10/30/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Vehicle shimmies, shakes, vibrates when braking and pulls to the left. Had 26,000 mile on vehicle. Brought to dealership and they said it could be due to breaking, car washes, and weather. Rosters were resurfaced at my expense. Now vehicle has 38,000 miles on it with the same problem. Dealership says it's my fault. All miles are highway and vehicle is garaged at home and during the day at the office. Did not need to replace roaters on any previously owned SUV's for 75,000 miles.", "fail date": "  10/27/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The contact owns a 2014 Honda Pilot. The contact stated that the when activating the brakes, the vehicle failed to stop. The failure recurred on numerous occasions. The vehicle was taken to a dealer where the failure was unable to be duplicated. The manufacturer was notified of the failure. The approximate failure mileage was 13,000.", "fail date": "  05/05/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Leased brand new Pilot lx on March 15, 2014. It appeared to be in perfect working condition. Then, suddenly on 3/30/14 while driving home, it lost about 80 percent of its brakes. To stop it, you must have foot to floor on brakes. If this had been an emergency stop, there could have been an accident. Taking it to dealer on 4/2/14 to see what the problem may be.", "fail date": "  03/30/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "We have 2014 Honda Pilot that had 68,072 miles on it. My wife believed that the automatic transmission for the vehicle was placed park in our driveway. According to the Honda owner's manuel there is a safety feature that prevents the ignition key from being removed unless the vehicle is in park. The vehicle rolled back into a tree causing over $3,000. 00 in property damage. This exact same problem has occurred in the past with the Honda Pilot (2003-2004) and the Honda odyssey (2003-2004) and the Acura mdx (2003-2006) which were the subject of a recall by Honda. Please see NHTSA action number pe12026. These recalled vehicles as well as our 2014 Honda Pilot are equipped with an automatic transmission. They have a safety interlock system that is supposed to prevent the ignition key from being removed from the ignition unless the transmission is in the park position. When the transmission is not in park, the vehicle may roll unexpectedly increasing the risk of a crash. This is exactly what happened to our 2014 Honda Pilot. I contacted Honda and they could have cared less about this problem even though the same product defect obviously exists again in the new model Honda vehicles. This product defect poses a high risk of danger and Honda should be required to remedy this defect. I have videos that document this defect.", "fail date": "  11/22/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Major electrical malfunction, most of the dash electronics won't work. The rear hatch is locked and cannot be opened. No a/c and no gauges operating. Major disappointment for a 2014 Honda Pilot touring edition with only 6000 miles. Hope the local Honda dealership fixes it tomorrow 3/31/15.", "fail date": "  03/30/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "I purchased a brand new Honda Pilot-navi 2014 on July 3 2014. 1 week after the purchase there was a major water leak inside the new 2014 vehicle!. . Water was leaking inside from a big rain storm and I do have a video and pics to show you. The next day space coast Honda was called where I purchased the new 2014 to get fixed. The service director said that I opened the moonroof which is not true!. He then told me leave the vehicle at the dealership for a technician to look where the water was coming from. The Honda dealership offered me a loaner at there cost for the day. The same day the Honda was taken there I was called around 5 pm to come pick up the new Honda. The service director told me he replaced the windshield and headliner inside and took all the water out from the leaking rain storm!!. . I did not get a copy of the service record and was told I have 3 years or 36,000 miles warranty. 2 days later it was taken back for more repairs! the new 2014 was stalling out,engine hesitating,riding ruff,engine fan keeps running,drivers door light not working and pulling to the right!. . Agian the service director tried to fix the problem and failed!. . I have called american Honda motor corp in California and told them the problems!. They told me go in my Honda Pilot handbook and fill out the form for consumer affairs!. . This new Honda has many issues and no 1 wants to help or take responsiblity to give me a new 2014 Honda or refund. August 28 2014 it was taken to space coast Honda again for the water leak and stalling out!. .", "fail date": "  07/13/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "45 miles on a brand new 2014 Pilot ex-l the ignition does not engaged consistently. When you turn the key and the engine cranks, it does not turn over, rather it continues to make cranking sound, even when key goes back to run/on position. You need to turn key off to get cranking to stop. 50 miles on barand new 2014 Pilot ex-l a continuous clicking sound comes from the steering column when making a left hand turn. It does it when you turn right, but more predominant when turning left. From onset - the driver's side door does not open and close smoothly - thought at first it was just the hinge catching, further inspection demonstrates the left front fender and driver's door seem is not uniform. Therefore the bottom of the fender and driver's side door are rubbing against each other and paint is rubbing off.", "fail date": "  01/14/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "Vehicle shimmies, shakes, vibrates when braking and pulls to the left. Had 26,000 mile on vehicle. Brought to dealership and they said it could be due to breaking, car washes, and weather. Rosters were resurfaced at my expense. Now vehicle has 38,000 miles on it with the same problem. Dealership says it's my fault. All miles are highway and vehicle is garaged at home and during the day at the office.", "fail date": "  08/18/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "When raining at about 55 to 60 mph vehicle hydroplanes. I have other family members that own the same vehicle having same problem.", "fail date": "  08/10/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "Issues: 1 - steering constantly vibrates at speeds above 45mph. Smooth roads higher vibrations. This vibration increases to extent that you feel that you are loosing control of the car at speed above 70mph and you can see the steering vibrating. So effectively, you cant drive you car beyond 70mph. 2 - transmission shutters at cruising speed above 35mph and searches for gears while going down hill. 3 - sudden burning smells in the cabin to an extent of air becoming toxic inside cabin. Honda replaced multiple parts but no result and problem has become worse. Finally Honda does not want to recognize that there is major issue so are washing off there hand by saying that it is vcm vibration. The point that vmc vibration can not be constant and those occur only when there transition from 3 cylinders to 6 cylinder or 6 to 3. The vehicle is under warranty as of now but once it goes out of warranty, Honda would never care for it.", "fail date": "  10/04/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "This car has a serious shaking issue when braking. This is well documented and Honda has not released any recalls for this. This car has a well known issue with consuming too much oil. My car consumes way too much oil which also causes issues with the variable cylinder management.", "fail date": "  09/08/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2014 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Vehicle shimmies, shakes, vibrates when braking and pulls to the left. Had 26,000 mile on vehicle. Brought to dealership and they said it could be due to breaking, car washes, and weather. Rosters were resurfaced at my expense. Now vehicle has 38,000 miles on it with the same problem. Dealership says it's my fault. All miles are highway and vehicle is garaged at home and during the day at the office.", "fail date": "  08/18/2015"}]