[{"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "When stopped at a stoplight or stop sign, the car has an auto start/stop feature where instead of the car idling, it shuts off and then starts back up when the brake is released. The car stalls and displays several dashboard warning lights and will not start back up after it auto stops. After several minutes, I can usually get it to start back up, but it typically happens in heavy traffic causing a substantial safety issue.", "fail date": "  11/30/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The automatic start/stop system turns the car off at red lights, as it it supposed to. However, several times the car will not start when I push the gas pedal but instead the whole car turns off. It takes opening and closing the door while pushing the park button and the engine start button to turn the car back on. This usually occurs at red lights which is very dangerous.", "fail date": "  11/22/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "In Aug 2021 when the auto stop engaged the car would fail to turn on. Errors would come on on the dash and while car would die at stoplight. Took to dealer and they could not replicate so nothing was done. This happened randomly and we would need to put in park, wait a while and turn back on. Then in oct 2021 the battery died and they replaced under warranty. There was no issues until Nov. 2022. The same started happening. Again dealer could not replicate and nothing was done. They did note the 1 year old advanced battery was low and charge and have charged it.", "fail date": "  11/15/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "I was stopped at a stop light and the engine went into \"idle\" mode and then cut off completely and all power was lost. I put the vehicle in park and attempted to restart unsuccessfully. I was unable to restart the vehicle for several minutes.", "fail date": "  11/03/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Our 2019 Honda Pilot will flash the brake for the front collision warning system when there is no oncoming traffic or even when the oncoming traffic is in its lane. It does not always happen, but enough to be an annoyance. It also tends, when stopped at a light, and the auto stop engages not to restart. The entire electrical system goes haywire and then dies. This includes the ability to use your 4way or emergency flashers. The car then has to be jumped or towed to restart the vehicle.", "fail date": "  10/30/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Today is the 6th time our Honda has had issues either the automatic start/stop system failing when at a stop light. The car will stop and shut off like it is supposed to, but will not restart. Car needs to be put into park, turned off, restarted, shift back into drive. This happens while we are at risk of being hit from behind, honked at, and creates an unsafe and stressful driving situation. Car has had infotainment issues that seemed to be fixed, but had issues prior to today’s incident. Car has been only serviced at Honda. No warning lights etc. This issue was reported to our dealer last December and they said the could no replicate the issue. In August this happened again immediately after having the car serviced for an oil change. The car is putting my family and others at risk and there seems to be many others with this same problem happening.", "fail date": "  10/23/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "When stopped at a red light the engine shifted from drive to neutral on its own. The brake became stiff and it took shutting off and restarting the car multiple times before it would shift. This is the third instance of this vehicle shifting to neutral on its own. After the previous times (they occurred within the same day- one shifting from park to neutral and the other similar to this experience, also at a red light), I took the car into the dealership where it came back showing no codes and could not be replicated while there. It is a push button electric shifter and the vehicle has had multiple recalls and service bulletins for electronics (all repaired) and has experienced issues beginning one month after I purchased the car brand new.", "fail date": "  10/23/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Auto idle start/stop stalls at intersection. Auto idle engages normally, but when release foot from brake, car acts like it is going to restart the engine as it should, instead it kicks the car in neutral and accessory mode. You have to press the brake, press the start/stop button multiple times to get it to restart.", "fail date": "  10/17/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "This is a 2019 Honda Pilot with start stop function. There is a noticeable delay in activation and getting longer with time; this is a 3 year old vehicle. During 2 other instances, the system failed and vehicle would not start on a public street. During these failures and delays, other than the obvious collision safety issue, the safety systems are unavailable via a message on the dash. When it eventually starts back up it functions normally. This is clearly the system prematurely failing or the system prematurely killing the battery (which has a normal functional life of 5 - 7 years).", "fail date": "  10/15/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "For the second time is the last few weeks the car experienced issues after losing electrical power. It failed to start after being parked for about an hour at the airport. All sorts of warnings started randomly blinking on the dashboard. But the door, cabin lights etc all would come in when the doors were opened.", "fail date": "  10/15/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "On several occasions my vehicle has acted as if it were going to die at a stoplight or intersection where the brake pedal was pushed enough to trigger the auto-off function. It did not start doing this until the last several months. I assumed it was because I did not have my foot pressed enough. On one occasion several weeks back it acted as if it did not want to start and then today I was completely stopped and stuck at a light, blocking traffic. The battery light came on and it would not let me restart it. After a minute I finally got it started and immediately drove it to the Honda dealer in which they weren’t able to check it. I will take back tomorrow for them to check it out. I’ve also read several articles about this same thing happening so I wanted to report it for the records.", "fail date": "  10/11/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "My 2019 Pilot continues to randomly turn off. This happens at stop lights mostly, but did happen while driving as well. Latest was at a gas station where it would not restart. Had it to a mechanic and auto zone and both said that nothing is wrong with the car.", "fail date": "  10/04/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "I am actually reporting two incidences, since the first (never reported) now appears to be related. 1st: in March 2022 (approx 35,600 miles on the vehicle), the vehicle completely shut down after attempting to accelerate back out of the auto-idle stop mode. I was stopped at a traffic light on a highway off-ramp in rush hour traffic. All of the warning lights and exterior lights started flashing and strobing in and out, but I also had no power of any kind for windows, radio, nothing. I was unable to turn on the emergency flashers, so I got out of the vehicle to redirect traffic around me while I waited for it to be towed to the dealership. They told me that by the time my vehicle got to them, that the battery was completely dead, and therefore there was no data or code. They told me that it had to be the battery, but they’d fully recharged the battery and it was all good. (covered under warranty) yesterday afternoon 9/27 I was at a stoplight, once again in auto-idle stop mode. I depressed the accelerator once the light turned green and the car would not move. I looked down and noticed that my car had shifted itself into neutral? it would not allow me to put it back in park and/or restart. By now I am trying to wave the people behind me to go around, when I look up and see there’s some kind of message scrolling across the driver’s display; something about a wrong gear? there were cars stuck behind me, so I was in a bit of a panic mode. I took a few breaths and tried again. I fully depressed the brake, was finally able to put the car back into park and restart the car. I am bringing the vehicle in for service tomorrow (I am now outside of warranty) after just having a comprehensive 40,000 mile service completed on sept 10. Note: vehicle was purchased brand new and has been 100% dealer serviced.", "fail date": "  09/27/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "\"check engine\" light comes on, followed by \"emissions system\" problem, then \"awd\" problem, and also \"transmission\" light with a message to pull over and find a safe location. Have brought in for the \"emissions systems\" problem and awd multiple times, but problem re-appears within a day. Uploading one invoice of many.", "fail date": "  09/26/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "In the past I have reported an issue with the auto stop to price Honda. They sent me away saying nothing was wrong. Last night my car died while coming to a stop. No warning. No engine check lights. The emergency flashers wouldn't work nor doors or windows and I was stuck in the middle of the road with my children without hazzard lights. No way to put car into neutral unless you have a special tool which even the Honda dealership couldn't help me with. This was not disclosed when we bought the car and was stuck in high traffic for over 2 hours until a mechanic came and finally got my car to start and move to side by switching the battery along with other stuff. He stated the battery should not have died in drive and something is wrong. I see this is a known issue when looking at your website. I do not feel safe driving this Honda Pilot. It can shut down at any time without warning and leave us stranded. Not being able to move into neutral in its self is safety hazzard especially with no hazzard lights. Price Honda (david) was very rude and brushed me off telling me no one is going to call me back over this. However their manager (craig) called me shortly after and even acknowledged the known issue and said could take years to recall. This is not ok and why wasn't any of this disclosed. We should know that we need a tool (and know how to do it since in the engine) to save us if our car breaks down so we can at least get to side of road! I see this issue is being investigated by you, not sure whybitbwas not discloaed especially when I already reported to Honda. My kids and I could have died yesterday. Single lane road no shoulders no flashers and cars flying past us. Not ok especially for this type of car that I bought brand new! I need assistance with this please before someone does get hurt.", "fail date": "  09/14/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "On multiple occasions the auto start/stop has failed when releasing brake pedal vehicle will completely shut off and takes multiple attempts to turn back on. This is a hazard due to the fact that it has occured on busy streets and state highways. At this time vehicle has not been inspected by dealer we do plan on taking it in ASAP.", "fail date": "  09/13/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "I got my brand new Honda in 2019; the problems started right away, after a few weeks, the radio system would just turn off while driving. The whole console wouldn’t work. I would turn it on/off but still nothing. If I let the car set over night sometimes it may work the next day. They replaced my radio but it continued. Steve from Honda said it was finally in error state and it was the amplifier. Steve had ordered a new 1 & put it in 9/8/22, I thought my problems were over. On 9/12/22; I dropped my daughter off at school, I was leaving but I had to stop for traffic. I was about to pull out when the dash starting flashing/lighting up & I couldn’t go anywhere. The car was in park and I was stuck. I pushed the car into drive, ect, but it wouldn’t go. I turned the car off/on to try to restart things but nothing. The brakes then locked up and I couldn’t do anything. I tried everything that I could think, I was blocking traffic not allowing people to leave from the school and cars from coming in. I called Honda rd. Asst. But they said I had no longer a warranty as I am at 30,000 but I thought it was 36,000 miles. They connected me to aaa which I had to pay out of pocket for towing. I called steve & my serv. Advr. Adam so they knew that I was going to towed in. I couldn’t get the vehicle to turn off or on after awhile. 2 hrs. Later; the tow truck had came, he had to jump start it to get it on his truck, he toke me to Honda. I waited over 4 hrs. But steve said battery was good, he ran errors but couldn’t find anything wrong except the back up camera had an error but it seemed as though he didn’t believe that is the problem. I could take it home but he said if his wife was having issues, he wouldn’t want her to drive it. I left it w/Honda, steve toke it hm. To see if it would do what it did for me. I honestly don’t want to drive it, I am scared; what if something worse happens or pay to be towed again. I didn’t want a new vehicle to deal with issues.", "fail date": "  09/12/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Vehicle is equipped with auto engine shutoff when vehicle stops. It started failing and has caused the car to stall at red light. Purchased vehicle 4 months ago.", "fail date": "  09/09/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "I received a transmission system problem warning and a blind spot info system warning. Also the spot on the dash that tells you if you are in park, neutral, drive or reverse has all of the letters on top of each other and they were flashing.", "fail date": "  08/29/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "On my drive home this afternoon the auto idle stop feature on my 2019 Pilot touring began to hesitate to restart after releasing my foot from the brake. The result was an orange warning light telling me that there is a problem with the collision mitigation system and a shudder before the engine would resume running. I had to turn off the auto-start feature to avoid stalling in rush hour traffic.", "fail date": "  08/24/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Car fails to start after a short drive and parked and always requires a jump start. Car also fails to restart after a stop/start at a complete stop! has happened multiple times in busy intersections where you’re a sitting target for moving traffic. Always requires a jump start. Have checked battery many times and the battery checks out fine. Maybe electrical or charging system issue. Dealer can’t reproduce the problem as it happens sporadically. Can’t figure out problem and a hazard to drive with kids in car.", "fail date": "  08/23/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Auto engine shut off will turn off engine at stoplight but fail to restart engine when brake is released. Extremely unsafe. It has happened multiple times and each time we are afraid there will be an accident because we are sitting ducks and not accelerating when traffic expects us to.", "fail date": "  08/21/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "There is a problem with the auto engine idle stop system. If I don't turn it off every time I start the car, then the car has a really difficult time re-starting when it automatically turns off at a stop light. This is especially true if the a/c is running. Sometimes, the car has a difficult time restarting or it has to try a few times. A couple of times, it has shifted itself into neutral and a couple of times, it has turned itself entirely off. The problem seems to be getting worse over time. Twice recently my car wouldn't start at all and had to be jumped to start again. I took it to the Honda dealership and they confirmed they had heard of the issue and that another customer had brought their Pilot into service for the same reason the week before. They told me that the first step was to try a new battery. I've done that but am worried my car will stop on the middle of the freeway somewhere. . .", "fail date": "  08/20/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "This is my second complaint as the auto start stop has failed again. This morning on the way to work, the auto start/stop engaged at an intersection. When the light turned green and I tried to go, the car wouldn't turn over. Stranded yet again at another intersection. Have to go through the whole process of putting the car in park, restarting the engine manually, then putting back into drive. The process isnt as quick as you'd think. There is a delay in all of this. Honda refuses to acknowledge the issue and has left me with an extremely unsafe vehicle.", "fail date": "  08/18/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The vehicle in question has the idle stop function, which turns off the vehicle when certain conditions are met. Randomly, the vehicle does not restart on its own which forces me to power cycle the vehicle in order for it to start back up. This is a safety issue because the vehicle has been stuck in the middle of an intersection while I am trying to get it restarted. If the vehicle were to be completely disabled, I could be stuck causing a hazard at any given intersection. I have had the vehicle inspected and the battery tested, but everything checks out ok. I don't feel very safe when the vehicle can just shut off randomly and not restart. I have noticed sometimes, when the vehicle does restart, the dash flashes a warning that says, \"collision mitigation braking system problem\" for a split second and then it clears.", "fail date": "  08/16/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Vehicle has auto idle feature that activates when car comes to complete stop. Typically, the engine restarts when you take your foot off the brake, however, there have now been three occasions that the system did not restart the engine and the car stalled. I have contacted several Honda dealers and they are all aware of this issue but do not have a way to fix the issue.", "fail date": "  08/04/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The engine fails to restart on its own from a complete stop at a traffic light or road intersection with the auto start/stop function engaged, it requires multiple starts, and twice now, just completely does not start.", "fail date": "  08/04/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The auto stop/start gas saving feature often results with the car being unable to automatically restart. When this happens, in traffic, I am forced to put the car in park, and hopefully, manually restart the vehicle. This has resulted in the need for roadside assistance, several times (the car requires a jump). I have sent the vehicle to the dealer multiple times, but they say they cannot find the problem or are unable to duplicate it. Once they tested for battery and electrical system for power leaks and such, and though the car is only 3 years old, it is on it's third battery. I have had to regiment myself to disabling the feature, before driving, to ensure the issue doesn't happen in traffic again, as it could result in an accident. The last time this happened was the first week of August 2022, but it has occurred numerous times, and I'm pretty fed up with the whole issue.", "fail date": "  08/03/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The engine start/stop idle does not start up again after the car stops when at a red light or in traffic.", "fail date": "  08/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "When the idle stop system is engaged and the brake is depressed to activate the vehicle engine to shut off (at a red light for example), sometimes when lifting your foot off the gas the vehicle does not restart as it is designed to. This leaves the driver stranded at a green light panicking to find a way to get the car started and other vehicles stuck behind the stalled car stopping the normal flow of traffic and causing a potential accident.", "fail date": "  07/29/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Vehicle was driving and operating as it should. Parked it for about 30 to 45 minutes now it won't start. Has happened before and Honda said vehicle was fine after they looked at it. Vehicle has had an issue with auto start stop while at a traffic light.", "fail date": "  07/28/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "When the car is stopped (like at an intersection), the auto ignition stop activates. Sometimes when the accelerator is pressed to start the car again, the car seems to blink, the radio resets, and the car shifts itself into neutral displaying a sign the driver should shift into park. Then we have to put the car in park and restart the car. This is definitely unnerving as this happens at busy intersections, and we're afraid of getting rear ended by jumpy motorists. This has happened on 6/30, 6/27. 6/23. 6/22. 6/15. Honda replaced the keyless entry unit on 7/18, but it still occurs.", "fail date": "  07/27/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The engine start stop function failed to restart the car at an intersection. I tried to start the car few times but it did not start. I placed it into neutral and tried restarting but it failed. I was not able to put it in drive, there was a notification that the car needs to be started before going into d. Finally was able to turn off the car. It restarted and was back in drivable condition. It was a panic situation. We hope Honda can address this issue.", "fail date": "  07/23/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The Pilot turns the engine off while idling to save fuel. Twice this week when I have been stopped at stop lights it becomes unresponsive and I am unable to get the car back into gear. Attempts to turn the car on and off and to restart the car don't work. Both times I was only able to get it started after opening the drivers door. . . It took at least 1 minute each time. But I am very worried about it causing an accident. I have realized that I can turn this feature off, but it defaults to it being on everytime you start it again.", "fail date": "  07/23/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The contact owns a 2019 Honda Pilot. The contact stated that after being idle at a red traffic light and attempting to accelerate, the vehicle lost motive power and stalled. The contact stated that the start/stop function operated as designed while stopped however, when the accelerator pedal was depressed the system failed to re-engage. The contact had to wait for several minutes before the push to start button would restart the vehicle. There was no warning light illuminated. The contact called the dealer but was unable to reach a representative. The vehicle was not diagnosed or repaired. The manufacturer was not made aware of the failure. The approximate failure mileage was 19,000.", "fail date": "  07/22/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "When stopped at a stoplight or stop sign, the car has an auto start/stop feature where instead of the car idling, it shuts off and then starts back up when the brake is released. The car stalls and displays several dashboard warning lights and will not start back up after it auto stops. After several minutes, I can usually get it to start back up, but it typically happens in heavy traffic causing a substantial safety issue.", "fail date": "  11/30/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "No restart after auto start/stop engages. On several occasions when coming to a full stop at a red light/stop sign or heavy traffic, the auto start/stop feature turns of the engine. However, when releasing the brake, which is supposed to turn the engine back on, the engine stalls and takes several attempts to restart the engine via the push button starter. Have taken the vehicle to our local Honda dealership several times. First couple of times they said it was a weak battery and they replaced it twice under the vehicles warranty. The third time they said it was our aftermarket forward camera that was causing interference and was charge by the dealer to remove and reprogram the \"system\". Fourth time they said it was a dirty throttle body and also had to pay to have it cleaned. Eventually found article on the internet from June '22 that there is an open investigation by NHTSA on this issue. Took vehicle back to dealership again and they wanted to charge for cleaning the throttle body but declined. Vehicle is not safe to drive with auto/stop feature on. We consciously have to turn off feature when initially starting the vehicle to avoid it from stalling in busy traffic or intersection.", "fail date": "  11/25/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The automatic start/stop system turns the car off at red lights, as it it supposed to. However, several times the car will not start when I push the gas pedal but instead the whole car turns off. It takes opening and closing the door while pushing the park button and the engine start button to turn the car back on. This usually occurs at red lights which is very dangerous.", "fail date": "  11/22/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "In Aug 2021 when the auto stop engaged the car would fail to turn on. Errors would come on on the dash and while car would die at stoplight. Took to dealer and they could not replicate so nothing was done. This happened randomly and we would need to put in park, wait a while and turn back on. Then in oct 2021 the battery died and they replaced under warranty. There was no issues until Nov. 2022. The same started happening. Again dealer could not replicate and nothing was done. They did note the 1 year old advanced battery was low and charge and have charged it.", "fail date": "  11/15/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Engine will not restart after idle stop engaged. Vehicle must be put in park, shut off, and turned back on for engine to restart.", "fail date": "  11/04/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I was stopped at a stop light and the engine went into \"idle\" mode and then cut off completely and all power was lost. I put the vehicle in park and attempted to restart unsuccessfully. I was unable to restart the vehicle for several minutes.", "fail date": "  11/03/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "All the lights on my dashboard were flickering and vehicle would not start. I was getting error messages on vehicle display that all my vehicle systems were offline. Vehicle started the next day, however at a red light my vehicle shut off and was no longer drivable. My vehicle died on the road and I was able to put my hazards on for other vehicles to go around me. We shut the vehicle down and approximately 20 minutes later the vehicle was drivable again. We took the vehicle in the next day for a full diagnostic. Everything came back normal and we read online that the battery may need to be replaced. Diagnostic said battery was ok, but we had it replaced anyway. I drove my vehicle that evening and while driving all my lights came up on my dashboard again. I pulled over, worrying that my vehicle would shut down while driving. Later that day my vehicle would not start again.", "fail date": "  11/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Our 2019 Honda Pilot will flash the brake for the front collision warning system when there is no oncoming traffic or even when the oncoming traffic is in its lane. It does not always happen, but enough to be an annoyance. It also tends, when stopped at a light, and the auto stop engages not to restart. The entire electrical system goes haywire and then dies. This includes the ability to use your 4way or emergency flashers. The car then has to be jumped or towed to restart the vehicle.", "fail date": "  10/30/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The vehicle is equipped with the automatic start/stop feature. Three times in the past few months, the car has unexpectedly stalled at a red light in the middle of traffic, creating a hazard for us and drivers around us. The electric power steering system warning light came on momentarily, and the display screen said ‘radio not available”. We were able to turn the car back on after a slight hesitation, but the radio and controls on the steering wheel stopped working. All controls, and the radio, were working again after leaving the car off for a few hours. The car was taken to our local Honda dealer, who did not find any diagnostic codes and was unable to duplicate the problem.", "fail date": "  10/14/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The contact owns a 2019 Honda Pilot. The contact stated that while driving at an undisclosed speed, the vehicle lost motive power. The vehicle was taken to the dealer numerous times, and the dealer replaced the starter, fuel injector, transmission fluid, and transmission plug; however, the failure recurred. The vehicle was not repaired. The manufacturer was not made aware of the failure. The failure mileage was approximately 42,000.", "fail date": "  10/13/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "My 2019 Pilot continues to randomly turn off. This happens at stop lights mostly, but did happen while driving as well. Latest was at a gas station where it would not restart. Had it to a mechanic and auto zone and both said that nothing is wrong with the car.", "fail date": "  10/04/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Start/stop (auto idle stope system) function issue. I have several incidents where the start/stop malfunctions. The other day I was on a red light and when I pressed the gas pedal to start driving the vehicle hesitate to start and begun to move backward. This happened several time already.", "fail date": "  09/28/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "\"check engine\" light comes on, followed by \"emissions system\" problem, then \"awd\" problem, and also \"transmission\" light with a message to pull over and find a safe location. Have brought in for the \"emissions systems\" problem and awd multiple times, but problem re-appears within a day. Uploading one invoice of many.", "fail date": "  09/26/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The owns a 2019 Honda Pilot. The contact stated that on multiple occasions while at a stop, he released the brake pedal, but the engine failed to re-engage. Additionally, the contact stated that the transmission inadvertently shifted into neutral while driving. The contact stated that he was able to restart the vehicle after multiple attempts. No warning lights were illuminated. The first time the vehicle was taken to the dealer however, the mechanic was unable to duplicate the failure. The vehicle was not repaired. The manufacturer was not notified of the failure. The failure mileage was approximately 52,000.", "fail date": "  09/23/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "While driving, a light came on for emissions systems failure. The vehicle seemed to not accelerate properly like it was pulling. I feared for the safety of my children. This is our only vehicle. My husband took it to the Honda dealership. He got told that there is an issue with the fuel injector and timing belt. After research, we discovered both these issues have been added to a Honda recall list for our year and model vehicle. When my husband asked the Honda service team about it, they said yes, but our VIN isn't covered. We are having the exact same issues as the recall.", "fail date": "  09/22/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Check engine light code p219b “check emissions system” fuel injectors needed to be replaced at only 32,000 miles. Vehicle was out of standard factory warranty by 6 months but under 36k. Honda did replace them under the service bulletin. Just wanted to report so they hopefully keep covering for others as this is an expensive repair.", "fail date": "  09/21/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Auto start feature not starting engine once brake pedal is released after engine is turned off at traffic stops due to this feature. It takes 6 to 7 tries when this happens to get the engine started while all this time putting the occupants of the car in anxiety and putting our lives at risk to push the car to the side. This has happened repeatedly in the last few days. It has happened few times couple of years ago and I wasn't aware it was due to this feature unless it started happening last week.", "fail date": "  09/16/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "In the past I have reported an issue with the auto stop to price Honda. They sent me away saying nothing was wrong. Last night my car died while coming to a stop. No warning. No engine check lights. The emergency flashers wouldn't work nor doors or windows and I was stuck in the middle of the road with my children without hazzard lights. No way to put car into neutral unless you have a special tool which even the Honda dealership couldn't help me with. This was not disclosed when we bought the car and was stuck in high traffic for over 2 hours until a mechanic came and finally got my car to start and move to side by switching the battery along with other stuff. He stated the battery should not have died in drive and something is wrong. I see this is a known issue when looking at your website. I do not feel safe driving this Honda Pilot. It can shut down at any time without warning and leave us stranded. Not being able to move into neutral in its self is safety hazzard especially with no hazzard lights. Price Honda (david) was very rude and brushed me off telling me no one is going to call me back over this. However their manager (craig) called me shortly after and even acknowledged the known issue and said could take years to recall. This is not ok and why wasn't any of this disclosed. We should know that we need a tool (and know how to do it since in the engine) to save us if our car breaks down so we can at least get to side of road! I see this issue is being investigated by you, not sure whybitbwas not discloaed especially when I already reported to Honda. My kids and I could have died yesterday. Single lane road no shoulders no flashers and cars flying past us. Not ok especially for this type of car that I bought brand new! I need assistance with this please before someone does get hurt.", "fail date": "  09/14/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "On multiple occasions the auto start/stop has failed when releasing brake pedal vehicle will completely shut off and takes multiple attempts to turn back on. This is a hazard due to the fact that it has occured on busy streets and state highways. At this time vehicle has not been inspected by dealer we do plan on taking it in ASAP.", "fail date": "  09/13/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "When stopped at an intersection, the auto engine idle stop activated in my vehicle. When I let off the brake pedal, the engine of the vehicle did not start back up. Alerts on my dash came up instructing me to place the vehicle in park and restart the vehicle. It took two attempts to get the vehicle restarted. The battery light turned on when trying to restart the vehicle. There was traffic behind me and I had to turn on my hazards to alert them of me having troubles.", "fail date": "  09/02/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "With the auto engine idle stop enabled, stopped at a traffic light and engine shutoff. When releasing the brake engine did not start and dashboard display said to put car in park and press start button. Followed directions and car did not restart until completing the park/start button sequence three times.", "fail date": "  08/26/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Fuel-saving stop-start system fails to restart. Car goes into neutral and has to be turned off and back on to restart. This happens when stopped at a traffic light. Low battery light ignites, seems engine doesn’t have enough power to restart when gas is pressed.", "fail date": "  08/25/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "On my drive home this afternoon the auto idle stop feature on my 2019 Pilot touring began to hesitate to restart after releasing my foot from the brake. The result was an orange warning light telling me that there is a problem with the collision mitigation system and a shudder before the engine would resume running. I had to turn off the auto-start feature to avoid stalling in rush hour traffic.", "fail date": "  08/24/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I was stopped at a stop light in traffic. The light turned green and I tried to hit the gas to go, but my vehicle turned off. I tried to depress the brake and push the start button, lights flashed on my dash but did not start my car. I tried again and nothing happened. Then, all lights on dash turned off when I tried again to start the engine. I waited a few more seconds and tried to start the car and the dash lights came on but still my car would not start. I continued to wait a few seconds and tried to start my car and it finally turned on after 15-20 attempts. I called the dealer and they said it's probably the battery. The car just had a new battery put in so it's not the battery. The car just passed inspection at the dealer's last week. We have received no warning messages in the vehicle about this. However, the same thing happened to me a year ago where the vehicle did not start after being stopped at a light, but it only took 3-4 times to get it started again. Today, I was at a busy intersection when this happened with rush hour traffic with my children in the car. The speed limit was 45 mph on the road. Cars had to slam on breaks to avoid hitting us. Not a safe situation.", "fail date": "  08/24/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Car fails to start after a short drive and parked and always requires a jump start. Car also fails to restart after a stop/start at a complete stop! has happened multiple times in busy intersections where you’re a sitting target for moving traffic. Always requires a jump start. Have checked battery many times and the battery checks out fine. Maybe electrical or charging system issue. Dealer can’t reproduce the problem as it happens sporadically. Can’t figure out problem and a hazard to drive with kids in car.", "fail date": "  08/23/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Auto engine shut off will turn off engine at stoplight but fail to restart engine when brake is released. Extremely unsafe. It has happened multiple times and each time we are afraid there will be an accident because we are sitting ducks and not accelerating when traffic expects us to.", "fail date": "  08/21/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "This is my second complaint as the auto start stop has failed again. This morning on the way to work, the auto start/stop engaged at an intersection. When the light turned green and I tried to go, the car wouldn't turn over. Stranded yet again at another intersection. Have to go through the whole process of putting the car in park, restarting the engine manually, then putting back into drive. The process isnt as quick as you'd think. There is a delay in all of this. Honda refuses to acknowledge the issue and has left me with an extremely unsafe vehicle.", "fail date": "  08/18/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The vehicle in question has the idle stop function, which turns off the vehicle when certain conditions are met. Randomly, the vehicle does not restart on its own which forces me to power cycle the vehicle in order for it to start back up. This is a safety issue because the vehicle has been stuck in the middle of an intersection while I am trying to get it restarted. If the vehicle were to be completely disabled, I could be stuck causing a hazard at any given intersection. I have had the vehicle inspected and the battery tested, but everything checks out ok. I don't feel very safe when the vehicle can just shut off randomly and not restart. I have noticed sometimes, when the vehicle does restart, the dash flashes a warning that says, \"collision mitigation braking system problem\" for a split second and then it clears.", "fail date": "  08/16/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Experiencing auto start/stop failures with car. It engages so quickly even at a quick stop sign the car is shuts off (I think timing should be extended). The problem is when it comes time to start back up there is often several turns before the engine starts. This itself is a safety concern, as I am often not able to move when I need to. Two other separate incidents where the system failed completely: the car did not turn over after several times and just stopped. This happened on interstate 95 in traffic. I was unable to move for 30 seconds while tried to get the car started again. Honda refuses to do anything about it; their solution is to have me try to video tape it occurring, since there are no faults. I am not doing this every time I come to a stop with my 1 year old in the car. It happened again while my wife was driving; this time on an on ramp to i95 while she was yielding for traffic. Auto start stop engaged, then failed to start back up- all while at a temporary stop. She has no idea what to do as the car requires you to put into park and then try and restart the car. Those were the two most severe cases; according to Honda this happens after 5 attempts to start the car. The other time it starts before the 5th time but not immediately. There is electrical failures associated with this; including collision system warnings during restart. Honda will no do anything, will not even attempt to replace starter or battery or even quote me a price to fix. This is completely unsafe to drive and we will be looking to trade the car in. Too bad as this is a wonderful car. Honda has driven it several times (according to them) and are not able to replicate the issue. Their advice to me is to manually disable the start/stop every time I drive the vehicle which is ridiculous. I have escalated to american Honda but so far no resolve. I can recall at least 20 incidents in total with this. Its not every time - but imagine how many times a day I stop and go.", "fail date": "  08/13/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Today and yesterday, the engine cut off when the car came to a complete stop. I tried to recreate the situation coming to a stop randomly, but found the cutting out was intermittent. Upon reading the forums, I discovered others are having the same problem and that you are investigating whether it has something to do with the auto start/stop feature, so I am reporting my issue with you. Where the engine cut off, I was either at a stop sign or at a red light with passengers including small children, and it took time to restart.", "fail date": "  08/10/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "At a stop light the my car turned off and did not come back on for 5 mins. I am aware of the auto stop feature for fuel efficiency but I was in a turning lane. I literally could have been in an accident. The car brakes were locked in could not even put the car in neutral or park the car was just off completely. No signs of over heating, battery failure, etc.", "fail date": "  08/09/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Vehicle has auto idle feature that activates when car comes to complete stop. Typically, the engine restarts when you take your foot off the brake, however, there have now been three occasions that the system did not restart the engine and the car stalled. I have contacted several Honda dealers and they are all aware of this issue but do not have a way to fix the issue.", "fail date": "  08/04/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The auto stop/start gas saving feature often results with the car being unable to automatically restart. When this happens, in traffic, I am forced to put the car in park, and hopefully, manually restart the vehicle. This has resulted in the need for roadside assistance, several times (the car requires a jump). I have sent the vehicle to the dealer multiple times, but they say they cannot find the problem or are unable to duplicate it. Once they tested for battery and electrical system for power leaks and such, and though the car is only 3 years old, it is on it's third battery. I have had to regiment myself to disabling the feature, before driving, to ensure the issue doesn't happen in traffic again, as it could result in an accident. The last time this happened was the first week of August 2022, but it has occurred numerous times, and I'm pretty fed up with the whole issue.", "fail date": "  08/03/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "When the auto engine idle kicks in more and more often the car struggles to restart. A message quickly flashes about a malfunction but too quickly to read it. I disable the feature very often as I fear the car will not restart.", "fail date": "  08/03/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The engine fails to restart on its own from a complete stop at a traffic light or road intersection with the auto start/stop function engaged. I fear I will get rear ended due to this. Or shot b/c of crazy road rage people. We took it to the dealer and it could not be replicated so they could not fix it. No warnings prior it has happened multiple times.", "fail date": "  07/31/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I was stopped at a stop light and the engine went into \"idle\" mode and then cut off completely and all power was lost. I put the vehicle in park and attempted to restart unsuccessfully. I was unable to restart the vehicle for several minutes.", "fail date": "  11/03/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "During stops, when I release the foot from the brake pedal, car suddenly shuts off, which becomes a safety issue. It takes me a minute or two to get the car started again. In case I shut off the \"auto-shutoff\" feature, car works perfectly fine. I must shut off the feature every time I restart the car.", "fail date": "  10/28/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Auto restart after stop does not seem to be functioning. After stopping at a light, auto restart did not start the car again.", "fail date": "  10/28/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Today is the 6th time our Honda has had issues either the automatic start/stop system failing when at a stop light. The car will stop and shut off like it is supposed to, but will not restart. Car needs to be put into park, turned off, restarted, shift back into drive. This happens while we are at risk of being hit from behind, honked at, and creates an unsafe and stressful driving situation. Car has had infotainment issues that seemed to be fixed, but had issues prior to today’s incident. Car has been only serviced at Honda. No warning lights etc. This issue was reported to our dealer last December and they said the could no replicate the issue. In August this happened again immediately after having the car serviced for an oil change. The car is putting my family and others at risk and there seems to be many others with this same problem happening.", "fail date": "  10/23/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "On several occasions my vehicle has acted as if it were going to die at a stoplight or intersection where the brake pedal was pushed enough to trigger the auto-off function. It did not start doing this until the last several months. I assumed it was because I did not have my foot pressed enough. On one occasion several weeks back it acted as if it did not want to start and then today I was completely stopped and stuck at a light, blocking traffic. The battery light came on and it would not let me restart it. After a minute I finally got it started and immediately drove it to the Honda dealer in which they weren’t able to check it. I will take back tomorrow for them to check it out. I’ve also read several articles about this same thing happening so I wanted to report it for the records.", "fail date": "  10/11/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Auto idle stop is malfunctioning. When my car turns off at a stop using auto idle stop many times the engine does not turn back on. Then I can't put make my car drive. I can't put it into park. Nothing happens when I give it gas. So now I have to turn off my car and try to restart the engine so I can drive again. So cars behind me are starting to accelerate because the light has turned green and my car has stopped working. This has happened to me more than 10 times. Now I try to remember to turn off auto idle stop but I don't always remember to do so. I'm afraid I will get hit because it is taking me sometimes 10 seconds to get my car moving again. My car is available for inspection. I have not taken it to the dealer. It has not been inspected by anyone. There were no warning signs although a warning light appears on the dash for a second when the engine won't start. It says something about auto idle stop but I'm so busy trying to start my car again I can't read it.", "fail date": "  10/06/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Start/stop (auto idle stope system) function issue. I have several incidents where the start/stop malfunctions. The other day I was on a red light and when I pressed the gas pedal to start driving the vehicle hesitate to start and begun to move backward. This happened several time already.", "fail date": "  09/28/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I am actually reporting two incidences, since the first (never reported) now appears to be related. 1st: in March 2022 (approx 35,600 miles on the vehicle), the vehicle completely shut down after attempting to accelerate back out of the auto-idle stop mode. I was stopped at a traffic light on a highway off-ramp in rush hour traffic. All of the warning lights and exterior lights started flashing and strobing in and out, but I also had no power of any kind for windows, radio, nothing. I was unable to turn on the emergency flashers, so I got out of the vehicle to redirect traffic around me while I waited for it to be towed to the dealership. They told me that by the time my vehicle got to them, that the battery was completely dead, and therefore there was no data or code. They told me that it had to be the battery, but they’d fully recharged the battery and it was all good. (covered under warranty) yesterday afternoon 9/27 I was at a stoplight, once again in auto-idle stop mode. I depressed the accelerator once the light turned green and the car would not move. I looked down and noticed that my car had shifted itself into neutral? it would not allow me to put it back in park and/or restart. By now I am trying to wave the people behind me to go around, when I look up and see there’s some kind of message scrolling across the driver’s display; something about a wrong gear? there were cars stuck behind me, so I was in a bit of a panic mode. I took a few breaths and tried again. I fully depressed the brake, was finally able to put the car back into park and restart the car. I am bringing the vehicle in for service tomorrow (I am now outside of warranty) after just having a comprehensive 40,000 mile service completed on sept 10. Note: vehicle was purchased brand new and has been 100% dealer serviced.", "fail date": "  09/27/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Auto start feature not starting engine once brake pedal is released after engine is turned off at traffic stops due to this feature. It takes 6 to 7 tries when this happens to get the engine started while all this time putting the occupants of the car in anxiety and putting our lives at risk to push the car to the side. This has happened repeatedly in the last few days. It has happened few times couple of years ago and I wasn't aware it was due to this feature unless it started happening last week.", "fail date": "  09/16/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "On multiple occasions the auto start/stop has failed when releasing brake pedal vehicle will completely shut off and takes multiple attempts to turn back on. This is a hazard due to the fact that it has occured on busy streets and state highways. At this time vehicle has not been inspected by dealer we do plan on taking it in ASAP.", "fail date": "  09/13/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The engine fails to restart on its own from a complete stop at a traffic light or road intersection with the auto start/stop function engaged. This is the third time has occurred. Many people online are reporting the same issue.", "fail date": "  09/12/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Vehicle is equipped with auto engine shutoff when vehicle stops. It started failing and has caused the car to stall at red light. Purchased vehicle 4 months ago.", "fail date": "  09/09/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Two incidences occurred within one hour. When in park the vehicle suddenly shifted to neutral and began to roll backwards. The second incident occurred 30 minutes later. When stopped at a traffic light the vehicle again shifted into neutral on its own and would not allow you to switch to drive with out turning off the vehicle and then back on again. Both could have resulted in catastrophic injury. This vehicle has been recalled (and repaired) multiple times for electrical issues and has all push button gear shifts. It is up to date on all recall and service notices and maintenance.", "fail date": "  08/30/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I received a transmission system problem warning and a blind spot info system warning. Also the spot on the dash that tells you if you are in park, neutral, drive or reverse has all of the letters on top of each other and they were flashing.", "fail date": "  08/29/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The idle start stop engine when I press the brakes shuts the engine off. Then it stalls the engine, puts it in neutral and I can’t start the car when I press the gas pedal. Music turns off too. I have to put the car in park, turn the engine completely off, restart the engine before I can go. Very dangerous as it’s stalled as I am in the middle of driving at a stop sign, roundabout, stopping for a pedestrian, stopped at a light, left hand turn. Occurs each time I drive. Started in late 2020.", "fail date": "  08/28/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "When coming to a complete stop the idle stop turns the car off. When you take your foot off the break to restart the engine it stalls the vehicle and puts the car in neutral. The car then needs to be put in park, restarted and then can be driven again. This has happened about 20 times over the last month and has become more frequent.", "fail date": "  08/15/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The auto stop start function is malfunctioning. When I start to go after being stopped at a red light, the engine often does not restart back up. The car shuts down and I need to put it in park and restart the car. This just started happening about a month ago and it is happening more frequently now.", "fail date": "  08/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The Pilot turns the engine off while idling to save fuel. Twice this week when I have been stopped at stop lights it becomes unresponsive and I am unable to get the car back into gear. Attempts to turn the car on and off and to restart the car don't work. Both times I was only able to get it started after opening the drivers door. . . It took at least 1 minute each time. But I am very worried about it causing an accident. I have realized that I can turn this feature off, but it defaults to it being on everytime you start it again.", "fail date": "  07/23/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I am writing to report that I believe there is a problem with the start/stop function of my 2019 Honda Pilot. My vehicle has failed to restart from a complete stop (three different times) when the automatic idle-stop feature is engaged. I have taken the car to a Honda dealership and they are unable to replicate the problem/can not find the problem. I have read that this is already an open investigation-- I just wanted to provide my information to add to the report.", "fail date": "  07/19/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Pilot's automatic start-stop system doesn't turn back on after a complete stop sporadically. General inspection did not find any issues. Vehicle available for further inspection if a loaner is provided. Warning lights that came on includes all lights on the dashboard flashing and a clicking sound occurring.", "fail date": "  07/15/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The \"auto idle stop\" function has begun to randomly not restart the Honda Pilot. When this occurs, the Pilot must be placed in park and then restarted. Restart is not always immediate.", "fail date": "  07/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Auto stop start is erratically failing to properly restart the car after brake has been disengaged. After arriving at a complete stop, the vehicle will properly shut down when the driver’s foot is on the brake. When the driver disengages the brakes, the engine should promptly restart and the car will find itself already in drive so it can continue to move forward. Under certain unknown circumstances, the car will stall and not be allowed to restart. In order to continue, I needed to shift the car to park, turn the car off completely, and then restart the car. Only then can I shift the car back to drive and continue. This presents a safety issue since once the brakes are removed, traffic behind interprets this action to mean you will be traveling forward shortly. The restart is sometimes accompanied by a lurk which might be also considered as moving forward. This vehicle has not been in a accident and the dealer was not able to reproduce this issue. The issue seemed to occur shortly after another recall was performed for the fuel pump. Auto stop start cannot be permanently disabled and needs to be performed each time the car is started. This circumstance seems documented in pe22005.", "fail date": "  06/29/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I currently have a 2019 Honda, Pilot with approximately 70,000 miles. I have had problems with the idle stop feature since the first year of owning the vehicle. I have had many instances of a restart resulting in actuating the warning lights on my instrument panel and a few times when my vehicle did not restart. My dealer either was not able to diagnose the problem or did not know how. I even paid to have my battery replaced, which helped elevate the problem but did not fix it. I also either have a problem with the automatic braking system giving me a warning or in some instances actually applying the brakes when there is no traffic. Both of these are reoccurring and on-going problems.", "fail date": "  06/28/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The start/ stop feature is malfunctioning. I was at a red light stopped this morning and the start/ stop feature kicked in and turn off the engine. However the switch or gear jumped to neutral with no action from me and the car stuck. When I was about to go as the lights turned green, the vehicledidn'tmove ratherthe neutrallight on the buttonwas on and none of the other buttons work. I tried pushing the drive button but the vehicle stuck on neutral. So I have turn the ignition off and restart the vehicle while cars were lining behind me on the same lane. Please help.", "fail date": "  06/22/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Took my Honda Pilot 2019 for emissions test vehicle emmssion inspection mva veip told me they having issues with this 2019 Honda especially the Honda Pilot and added manufacturing issues. My $14 was refunded back. Can someone please look into this issue for us. My friend with Honda Pilot 2019 is having the sane issue. We keep getting extended dates to drive around gases are expensive. Please help.", "fail date": "  06/18/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The stop-start function has not restarted on a couple occasions. I have been at a stop light released my foot from the gas and the failure has occurred. The vehicle was auto shifted into neutral. Instructions were to put in park and restart. I did not feel safe that I my was stuck in an intersection and I didn't know if the vehicle would restart. There were no noticeable errors that I recall. I have had the battery checked on the vehicle and it is good. As of right now, I have not had it checked by a dealer. I try to remember to disable the start-stop function when I drive.", "fail date": "  06/14/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I recently experienced an issue where I was sitting at a traffic light. The auto stop/start feature had turned the car off while waiting at the light, but when I let off the gas pedal, the feature seemed to initiate a start of the vehicle, but that didn't work. The driver dash lit up saying I needed to put the car in park and hold down the break before hitting the start/stop engine button. This was the first time I've fully experienced this happening. I've had similar issues with the auto start/stop feature, but nothing has been consistent to reproduce. I brought it to the attention of the dealership from which I purchased the car, but they could not reproduce the issue. I just thought it either had to do with the battery level being low or something with the starter, but the dealership indicated those looked fine. From what I remember of this specific issue, I did have my a/c running pretty high, as it was a rather hot morning.", "fail date": "  06/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Vehicles review camera no longer working after software update. Camera was working fine for a few weeks then stopped randomly.", "fail date": "  05/23/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The Honda Pilot repeated failed maryland emission inspection. I am requesting the NHTSA to investigate nationwide before it becomes a major safety issue. The maryland emission officials are also aware that most 2019 Honda Pilot is failing the emission test.", "fail date": "  05/21/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Twice since purchasing the vehicle last year the automatic start/stop feature on the Honda has failed to restart the engine once we took our foot off the brake pedal. The first time was more than six months ago. We were at a light and the vehicle did not start after taking my foot off the brake when the light turned green. I tried putting it in park and then restarting the vehicle with the touch button but it didn't work. I tried with the remote start feature on the key and it would not start that way. At this point traffic was honking and going around us. I started pushing the park and neutral button to make sure it was in park, but nothing worked. I finally got the vehicle to restart by holding the start button on the dash for about 10-15 seconds. When I took it into the dealer a month or so later to have a recall taken care of I brought it up to the advisor and he asked if it has happened since then. I said no and he said it was probably something I did. . . The second time, was 5/11/2022 around 11 am. I was on the way to the Honda dealership to buy an oil filter and crush ring to change the oil. I had been driving for about a half an hour, stopped at a red light in front of the dealership and it happened again. Once again, traffic on the offramp started piling up, people were honking and going around on the shoulder. I tried the same procedure as before but it didn't work at first. I tried it a couple of times and the vehicle finally started. The vehicle has not been scanned with a scanner since the last time so there is probably a stored code if you need to verify this.", "fail date": "  05/11/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I was driving with my granddaughter. When we were stopped at a light and my car shut down. I didn’t know what to do. I finally figured out how to get the vehicle to start again. The idel- stop is not working it continues to happen. So my husband and I have to remember everyone we start the car to turn it off and we tend to forget. Then here we are stuck in the middle of traffic. Idle-stop feature is not working correctly.", "fail date": "  02/23/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The engine turned off and the car went in to neutral gear while sitting at a stoplight. This happened 2x in 1 day. The first time, the car was in the \"auto engine idle\" mode and the second time I had disabled the feature so it was at a regular idle. The dash said the car was in accessory mode and to push the brake and start the car. I had to shift to park to be able to restart the car. I had cars behind me honking the horn and was afraid I was going to be rear ended at the stoplight by the driver behind me. This is definitely a safety hazard!.", "fail date": "  02/15/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The battery to my Pilot failed with either no warning or previous misdiagnosis by two different Honda dealerships. The part is no longer available as I returned it for a core charge. I'm not sure if there are codes in my vehicle that could be retrieved. On Saturday February 12, I was driving my wife and two children in the vehicle ages 3 and 5. The vehicle was stopped at one stoplight, the engine shut-off as part of the auto start/stop and when it did the auto restart the infotainment glitched. It had been doing that off and on for a while and the dealers assured me my battery was fine on multiple service visits. We had to stop at another stoplight and the vehicle shut-off and would not re-start. I called a tow service hoping that they could jump start the vehicle. It would not start and they had to tow the car. I've had my vehicle for 2. 5 years and 38,500 miles. I am very disappointed that a vehicle this new would leave me stranded in the middle of the road. I have been taking it to 2 different dealers for service. First jay wolfe Honda where I purchased the vehicle and more recently olathe Honda. I have had both of them check the battery in 2021. Both indicated that the battery was fine. I went back to olathe Honda today as I had discussed the factory battery with them. I have a service report from September of 2021 that indicates they checked the battery and to see the attached test results. I asked them to see the test results and they indicated that they don't typically attach them because they are printed on thermo paper. The service report indicated the battery was fine. If it wasn't fine, it would have been covered under warranty at this point. There is not a record of what the battery tests truly indicated in September.", "fail date": "  02/12/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "After the automatic engine start/stop feature turns on \"stops at a traffic light\", the car does not restart and the car requires repeated pushes on the start/stop engine button to restart. The battery has been checked and it is in good condition. The dealer is unable to replicate the issue as it happens intermittently. It has occurred a number of times,.", "fail date": "  02/09/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Drivers side sun visor has lost its ability to stay in the closed position. It constantly falls down approx 5 inches in front of my head when not being used. At this position it pushes against my forehead which to me is a safety issue if something were to happen I would definately have impact in my head since I am a short person 5 ft 1 inch and perfer to sit higher up for visability. It will not go back into its original closed position. I have hit my head a dozen times already and I have only had this vehicle less than a year. 2019 is a newer vehicle and I would consider this a true safety defect in this model. Yes, the dealership has seen this issue and I am awaiting their decision since its passed its 36k mileage for warranty.", "fail date": "  01/03/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The contact owns a 2019 Honda Pilot. The contact stated while stopped, the vehicle independently shifted to neutral. The contact stated that the vehicle failed to accelerate or shift to drive. The vehicle had to be turned off and restarted and the vehicle to operated correctly. The contact stated that the failure occurred several times. The contact also stated that there was a clicking noise coming from the vehicle. The vehicle was not taken to an independent mechanic or dealer for diagnosis or repairs. The manufacturer was not notified of the failure. The approximate failure mileage was 71,000.", "fail date": "  11/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "When stopped at a red light the engine shifted from drive to neutral on its own. The brake became stiff and it took shutting off and restarting the car multiple times before it would shift. This is the third instance of this vehicle shifting to neutral on its own. After the previous times (they occurred within the same day- one shifting from park to neutral and the other similar to this experience, also at a red light), I took the car into the dealership where it came back showing no codes and could not be replicated while there. It is a push button electric shifter and the vehicle has had multiple recalls and service bulletins for electronics (all repaired) and has experienced issues beginning one month after I purchased the car brand new.", "fail date": "  10/23/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "This is a 2019 Honda Pilot with start stop function. There is a noticeable delay in activation and getting longer with time; this is a 3 year old vehicle. During 2 other instances, the system failed and vehicle would not start on a public street. During these failures and delays, other than the obvious collision safety issue, the safety systems are unavailable via a message on the dash. When it eventually starts back up it functions normally. This is clearly the system prematurely failing or the system prematurely killing the battery (which has a normal functional life of 5 - 7 years).", "fail date": "  10/15/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The contact owns a 2019 Honda Pilot. The contact stated that while driving at an undisclosed speed, the vehicle lost motive power. The vehicle was taken to the dealer numerous times, and the dealer replaced the starter, fuel injector, transmission fluid, and transmission plug; however, the failure recurred. The vehicle was not repaired. The manufacturer was not made aware of the failure. The failure mileage was approximately 42,000.", "fail date": "  10/13/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Vehicle failed to restart after stopping at a red light. Had to completely turn off the vehicle and restart it for it for engine to fire back up. Auto stop feature was on. Power seemed to suddenly go down and then the car was in park. Took couple of tries to start up as the car went into neutral in between.", "fail date": "  09/27/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "In the past I have reported an issue with the auto stop to price Honda. They sent me away saying nothing was wrong. Last night my car died while coming to a stop. No warning. No engine check lights. The emergency flashers wouldn't work nor doors or windows and I was stuck in the middle of the road with my children without hazzard lights. No way to put car into neutral unless you have a special tool which even the Honda dealership couldn't help me with. This was not disclosed when we bought the car and was stuck in high traffic for over 2 hours until a mechanic came and finally got my car to start and move to side by switching the battery along with other stuff. He stated the battery should not have died in drive and something is wrong. I see this is a known issue when looking at your website. I do not feel safe driving this Honda Pilot. It can shut down at any time without warning and leave us stranded. Not being able to move into neutral in its self is safety hazzard especially with no hazzard lights. Price Honda (david) was very rude and brushed me off telling me no one is going to call me back over this. However their manager (craig) called me shortly after and even acknowledged the known issue and said could take years to recall. This is not ok and why wasn't any of this disclosed. We should know that we need a tool (and know how to do it since in the engine) to save us if our car breaks down so we can at least get to side of road! I see this issue is being investigated by you, not sure whybitbwas not discloaed especially when I already reported to Honda. My kids and I could have died yesterday. Single lane road no shoulders no flashers and cars flying past us. Not ok especially for this type of car that I bought brand new! I need assistance with this please before someone does get hurt.", "fail date": "  09/14/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Two incidences occurred within one hour. When in park the vehicle suddenly shifted to neutral and began to roll backwards. The second incident occurred 30 minutes later. When stopped at a traffic light the vehicle again shifted into neutral on its own and would not allow you to switch to drive with out turning off the vehicle and then back on again. Both could have resulted in catastrophic injury. This vehicle has been recalled (and repaired) multiple times for electrical issues and has all push button gear shifts. It is up to date on all recall and service notices and maintenance.", "fail date": "  08/30/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "-automatic start/stop feature -vehicle's engine did not restart after the auto start/stop engaged while in rush hour traffic. Also the vehicle will immeadiatly or on start will shift the transmission in neutral. Leaving the family in the middle of a unprotected left turn in the middle of a now red light intersection, this is dangerous and unsafe. I will also as you come to a complete stop after traffic on the highway hits a back up. - I have taken the vehicle in the same Honda dealership they have not been able to \"reproduce\" the problem. At the 1st attempt they recommended a new battery, but the problem is still occuring. I have given them video evidence in the hope they will have a solution to this safety defect. -the dealership currently has my vehicle at its service department and I was told by the service manager that he is coordinating with his service representive for a possible solution. No other agencies have looked at the vehicle thus far. -sometimes the start/stop indicator on the dash illumates sometimes there's a delay. The message given my the dash reads \"gear position is n. Release accelerator pedal\" the message that reads if you have the transmission in d than press the n button reads completely different and cannot be duplicated other than when the vehicle shifts into n on its own after a auto start/stop. -this issue started occurring randomly at 57,000 miles now at 59,000 its occuring more frequently and is causing unsafe situtations while in operation of the vehicle.", "fail date": "  08/05/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Vehicle is shutting down at red lights / stop signs; when this happens engine goes into idle mode. But pressing the gas pedal to resume travel, vehicle immediately shuts down. The vehicle needs to be turned off, and restarted. Restart is not always successful on first attempt, leaving vehicle stranded in congested traffic areas until it the issue clears. This type of event has had more than one occurrence.", "fail date": "  07/26/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The transmission on this vehicle will will shudder when at high rpms and low speed such as when leaving a stop sign or traffic light. This shudder delays acceleration and can cause a safety issue when pulling out into traffic and leaves you not able to get out of on-coming traffic's way quick enough.", "fail date": "  07/21/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Reported to dealer twice and could not be replicated. They just tell me they have never heard of this problem. While at a traffic light the vehicle either shifts into neutral, park or second gear. Sometimes I press the accelerator and it does not go even though I’m in drive. I gave up with the dealer but it is scary when people behind you honk and I could be rear ended because I’m scrambling to press the transmission buttons or restarting. A few incidents, I had to turn off and restart. I have learned if it is running and in drive but does not go, I press the drive button several times to make it go or turn off and restart in lines of traffic. This vehicle has bells and whistles but falls short with engine and transmission. I currently own 5 Honda vehicles and 12 Hondas over the years. This vehicle is the one I feel the least secure in being dependable. It has 16,000 miles on it and has been problematic since approx 7,500 miles.", "fail date": "  06/18/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Start / stop and engine failure. When I have the start/stop feature enabled there have been numerous occasions where the car has stalled and will not restart. This has happened in critical traffic situations and has almost caused multiple accidents and injury. In addition, the engine has cut off while driving through parking lots and stopping for pedestrians; during this time I need to reset the entire car to get it to start back up while stuck in the middle of the street. One other occasions the start stop has failed where the car does restart but the entire car resents and delays me from moving until this is finished. I have taken the vehicle back to the dealer to review and they say everything is working as designed.", "fail date": "  06/08/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "As described in power train TSB a20-029 (but so far associated only with 2019 Pilot awd touring and elite) - my 2019 Pilot awd transmission has intermittent harsh or jerky upshifts with steady acceleration. The vehicle lags, failing to accelerate properly. This creates a safety issue when merging, turning into active traffic, etc. The issue was inspected via diagnostic snapshot at jenkins & wynne Honda in clarksville TN on may 3, 2022. Output graph confirmed transmission lag occurring consistently throughout tech drive. Issue first appeared in April 2022 at approximately 32,000 miles, just 2,000 miles past 30,000 mile service completed in Jan. 2022. All vehicle service maintained according to manufacturer timeline and recommendations.", "fail date": "  05/03/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Intermittently when starting my vehicle while seated or using the factory remote start, the vehicle will move/drive forward up to several inches. I took videos of this and have taken it to the Honda dealer 3 separate times. The most recent time, they told me it was acceptable and that Honda says it can move up to 5” and be within acceptable tolerances. This is very unsafe due to my vehicle moving when unoccupied and with the parking brake set. The problem was confirmed and reproduced by the dealer. When I voiced my concern about the safety aspect, I was told that there should be nothing within 4’ of my vehicle. I feel unsafe to park my vehicle because I can’t control how close someone parks in front of me. I feel unsafe to park in my garage because I don’t want my car to drive forward and hit my property. I don’t want my daughter any where near my car when I am simply starting it.", "fail date": "  02/07/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "We own a 2019 Honda Pilot touring (VIN 5fnyf5h94kb040880). We purchased our vehicle from checkered flag Honda in norfolk, virginia in June 2019. This vehicle has 32,096 and is still under the factory bumper to bumper warranty. We have been experiencing an issue with the systems auto-start stop feature. The vehicle's engine stops at a red light, and when we release the brake, on numerous occasions the vehicle fails to restart the engine and stalls in the middle of the road. This has happened more than 15 times since we have owned the vehicle and puts us in an unsafe situation. We took our vehicle in for service at checkered flag on 08/12/2021 and explained the problem we were having to the service technicians. During that visit, they were not able to duplicate our engine stalling issue (see service record attached). Since 08/2021, this issue has continued to occur 6-8 times since August. The engine attempts to restart itself after letting off the brake or after a set period of time, however after attempting to crank the engine, the car beeps and has to be restarted manually. When attempting to restart the car manually, the car will not start the next 2-3 attempts, and will eventually restart after multiple presses of the engine start button. This is extremely unsafe as we are not able to move the vehicle, sometimes for a few minutes. According to the service records, the technicians performed a battery check, and the battery was fine.", "fail date": "  01/08/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The contact owns a 2019 Honda Pilot. The contact stated that while operating the vehicle the transmission had erroneously shifted from the drive position to the select position causing the vehicle to hesitate and sputter. After turning the vehicle off and restarting the engine the failure had self corrected. On one occasion while parked with the engine idling, as contact was exiting the vehicle the transmission erroneously shifted out of the park position and began to drive forward knocking the contact to the ground and driving over the legs. During the incident the driver sustained injuries to both legs and a fractured arm. The vehicle was taken to the local dealer who reprogrammed the transmission. No further information was available. Later while operating the vehicle warning messages began to displayed including service engine, power train and the warning message \"danger pull over immediately\". The cause of the failure was not yet determined. The manufacturer was not notified. The VIN was not available. The failure mileage was 52,000.", "fail date": "  01/02/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "I started the Honda Pilot drove on a driveway about 30 feet to an intersection. When clear I accelerated onto the road. The car was very slow to accelerate and I slowly rolled onto the road barely avoiding an oncoming car. While in my lane I stopped and observed an awd warning light on the dashboard. I turned the engine off then restarted the engine. The awd warning light was off and the car drove normally. The next day when starting my car to leave a parking lot the awd warning light appeared on my dashboard. I turned the engine off then restarted the engine. The awd warning light was off. I drove home without the awd warning light reappearing.", "fail date": "  11/19/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Unexpected movement: incident #1. Car parked on level pavement in park gear but manual brake not set. I pressed brake and started the engine. Then lifted foot from brake (while car is still in park) and the body moved forward 6-8 inches before I could reapply the brakes. Incident #2 car parked in park facing steeply downhill. Engine running with gear in park. Pressed reverse button and lifted foot from brake but before I could hit the gas, the car rolled forward downhill about two feet before I could reapply the brake. Once the brake stopped the car then the reverse gear engaged and I was able to go from brake to gas pedal without rolling.", "fail date": "  10/09/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "My 2019 Pilot elite has 16,400 miles on it just started a couple months ago where I would get to 2425 miles an hour in the car with lunch or lurch it happens also sometimes when I get to 30 some miles an hour it all lurcher lunch. Last Friday I made a left turn onto a major street and went to accelerate in the car just wouldn't do anything it wouldn't accelerate it slow down and I had to pull over to the side and put my flashers on I had to wait a while probably a minute or so and then I could press my foot on the excelerator and go forward. This lurching or lunging does not happen all the time it could be on a city street when it happens it can be when I go to accelerate to get on the expressway I have mentioned this to my mechanic at Honda and they don't seem to know what the problem would be I'm wondering if there is recall that I might've missed or there's some thing that someone knows I can't be the only one that this is happening to.", "fail date": "  07/15/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "On July 3, 2020, after reversing out of my garage onto my driveway, I put the car in drive and when I pressed the accelerator, the car shifted into park on its own. I tried again and it did it again. My husband and kids were in the car and my husband said \"it did this to me the other day too. \" I got my phone out and took video of it occurring two more times. Each time I put the car in drive and pushed on the accelerator, it shifted into park on its own after moving forward. It did this with or without a seat belt on. The video is an mp4 file and there does not seem to be a way to attach it online, but I am happy to provide it upon request.", "fail date": "  07/03/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Several times since 2019 while driving on not straight roads(slight curves either left or right), the automatic emergency braking would activate, first I would get a big bold brake in red letters on the display. I would be looking around, no cars are coming, I'm in the correct lane, not speeding and sometimes the car would actually start applying the brake(s) when there is absolutely no reason to apply the brakes. This has happened several times while we have driven the vehicle either on a 5 to 6 hour trip and maybe has occurred a total of 5 times since we have owned the vehicle.", "fail date": "  03/09/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "When the engine is disabled the car can't be put into neutral by the operator. In my case, on 2/13/20 the starter malfunctioned at < 7000 miles-it has since been replaced. I was in a parking garage, and no structure trucks were available to tow from the spot the car was disabled. The plan was to put it into neutral and push it to the street where it could be towed. The owner's manual does not tell what to do. The dealer didn't know, either. If it's googled, a youtube video comes up, that identifies an oddly shaped device or bolt deep in the engine compartment. But even the aaa mechanic who came to the scene,with all his tools, could not get it to turn. I asked the dealership if there was any other way and ultimately they said \"no. \" they later told me, after doing some research, that Honda has a special tool, requiring three extensions, used to accomplish this during transport to the dealer. This seem quite unsafe. Obviously, cars can be disabled in many ways. Without a reasonably accessible means of putting the car in neutral, it cannot be moved in an emergency situation (for example, out of a lane of traffic). It definitely can't be done by an owner (unless, I suppose it's someone who has the ability to google during the emergency, finds the video, and has the special tool). Please note the car wash feature will not work because the engine has to be running for that. When I first brought this up, no one at the dealership knew anything about this defect. I have since learned that most cars have a shift lock override lever easily accessible in the passenger compartment, often on or near the shift console. In my conversation with the dealership,they say that 2020 Pilots and 2019 and 2020 passports also have this design. I do not know how many other vehicles are affected. This seems highly unsafe and should be addressed. Thank you.", "fail date": "  02/13/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "On two separate occasions I have experienced my car notifying me of a transmission issue and kicking it into neutral on its own. The first time this occurred back at the end of November, used auto start and got into my car shortly after. Turned on the car and placed into reverse. Still stopped, pulling up my gps and heard the alert and saw on my dashboard �stop driving when safe. Transmission problem. See manual\" it lights up that for a moment then goes away. But it shifted my car into neutral. Didn't think anything of it. Finished the the gps. Took another moment and put the car in reverse. It did it again and it was back in neutral when I was just in reverse. I called the dealership immediately. The next day car was taken to the dealership. Nothing was stored in the database. And they said they had never heard of it and couldn't find anything wrong. Fast forward to today, auto start, got into car. Placed in drive for a moment and before moving the alert came up and car was in neutral. It did it three times. Took a photo of the alert which is exactly as quoted. I am at a loss with Honda and what to do. I have also searched the owners manual and there's nothing of this quoted issue.", "fail date": "  01/19/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Engine is revving on its own @ 3000 rpm with no foot on the gas pedal or driving 15 mph and the engine is @ 4500 rpm with no foot on the gas pedal. My wife was in the pickup lane at my children's school and she told me that she had to hold the brake down & turn off the ignition because it felt like the Honda Pilot was going to accelerate on its own into the pickup line at the school. Now you see why I said this vehicle is dangerous.", "fail date": "  11/27/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Tl the contact owns a 2019 Honda Pilot. While driving at any speed, the entertainment system failed and the screen turned off and on. The contact also stated that the vehicle shook violently without warning when it struck a bump in the road. The vehicle was taken to john eagle Honda (855-562-7994, located at 5311 lemmon Ave, dallas, TX 75209) where it was diagnosed that the computer system module needed to be repaired. The contact was not informed when the repairs could be completed. The contact notified the manufacturer of the failure and informed them that she wanted a different vehicle. The contact was referred to the dealer. The vehicle was not repaired. The failure mileage was approximately 300.", "fail date": "  11/11/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Purchased the new 2019 Honda Pilot elite at around 3,000 miles. While driving around 25-30 miles per hour speed on paved roads, sometimes not all the time. The car downshifting and stalling for a few seconds before being able to accelerate again. This happen while driving on a nice sunny day with no loose gravel or rain, in a 4 way intersection making a left turn on green which made the car stalled and wasn't able to accelerate for a good 1 to 2 second. Good thing there wasn't any other vehicle that is near by. This can cause an accident and body injury! this happen during turns and straight driving. I've discuss this every time I go and get the car maintenance at the Honda dealership but they cannot duplicate the problem I've had encounter. The car as of now has 15,651 miles and downshifting and stalling comes and goes whenever it wants to its not contestant. For a new car over $50k plus not including taxes, its extremely dangerous to me and anyone who is driving or pedestrian walking near by!.", "fail date": "  07/04/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "For the second time is the last few weeks the car experienced issues after losing electrical power. It failed to start after being parked for about an hour at the airport. All sorts of warnings started randomly blinking on the dashboard. But the door, cabin lights etc all would come in when the doors were opened.", "fail date": "  10/15/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "I got my brand new Honda in 2019; the problems started right away, after a few weeks, the radio system would just turn off while driving. The whole console wouldn’t work. I would turn it on/off but still nothing. If I let the car set over night sometimes it may work the next day. They replaced my radio but it continued. Steve from Honda said it was finally in error state and it was the amplifier. Steve had ordered a new 1 & put it in 9/8/22, I thought my problems were over. On 9/12/22; I dropped my daughter off at school, I was leaving but I had to stop for traffic. I was about to pull out when the dash starting flashing/lighting up & I couldn’t go anywhere. The car was in park and I was stuck. I pushed the car into drive, ect, but it wouldn’t go. I turned the car off/on to try to restart things but nothing. The brakes then locked up and I couldn’t do anything. I tried everything that I could think, I was blocking traffic not allowing people to leave from the school and cars from coming in. I called Honda rd. Asst. But they said I had no longer a warranty as I am at 30,000 but I thought it was 36,000 miles. They connected me to aaa which I had to pay out of pocket for towing. I called steve & my serv. Advr. Adam so they knew that I was going to towed in. I couldn’t get the vehicle to turn off or on after awhile. 2 hrs. Later; the tow truck had came, he had to jump start it to get it on his truck, he toke me to Honda. I waited over 4 hrs. But steve said battery was good, he ran errors but couldn’t find anything wrong except the back up camera had an error but it seemed as though he didn’t believe that is the problem. I could take it home but he said if his wife was having issues, he wouldn’t want her to drive it. I left it w/Honda, steve toke it hm. To see if it would do what it did for me. I honestly don’t want to drive it, I am scared; what if something worse happens or pay to be towed again. I didn’t want a new vehicle to deal with issues.", "fail date": "  09/12/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "At a stop light the my car turned off and did not come back on for 5 mins. I am aware of the auto stop feature for fuel efficiency but I was in a turning lane. I literally could have been in an accident. The car brakes were locked in could not even put the car in neutral or park the car was just off completely. No signs of over heating, battery failure, etc.", "fail date": "  08/09/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Having crackling noise coming from the front dash of my car which interferes with the radio and the screen of my radio. Seems to be the electrical problem but if it’s shutting down the radio it’s possible that it could totally shut down my car while driving . It has become a safety issue. Break problem getting a pop/clicking noise in the front left & right tire has been put in shop 5 time never fixed. . They keep adding lubricant still have the same problem. . Another safety hazard. .", "fail date": "  01/17/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "On several occasions the car has flashed brake and then started braking when there has been no car in front of me.", "fail date": "  01/07/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "When driving on the interstate, car automatically applied breaks at 70+ mph bringing speed down to 55 or less as it sensed a car in the right lane. However, there was clear lanes and no potential impact for a crash. The breaking almost resulted in me getting rear ended. Also, there have been numerous instances where the car has had sensors go off for collision warnings when I am driving in the city and there is no car in sight or I am turning left at a stoplight. This is not safe and needs to be addressed.", "fail date": "  10/19/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Driving and the automatic braking engage with no vehicles around.", "fail date": "  10/12/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The auto -stop feature is now completely defective. Since I hit 30,000 miles I have had issues with it infrequently completely shutting off the engine. Now the mileage is higher, the vehicle shuts off every time I stop at light or stop sign. I have approximately 56,000 miles on the vehicle. It has been regularly serviced at the dealership. I feel this is a major safety issue since other vehicles expect me to be moving one the light etc. , changes. There are no warning lights or other symptoms prior to the failure.", "fail date": "  10/01/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "While driving during the daytime on a road without any other vehicle in front of me or behind me, my car's automatic emergency braking system engaged on its own without any reason. When I brought the car to the dealership, the service advisor told me he had been getting other complaints about the same problem for this vehicle.", "fail date": "  10/15/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "9/8/20 at 7:45am a clear sunny morning on my way to work. I was stopped at a red light and when the light turned green I pushed on the accelerator. As soon as I started to pick up speed ~15-20 mph, my Honda Pilot sensed another \"invisible\" collision hazard and engaged the automatic collision avoidance braking system. The automatic braking system slammed on the brakes and brought the vehicle to an immediate and compete stop while I was turning in the middle of the intersection and the truck behind me almost rear-ended me. This faulty automatic collision avoidance braking system slamming on the brakes for no reason at all is going to severely injure or kill someone! I am afraid to drive home from work.", "fail date": "  09/08/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "9/7/2020 around 2:15pm on a beautiful clear, sunny day, my 2019 Honda Pilot incorrectly sensed an \"invisible\" collision hazard and engaged the automatic collision avoidance braking system. There was not even a vehicle driving in front of me. My 2019 Pilot automatically slammed on the brakes and brought the vehicle to an immediate and compete stop while I was driving 55 mph on a busy highway. The vehicle behind me almost rear-ended me. This faulty automatic collision avoidance braking system, slamming on the brakes for no reason at all, is going to severely injure or kill someone!.", "fail date": "  09/07/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Honda Pilot 2019 -driving on a highway with my whole family with 3 kids at the back, at a speed ~40mph. The lane in which I was driving (right) slowed down, so moved to the left lane. That lane was also slowing as I can see the cars in the front slowing down and stopping. My attempts to stop the car proved futile. The car did not stop. 1) repeated pumping of the breaks did not yield to stop the car. Honda Pilot collided with the car in the front. 2) the cars system to slow the car while approaching a vehicle in the front did not function. 3) airbags did not deploy at all - none of the airbags deployed. - collision center was literally baffling, over this - have no clue how the airbags did not deploy with this kind of a collision. I seriously suspect that there is some thing seriously flawed. Since I'm not an automobile engineer, I'm not sure of technicality involved in this. Something went wrong terribly, that the car did not stop on braking, car did not slow down, & the airbags did not deploy. When informed about this to Honda, Honda was referring to geico, that they will do the investigation. Geico says that its not their problem and Honda should do the investigation. As a common man I would like to have this problem investigated and necessary action to be taken. I see they subrogate each other, which is not correct. I'm not sure how many cars are running in this condition on the road. Please do take necessary steps to check on this. I can give all the required documents, pictures and police reports in this regard. I need assistance in investigation of this accident and find out why the car did not respond. I see that there are other recalls with reference to Honda Pilot 2019, though my car is not on the recall, I have my doubts that there is malfunctioning component in the car, that has caused this flaw. Hoping to hear from you soon. Thank you.", "fail date": "  07/03/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "When driving the vehicle, these messages shown on the screen from time to time: brake, emission systems problems and low tire pressure.", "fail date": "  06/30/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The contact owns a 2019 Honda Pilot. The contact stated while driving at an undisclosed speed, the vehicle stalled and failed to restart. The contact stated that several unknown warning lights were illuminated. The contact stated that the brake pedal was difficult to depress while starting the vehicle. The vehicle was towed to the local dealer however, the mechanic was unable to duplicate the failure. The vehicle was taken back to the local dealer where it was diagnosed that the battery needed to be replaced. The contact stated the failure was related to NHTSA action number: pe22005 (engine and engine cooling). The vehicle was repaired however, the failure recurred. The manufacturer was not contacted. The failure mileage was unknown. The VIN was not available.", "fail date": "  01/01/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "When driving my Honda Pilot the automatic emergency braking system has engaged multiple times (3-4 times with me, and once with my husband driving) in the middle of driving with there was no reason for the braking to occur - meaning there were times when no cars were even in front of me. When this happens the orange brake warning shows up on my dashboard advising \"brake\" and my car jolts forward to strongly break. There has not been a recall on this issue, therefore, there has not inspection on my car specific to this issue. When this occurs it causes extreme panic on unawareness of what is going on. There is a threat of a crash behind me, especially when driving on roads 55 mph, when the car all of a sudden out of nowhere comes to almost a complete stop. Also, it extremely distracts me due to the suddenness of this issue without any perceived warning. Therefore, I quickly try to understand if I do need to swerve or figure out how to quickly speed up after it brakes so no cars hit me from behind. Then it takes me awhile to calm down and understand what happened.", "fail date": "  12/07/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "My vehicle is automatically braking at high speeds for no reason. Ive travelers at over 50 mph on highways and it just suddenly slams on the brakes where I've almost been rear ended a few times. It's been in the dealership and they keep claiming nothing is wrong.", "fail date": "  11/01/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Brakes are ridiculously slow. Brake response time is very slow even though speed is within 30 miles per hour or less. You literally have to push paddle completely down to the floor and even after that it won't stop immediately. Car stops very slow. So considering situation (driving in street and child pops up in front of car) if you have to stop suddenly you not gonna make it unless you use emergency brake of the car. Honda must fix the issue otherwise someone will lose life for sure. Also, weirdly car moved forward little bit when I just pushed start button to start the car even after brake paddle was pushed down position and touching gas paddle at all. I was bit surprised and thankfully it was in parking lot so didn't hit anyone. I am going Honda dealership to check with them if they can check and do something to make brake more responsive and tight. This is just second day of car and this crap happening. I am bit scared, disappointed and frustrated.", "fail date": "  10/06/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The transmission has slipped now twice while driving. Once on the highway and again yesterday after turning right onto a busy narrow road. The navigation system and screen display has blacked out and become non-functional while driving at least 6-7 times (no radio, navigation, or anything functions when this occurs). The car has had to be turned off in order reset the screen and function again. It is not possible to turn off the car when driving on a highway or narrow country road. Lastly, the car has breaked unnecessarily on several occasions despite adjusting the settings to not be overly sensitive. Once it came to a complete stop unnecessarily, thankfully no one was behind me. It has started breaking unnecessarily while driving on a highway and on a country road when no vehicles or anything were around. These situations have been scary and unsettling.", "fail date": "  09/14/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "When driving on some rural roads where line is clearly present in road my car automatically applies brakes as crash avoidance when oncoming car is coming that is clearly in its own lane. This has happened multiple times and Honda was notified and does not seem concerned about this safety issue but is aware that it happens.", "fail date": "  06/01/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Automatic braking (collision) mitigation activates erroneously. Upon slight right curve in road, detects opposing traffic as collision. Applies brakes. Even upon setting system to least sensitive, still exhibits condition. Continues to occur multiple times per week.", "fail date": "  06/01/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "When the brakes are needed suddenly the brake pedal travel is to excessive. The brakes are slow to respond as if they are not working and then they grab suddenly with the brake pedal almost to the floor. This is very unnerving as you think you are loosing control of the car. Normally I have to tap the brake pedal let off and get back on the brake pedal quickly for the brakes to respond normally or have a good brake pedal feel. I am getting tired of doing this every time to stop the vehicle. Honda cannot be serious that this is normal. This is an accident waiting to happen.", "fail date": "  03/01/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Brakes are extremely slow to react and very mushey when they do. Holding the brke pedel hard takes the pedal to the floor. When service rep was asked to adjust, they stated, all Pilots are like this. This is an accident wating to hpen.", "fail date": "  10/01/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "I drove our Honda Pilot during a moderate snow storm. The collision avoidance system repeatedly recognized the snow as a vehicle and repeatedly applied the brakes at highway speed in heavy traffic. It happened from davenport, IA to des moines, IA on 14 Jan 22. It also repeatedly tried to steer because the lane keeper assist kept malfunctioning. On Sunday 16 Jan 22 we returned from des moines to davenport and it repeatedly happened again. On Sunday the roads were clear and there wasn't any precipitation in the air. I washed the windshield and wiped off the sensor panel but it didn't stop. The Honda dealer in moline, IL told me that there was nothing they could do. They said that happens in snow and rain and that I should wash the vehicle. The vehicle is malfunctioning and dangerous. It randomly applies the brakes and tries to steer itself at highway speed if there is any obstruction to the sensors. I had to fight the steering wheel to keep it on the road when driving down the middle of the lane. Having the car applying the brakes randomly at highway speed is also incredibly dangerous. I can't control how close semi trucks follow and several almost rear ended me. They also got very upset because they thought I was doing it on purpose. I can't wash the vehicle every time it snows or pull over every time it rains hard. The dealers suggestions are not practical. The malfunctioning lane keeper assist and automatic breaking on this vehicle is an accident waiting to happen. Or it's already happened and isn't getting the credit it deserves. The lane keeper assist and automatic breaking also can't be turned off, and shouldn't have to be.", "fail date": "  01/14/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "When driving on the interstate, car automatically applied breaks at 70+ mph bringing speed down to 55 or less as it sensed a car in the right lane. However, there was clear lanes and no potential impact for a crash. The breaking almost resulted in me getting rear ended. Also, there have been numerous instances where the car has had sensors go off for collision warnings when I am driving in the city and there is no car in sight or I am turning left at a stoplight. This is not safe and needs to be addressed.", "fail date": "  10/19/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Honda Pilot 2019 -driving on a highway with my whole family with 3 kids at the back, at a speed ~40mph. The lane in which I was driving (right) slowed down, so moved to the left lane. That lane was also slowing as I can see the cars in the front slowing down and stopping. My attempts to stop the car proved futile. The car did not stop. 1) repeated pumping of the breaks did not yield to stop the car. Honda Pilot collided with the car in the front. 2) the cars system to slow the car while approaching a vehicle in the front did not function. 3) airbags did not deploy at all - none of the airbags deployed. - collision center was literally baffling, over this - have no clue how the airbags did not deploy with this kind of a collision. I seriously suspect that there is some thing seriously flawed. Since I'm not an automobile engineer, I'm not sure of technicality involved in this. Something went wrong terribly, that the car did not stop on braking, car did not slow down, & the airbags did not deploy. When informed about this to Honda, Honda was referring to geico, that they will do the investigation. Geico says that its not their problem and Honda should do the investigation. As a common man I would like to have this problem investigated and necessary action to be taken. I see they subrogate each other, which is not correct. I'm not sure how many cars are running in this condition on the road. Please do take necessary steps to check on this. I can give all the required documents, pictures and police reports in this regard. I need assistance in investigation of this accident and find out why the car did not respond. I see that there are other recalls with reference to Honda Pilot 2019, though my car is not on the recall, I have my doubts that there is malfunctioning component in the car, that has caused this flaw. Hoping to hear from you soon. Thank you.", "fail date": "  07/03/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "My 2019 Honda randomly brakes while I'm driving almost causing someone to rear end me, and other times almost causing me to be in accidents. In addition, at 19k miles my transmission went out (started catching, making a grinding noise) while I was driving on the interstate and caused the vehicle to decelerate. I pulled off the road turned the vehicle off, once restarted it decelerated and the transmission light, emissions light and blind spot light came on the dash board.", "fail date": "  12/28/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "The driver display and the infotainment system of the Honda Pilot continuously goes blank and not sure what other effects it has on the vehicle as the drive is unable to see the speed they are driving or if anything else is working in the vehicle. This is a safety hazard especially when using speed control or other devices. This happens in motion, on highways, city streets, and stationary. First the infotainment system does blank and the driver settings,.", "fail date": "  12/20/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "The digital speedometer and infotainment system shut off and restart at random. In addition, the speakers crackle, the radio stops working, the backup camera does not always engage when going in reverse. The digital speedometer screen has turned off twice and the only (temporary) solution was for the dealer to reset the system.", "fail date": "  11/15/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "\"network connection lost\" when using infotainment system. Dash/speed cluster goes black and reboots in mid drive. \"fm unavailable\" displayed when listening to radio. Collision warning \"brake\" message displays randomly. Sandy/popping noises randomly in speakers. All of these I can not reproduce on the spot, it is random that I can tell at this point.", "fail date": "  11/11/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Speedometer and control head completly blank-- dead.", "fail date": "  10/28/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "I purchased the vehicle on August 10, 2019. Within 2 weeks the radio began making a popping and cracking sound that sounded like rocks hitting the windshield. This sound happens daily when I drive the vehicle. About one week after this happened, the dvd player would stop working and the sound from the radio would begin to completely go out. It would come back on eventually, sometimes as much as 30 - 45 minutes later. After about two weeks, these problems continued and the screen for navigation, along with the speedometer screen would completely go black while the vehicle was in motion. It restarts after about 10 - 20 seconds. In two instances the rear backup camera has shut off while I was backing up as well. I have reported the issue to two dealerships including the one where I made the purchase. I am scheduled to take it in to have repairs done tomorrow.", "fail date": "  09/28/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Purchased the new 2019 Honda Pilot elite at around 3,000 miles. While driving around 25-30 miles per hour speed on paved roads, sometimes not all the time. The car downshifting and stalling for a few seconds before being able to accelerate again. This happen while driving on a nice sunny day with no loose gravel or rain, in a 4 way intersection making a left turn on green which made the car stalled and wasn't able to accelerate for a good 1 to 2 second. Good thing there wasn't any other vehicle that is near by. This can cause an accident and body injury! this happen during turns and straight driving. I've discuss this every time I go and get the car maintenance at the Honda dealership but they cannot duplicate the problem I've had encounter. The car as of now has 15,651 miles and downshifting and stalling comes and goes whenever it wants to its not contestant. For a new car over $50k plus not including taxes, its extremely dangerous to me and anyone who is driving or pedestrian walking near by!.", "fail date": "  07/04/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "When driving on some rural roads where line is clearly present in road my car automatically applies brakes as crash avoidance when oncoming car is coming that is clearly in its own lane. This has happened multiple times and Honda was notified and does not seem concerned about this safety issue but is aware that it happens.", "fail date": "  06/01/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "When driving the car, the instrument panel (including the speedometer) will shut off for approximately 2 minutes, and the reboot. This result in the inability to tell exactly how fast the vehicle is moving. This will occur under multiple conditions while the car is in drive, and is not dependent on the type of road being driven on. Additionally, the center console infotainment screen, which also serves as the screen for the back up camera will shut off, for varying amounts of time, rendering the ability to see/use the back up camera useless. I have encountered, on numerous occasions, both systems shutting off at the same time, while the car is in drive or reverse, leaving me with the unable to safely gauge how I am operating the vehicle.", "fail date": "  03/31/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Recurrent problem. Started when vehicle was 2 months old. Taken car to dealer service department. No solution. When in motion (highways, city roads) speakers make a sparkling sound followed by the entertainment screen ( navigation, handheld phone, rear vision. . . ) and the odometer screen (speed display, all the signals) became dead. It could last few seconds and reboot back or up to 30 minutes. In a 15 mile journey , could happen around 15 times. So the dangerous situation is that I am driving with no idea how much speed I am going, I am not able to use my handheld phone (also very important to me as a busy doctor trying to answer emergency calls), no navigation system available, the rear vision camera becomes useless with a blank screen. . . I learnt from the internet that this is an ongoing problem and no solution have been found. Problem happens in motion and also or when car is parked. My car is 4 months old and has spent several days at the dealer service department and at the last visit I was given a report in which states that Honda is studying a new software update. I don't want risk my family or others life's so waiting is not an option. This is not just one incident , it keeps recurring we bought the car brand new from the Honda dealer in November 2018. I have videos to provide proof (can not attach them).", "fail date": "  03/16/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "With the Honda Pilot stopped, the engine shut off with the auto engine idle stop feature, but recently when pressing the accelerator pedal the car stalled out and turned off completely including disconnecting blue tooth and audio and display. This has happened one time where it completely shut off instead of restarting when pressing accelerator - but has also had exceptionally long \"stall out\" timing several other times when accelerator is pressed after stopping at stop light or stop sign. This is a concern as the car is stopped when other cars anticipate the vehicle to move forward with traffic and could result in a rear end collision. There was a warning lamp message that flashed on and a dinging - similar to when the car starts initially.", "fail date": "  10/25/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Today is the 6th time our Honda has had issues either the automatic start/stop system failing when at a stop light. The car will stop and shut off like it is supposed to, but will not restart. Car needs to be put into park, turned off, restarted, shift back into drive. This happens while we are at risk of being hit from behind, honked at, and creates an unsafe and stressful driving situation. Car has had infotainment issues that seemed to be fixed, but had issues prior to today’s incident. Car has been only serviced at Honda. No warning lights etc. This issue was reported to our dealer last December and they said the could no replicate the issue. In August this happened again immediately after having the car serviced for an oil change. The car is putting my family and others at risk and there seems to be many others with this same problem happening.", "fail date": "  10/23/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "While driving, a light came on for emissions systems failure. The vehicle seemed to not accelerate properly like it was pulling. I feared for the safety of my children. This is our only vehicle. My husband took it to the Honda dealership. He got told that there is an issue with the fuel injector and timing belt. After research, we discovered both these issues have been added to a Honda recall list for our year and model vehicle. When my husband asked the Honda service team about it, they said yes, but our VIN isn't covered. We are having the exact same issues as the recall.", "fail date": "  09/22/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Check engine light code p219b “check emissions system” fuel injectors needed to be replaced at only 32,000 miles. Vehicle was out of standard factory warranty by 6 months but under 36k. Honda did replace them under the service bulletin. Just wanted to report so they hopefully keep covering for others as this is an expensive repair.", "fail date": "  09/21/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "My car started jerking and then started to get a loud noise. Took it to the dealer and they said has to do to with the fuel pump and to replace/fix it's costing over 3500. 00. I noticed that are recalls for Honda Pilot from 2018 to 2020 on fuel pumps. However, there is not a recall on the care yet. How to resolve this issue.", "fail date": "  09/16/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "The engine fails to restart on its own from a complete stop at a traffic light or road intersection with the auto start/stop function engaged. This is the third time has occurred. Many people online are reporting the same issue.", "fail date": "  09/12/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "I got my brand new Honda in 2019; the problems started right away, after a few weeks, the radio system would just turn off while driving. The whole console wouldn’t work. I would turn it on/off but still nothing. If I let the car set over night sometimes it may work the next day. They replaced my radio but it continued. Steve from Honda said it was finally in error state and it was the amplifier. Steve had ordered a new 1 & put it in 9/8/22, I thought my problems were over. On 9/12/22; I dropped my daughter off at school, I was leaving but I had to stop for traffic. I was about to pull out when the dash starting flashing/lighting up & I couldn’t go anywhere. The car was in park and I was stuck. I pushed the car into drive, ect, but it wouldn’t go. I turned the car off/on to try to restart things but nothing. The brakes then locked up and I couldn’t do anything. I tried everything that I could think, I was blocking traffic not allowing people to leave from the school and cars from coming in. I called Honda rd. Asst. But they said I had no longer a warranty as I am at 30,000 but I thought it was 36,000 miles. They connected me to aaa which I had to pay out of pocket for towing. I called steve & my serv. Advr. Adam so they knew that I was going to towed in. I couldn’t get the vehicle to turn off or on after awhile. 2 hrs. Later; the tow truck had came, he had to jump start it to get it on his truck, he toke me to Honda. I waited over 4 hrs. But steve said battery was good, he ran errors but couldn’t find anything wrong except the back up camera had an error but it seemed as though he didn’t believe that is the problem. I could take it home but he said if his wife was having issues, he wouldn’t want her to drive it. I left it w/Honda, steve toke it hm. To see if it would do what it did for me. I honestly don’t want to drive it, I am scared; what if something worse happens or pay to be towed again. I didn’t want a new vehicle to deal with issues.", "fail date": "  09/12/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "While coming to a stop light auto start/stop activated when releasing brake pedal car failed to restart. Needed to enter vehicle into park and restart car with push button to resume.", "fail date": "  09/03/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Auto engine shut off will turn off engine at stoplight but fail to restart engine when brake is released. Extremely unsafe. It has happened multiple times and each time we are afraid there will be an accident because we are sitting ducks and not accelerating when traffic expects us to.", "fail date": "  08/21/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "The vehicle in question has the idle stop function, which turns off the vehicle when certain conditions are met. Randomly, the vehicle does not restart on its own which forces me to power cycle the vehicle in order for it to start back up. This is a safety issue because the vehicle has been stuck in the middle of an intersection while I am trying to get it restarted. If the vehicle were to be completely disabled, I could be stuck causing a hazard at any given intersection. I have had the vehicle inspected and the battery tested, but everything checks out ok. I don't feel very safe when the vehicle can just shut off randomly and not restart. I have noticed sometimes, when the vehicle does restart, the dash flashes a warning that says, \"collision mitigation braking system problem\" for a split second and then it clears.", "fail date": "  08/16/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Auto stop start is erratically failing to properly restart the car after brake has been disengaged. After arriving at a complete stop, the vehicle will properly shut down when the driver’s foot is on the brake. When the driver disengages the brakes, the engine should promptly restart and the car will find itself already in drive so it can continue to move forward. Under certain unknown circumstances, the car will stall and not be allowed to restart. In order to continue, I needed to shift the car to park, turn the car off completely, and then restart the car. Only then can I shift the car back to drive and continue. This presents a safety issue since once the brakes are removed, traffic behind interprets this action to mean you will be traveling forward shortly. The restart is sometimes accompanied by a lurk which might be also considered as moving forward. This vehicle has not been in a accident and the dealer was not able to reproduce this issue. The issue seemed to occur shortly after another recall was performed for the fuel pump. Auto stop start cannot be permanently disabled and needs to be performed each time the car is started. This circumstance seems documented in pe22005.", "fail date": "  06/29/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "In June of 2022 my car started to buck and stalled out; I had to get it towed to huntington Honda. The dealership told me that the fuel pump failed do to corrosion and it was not covered under my warranty. I did have to go through insurance. I have no idea how the male pin in the fuel pump corroded and broke off inside the connector and neither did the service advisor. Honda America spoke with the dealership after the car was fixed and concluded that is was corrosion. I have always taken care of my car and cannot understand how that part even became corroded. Please help me in this matter as this could be happening to others. Honda America and06/18/2022 the dealership where no help at all. My # is 631-972-5301. Please feel free to contact me with any questions. Your help is very much appreciated.", "fail date": "  06/19/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "We have had a check engine light going off and on for a few days now. Car sputtering. Almost like no power at times and quick to slow down. We brought it to a Honda dealership and determined it had faulty fuel injectors. I was told there is a campaign on the issue now. But we would have to pay 40% of the repair cost. I believe it to be a dire safety issue. So we are paying for the repair. I was also told there is no recall on it for our VIN but similar vehicles with similar issues come through there all the time.", "fail date": "  05/14/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Car stalls at a stoplight. Battery was completely depleted so it wouldn't restart. I couldn't even open the windows on a hot day b/c the battery was depleted. Honda dealer in richmond California tells me they can't replicate the issue and all the diagnostic tools they have indicate no problems. This is a serious safety issue that must be addressed.", "fail date": "  10/01/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "May 2021, I received a recall letter from Honda automobile division regarding my 2019 Honda Pilot vehicle that may have a fuel pump module with, out of specification impellers. I purchased my new 2019 Honda Pilot, June 2019, from Honda of kingsport. I scheduled the recall fix on Tuesday, June 1, for Friday June 4, 7am. Lilly, the young lady that scheduled the maintenance appointment verified that Honda of kpt would have me a loan car ready to go when I arrived on Friday morning. 6pm, Thursday night (6/3/21) the evening prior to my service recall appointment, I receive a call from a steve mccoy with Honda of kingsport. He says he will not be able to accommodate the loaner car. When I challenge him, he then says he will be able to provide me a loan car. I ask him exactly what they will be doing and he proceeds to tell me they remove the back seat of the vehicle, go through an access door. . . . In the cab of the vehicle, remove the fuel pump through the cab of the vehicle, and replace the fuel pump with a new fuel pump. He verified that this fix will result in gas fumes in the cab of my vehicle!!!! I am a 66yo, type 1 diabetic. I cant have interior painting done in my home, without leaving and Honda expects me to drive a vehicle with strong gas fumes in the cab impacting my health! Honda will need to provide me a loan car for a week until the gas fumes are no longer in the cab of my car! please help me?.", "fail date": "  06/02/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Cars jerks when accelerating or cruising at lower speeds.", "fail date": "  04/02/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Engine is revving on its own @ 3000 rpm with no foot on the gas pedal or driving 15 mph and the engine is @ 4500 rpm with no foot on the gas pedal. My wife was in the pickup lane at my children's school and she told me that she had to hold the brake down & turn off the ignition because it felt like the Honda Pilot was going to accelerate on its own into the pickup line at the school. Now you see why I said this vehicle is dangerous.", "fail date": "  11/27/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "This is a 2019 Honda Pilot with start stop function. There is a noticeable delay in activation and getting longer with time; this is a 3 year old vehicle. During 2 other instances, the system failed and vehicle would not start on a public street. During these failures and delays, other than the obvious collision safety issue, the safety systems are unavailable via a message on the dash. When it eventually starts back up it functions normally. This is clearly the system prematurely failing or the system prematurely killing the battery (which has a normal functional life of 5 - 7 years).", "fail date": "  10/15/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "The engine start/stop idle does not start up again after the car stops when at a red light or in traffic.", "fail date": "  08/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "I currently have a 2019 Honda, Pilot with approximately 70,000 miles. I have had problems with the idle stop feature since the first year of owning the vehicle. I have had many instances of a restart resulting in actuating the warning lights on my instrument panel and a few times when my vehicle did not restart. My dealer either was not able to diagnose the problem or did not know how. I even paid to have my battery replaced, which helped elevate the problem but did not fix it. I also either have a problem with the automatic braking system giving me a warning or in some instances actually applying the brakes when there is no traffic. Both of these are reoccurring and on-going problems.", "fail date": "  06/28/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "2019 Honda Pilot collision mitigation system flashing brake on screen average 3 times per day. Includes shaking of steering wheel & if cruise control on, braking. All this is happening when there is nothing blocking car. If cruise control on & need to respond to car that just pulled in front of me on highway, because the brake pedal is already suppressed by the car I can not respond properly. The only thing I have found to override the car is to push the gas pedal, which is also very dangerous!! please help!! this is so dangerous. If something is actually happening on the road it is difficult to think about how to respond because the car is freaking out. The ability to think clearly & respond to unsafe situations is so important in those first few seconds. Honda mechanic said this is ‘just a side effect’ of a self driving car feature (cruise control) until Honda improves technology. There is no way to turn off collision mitigation breaking system permanently.", "fail date": "  03/18/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "I have had the assisted emergency braking deploy itself with the brake light blinking on the dash board when there is no reason for it to engage. No traffic around, just a sudden braking which pushes you forward in your seat and quickly scan all around you for impact which is not going to occur. I have heard of this happening to others but this has happened to me about 6 times and my husband has had it twice.", "fail date": "  02/08/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "I drove our Honda Pilot during a moderate snow storm. The collision avoidance system repeatedly recognized the snow as a vehicle and repeatedly applied the brakes at highway speed in heavy traffic. It happened from davenport, IA to des moines, IA on 14 Jan 22. It also repeatedly tried to steer because the lane keeper assist kept malfunctioning. On Sunday 16 Jan 22 we returned from des moines to davenport and it repeatedly happened again. On Sunday the roads were clear and there wasn't any precipitation in the air. I washed the windshield and wiped off the sensor panel but it didn't stop. The Honda dealer in moline, IL told me that there was nothing they could do. They said that happens in snow and rain and that I should wash the vehicle. The vehicle is malfunctioning and dangerous. It randomly applies the brakes and tries to steer itself at highway speed if there is any obstruction to the sensors. I had to fight the steering wheel to keep it on the road when driving down the middle of the lane. Having the car applying the brakes randomly at highway speed is also incredibly dangerous. I can't control how close semi trucks follow and several almost rear ended me. They also got very upset because they thought I was doing it on purpose. I can't wash the vehicle every time it snows or pull over every time it rains hard. The dealers suggestions are not practical. The malfunctioning lane keeper assist and automatic breaking on this vehicle is an accident waiting to happen. Or it's already happened and isn't getting the credit it deserves. The lane keeper assist and automatic breaking also can't be turned off, and shouldn't have to be.", "fail date": "  01/14/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "On several occasions the car has flashed brake and then started braking when there has been no car in front of me.", "fail date": "  01/07/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "When driving on the interstate, car automatically applied breaks at 70+ mph bringing speed down to 55 or less as it sensed a car in the right lane. However, there was clear lanes and no potential impact for a crash. The breaking almost resulted in me getting rear ended. Also, there have been numerous instances where the car has had sensors go off for collision warnings when I am driving in the city and there is no car in sight or I am turning left at a stoplight. This is not safe and needs to be addressed.", "fail date": "  10/19/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "Driving and the automatic braking engage with no vehicles around.", "fail date": "  10/12/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "While entering the express lane on I-595 e my Honda 2019 Pilot unexpectedly reduced speed applying the brakes. There were no cars in front or behind me and the yet the emergency braking system was applied. This could have caused a rear end collision. In speaking with a local Honda service dealer he had said that this had also happened to him twice. My incident occurred approx. 1 year ago. I've also read that this issue has been identified in Honda cr-v's and accords.", "fail date": "  07/12/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "Several times since 2019 while driving on not straight roads(slight curves either left or right), the automatic emergency braking would activate, first I would get a big bold brake in red letters on the display. I would be looking around, no cars are coming, I'm in the correct lane, not speeding and sometimes the car would actually start applying the brake(s) when there is absolutely no reason to apply the brakes. This has happened several times while we have driven the vehicle either on a 5 to 6 hour trip and maybe has occurred a total of 5 times since we have owned the vehicle.", "fail date": "  03/09/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "When driving my Honda Pilot the automatic emergency braking system has engaged multiple times (3-4 times with me, and once with my husband driving) in the middle of driving with there was no reason for the braking to occur - meaning there were times when no cars were even in front of me. When this happens the orange brake warning shows up on my dashboard advising \"brake\" and my car jolts forward to strongly break. There has not been a recall on this issue, therefore, there has not inspection on my car specific to this issue. When this occurs it causes extreme panic on unawareness of what is going on. There is a threat of a crash behind me, especially when driving on roads 55 mph, when the car all of a sudden out of nowhere comes to almost a complete stop. Also, it extremely distracts me due to the suddenness of this issue without any perceived warning. Therefore, I quickly try to understand if I do need to swerve or figure out how to quickly speed up after it brakes so no cars hit me from behind. Then it takes me awhile to calm down and understand what happened.", "fail date": "  12/07/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Back Over Prevention", "Sub Problem": "Rearview System Braking problems", "description": "What component or system failed or malfunctioned, and is it available for inspection upon request? - rear view camera how was your safety or the safety of others put at risk? -I am unable to view if anything is obstructing my vehicle. Has the problem been reproduced or confirmed by a dealer or independent service center? I will be taking it in on 9/29 for diagnosis, seeing that my VIN is not eligible for bulletin 20-051 when bulletin states \" the rear view camera may not display when shifting to reverse\" service bulletin 20-047 was previously done on the 25th of September. Also, at the same time the rear camera stopped working, the rear wiper also stopped working. Has the vehicle or component been inspected by the manufacturer, police, insurance representatives or others? no, it was not. Were there any warning lamps, messages or other symptoms of the problem prior to the failure, and when did they first appear? no, I had no indication prior to failure.", "fail date": "  09/20/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Back Over Prevention", "Sub Problem": "Rearview System Braking problems", "description": "The infotainment screen goes black. No rear camera view shown when reversing. Vehicle was being driven on a public street.", "fail date": "  04/11/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Front end impact into another vehicles passenger side. Other drivers side impact bags deployed mine did not. Seat belt pin engaged on my vehicle.", "fail date": "  11/27/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "When driving the vehicle, these messages shown on the screen from time to time: brake, emission systems problems and low tire pressure.", "fail date": "  06/30/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Engine is revving on its own @ 3000 rpm with no foot on the gas pedal or driving 15 mph and the engine is @ 4500 rpm with no foot on the gas pedal. My wife was in the pickup lane at my children's school and she told me that she had to hold the brake down & turn off the ignition because it felt like the Honda Pilot was going to accelerate on its own into the pickup line at the school. Now you see why I said this vehicle is dangerous.", "fail date": "  11/27/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Engine acceleration suddenly degrade in the highway 50 miles seems running like 20 miles even pressing the gas hard. Also water coming from no where on the driver side floor when it rain hard or light notice this since the day I bought it.", "fail date": "  12/05/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "The radio in this vehicle freezes, produces static feedback and electrical feedback while operating the touchscreen. Sound from the speakers becomes distorted and lacking power. Electrical surging can be heard. This occurred within the first 1000 miles since purchased new. Rear hatch alignment was also not installed properly from the factory and required a body shop to attach it correctly. Seat fabric material was also defective and coming apart.", "fail date": "  05/01/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "The passenger side mirror won't stay at the proper adjustment. You set it and it drops in a few minutes so you can't see the cars behind you. When you drive you have to keep adjusting the mirror. It's a small problem but could be a big problem if there is an accident.", "fail date": "  02/06/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Lane Departure", "Sub Problem": "Warning problems", "description": "\"check engine\" light comes on, followed by \"emissions system\" problem, then \"awd\" problem, and also \"transmission\" light with a message to pull over and find a safe location. Have brought in for the \"emissions systems\" problem and awd multiple times, but problem re-appears within a day. Uploading one invoice of many.", "fail date": "  09/26/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Lane Departure", "Sub Problem": "Warning problems", "description": "Vehicle is equipped with auto engine shutoff when vehicle stops. It started failing and has caused the car to stall at red light. Purchased vehicle 4 months ago.", "fail date": "  09/09/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Exterior Lighting problems", "description": "Speedometer and control head completly blank-- dead.", "fail date": "  10/28/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Exterior Lighting problems", "description": "1st problem. . . Video display worked only intermittently. 1st visit, wolfchase Honda updated software, problem continued. 2nd visit they replaced video unit. 2nd problem. . . Speakers started making crackling noise. Went on their site to make appt and received a notice that ot a recall notice about electrical issue (or a fleet campaign not sure which). They updated software on that 3rd visit. Speaker problem worsened after that visit and speedometer display and video (stereo system, navigation etc) would blank out while driving. System would generally reset but only after 30 seconds of non visibility to my speed, cruise control status etc. . Took it back for 4th visit. They stated they found an issue with tailgate sensor. Picked it up on Friday oct 4th and it started making the crackling noise in the speakers again yesterday, oct 5th. Last time, it eventually got worse until speedometer stopped working. Plan to make another appt (my 5th) this week. Craclking noise occurs when stopped, when driving, when vehicle is turned off (after being on). Video and speedometer display stop working when driving.", "fail date": "  10/02/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2019 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Exterior Lighting problems", "description": "The vehicle was advertised with �led� low beam lights. It has halogen.", "fail date": "  12/21/2018"}]