[{"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "My children bought this vehicle for me because I lost my job due to covid aftereffects and I had to return my kia soul 2014 to the creditors. I was delivering food boxes to the elderly when the at temp light came on and the transmission started to lockup I had to pullover because the car was running hot. It was very frightening so I couldn't get home. I have never had that happen to me. Goggleing this Honda brand there has been several complaints about this model but no Honda recall this car is dangerous! and should be either recalled or taken off the market as nto to never be ever resold.", "fail date": "  03/02/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Tl- the contact owns a 2005 Honda Pilot. The contact stated that while driving about 20 mph, the vehicle accelerated out of control, and crashed into a stationary police cruiser. There was no warning. The air bags did not deploy. A police report was filed. The driver and the front passenger sustained injuries that did not require immediate medical attention. The contact's vehicle was damaged and was towed to a tow yard. The dealer was not called and the manufacturer was not made aware of the failure. The contact stated that two weeks earlier, while driving about 10 mph, the brakes locked up momentarily and released when the contact stepped on the fuel pedal. The failure mileage was approximately 190,000. Fe.", "fail date": "  09/06/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The contact owns a 2005 Honda Pilot. While the vehicle was in park and the key was not near the vehicle, the gear shifted independently. As a result, the vehicle crashed into the neighbor's yard. The contact was in the vehicle cleaning it out at the time of the failure. The contact sustained a concussion to the head and injuries to the neck, back, and left leg that required medical attention. The vehicle was taken to union park Honda (1704 pennsylvania Ave, wilmington, DE 19806), but the cause of the failure was undetermined. The body damages were repaired. The manufacturer was not notified of the failure. The approximate failure mileage was 144,000.", "fail date": "  09/23/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "My vsa light and my vtm-4 wheel light came on. When I attempted to push on the gas petal it would accelerate. I was driving on a city street going home.", "fail date": "  04/04/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "There is vibration when accelerating between 35-45 mph. Seems there issue with transmission which is common among other ownwers.", "fail date": "  12/17/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "D light started blinking as I was going down the interstate. After I stopped I check gas cover and transmission fluid levels. Both ok. Happened again so I went to get code read. . . Throwing code p0872 and code 0700. I had this problem a few years ago and Honda fixed problem for almost $500. Why is it happening again?.", "fail date": "  11/05/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Traveling about 35 to 45mph we feel a shutter once you speed up it goes away. Also see a flutter in engine rpm.", "fail date": "  09/25/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "My Pilot 2005, 45000 mls. Is running very good but from 3 month ago the engine light is on and the vtm-4 is on at the same time some times in off and always back. This happen when the engine start and stay on, sometimes on the road is off back again on engine light and vtm-4.", "fail date": "  07/04/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Traction control system (vsa) light came on. Took to mechanic, who advised me of recall and that I should take to dealer. I took vehicle to dealer, who tells me that the car is not under the March, 2013 recall, even though my vehicle issues are the same as the issues which led to the 2013 recall.", "fail date": "  05/10/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "When I am going in a speed range about 35 mph I get like shudder/grindingâ  sound coming out of the bottom of the Pilot. I am getting very concern because I've driven other Pilots and they all do the same and they shouldn't be doing this noise.", "fail date": "  12/25/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Tl-the contact owns a 2005 Honda Pilot. The contact stated while driving approximately 10 mph, the gas pedal was depressed and failed respond with out warning. The vehicle was towed to a mechanic where it was diagnosed that the radiator and the transmission needed to be replaced. The vehicle was not repaired. The manufacturer was not notified of the issue. The failure mileage was 137000. Ss.", "fail date": "  09/15/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "I had been driving for about 15 minutes when car suddenly failed to maintain speed and slowed from 45 mph to 30-35 mph. I could not get car to accelerate, engine was audibly strained and smoke was shortly evident from under hood. I put on my emergency flashers and pulled off the road as soon as it was safe to do so. No warning lights were illuminated. Smoke ceased when I turned the engine off. Upon exiting the car I observed a heavy stream of brown oily liquid draining from hood and additional blue oily fluid following shortly thereafter. I checked the fluid levels to find totally depleted transmission fluid and rapidly diminishing engine coolant. I called my Honda dealer service dept. And was advised not to drive the car and to have it towed to the service dept. Which I did. It was determined that a hose had disconnected and the radiator would need replacement. He could offer no explanation as to what caused the problem stating it had not seen it before. Total cost: $825. 00. Given the many internet complaints of this identical problem unreported to official agencies combined with those reported to Honda corporate and nhsta I am unconvinced that all Honda dealerships are unaware of this issue. I am, however, totally convinced that serious injury or death would have resulted had I been driving on a crowded highway at 70 mph when this hose disconnected causing an instantaneous loss of speed with impending engine failure. I am equally convinced that Honda corp. Is negligent in not admitting this to be a manufacturing defect worthy of a voluntary recall and financial reimbursement to it's customers. Nhsta is negligent in it's lack of attention to the serious nature of this problem and failure to mandate a recall.", "fail date": "  07/16/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Transmission overheated, over pressurized and sprayed out bleeder valve.", "fail date": "  07/05/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The d light is flash. So there are something warning my transmission I think my transmission is going to be fail. We know that Honda, Pilot 2004 had recall for this. Would you please have my 2005 recall transmission? I worry to drive it now, cause of safety reason and also the cost of repair. Since this car only 58,485 miles. It doesn't make sense the d light is flash with this miles. Please help! thankyou.", "fail date": "  04/19/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The contact owns 2005 Honda Pilot. The contact stated while driving approximately 55 mph, the vehicle over heated and stalled without warning. The vehicle did not restart. The vehicle was towed to the contacts residence. An independent mechanic stated that the transmission pushed water into the radiator and the transmission needs to be replaced. The vehicle was not repaired. The manufacturer was notified of the failure. The approximate failure mileage was 200,000.", "fail date": "  03/27/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The contact owns a 2005 Honda Pilot. The contact stated that while driving 60 mph, the vehicle exhibited a reduction in power. The vehicle was towed to the dealer for inspection where they stated that the radiator and transmission needed to be replaced. The vehicle was not repaired. The manufacturer was notified of the failure. The failure mileage was 125,000.", "fail date": "  03/01/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Transmission cooler line inside radiator failed combining fluids and causing the transmission to malfunction. Loss of ability to drive/move vehicle with family in the vehicle. This is a common failure and requires a new radiator and replace / rebuild the transmission. A recommendation from Honda to replace the radiator every 100,000 miles would have prevented having to replace / rebuild the transmission. Subsequent to repair, oil remains in the coolant system and has caused failure of a coolant line due to over-pressurization. The vehicle, with multiple children in it, has been stranded two more times due to coolant system failure.", "fail date": "  01/31/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Transmission cooler line inside radiator failed combining fluids and causing the transmission to malfunction. Loss of ability to drive/move vehicle while on a rural road between cities during a snowstorm with my family in the vehicle. This is a common failure and requires a new radiator and replace / rebuild the transmission. A recommendation from Honda to replace the radiator every 100,000 miles for a marginal fee(similar to the timing belt) would have prevented having to replace / rebuild the transmission.", "fail date": "  12/14/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "I was driving up a hill when my vehicle started to lose power and high rpms upon acceleration. Was not able to climb hill so I pulled over and turned the car off. Restarted and made it a short distance before it stopped. I was fortunate to get out of harm's way prior to the car giving out completely. The vehicle had to be towed. A mechanic took a look at the vehicle and explained that transmission and radiator were both ruined and would both need to be replaced. He indicated that transmission fluid and radiator fluid mixed causing the malfunction and it also has caused the need for flushing of the engine. I have noticed that several other owners have made internet posts about the same problem. This issue should be under consideration for a recall by Honda as it sounds like a common occurrence that is the result of a design flaw. It is potentially very dangerous as this happens with no warning and causes the vehicle to stop functioning. Obviously, this would be very dangerous if it occurs at highway speeds. Thank you in advance for your consideration.", "fail date": "  12/05/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Radiator failed causing the transmission fluid to mix with the coolant. My wife was stranded with my four children. We had the radiator changed and coolant and transmission fluid flushed. The transmission has not functioned properly since the problem happened.", "fail date": "  11/04/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Transmission cooler line inside radiator failed commingled fluids and causing transmission to malfunction. Loss of ability to drive/move vehicle while in middle of multi-lane highway.", "fail date": "  10/28/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Makes loud noise and rattling while excelerating.", "fail date": "  10/16/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The Honda has started shuddering when between 30 - 40 mph this is a known issue with this vehicle. The shuddering makes it very difficult to control the vehicle at times and should be considered a major safety hazard.", "fail date": "  10/01/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The contact owns a 2005 Honda Pilot. The contact stated that while driving 3 mph, the temperature gauge spiked as coolant began overflowing from the radiator. The vehicle was taken to a dealer for diagnosis and the contact was informed that transmission fluid was found in the radiator and radiator fluid was found in the transmission. As a result, the radiator, transmission cooler, transmission and all of the lines from the transmission would need to be replaced. The vehicle was not repaired. The failure and current mileage was 83,000.", "fail date": "  06/22/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Radiator failed, causing loss of transmission fluid, causing loss of motion. The car stopped dead in the road and could not move on its own power. From contact with other Honda Pilot and Honda ridgeline owners, I learned that this type of failure occurs frequently at around 100,000 miles. The single radiator unit cools both the engine and the transmission fluid.", "fail date": "  06/12/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "As soon as I stopped in front of my house, I saw fluid pouring from the front right engine area. Fortunately for me, the problem occurred at that moment. There were no symptoms of, or dash board alerts previous to that. ( and nothing on the street) the car was towed on a flatbed to my service center,which is a certified Honda service center. . Apparently there was a line failure that allowed antifreeze and transmission fluid to mix and go into the transmission. The radiator was replaced and coolant flushed. The transmission was flushed 6 times with 28 quarts of transmission fluid and after driving 16 miles I am aware that the tranny is compromised and am going back to flush again. My service man made it clear that there is no guarantee on the transmission. I am a woman who maintains her car diligently and could not have done anything to prevent this catastrophic failure and upon researching the problem, find other Honda owners experiencing the same thing. It is up to Honda to step up and recognize a design/product flaw and perhaps recall others before it happens to them. I sincerely hope Honda realizes that this is an opportunity to do the right thing and fix the problem.", "fail date": "  06/06/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "As I try to increase speed, the engine will sputter as if it doesn't want to shift to the next gear. This is particularly noticeable in the range of 25-50 mph. I have to let off the gas in order for the car to shift to the next gear successfully. If I continue to give it gas it continues to sputter until I let off the gas.", "fail date": "  02/01/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "I took it in for a recall. I was told that the front and right engine mounts are \"cracked\". At about 25-45 mph there is a noticeable shudder under the hood. In searching the NHTSA database I find many other reports of this shudder and several saying that engine mounts are a problem in this model. The reports are in several areas including engine, suspension, drive train, transmission. It seems the engine mounts could be a common denominator. If the mounts go it could cause a catastrophic failure including loss of control.", "fail date": "  11/13/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Tl- the contact owns a 2005 Honda Pilot. The contact stated that while driving 35 mph, the vehicle suddenly decelerated and she was unable to continue driving. The contact mentioned that the temperature gauge illuminated and smoke started to emit from underneath the hood. The vehicle was towed to an independent mechanic who diagnose that the transmission and radiator fluid mixed. As a result, the radiator and transmission needed to be replaced. The manufacturer was made aware of the failure who did not offer any assistance since the vehicle was not included on any recalls. The vehicle was not repaired. The VIN was not available. The failure and current mileage was 97,000. Pmb.", "fail date": "  10/12/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "While driving at normal town speed (~25mph) car began overheating and speed dropped. Pulled car over to cool. Started to drive slowly home and symptom repeated. Car towed to Honda. They diagnosed as radiator and transmission fluid mixing due to failure in the radiator. Damaged the transmission that needed to be totally replaced, along with a radiator and transmission cooler. Engine also needed extensive flushing. Suggested cost was $6400 without labor. After repairs, engine damage could be assessed. This appeared to be a minor failure in the radiator that destroyed a separate system and might have damaged the engine.", "fail date": "  09/24/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The contact owns a 2005 Honda Pilot. The contact stated that while driving approximately 35 mph, the transmission shifted gears in a jerking motion. The vehicle was taken to an independent mechanic where the contact was advised that the computer system would need to be reprogrammed. The vehicle was not repaired. The manufacturer was not notified of the problem. The approximate failure mileage was 110,000.", "fail date": "  09/05/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "D light transmission flash and I stop the car to try reset ignition key. The d light no flash now. But I think that it will have problem my transmission later on. For my safety concern I need a recall for my car about this issue. Thanks for your cooperation to keep highway safe.", "fail date": "  09/03/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The vehicle shutters at approximately 35 mph while acceleration. The vehicle then had the same episode happen while on the highway at 60 mph while acceleration. I have experienced these episodes several times within the last month. I believe that the issue is progressing and I am concerned about my safety. I have investigated several forums online with many posts that have the same issues with the Honda and sister Acura. I would like Honda to step up and be held responsible for the repair.", "fail date": "  09/01/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The contact owns a 2005 Honda Pilot. The contact stated that while attempting to accelerate from a traffic stop the vehicle hesitated. The vehicle was taken to an independent mechanic who diagnose that the coolant fluid was in the transmission and transmission fluid was in the radiator. The vehicle was repaired. The manufacturer was made aware of the failure who did not offer any assistance. The failure mileage was 129,504 and the current mileage was 130,500.", "fail date": "  08/08/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The contact owns a 2005 Honda Pilot. While driving approximately 20 mph, the engine power reduced significantly and without warning. The contact continued to drive and upon reaching the destination an inspection underneath the hood was performed. The contact noticed a dark brown milky substance leaking from the radiator. The vehicle was taken to an independent mechanic who advised the contact that the transmission and engine would need to be replaced. The vehicle was repaired. The manufacturer was not notified of the problem. The approximate failure mileage was 67,000.", "fail date": "  04/28/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "In the highway the car brakes for no reason for a moment than it release.", "fail date": "  03/18/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Tl- the contact owns a 2005 Honda Pilot. The contact stated the vsa light stays illuminated in her vehicle. The contact is unable to deactivate the conntrol module:the contact is referencing the failure to (NHTSA campaign number: 13v092 components service brakes, hydraulic, traction control system) the vehicle was not taken to a dealer for a diagnosis or repairs. The manufacturer was not made aware of the failure. The failure mileage was 154,000 tp.", "fail date": "  01/17/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "2005 Honda Pilot with 145k miles suddenly started to apply brakes without warning while driving on straight, flat, dry roads at moderate speeds. If has also occurred at highway speed, but never associated with skidding, sliding, etc. The brakes appear to apply differentially, causing a swerve that needs to be corrected quickly to avoid collision with traffic. The vsa light comes on, and the triangular vsa disconnect light comes on. They both go out after the car is shut off and restarted. The local Honda dealer says there is no recall for this, but that they had reprogrammed the car's vsa during an earlier service visit.", "fail date": "  09/11/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The brakes are applying randomly without applying pressure on the brake pedal. The vsa light remains illuminated and it is unsafe to drive. 13v092 is the recall bulliten I believe applies to my vehicle, but when I search my VIN, it shows no unrepaired recalls. I have verified that the vsa subharness has not been installed prior to my purchase of the vehicle. My manufacture date falls between the timeline of this recall and also my VIN begins with 2hk, which is specified in campaign 13-026 as requiring vsa sub harness installed. I have taken it to my local Honda dealer and they have told me that it does not qualify for the recall because it is \"VIN specific\".", "fail date": "  09/01/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "When driving down the slope on the curb my car apply the breaks without any input.", "fail date": "  09/01/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Tl- the contact owns a 2005 Honda Pilot. The contact stated that while driving about 20 mph, the vehicle accelerated out of control, and crashed into a stationary police cruiser. There was no warning. The air bags did not deploy. A police report was filed. The driver and the front passenger sustained injuries that did not require immediate medical attention. The contact's vehicle was damaged and was towed to a tow yard. The dealer was not called and the manufacturer was not made aware of the failure. The contact stated that two weeks earlier, while driving about 10 mph, the brakes locked up momentarily and released when the contact stepped on the fuel pedal. The failure mileage was approximately 190,000. Fe.", "fail date": "  09/06/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "My car was not part of the Honda Pilot vsa recall (https://. . Read more...\n", "fail date": "  09/04/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Car will apply brake to itself causin a swerve or a jerk and the vsa light will come on and as sson as u turn off the ignition the light will turn off. And will happen again when it wants too. Any car appky brake by itself is unsafe and will cause a accident especially when driver have no control of it. . . This needs to be addressed immediately and recalled and fixed. This is not the only Honda Pilot doing this. There were quite a few.", "fail date": "  08/25/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Unfortunately, our each vehicle has been targeted and caused car accident from 2010 to present day. In 2012, our Mazda mpv 2006 engine was destroyed or replaced at the work place during working at hilton hotel. Our accura mdx 2002 VIN # 2hnyd18612h509321 and current Honda Pilot 2005 VIN # 5fnyf18645b010202 were under controlled and involved car accident in 2017 and 2018 because of targeting. I have noticed and reported to local police and insurance behalf of this cases which can stop suddenly or slowly. Its depend on how they controlled and pre-arranged accident to be happened on a pointing time. Surely, many life and vehicles are very dangerous. We desperately need safety cars and people in our community in order to avoid crushing cars and people from now and future. Please help.", "fail date": "  11/30/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Driving my Honda Pilot truck eastbound on the left lane at about 40 miles an hour, had the foot on the gas petal, the brake made a groaning noise and the truck started to slow down rapidly. To a full stop. The brakes went on and was so scared, because I looked up on my rear view mirror and there was a SUV driving behind me. He did see me , and he had to swerve into the opposite lane. My heart sank. He got out of his SUV and he started to yell at me. I told him the truck came to a stop it malfunctioned and they were lights on my dashboard . As he walked away back into his SUV and drove off I sat there. I put the car in park looked at my manual and shut off the vehicle and turned it back on and the indicators on my dashboard we're gone. I called up my husband to let him know. Before I shut the car off,, two indicators came on vsa and a warning sign. I know there was a recall it in 2013 I did get that fixed as I took it to a Honda dealership. About two years ago it happened again I was on the belt parkway in new york and the Pilot made a noise and it stopped on its own there were more than two lights flashing on my dashboard that day. And I was driving slower on the parkway because of traffic. So, the impact wasn't so scary . Two lives were saved that day. I called Honda recall case #06490313. Since my husband had to bring his car in to get fixed I also took my Honda. The company's name is hardmans auto ,they also order parts from the Honda dealership also located in the same town. Did cool Honda auto service but the manager named mark hasn't called me back yet. Will call again today to get my Pilot checked.", "fail date": "  11/27/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "My 2005 Honda Pilots brakes are on. I started the vehicle and shifted into reverse, the brakes are fully engaged. I shifted into drive, same thing. The emergency brake is not engaged. I cannot drive the vehicle.", "fail date": "  09/23/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Vehicle stability assist recall completed in 2013 has failed to address vsa issues. Vehicle will randomly apply brakes while driving in normal conditions, possibly presenting a hazard to driver, passengers, and other vehicles on the road. When the brakes are applied, the vsa light illuminates and must be reset. There are multiple documented occurrences of this online with multiple owner/operators, and the fact that the previous recall has not been effectively must be addressed. Thank you for your time and attention.", "fail date": "  04/04/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "On cold temperatures, and while the car is moving on the highway, the brakes will suddenly apply all by itself and the vsa off and a triangle (with exclamation) light comes on the dashboard. This causes the vehicle to strongly jerk and swerve for a second. Turning off the vsa before driving, the sudden brake will not happen. I checked recalls for my VIN but there are no open recalls. Please investigate.", "fail date": "  12/14/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The contact owns a 2005 Honda Pilot. While driving approximately 50 mph, the vehicle slighty swayed from the left and the right with a shuttering sensation. The vsa system warning indicator illuminated. The contact turned off the vehicle to disengage the warning indicator; however, the failure recurred. The contact found in the owner's manual that the vsa warning was an indication that the brakes and stability controls were experiencing a malfunction. The contact took the vehicle to the dealer and several failure codes appeared; however, they were not able to completely indicate what the nature of the repairs. The vehicle was not repaired. The manufacturer was made aware of the failure and opened a case. The approximate failure mileage was 150,000.", "fail date": "  08/30/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "To whom it may concern, my 2005 Pilot model exl has 90,000 miles. Recently the vsa light started to come on randomly while I was driving the car. Whenever that happened there would also be a loud ¿chunk¿ noise that accompanied it and for a fraction of a second the brakes and steering wheel would lock up. However today when it happened, I could not turn off the vsa function and the worst part was that the malfunction of the vsa had locked the brakes once while I was driving on the road. Due to the malfunction I lost control of the car for a few seconds and although this only occurred one time, it was an extremely frightening experience.", "fail date": "  02/24/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Tl- the contact owns a 2005 Honda Pilot. The contact stated that while driving at about 10 mph, the speedometer dropped down to zero. She stated that the vsa light came on and the breaks automatically engaged. The contact pulled to the side and turned the vehicle off for a few minutes and then restarted it. The failure recurred and the contact notified a local dealer who did not offer any help, citing that the vehicle was not in any recall. The manufacturer was not notified of the failure. The failure mileage was 140,00.", "fail date": "  10/08/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Tl- the contact owns a 2005 Honda Pilot. The contact stated that while driving the vehicle the abs and vsa warning lights had illuminated and when pressing the brake pedal the vehicle the brakes malfunction creating a longer stopping distance. The cause of the failure was not diagnosed or repaired. The manufacturer was not notified of the failure. The contact was informed that the vehicle was not included in the NHTSA campaign number 13v0920000 (braking system). The contact stated that the vehicle had experienced the same failure listed in the recall. The failure mileage was 119,000. Jft.", "fail date": "  09/20/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Hace un tiempo tuve un accidente y mientras conducia solo en mi Honda Pilot y lo bolsa DE aire del lado del pasajero exploto aun cuando no habia nadie en el asiento del pasajero y la bolsa DE aire del lado mio, del conductor siendo la mas importante no abri� poniendo mi vida en riesgo.", "fail date": "  06/22/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "I was parking , when the car jolted forward, I hit the brake, but the car accerated going onto the pavement of the shopping centre, breaking two sides of a brick pillar. Both sides of the front of the car doors were destroyed and the main front, the car was a totall loss. The airbags, never came out.", "fail date": "  04/03/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Honda Pilot was serviced at ed voyles Honda on 10/22 and picked up on 10/23. Extensive service performed on car. . . Timing belt, transmission, air bags replaced per recall, engine mounts replaced, oil changed, etc. Picked up car on 10/23. On 10/24 backed out of driveway and put car in drive gear. Car accelerated without me putting foot on acceleration. Could not stop vehicle. Acceleration continued and increased. Only way to stop car was to run into a tree. Not sure if caused by recent work or I have read now that 2005 Honda Pilots have had issues with unprovoked acceleration. Usaa insurance company has totaled car and car is at junk yard now.", "fail date": "  10/24/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "I heard a loud thumping or grinding sound from the front of the car and the brakes engaged on their own. At the same time the vehicle stability warning light came on (yellow triangle). Over next three weeks this happened three times, seemingly randomly. On one occasion the \"yaw sensor\" code was triggered. The vsa recall in 2013 was performed by the dealer in 2013.", "fail date": "  10/15/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The first incident happened while turning, car came to a stop, jerked the wheel almost hitting another car; all without warning. A child passenger was in the back seat and was thrown forward hitting her head on the passenger front seat and seat belt locked causing her to have a seat belt bruise. Vsa (light), the vsa activation light (triangle with exclamation inside) were both illuminated. SUV was taken to local dealership to perform the recall work. Two weeks later, same thing but this time I was going about 55mph on highway, SUV came to almost a complete stop within a short distance. Grinding feeling and with the vsa indicator lights on. Almost hit someone when the wheel jerked and caused me to go into the right lane and almost hitting someone, kids were in the SUV one in the passenger side front and the other in back same side. Seat belt once again left a bruise on their chest and caused the front passenger to have strained his neck. This is a vehicle that cause great concern. I am now afraid to allow my son to drive this vehicle with this problem continuing. The dealership has said that they have preformed the recall bulletin and I will need to fix this on my own. This is not satisfactory at all.", "fail date": "  06/11/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "1st incident-I was traveling at a slow rate of speed (approx. 25-30 mph). Heard a growling sound & car suddenly braked on its own. I also felt as if I had lost steering ability. The vsa light flashed on then off during the incident. 2nd incident- same as above only a week later. 3rd incident- about 2 weeks later. My wife was driving the car. Had slowed down to enter the ramp to get on the highway. Again the car made a grinding sound, the vsa light came on momentarily while the car applied the brakes on its own. All of these incidences occurred after the car was serviced for the vsa recall(13-026) on may 6, 2015. Previous to this service, we had never had any issues with the vsa. We believe that by having this recall performed, has caused another malfunctioned as a result. I have read some much more frightening incidences than ours on your site. So we are now driving our car with the vsa off! please investigate before someone seriously gets hurt.", "fail date": "  06/04/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "2005 Honda Pilot. Lawyer wrote in on behalf of client. Sudden malfunction which resulted in personal injuries according to the letter, the brake system locked up, while his client was traveling at a high speed.", "fail date": "  04/19/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "While driving around a bend towards a red light, without my foot on the pedal my car made a weird shutter or brake pulsing, I thought I had gone over some ripple strips. When the the light changed, I proceeded to make a right turn in a busy intersection, when going almost 30 & out of the turn, my Pilot came to an unassisted abrupt stop! im so lucky the person behind me didnt rear end me! it sounded like the transmission was grinding & the tires were locked. I waited a few seconds let go of brakes & the vechile began to move but in 5 ft it did it again. Towed to dealer who cant seem to find or recreate the problem. Multiple brake, abs, vsc & electrical alarms were reported by dealer but still no solution. This car is unsafe to drive and by multiple reports this is a widespread problem.", "fail date": "  03/14/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "As I was approaching a left turn lane I applied the brakes gently and the left front brake momentarily grabbed causing the vehicle to swerve into the oncoming traffic and the vsa lights activated. This has occurred 9 times in the last 300 miles. I took the vehicle to the dealer immediately and they told me they could not duplicate the problem and they found no problems with the car. Never had a problem until the \"recalled\" vsa module was replaced less than 6000 miles ago. The dealer tells me that the vsa module is not under warranty.", "fail date": "  02/07/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "I had let the car warm up for about 20minutes before I left. About 8:30am Saturday Dec. 14th 2013 my 2005 Honda Pilot started to accelerate on its own at a very high rate of speed. I tried to push on the brakes but it would not stop. I started praying to jesus and saying out loud god please! god please! god please! I know this sounds a little dramatic but it was very scary! I got off on the side of the road and by the grace of god something gave way. Either the accelerator stopped accelerating or the brakes finally worked but I was able to get the car to stop. From one worried car owner to another who may have had this problem or that might have this problem. I now know that I could put it in neutral and maybe turn the key off to also to get it to stop.", "fail date": "  12/14/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The contact owns a 2005 Honda Pilot. The contact stated that while driving approximately 40 mph, the vehicle stability assist (vsa)warning indicator illuminated as the steering wheel seized. The steering wheel independently released after several seconds and the vehicle resumed normally. The vehicle was taken to an authorized dealer and repaired under NHTSA campaign id number: 13v092000 (service brakes, hydraulic , traction control system) however, after the recall remedy was performed the failure recurred twice and the vehicle was taken back for repairs each time. The manufacturer was not notified of the defect. The approximate failure mileage was 50,000.", "fail date": "  11/20/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The contact owns a 2005 Honda Pilot. The contact stated that while driving 10 mph, the vehicle stalled and the vsa warning lamp illuminated. The vehicle was taken to the dealer. The technician was unable to diagnose the failure. The manufacturer was made aware of the failure. The vehicle was not repaired. The failure and current mileage was 93,000.", "fail date": "  10/01/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "While driving on the highway, the vehicle's vsa engaged locking up the brakes. We were very lucky to have not caused a serious accident. It happened again why leaving the highway for side streets. The vehicle was towed to the dealer for inspection. We are extremely concerned as the vehicle had just been to the dealership for the recall involving the involuntary command of vsa engagement. This is absurd that these vehicles are allowed to still be on the road with such a serious flaw that could result in loss of life.", "fail date": "  06/26/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "After the recal of vsa it happens that the SUV experiencing the symptom of excessive braking and vsa light comes out. . . Before the recall we haven't experiencing this vsa problem. . I don't know in some reason why it comes out after the recall had been made. . First occurrence I bring it to the dealer and advise that they been check , fixed and inform it won't come out any more . . After two weeks it happend again and mynsuv will bring again to the dealer for the second time. . . I feel they make me feel worse this recall that been made . . . Is there any advice ????.", "fail date": "  06/06/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The contact owns a 2005 Honda Pilot. The contact stated that while driving at unknown speeds, the brakes engaged independently and the stability assist warning light illuminated. The vehicle was repaired under a recall associated with NHTSA campaign number 13v092000 (service brakes, hydraulic, traction control system) but the failure recurred. The manufacturer was not made aware of the failure. The failure and current mileage was 72,000.", "fail date": "  05/01/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "2005 Honda Pilot. Consumer writes in regards to a defective vsa electrical control unit recall notice and seeks reimbursement for repairs. The consumer stated without warning, the vehicle came to a complete stop in the middle of the intersection. The vehicle was towed to a repair shop, where the vsa/abs modulator assembly was replaced.", "fail date": "  05/01/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The contact owns a 2005 Honda Pilot. The contact was driving approximately 55 mph and engaged the brakes. The vehicle came to a abrupt stop and then began to accelerate uncontrollably. The contact was unable to maneuver the uncontrollable vehicle and crashed into two cement barriers. The contact sustained minor back injuries. A police report was filed of the incident. The vehicle was destroyed and towed to a salvage facility. The manufacturer was not notified of the failure. The contact referenced NHTSA campaign id number:13v092000 (service brakes, hydraulic: antilock: control) and stated that the recall notification was received after the consequence of the recall had been experienced. The approximate failure mileage was 124,000.", "fail date": "  04/30/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "While exiting a driveway at approximately 5 miles per hour the brakes locked without the driver applying pressure. The driver was able to get the vehicle to the center painted median with extra gas and still under unwanted braking. Once the car came to a complete stop for 30 seconds or so the brakes released. The driver then drove the vehicle at a slow speed along the curb to our house within 2 miles. It's now parked as we are afraid to drive it. A call to metro Honda in montclair was of no assistance. They said my vehicle was not effected by the recent Honda recall on the issue. The vsa light remains illuminated as well as the system warning light.", "fail date": "  03/26/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Airbag tensioner seatbelt light is on (red one); aka, srs (supplemental restraint system) dealership pulled codes 41-11 and 42-11, which are the front left and right impact sensors. They said the impact sensors \"appear to be okay\". But the main srs computer unit control modular is \"not working properly\". The car has 137,000 miles on it and has not been in an accident and the light came on immediately when I started my car after it sat for a day without driving it. I live in rural area where no one could have tampered with my car. The dealership was perplexed and said they have seen this happen a lot recently and believe it is a defect in the srs unit. The impact sensors are fine but the codes are being thrown for impact sensors, not the srs unit; which they said if I paid 1,000 dollars (might) resolve the impact sensors error. . . If not, then I would have to pay another 900 for parts/labor to do the sensors as well. This is a manufactor defect they know about this I called many dealerships and they think that it should be warrantied as a safety hazard. . . Honda will not yet acknowledge that me or my family could be killed because their computer srs unit malfunctions. I will continue to support and buy only Honda but I need this to be warrantied and replaced no cost out of my pocket. Please issue a recall or honor the repair cost immediately.", "fail date": "  06/28/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2005 Honda Pilot. The contact stated that after starting the vehicle, the passenger’s side air bag light illuminated continuously. The vehicle was taken to an independent mechanic where it was diagnosed that the front passenger’s impact sensor needed to be replaced. The dealer was not contacted. The vehicle was repaired. The contact mentioned that a year later the failure recurred. The manufacturer was not notified of the failure. The approximate failure mileage was 100,000.", "fail date": "  03/04/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Dmv has sent me a letter stating my car has a recalled airbag that could kill or injure me or my passengers.", "fail date": "  08/09/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Vehicle parked in lot. Airbag deployed, parked and locked.", "fail date": "  03/15/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall - I have been contacting my local dealership since 8/24/16 and they still do not have the part.", "fail date": "  08/24/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "I have Honda Pilot 2005 and airbag come on and it be on from when I get it like 2 weeks a go.", "fail date": "  08/15/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall I reached out to Honda dealership in fremont, CA on August 1st 2016 in reference to the recall. Dealership mentioned that they don't have part in stock but will call back as soon its available. It is more than 90 days but no information.", "fail date": "  08/01/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2005 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags) and stated that the part needed for the repair was not available. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure. Parts distribution disconnect.", "fail date": "  07/08/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "I contacted my local Honda dealer on 7/12/16 and they did have the part. I never heard from them so I called again on 9/9/16 and they still don't have the part and do not know when they will get it. The recall says \"Honda suggests that you avoid having a passenger sit in the front passenger's seat until the recall repair has been performed\" my local Honda doesn't seem to think this is urgent.", "fail date": "  07/07/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2005 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags); however, the part to do the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was not made aware of the issue. The contact had not experienced a failure. VIN tool confirms parts not available.", "fail date": "  07/07/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2005 Honda Pilot. The contact received notification of NHTSA campaign number: 16v061000 (air bags); however, the part to do the repair was unavailable. The manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was not notified of the issue. The contact had not experienced a failure. Parts distribution disconnect.", "fail date": "  07/06/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2005 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags); however, the part to do the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure.", "fail date": "  07/05/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2005 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags); however, the part to do the repair was unavailable. The manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was not notified. The contact had not experienced a failure. Parts distribution disconnect.", "fail date": "  07/05/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2005 Honda Pilot. The contact received a recall notification for NHTSA campaign number: 16v344000 (air bags) and stated that the part needed was unavailable to perform the recall repair. The manufacturer was not notified of the issue. The contact had not experienced a failure. Parts distribution disconnect.", "fail date": "  06/30/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. My Honda Pilot was recalled for the takata recall probably a little over a year ago. The problem is that they changed the drivers air bag and yesterday I get the recall letter for the passenger airbag! knowing the dangers do the takata airbags why did they not replace both do them? my residence is in south louisiana, hot and humid. Also my vehicle now has over 320k miles, I'm probably very lucky or blessed. On Thursday June 29th the national news stated 'do not drive your Honda'!!! this is the evening before our trip to memphis for the 4th of July holiday. But I know mine was changed already!!! right!! but I return to find my recall notice for the passenger air bag. . . . There needs to be stronger guidelines and enforcement. Yes I called but none are available. Same as when I had to wait for the drivers side bag.", "fail date": "  06/30/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2005 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags) however the parts to do the repair were unavailable. The manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was not notified of the issue. The contact had not experienced a failure. Part distribution disconnect.", "fail date": "  06/12/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2005 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags) however, the part to do the recall was unavailable. The contact called the local dealer and it was confirmed that the part was not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure. Parts distribution disconnect.", "fail date": "  05/23/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "First issue. Honda is failing to make proper notifications concerning recalls and extended warrantees. A warrantee extension notice for my 2009 Honda accord was forwarded to me by the person across town who received my notice. Last year the same person forwarded to me a takata airbag recall notice he received for my 2005 Honda Pilot. I purchased my 2005 Honda Pilot direct from Honda and my accord from a private owner. Both vehicles are in the Honda service data base with my correct name, address, and VIN. I have no connection to that address, and the resident there does not have my name or any Honda vehicles. I have spoken to Honda service and the Honda recall center about this. Yet, in March the same issue occurred with my 2009 Honda accord. Additionally, I have not received a notice on my 2010 Honda accord (purchased from a Honda dealer), which, according to the notice, is part of the class of vehicles subject to the same extended warrantee. Honda¿s national service center could not explain to me how the mistake occurred and could not assure me that their records would be corrected for purposes of safety notifications since Honda has had my information correct in their service center database. Second issue: my notice of an extended warrantee on 2008-2010 accords is for a corrosion issue with an internal component in the srs electronic control unit that could potentially result in srs failure. The notice stated that if the dashboard srs light alerts you to an issue, you need to bring the vehicle in for inspection ASAP. The srs light in my 2005 Honda Pilot illuminates intermittently. Honda said it is not covered, but they would diagnose it for $120/hr + repairs. For purposes of vehicle safety, can your office determine if the older Honda Pilots have the same srs ecu issue as the 2008-2010 Honda accord, and thus should be subject to a recall?.", "fail date": "  03/01/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Tl-the contact owns a 2005 Honda Pilot. The contact received a recall notification for NHTSA campaign id number: 16v344000 (air bags) and stated that the part needed was unavailable to perform the recall repair. The manufacturer was notified of the issue. The contact had not experience a failure. Parts distribution disconnect. Bp.", "fail date": "  02/08/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Tl-the contact owns a 2005 Honda Pilot. The contact stated that while driving various speeds, the check engine light and the srs light illuminated. Mungenast saint louis Honda of saint louis, missouri was made aware of the failure and made unknown replacements but the failure recurred. The manufacturer was made aware of the failure. The failure mileage was 275,000. Ad.", "fail date": "  01/24/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Still waiting for recall notice.", "fail date": "  12/01/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2005 Honda Pilot. The contact received notification of NHTSA campaign number: 15v320000 (air bags); however, the parts needed were not available to perform the repairs. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall remedy. The manufacturer was not notified of the issue. The contact had not experienced a failure.", "fail date": "  07/22/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Hace un tiempo tuve un accidente y mientras conducia solo en mi Honda Pilot y lo bolsa DE aire del lado del pasajero exploto aun cuando no habia nadie en el asiento del pasajero y la bolsa DE aire del lado mio, del conductor siendo la mas importante no abri� poniendo mi vida en riesgo.", "fail date": "  06/22/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Wife while turning on insde of lot bumbed pole at kroger parking lot. Both front air bags depoyed exploding shrapenal hit my wife cuting into her arms. Honda was said they replace all air bags and assories. They sent one part. Dealer would not repair because they didnt everthing it needed.", "fail date": "  06/03/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Tl-the contact owns a 2005 Honda Pilot. The contact did not receive a recall notice but the VIN was included in NHTSA campaign number: 14v351000 (air bags) however, the part needed to repair the vehicle was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was not notified of the issue. The contact had not experienced a failure. Oo.", "fail date": "  04/30/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "I was parking , when the car jolted forward, I hit the brake, but the car accerated going onto the pavement of the shopping centre, breaking two sides of a brick pillar. Both sides of the front of the car doors were destroyed and the main front, the car was a totall loss. The airbags, never came out.", "fail date": "  04/03/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "I was advised by my Honda dealership (russel & smith Honda) on 2/16/15 that there was a recall in my car's airbags - however the required part was not available to correct the problem. Two months later I a yet to hear from the dealer to schedule my recall fix appointment. In the interim I keep getting letters from Honda that there is a recall but it appears that there is no remedy as the parts are not available. I think Honda should ensure that appropriate parts for the air bag recall should be made available to their local dealers and advice the dealers to fix the problem in a reasonable time frame. I have waited 2 months with no word from russel & smith Honda dealer in houston and I am worried that my vehicle may not be safe for driving.", "fail date": "  02/16/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2005 Honda Pilot. The contact received a notification for NHTSA campaign numbers: 14v700000 (air bags) and 14v351000 (air bags). The part was unavailable to repair the vehicle. The dealer was uncertain when the part would become available to service the vehicle under the recall. The manufacturer was not notified of the issue. The contact had not experienced a failure. The VIN was not available.", "fail date": "  02/12/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "My car is part of an airbag recall by Honda. I have been trying to get my airbag replaced since November of last year. The miami Honda dealerships I have approached are south motors and brahman Honda. They have been totally uncooperative and have setup systems to give customers the run around. I understand that place with hot, humid climate like florida, are at higher risk for airbag malfunction. It is outrageous that these dealerships are playing games with my safety and the safety of my family. I do not understand what it is that they are waiting for to take care of this issue. I would like to know what it is that your agency will do to enforce this mandate. I will be willing to file a complaint with the court or testify if needed. I look forward to hearing from you on this issue.", "fail date": "  11/18/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Tl-the contact owns a 2005 Honda Pilot. The contact received a notification for recall NHTSA campaign id number: 14v351000 (air bags) and stated that the part needed was unavailable to repair the vehicle. The dealer was unable to indicate when the part would become available. The manufacturer was not notified of the issue. The contact had not experienced a failure. Pam.", "fail date": "  11/04/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Submission from congressman paulsen on behalf of constituent re airbag recall (reply directly to the constituent). The consumer stated Honda should be required to replace all air bags.", "fail date": "  11/03/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Honda Pilot was serviced at ed voyles Honda on 10/22 and picked up on 10/23. Extensive service performed on car. . . Timing belt, transmission, air bags replaced per recall, engine mounts replaced, oil changed, etc. Picked up car on 10/23. On 10/24 backed out of driveway and put car in drive gear. Car accelerated without me putting foot on acceleration. Could not stop vehicle. Acceleration continued and increased. Only way to stop car was to run into a tree. Not sure if caused by recent work or I have read now that 2005 Honda Pilots have had issues with unprovoked acceleration. Usaa insurance company has totaled car and car is at junk yard now.", "fail date": "  10/24/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "I would like to encourage the transportation secretary to expand the air bag recall nationally, as it is a matter of highest concern to americans without boundaries. All americans affected deserve to have their vehicle air bags replaced, no matter where they live.", "fail date": "  10/24/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Vsa engaged while driving xway, pulled vehicle to right, into other lane. This was repaired per previous recall, but continued to engage periodically within 3 days. Additionally, I am on list for airbag recall, but not yet recalled in ky. We are in ohio valley, with higher humidity than florida. I have driven to florida multiple times. We should be added to recall list.", "fail date": "  10/14/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall.", "fail date": "  09/23/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "The yaw rate lateral acceleration sensor is faulty and should be included in Honda's 2013 recall of the vsa. The vehicle has the exact symptoms of the vsa recall, which was fixed on my vehicle. I purchased the car last year with very low miles, only drove for a few months before it started having issues. Started out having the vsa triangle light on dash and losing power (limp mode) only after coming out of a turn after driving vehicle for awhile. Increased to the point where after roughly 30 minutes of the vehicle running the vsa issue would happen at least once during the drive. Severity of the vsa/limp mode got worse, no power for longer at a time and the horrible grinding noise directly underneath cabin. Took to Honda complaining of these issues, couldn't replicate it so nothing was wrong. One month ago, my vehicle started having the un-commanded braking problem. Driving at 55 mph, the slightest touch to the brakes causes the vehicle to hard brake, causing a swerve at least going that fast. It has done this un-commanded braking more than once, I have been afraid to drive it and at least got it 30 minutes to my Honda dealer, which I also purchased the vehicle from. It was diagnosed with the faulty yaw rate lateral acceleration sensor. I have argued with Honda for the last three weeks over the issue, ultimately to be told that it was not included in the final recall, even though the investigation names the yaw sensor as possibly being implicated in the malfunction. $994 for the sensor alone. It is absolutely dangerous and even the dealer recommends it be fixed immediately, yet Honda has declared no fault.", "fail date": "  06/01/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "The vsa light is coming on and staying on.", "fail date": "  09/20/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "2005 Honda Pilot with 145k miles suddenly started to apply brakes without warning while driving on straight, flat, dry roads at moderate speeds. If has also occurred at highway speed, but never associated with skidding, sliding, etc. The brakes appear to apply differentially, causing a swerve that needs to be corrected quickly to avoid collision with traffic. The vsa light comes on, and the triangular vsa disconnect light comes on. They both go out after the car is shut off and restarted. The local Honda dealer says there is no recall for this, but that they had reprogrammed the car's vsa during an earlier service visit.", "fail date": "  09/11/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "While driving on a long road trip, the car spontaneously engaged the abs in an intermittent manner. Vsa light came on. Stopped and restarted the car. Exactly the same thing happened after a little while. Stopped and restarted the car with the vsa system manually turned off. Exactly the same thing happened after an hour or so. Engagement of abs was intermittent. As detailed in the attached document, we have take this to numerous Honda repair centers and the problem has persisted. We have experienced the spontaneous and intermittent engagement of abs only during long highway driving. In-between each repair, we have driven the car in the city nearly every day without any problems. However, each time we have taken the car for a long trip, we have experienced the problem after a few hours of normal driving. This problem has occurred while driving normal speeds during perfectly normal (not raining or slippery) conditions.", "fail date": "  06/24/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "My car was not part of the Honda Pilot vsa recall (https://. . Read more...\n", "fail date": "  09/04/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "Car will apply brake to itself causin a swerve or a jerk and the vsa light will come on and as sson as u turn off the ignition the light will turn off. And will happen again when it wants too. Any car appky brake by itself is unsafe and will cause a accident especially when driver have no control of it. . . This needs to be addressed immediately and recalled and fixed. This is not the only Honda Pilot doing this. There were quite a few.", "fail date": "  08/25/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "While driving normally in any condition the vehicle without any warning will make a bang noise, shudder and brake without applying the brakes. The vsa light comes on and the vehicle will not function correctly until after the car is turned off and restarted. This has happened many times. The vsa recall was done yet the vehicle continues to have the same issues.", "fail date": "  07/31/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "Vehicle stability assist control module is malfunctioning and the brakes are activating by themselves. . . Vehicle stability assist warning light is on and cannot turn the vsa light off. . . Honda doesn't list this VIN number as under recall that it has the same problem as the vehicles under recall. Unibody rear under frame and suspension mount corrodes and rust do to water collecting under vehicle inside the unibody. There is no weep holes for water to drip out and the suspension mounts corrode and have come off the vehicle.", "fail date": "  05/29/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "Driving 35 mph in right turn breaks being applied by themselves very dangerous vsa light coming on after event.", "fail date": "  04/25/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "Vsa system activates brakes without any input from driver under normal driving circumstances. Vsa light came on, car braked on its own on highway at 65mph, car pulled to the right; same thing happened during gentle left turn at 15mph. I believe this to be a defective yaw rate sensor. My VIN was not included in recall in 2013, #13v092000. Local dealer replaced battery stating that failing a load test could cause vsa code. Problem happened again, now local dealership found yaw rate sensor error code.", "fail date": "  04/11/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "Honda performed a vsa recall but today when I received the vehicle from Honda dealership after service, I received the vehicle with vsa warning light. I never had that warning light. The defect occured in Honda service centre. They were not taking responsibility. After great pursuation they told that they will investigate and I will have to pay for repairs. After investigation they informed that 3 tpms sensors were required. I agreed to do the repairs. At the end of the day they still returned the vehicle with vsa light now asking to replace abs modulator at a cost of $1528. 03 plus taxes. I understand that there is a problem with Honda's vsa system and Honda fell short of the desired corrective action in the 2013 class action suite. It is a major safety issue and Honda should do a recall to completed rectify the defect. Really need your help. Internet forums are flooded with many people facing similar problems. I have necessary paper work from Honda dealership and the same can be furnished on demand.", "fail date": "  01/24/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "Driving 65 mph brakes applied by themselves, vehicle swerved and almost lost control vsa light came on. Took it to dealer on Jan. 17/18 . Vsa needed replaced. Repair done on 3/6/18, we did not drive until repair done. Then on 3/31/18 it occurred again, same problem, brakes applied by themselves and vehicle swerved and again a struggle to control it. Called dealer, they will have to do a diagnostic to determine if the problem is under warranty? this is safety issue for which I have contacted Honda America and they do not believe it is an issue that they need to address. Something needs to be done, I do not believe it was properly address in the Honda recall of 2013.", "fail date": "  01/12/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "Vsa warning light continues to come on. Car will apply brakes without driver hitting the brake pedal. Car will swerve to one side when brakes are applied by vsa mechanism. This has happened numerous times. Very dangerous there should be a recall but Honda does not show one for this VIN, but other Pilots in this year have recalls. This is a very dangerous issue and Honda needs to fix this.", "fail date": "  07/21/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "Vehicle stability assist recall completed in 2013 has failed to address vsa issues. Vehicle will randomly apply brakes while driving in normal conditions, possibly presenting a hazard to driver, passengers, and other vehicles on the road. When the brakes are applied, the vsa light illuminates and must be reset. There are multiple documented occurrences of this online with multiple owner/operators, and the fact that the previous recall has not been effectively must be addressed. Thank you for your time and attention.", "fail date": "  04/04/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "Brakes engaged on their own while driving down the road. Huge safety issue and vehicle control was lost and vehicle slid and skidded into opposite lane of traffic. Warning lights vsa came on and vehicle drove like the emergency brake was engaged. Cleared after engine turned off, then happened the second time when getting on interstate in rush hour traffic. Car behind me had to turn towards ditch to avoid collision as I had no control over my vehicle. Drove to nearest dealer and they immediately saw the vsa light and warning symbol and said it was related to recall. Later changed their minds and said yaw rate sensor needs replaced at a total cost of $1150. Encouraged me to write to Honda for some relief in costs however that complaint fell on deaf ears. I have owned 5 Honda's and currently own 3 . They claim if they are not purchased new no customer has any loyalty based on their criteria. Seriously. . . . How do they think the Honda resale value is established and is so good !!!! very disappointment in the rude woman name caroline regional customer service rep in our area. She claimed all car problems are life threatening. Maybe consider Toyota next time.", "fail date": "  01/27/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "When driving vehicle, it brakes suddenly, swerves, and makes a clunking noise as if you just hit something in the road. The vsa lights both come on in the vehicle. This is the 2nd time my yaw sensor has failed since the initial vsa recall in 2013, which I completed. . When googling this issue, it is all over the internet with other Honda Pilot drivers. This is very dangerous and almost caused a wreck with each instance.", "fail date": "  06/27/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "Vsa light randomly comes on when going around corners at low speeds and has a grinding noise, or when driving at highway speeds the car pulls sharply. The car has been to the dealer several times and the last time they said the vsa modulator needs to be replaced at a cost of about $2000.", "fail date": "  06/14/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "While driving in normal conditions at any speed at any time it on any type of roadway feels as if the brake is being slammed on and pulls the car slightly to the left without any input from the driver. I have this occur daily. The vsa light and many times the tire pressure light immunimate just prior or at the time of the event. It is at the Honda dealer who first wanted me to replace the rear end but they say it is a faulty sensor and are replacing it for about $800 but they are still not sure that is the problem. I saw the recall for 2013 part of the vsa and they say that was fixed back then. So what is going on now this continues to be a major safety issue and costly.", "fail date": "  02/29/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "The contact owns a 2005 Honda Pilot. The contact stated that while driving at 65 mph, the vsa light and the tire pressure warning lights illuminated. The contact depressed the brake pedal but the brake lights failed to illuminate. The vehicle was diagnosed but not repaired. The manufacturer was notified of the failure. The approximate failure mileage was 150,000.", "fail date": "  02/20/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "Vsa warning lights came on while I was driving on highway and the car suddenly applied brake itself for no reason. I almost lost control of the car due to panic of unknowing what happen. I pulled the car over and took a quick picture of malfunction vsa warning lights. Then, I turned off the engine and start again later to check if anything has gone wrong. Vsa lights went off and the car is driving as normal. I had notified this vsa warning lite on ignition before the cold start in the morning to local dealer since last year. They said that they can't find any error code in diagnosis. In lately incident, they finally took the matter seriously then they found yaw sensor error code but they still can't guarantee the vsa problem will be solved. I wish ahc will look into this vsa problem to help out the owners and I think there are many other people having same problem like me.", "fail date": "  11/29/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "Random, repeated and sudden breaks apply; car slows down dramatically. Vsa light may come on, may not. This occurred several times. The first time it occurred was on a trip to PA. The car would suddenly slow by more than 20 mph. We were thrown hard into our seat belts. We went to a Honda dealership in pittsburgh. They wanted to sell me 4 new tires stating the problem was due to tires not wearing even. This was hard for us to believe. It was extremely dangerous. We had to veer off the road many times to avoid accidents! google search on vsa car suddenly breaking - first 'hit' was a 2013 recall on the vsa harness and sensor. We received no information on the recall. Honda pittsburgh fixed the recall free. Then 8 weeks later in maryland the car began to do the same exact thing. We emergency stopped at a local auto center. Their system code showed faulty \"abs brake system\" they kindly reset the codes, but the car continued to exhibit same. We then went to salisbury, MD. Honda. They said we needed a new vsa module despite the diagnostic showing no codes stating we had a faulty vsa. The only vsa module was in ohio and would take a week to get to maryland, and cost us $1,710! all other vsa modules were on back order. We were on vacation and could not stay an additional week. Nor did it make sense to us to replace the vsa module when salisbury Honda said it was \"working as designed\". I have a legal formal complaint registered with Honda America. I urge you to do the same. Winston salem, nc Honda feels it is the yaw sensor. However, they have had my car for 5 days and are unable to duplicate the problem or show a code. I feel a recall should now be made for a yaw sensor. Better yet, Honda America should replace all vsa modules for free before someone is killed!! .", "fail date": "  05/19/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "The contact owns a 2005 Honda Pilot. While driving approximately 60 mph, the brakes engaged independently. As a result, the vehicle swerved from left to right and the vehicle stability assist warning light illuminated. The vehicle was serviced under NHTSA campaign number: 13v092000 (service brakes, hydraulic, traction control system); however, the failure recurred. The vehicle was taken to a dealer where it was diagnosed that the yaw rate sensor needed to be replaced. The vehicle was not repaired. The manufacturer was notified of the failure. The failure mileage was 126,000.", "fail date": "  04/28/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "Sitting in a parking lot and the vsa light came on. Looked it up and saw the recall on the vsa so intended to get it checked out. A couple days later I'm tooling along at freeway speed and for a brief second it felt like someone slammed on the brakes and released, and the vsa light came on. Took it to the dealership and the codes they found were for some sort of a power drop and blamed it on a possible power outage or drop at some point. Maybe alternator, battery or something, but they didn't find anything wrong with any of those, but it cost me $125. 00 to be told they don't know. The vsa recall was completed in 2012 for the wiring harness. Today (a week later) I'm going about 25 on a surface street and the exact same thing happened, so I took it to the dealership without turning off the engine and possibly clearing any codes. What they came back with was a faulty yaw sensor code, but they want to keep it for a couple days to do further research. I'm told it is connected to the main computer and if it is the yaw sensor then the main computer has to be replaced, at a cost of $1650. 00 (they will credit toward the repair the $125. 00 I paid last week for the non-answer). In reading online, I'm not the only person who has had this issue. Also reading online a quick review seems to lead me to believe that the sensor can be replaced by itself, separate from the main computer, at a much lower cost.", "fail date": "  03/05/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "My daughter was driving our family's 2005 Honda Pilot. She applied the brake lightly which resulted in excessive breaking in the left front wheel and then appearance of the vsa light. I brought the vehicle to the Honda dealer who first indicated there was no recall and then indicated there was a vsa wire harness recall (NHTSA 13v-092) but that it did apply the vsa light going on and therefore had nothing to do with the recall. A vsa light diagnostics which I independently paid for indicated a yaw rate failure code (25-01). This light vsa light has continued to intermittently go on and off with an intermittent contemporaneous relationship to braking. On 2/25/15 my daughter was driving the vehicle on the highway (no vsa light on), applied the brakes lightly and the car braked severly even once her foot was off the brake and pulled the car in the same front right direction as before forcing her to swerve along side a passing truck. The vsa light went on after the event occurred. Calling the Honda dealer today, the service manager indicated that Honda does not have a recall on this matter once the part for the 13v-092 recall was replaced. In reviewing safer car. Gov NHTSA campaign id number dp12002 it describes well what has occurred twice and which has not been corrected by the recall service performed. I have also contacted Honda USA. I believe Honda has inadequately evaluated the relationship of similarly reported events regarding unexpected car brake assist with mild application of the brake since the vsa wire harness recall repair did not resolve the unexpected and inappropriate vsa/esc/ba system logic response. It is not clear why Honda is not addressing my matter under this recall (NHTSA 13v-092) and the referenced NHTSA dp12002, and further investigating under a known safety recall.", "fail date": "  02/03/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "My 2005 Pilot model has 108,000 miles. The vsa light started to come on while I was driving the car. Whenever that happens for a fraction of a second the brakes and steering wheel would lock up and vsa light remains on until vehicle is turned off. The stability control recall 13v092000 was performed July 2013, it was to fix this problem. Local Honda dealer found yaw rate sensor failure and wants $1,100. 00 to replace.", "fail date": "  10/17/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "I heard a loud thumping or grinding sound from the front of the car and the brakes engaged on their own. At the same time the vehicle stability warning light came on (yellow triangle). Over next three weeks this happened three times, seemingly randomly. On one occasion the \"yaw sensor\" code was triggered. The vsa recall in 2013 was performed by the dealer in 2013.", "fail date": "  10/15/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "The first incident happened while turning, car came to a stop, jerked the wheel almost hitting another car; all without warning. A child passenger was in the back seat and was thrown forward hitting her head on the passenger front seat and seat belt locked causing her to have a seat belt bruise. Vsa (light), the vsa activation light (triangle with exclamation inside) were both illuminated. SUV was taken to local dealership to perform the recall work. Two weeks later, same thing but this time I was going about 55mph on highway, SUV came to almost a complete stop within a short distance. Grinding feeling and with the vsa indicator lights on. Almost hit someone when the wheel jerked and caused me to go into the right lane and almost hitting someone, kids were in the SUV one in the passenger side front and the other in back same side. Seat belt once again left a bruise on their chest and caused the front passenger to have strained his neck. This is a vehicle that cause great concern. I am now afraid to allow my son to drive this vehicle with this problem continuing. The dealership has said that they have preformed the recall bulletin and I will need to fix this on my own. This is not satisfactory at all.", "fail date": "  06/11/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "1st incident-I was traveling at a slow rate of speed (approx. 25-30 mph). Heard a growling sound & car suddenly braked on its own. I also felt as if I had lost steering ability. The vsa light flashed on then off during the incident. 2nd incident- same as above only a week later. 3rd incident- about 2 weeks later. My wife was driving the car. Had slowed down to enter the ramp to get on the highway. Again the car made a grinding sound, the vsa light came on momentarily while the car applied the brakes on its own. All of these incidences occurred after the car was serviced for the vsa recall(13-026) on may 6, 2015. Previous to this service, we had never had any issues with the vsa. We believe that by having this recall performed, has caused another malfunctioned as a result. I have read some much more frightening incidences than ours on your site. So we are now driving our car with the vsa off! please investigate before someone seriously gets hurt.", "fail date": "  06/04/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "I went to Honda dealership on may 30, 2014 in fremont California for the safety recall campaign - installing subharness. After the dealership installed new harness for the safety of vsa (vehicle stability assistance) on the 30th of may 2014, vsa light is on when I pickup the car and the service advisor at the dealership said it was yaw rate sensor failure according to the code scanned. Before the recall, the car was ok, without the vsa light on. Basically I am driving the without vsa after the recall from Honda.", "fail date": "  05/30/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "As I was approaching a left turn lane I applied the brakes gently and the left front brake momentarily grabbed causing the vehicle to swerve into the oncoming traffic and the vsa lights activated. This has occurred 9 times in the last 300 miles. I took the vehicle to the dealer immediately and they told me they could not duplicate the problem and they found no problems with the car. Never had a problem until the \"recalled\" vsa module was replaced less than 6000 miles ago. The dealer tells me that the vsa module is not under warranty.", "fail date": "  02/07/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "Traveling 45-60 miles per hour, vsa light comes on and vehicle comes to a complete stop, no warning no brake lights nothing, vsa recall has been performed 3 times now, along with yaw rate sensor. After repairs done again on 07/28/2015 lasted until 09/09/2015 when traveling 45 miles per hour and vehicle stopped again almost causing a major accident. Anyone else out there experiencing these difficulties ?.", "fail date": "  07/12/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "After the recal of vsa it happens that the SUV experiencing the symptom of excessive braking and vsa light comes out. . . Before the recall we haven't experiencing this vsa problem. . I don't know in some reason why it comes out after the recall had been made. . First occurrence I bring it to the dealer and advise that they been check , fixed and inform it won't come out any more . . After two weeks it happend again and mynsuv will bring again to the dealer for the second time. . . I feel they make me feel worse this recall that been made . . . Is there any advice ????.", "fail date": "  06/06/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "The vehicle would apply additional brake force on the driver's side front wheel while the driver use the brake to slow the vehicle on a downhill road. The extra brake force only last 1 second or 2 but it caused the vehicle steer to the left and the vsa come on. In several occasions, the vehicle crossed the lane to the oncoming traffic. The vsa light will come on until I trun off the igintion. The Honda dealer initially suggest it was related to the vsa recall but after performing the recall work 4 times, the issue still exist. They finally determined the yaw sensor was causing the problem and replace it.", "fail date": "  04/25/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "While exiting a driveway at approximately 5 miles per hour the brakes locked without the driver applying pressure. The driver was able to get the vehicle to the center painted median with extra gas and still under unwanted braking. Once the car came to a complete stop for 30 seconds or so the brakes released. The driver then drove the vehicle at a slow speed along the curb to our house within 2 miles. It's now parked as we are afraid to drive it. A call to metro Honda in montclair was of no assistance. They said my vehicle was not effected by the recent Honda recall on the issue. The vsa light remains illuminated as well as the system warning light.", "fail date": "  03/26/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "First incident, my wife was driving approximately 45 mph when 2005 Honda Pilot began to vibrate and make a \"groaning\" noise or a noise almost like when you drive on a gravel road. 2005 Honda Pilot was also (while vibrating and making noise) abruptly slowing down/ stopping without depressing the brake pedal. It would also do this while applying the accelerator. Second incident was later that same day. I picked the 2005 Honda Pilot up from my wife as she was now to afraid to drive it. After about 10 mins of driving, I was doing about 55 mph and the 2005 Honda Pilot made the same noise and vibration as described above and also slowed down abruptly as if I hit the brakes(which I didn't). About another half mile was a traffic light as I began to slow down for light I applied the brakes gently and as I applied the brakes the brake pedal left my foot and the 2005 Honda Pilot came to an abrupt stop. This happened two more times so I pulled into a parking lot because I did not feel safe driving at that point. When I stopped in the parking lot I noticed my vsa indicator light was on. It would not turn off until I turned the 2005 Honda Pilot off. Same day I took my 2005 Honda Pilot to the local Honda dealership and they have not been able to reproduce the symptom.", "fail date": "  02/13/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Radiator problems", "description": "Loss of power on highway even when accelerator engaged. Had to pull over the shoulder. Vehicle could not be driven. Smoke was coming from the rear of vehicle but sent away after engine was shut off. Vehicle had to be towed. Service department at nearest Honda dealer cited a radiator leak that likely got into the transmission line.", "fail date": "  10/29/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Radiator problems", "description": "On 9-9-15, our 2005 Honda Pilot abruptly stopped on emerald parkway - police assisted. Leaking fluid was clumpy red/brown and vehicle hot. Shop today says radiator and transmission and possibly engine need replaced and instructed us to contact a Honda dealer. This is our second safety complaint on this vehicle - 1st was dangerous \"phantom braking\" or inadvertant application on brakes in 2012, which Honda subsequently recalled in 2013. After reading thru complaints, I see the exact same problem - transmission line in radiator suddenly came loose and transmission fluid leaked into radiator and coolant leaked into transmission, ruining both has occurred numerous times. We anticipate a very expensive repair. . . . We are thankful this did not occur on the highway, during rush hour or with any of our 3 kids in the vehicle, and are angered at Honda's failure to recall this as well - as some said they did for 2003 and 2004 models?.", "fail date": "  09/08/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Radiator problems", "description": "This is a 2005 Honda Pilot we bought in 2009. The dealer called me to say that the radiator burst and the antifreeze got mixed in with the transmission fluid causing the transmission to fail. He is now quoting a $5,000 bill to replace the radiator and the transmission.", "fail date": "  12/09/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Radiator problems", "description": "I was driving my Honda rpm started going up and down vechicle started violently started to shake. I luckly made it home. The transmission fluid and coolant had mixed. I bought a new radiator, extensive transmission flush 15 qts. Now 2 months later the vechicle is shifting hard, shaking at 35-40 mph and have been informed I need a new transmission. I have read numerous comments and reports of this Honda should be notified and a recall put in place.", "fail date": "  07/28/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Radiator problems", "description": "I had been driving for about 15 minutes when car suddenly failed to maintain speed and slowed from 45 mph to 30-35 mph. I could not get car to accelerate, engine was audibly strained and smoke was shortly evident from under hood. I put on my emergency flashers and pulled off the road as soon as it was safe to do so. No warning lights were illuminated. Smoke ceased when I turned the engine off. Upon exiting the car I observed a heavy stream of brown oily liquid draining from hood and additional blue oily fluid following shortly thereafter. I checked the fluid levels to find totally depleted transmission fluid and rapidly diminishing engine coolant. I called my Honda dealer service dept. And was advised not to drive the car and to have it towed to the service dept. Which I did. It was determined that a hose had disconnected and the radiator would need replacement. He could offer no explanation as to what caused the problem stating it had not seen it before. Total cost: $825. 00. Given the many internet complaints of this identical problem unreported to official agencies combined with those reported to Honda corporate and nhsta I am unconvinced that all Honda dealerships are unaware of this issue. I am, however, totally convinced that serious injury or death would have resulted had I been driving on a crowded highway at 70 mph when this hose disconnected causing an instantaneous loss of speed with impending engine failure. I am equally convinced that Honda corp. Is negligent in not admitting this to be a manufacturing defect worthy of a voluntary recall and financial reimbursement to it's customers. Nhsta is negligent in it's lack of attention to the serious nature of this problem and failure to mandate a recall.", "fail date": "  07/16/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Radiator problems", "description": "The contact owns a 2005 Honda Pilot. The contact stated that while driving 60 mph, the vehicle exhibited a reduction in power. The vehicle was towed to the dealer for inspection where they stated that the radiator and transmission needed to be replaced. The vehicle was not repaired. The manufacturer was notified of the failure. The failure mileage was 125,000.", "fail date": "  03/01/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Radiator problems", "description": "Like so very many other Honda Pilot owners of the timeframe, I have experienced a transmission leak and failure from a radiator failure - and though Honda had settled a class-action suit about these problems with a minor warranty extension. . . My failure, of course, happened shortly after that extension. I am out nearly $5,000 and nearly got killed when my car died because Honda has failed to properly recall these transmissions. Shame on Honda - and shame on you for not holding them to task even after they settled a lawsuit (with such a lame and still unsafe response).", "fail date": "  01/08/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Radiator problems", "description": "Transmission cooler line inside radiator failed combining fluids and causing the transmission to malfunction. Loss of ability to drive/move vehicle while on a rural road between cities during a snowstorm with my family in the vehicle. This is a common failure and requires a new radiator and replace / rebuild the transmission. A recommendation from Honda to replace the radiator every 100,000 miles for a marginal fee(similar to the timing belt) would have prevented having to replace / rebuild the transmission.", "fail date": "  12/14/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Radiator problems", "description": "I was driving up a hill when my vehicle started to lose power and high rpms upon acceleration. Was not able to climb hill so I pulled over and turned the car off. Restarted and made it a short distance before it stopped. I was fortunate to get out of harm's way prior to the car giving out completely. The vehicle had to be towed. A mechanic took a look at the vehicle and explained that transmission and radiator were both ruined and would both need to be replaced. He indicated that transmission fluid and radiator fluid mixed causing the malfunction and it also has caused the need for flushing of the engine. I have noticed that several other owners have made internet posts about the same problem. This issue should be under consideration for a recall by Honda as it sounds like a common occurrence that is the result of a design flaw. It is potentially very dangerous as this happens with no warning and causes the vehicle to stop functioning. Obviously, this would be very dangerous if it occurs at highway speeds. Thank you in advance for your consideration.", "fail date": "  12/05/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Radiator problems", "description": "Radiator failed causing the transmission fluid to mix with the coolant. My wife was stranded with my four children. We had the radiator changed and coolant and transmission fluid flushed. The transmission has not functioned properly since the problem happened.", "fail date": "  11/04/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Radiator problems", "description": "Transmission cooler line inside radiator failed commingled fluids and causing transmission to malfunction. Loss of ability to drive/move vehicle while in middle of multi-lane highway.", "fail date": "  10/28/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Radiator problems", "description": "Had a sudden failure of the transmission cooling portion of the radiator causing a loss of power to the rear wheels while driving on the highway at 70 mph. If this had happened on a busy freeway it would have been very dangerous. Upon doing an internet search I see that hundreds of 2005 Honda Pilots have suffered the same sudden failure of the exact same part causing the same condition. This usually results in damaging the transmission and costing thousands to repair. This is absolutely a safety hazard. Honda refuses to acknowledge that any problem exists. It is plainly evident that a manufacturing defect of this part exists. Any engineer who examines the data of hundreds and hundreds of accounts posted on the internet must come to the same conclusion. This is defective! this is dangerous! owners should be partially compensated for the expense of repair. Honda should be held accountable for a knowingly defective part.", "fail date": "  10/20/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Radiator problems", "description": "While driving along a rural 2 lane highway with no one behind me, the transmission appeared to slip and the engine rpm went way up. The truck slowed down. This lasted 3 or 4 seconds and then went back to normal. In a few minutes, I stopped at the light entering the village of saranac lake, NY. The 2005 Honda Pilot stopped running. I tried to restart and nothing happened at all. I put my flashers on and opened the hood. I saw a liquid that looked like chocolate milk leaking under the engine. After it was towed to a garage, the mechanic said he thought the radiator leaked and allowed the antifreeze to mix with the transmission fluid. The truck would need a new radiator and maybe a new trans and or engine. If someone had been behind me when this happened, it could have caused an accident because it caused the vehicle to slow down and the brake lights did not come on. I read that over 1 million 2003 and 2004 Honda Pilots were recalled for the same problem.", "fail date": "  10/18/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Radiator problems", "description": "On our way home to NJ from a family trip to canada we stopped for a bathroom break in the \"middle of nowhere\" maine. The car hesitated to go when stepping on the gas. I managed to drive dwon the road, the \"temp\" light went on, then I pulled over. I checked the fluids. . . . The transmission fluid was milky red. We were lucky to have cell phone service to call for a tow. I had my family, wife and two younger kids in the car. We waited for over 30 minutes for the tow truck to arrive, he had to call for transport for my family. We managed to find a service center that was willing stay open to fix our car. The car needed a new radiator and have the transmission flushed ($800), a valve broke sending coolant into the transmission. We learned that other 2005 Pilots had the same problem of which there was a recall for this issue on the 2004 Pilots, Honda would not do anything! (as a side note, I had some seat leather replaced and the color match was that of a 2004 Pilot). Since the day of the repair the transmission is very rough/bucking while shifting gears. To date, besides routine maintenance, oil changes and small parts, I have replaced the timing belt, starter, water pump, and the radiator. To have the transmission replaced would be a very costly repair. This was our family travel car and I now will only take the car around town for fear that the transmission will go. I was not in the market for a new car but due to this situation I need to get rid of this car!.", "fail date": "  08/24/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Radiator problems", "description": "The transmission line that goes into the radiator was dislodged and all the transmission fluid leaked out as well as coolant. The car had been driven about 4 miles and was parked at the time of the incident. There was no visible damage to the transmission line or the radiator but both had to be replaced according to the Honda dealer. The cost of replacement was $641. 55 and none of this was covered by Honda. We believe that this is a serious defect in the Honda Pilot and is a major problem in both the Honda Pilot and odyssey van. This connection was not damaged and simply let loose. It has occurred in many other vehicles at different amounts of mileage from my vehicle. This connection should never come loose under normal driving conditions and is a serious defect with significant safety concerns. The repair person at the dealer told me that they are seeing a lot of these problems and that the line simply blows out under the pressure from inside the radiator (he said about 110 psi) Honda should be held responsible for this defect and all Honda Pilots and odyssey vans should be recalled and the defect corrected before serious injuries occur. We believe you should investigate this further and have Honda take corrective action. As I investigated this I determined that in some cases the coolant and radiator fluid mix together and cause serious damage to the transmission. This is caused by the same problem but the repair cost go into the thousands $ because of the damage to the transmission.", "fail date": "  07/13/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Radiator problems", "description": "The contact owns a 2005 Honda Pilot. The contact stated that while driving 3 mph, the temperature gauge spiked as coolant began overflowing from the radiator. The vehicle was taken to a dealer for diagnosis and the contact was informed that transmission fluid was found in the radiator and radiator fluid was found in the transmission. As a result, the radiator, transmission cooler, transmission and all of the lines from the transmission would need to be replaced. The vehicle was not repaired. The failure and current mileage was 83,000.", "fail date": "  06/22/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Radiator problems", "description": "Got into vehicle today. Placed car into drive and the car would not accelerate. I placed it back into park and then back to drive. It finally kicked into gear. I got on the highway and drove approximately 30 miles with no problems. I made a quick stop. When I started my car again it did the same thing. I drove about a mile and the transmission starting slipping badly. It stopped accelerating completely. I had it towed to the dealer. I was informed by the dealer that the radiator had failed and had mixed with the transmission fluid. Was told the radiator and the transmission would need to be replaced. Wake up ntsb. This has been reported consistently to you as a complaint and posted on numerous forums online. This is definitely a problem with this model and Honda is not stepping up. Make them answer the complaints. Most people do not have $5000 to repair an 8 year old car.", "fail date": "  06/19/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Radiator problems", "description": "As soon as I stopped in front of my house, I saw fluid pouring from the front right engine area. Fortunately for me, the problem occurred at that moment. There were no symptoms of, or dash board alerts previous to that. ( and nothing on the street) the car was towed on a flatbed to my service center,which is a certified Honda service center. . Apparently there was a line failure that allowed antifreeze and transmission fluid to mix and go into the transmission. The radiator was replaced and coolant flushed. The transmission was flushed 6 times with 28 quarts of transmission fluid and after driving 16 miles I am aware that the tranny is compromised and am going back to flush again. My service man made it clear that there is no guarantee on the transmission. I am a woman who maintains her car diligently and could not have done anything to prevent this catastrophic failure and upon researching the problem, find other Honda owners experiencing the same thing. It is up to Honda to step up and recognize a design/product flaw and perhaps recall others before it happens to them. I sincerely hope Honda realizes that this is an opportunity to do the right thing and fix the problem.", "fail date": "  06/06/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Radiator problems", "description": "I was driving my 2005 Honda Pilot probably around 40mph, a noise, I turned on the closest road to get out of traffic and was heading up hill, the rpm dial moved irradically, the vehicle did not want to go, there were no engine lights on, the temperature gauge was normal. The vehicle shut off. I had no steering control, because I was on a hill I had to use the emergency brake to stabilize the vehicle. The vehicle had died. I turned the ignition to the off position and then tried to restart since we were on a 2 land road with no guard rail and a steep drop off beside the passenger side. When I tried to turn it on, a light came on the alt temp. I was unable to get the vehicle down and had to wait for assistance. We lifted the hood and it was not hot coming from inside but there was a fluid leaking. My vehicle was towed to the Honda dealership. I was told that this has happened to several other Honda Pilots. We could have been killed if we were on the highway when this vehicle died with no warning or lights. I was told that they think something when with the radiator which leaked fluid into the transmission. They don't know yet if the engine is dead until the work on the rest of the vehicle. The customer service person from Honda, gladys, is not willing to assure me that if my vehicle is repaired it wont happen again and that we will be safe. My family feels that this is a faulty design that cause the vehicle to have a catastrophic break down. We have own Honda's for over 25 years and have never had a complaint.", "fail date": "  04/29/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Radiator problems", "description": "While driving at approx. 45 mph, the engine blew out the middle front spark plug (I believe it's #5) and coil pack damaging the radiator and stalling the vehicle. The spark plug was original and had never been touched. The spark plug threads were stripped requiring an insert to repair the head. The coil pack was broken and the twisted wires blew the ignition coil fuse. The expelled coil pack and/or spark plug (I never did find the spark plug) also put a hole in the radiator requiring replacement.", "fail date": "  04/13/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Radiator problems", "description": "Tl- the contact owns a 2005 Honda Pilot. The contact stated that while driving 35 mph, the vehicle suddenly decelerated and she was unable to continue driving. The contact mentioned that the temperature gauge illuminated and smoke started to emit from underneath the hood. The vehicle was towed to an independent mechanic who diagnose that the transmission and radiator fluid mixed. As a result, the radiator and transmission needed to be replaced. The manufacturer was made aware of the failure who did not offer any assistance since the vehicle was not included on any recalls. The vehicle was not repaired. The VIN was not available. The failure and current mileage was 97,000. Pmb.", "fail date": "  10/12/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Radiator problems", "description": "I was driving to work when 2005 Honda Pilot stated trailing a liquid. Drove a quarter of a mile to work to find coolant and transmission fluid leaking from the front of the vehicle. Had it towed to a transmission shop found that the radiator failed causing coolant and transmission fluid to leak out. Radiator replaced, transmission flushed and serviced, and coolant system flushed final repair cost $900. This is a common failure for the Honda Pilot and should be checked out and resolved for others.", "fail date": "  10/10/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Radiator problems", "description": "Tl - the contact owns a 2005 Honda Pilot. The contact stated that after parking the vehicle he noticed oil and coolant fluid leaking. The vehicle was taken to the dealer who diagnosed that the radiator corroded internally mixing the transmission fluid and coolant which ingested by the transmission. As a result, the transmission and radiator needed to be replaced. The manufacturer was made aware of the failure who did not offer any assistance. The vehicle was not repaired. The failure and current mileage was 100,000. Pm.", "fail date": "  10/01/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Radiator problems", "description": "While driving at normal town speed (~25mph) car began overheating and speed dropped. Pulled car over to cool. Started to drive slowly home and symptom repeated. Car towed to Honda. They diagnosed as radiator and transmission fluid mixing due to failure in the radiator. Damaged the transmission that needed to be totally replaced, along with a radiator and transmission cooler. Engine also needed extensive flushing. Suggested cost was $6400 without labor. After repairs, engine damage could be assessed. This appeared to be a minor failure in the radiator that destroyed a separate system and might have damaged the engine.", "fail date": "  09/24/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Radiator problems", "description": "2005 Honda Pilot - seal or transmission cooler failed and leaked transmission fluid into the radiator. No warning lights or indicators were evident. Owner noticed leaking fluid from the radiator overflow. Both parts now require expensive replacement. Vehicle has 86,000 miles and never experienced issue before. However, there are several posts on the internet concerning the exact same issue, with little or no apparent acknowledgement by Honda of this broad issue.", "fail date": "  08/13/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Radiator problems", "description": "The contact owns a 2005 Honda Pilot. The contact stated that he noticed there was a puddle of a red colored fluid under the vehicle. In addition, the contact noticed that the automatic transmission cooler had leaked into the radiator. The vehicle was taken to the dealer and inspected. The dealer stated that the failure was common with the vehicle model. The vehicle was repaired by replacing the upper and lower hose, the radiator, the thermostat and the automatic transmission. The manufacturer was not made aware of the failure. The current mileage was 78,500. The failure mileage was 77,145.", "fail date": "  06/13/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Radiator problems", "description": "Transmission cooling portion of radiator failed causing transmission fluid to leak into the radiator and mix with coolant. Transmission drained and caused car to stop. Introduction of antifreeze into the transmission caused damage to the transmission resulting in need to replace transmission.", "fail date": "  05/08/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Radiator problems", "description": "The contact owns a 2005 Honda Pilot. While driving approximately 20 mph, the engine power reduced significantly and without warning. The contact continued to drive and upon reaching the destination an inspection underneath the hood was performed. The contact noticed a dark brown milky substance leaking from the radiator. The vehicle was taken to an independent mechanic who advised the contact that the transmission and engine would need to be replaced. The vehicle was repaired. The manufacturer was not notified of the problem. The approximate failure mileage was 67,000.", "fail date": "  04/28/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Radiator problems", "description": "2005 Honda Pilot --- 60,000 miles -- garage kept. Internal transmission hose inside radiator burst while sitting in my garage allowing transmission and radiator coolant to mix and leak. Numerous other people have experienced same issue with same vehicle. Please investigate. Radiator and transmission failure.", "fail date": "  03/02/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Radiator problems", "description": "Our 2005 Honda Pilot has been pretty good for last seven years and 132,000 miles, although we wanted to keep it to 200,000 miles. Last Saturday, out of nowhere, it started to leak thick, pink liquid on our driveway. It appeared to me, and after looking at the owner's manual, that the issue was the radiator. It was a cold day so I started to drive to the dealer, watching the engine temperature light on the way. The car only went two miles before transmission stopped working. The car has now been at a local repair shop for a week and three days while I rent another vehicle. It is my understanding that this is a common issue in Pilot's after going over 100,000 miles (catastrophic radiator failure that leads to transmission failure). Honda should make certain that owners replace the radiator components that lead to this catastrophic failure before the owner has to replace both the radiator and the transmission. I would have certainly bought a new car if I had known this was coming up on the horizon, but now my investment in this vehicle will be too high to get rid of it. It seems that with some preventive maintenance, $5000 to $7000 of repairs could have been avoided, and I bet the Honda dealer does not offer me $5k to $7k in trade in.", "fail date": "  02/18/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Radiator problems", "description": "Noticed vehicle left a large puddle in the driveway. Checked under hood and it appeared something had leaked/sprayed in the engine compartment towards the passengers side. Took to mechanic. Diagnosis of problem (paraphrased as best as I can recall)- transmission cooling part failed and leaked into radiator causing trans fluid and antifreeze to mix, flow through engine and spray out. Mechanic stated it's something he doesn't see often and it's a major repair (think 1k). A quick search of the internet shows this is an issue with 05 Honda Pilots and that Honda is not taking responsibility for it. This is obviously a design flaw or defect and they are doing nothing. Hopefully the problem was caught/addressed in time to repair without having caused additional major damage to my engine. Unacceptable.", "fail date": "  11/19/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Radiator problems", "description": "2005 Honda Pilot radiator coil failed causing fluids to mix and transmission to fail. Repair shop indicated that radiator had prematurely deteriorated causing failure. Had a new radiator installed at $500- system flushed multiple times. . . . Just about a month later- radiator failed again. Replaced but vehicle is still not running well. At @40 mph vehicle seems to randomly \"rev and stick\"- let off gas and it passes.", "fail date": "  06/15/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Radiator problems", "description": "Radiator was apparently struck by rock and cracked. The Honda Pilot was immediately towed to dealer for factory replacement. Within two months the new radiator was severely damaged and cause of crack was undetermined. After searching the internet auto blogs there appear to be numerous complaints regarding cracked radiators in Honda Pilots from random road debris. This does not appear to be common in the accord or other make and model vehicles suggestive to me that the repeated occurrence of cracked radiators in the Honda Pilot is a result of faulty design. This could lead to serious engine damage or injury if this continues.", "fail date": "  01/01/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Radiator problems", "description": "I had to replace my radiator at 37228 mileage and 85031 on 2005 Honda Pilot. The radiators are failing at the transmission fittings attached to the bottom of the radiators. There are several thousand complaints about this issue and Honda is denying there is a problem. The problem is the transmission cooler is built into the bottom of the radiator. The cooler sits in the bottom of the radiator. There are two transmission fittings on the out side of the radiator that attach to the transmission. This brings transmission fluid in the radiator cooler, cools the fluid and returns it to the transmission. Now inside the bottom radiator sits the transmission cooler which is just a small pipe witch is attached to the transmission fittings. When the fluid enters the radiator cooler it gets instantly cooled and returned to transmission because the cooler is submerged in radiator fluid. This is because the bottom of the radiator is the coolest at the bottom. What's happening is the transmission fittings are rusting away and failing allowing radiator fluid to enter the return line to the transmission. When radiator fluid enters the transmission the transmission is done. You need a replacement. These problem is happening to several Hondas and nissin. The two car company's use the same manufacturing for the radiator. The company is dense. The failing on Hondas and Nissan. If you look into this matter you will see how many people are affected by this. I replaced two radiators for this truck so far. Please look into this problem for $1400 so far. There is a defect with this radiator and Honda refuse to do anything about it. People are spending thousands of dollars for something that could be fixed by Honda and Nissan. Please issue a recall with this issue. Thank you.", "fail date": "  04/16/2008"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Radiator problems", "description": "Radiator failure due to lack of protection, resulting in puncture, loss of coolant and engine over heating. Possible engine fire.", "fail date": "  07/18/2005"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "I parked my car in front of my house at 10pm the following morning my neighbor came to tell me my car was on fire. It had been raining the previous night. My driver window was not completely closed so rain got in my car. There was black smoke coming out of the window. When I opened my door, the driver seat & driver door was on fire. I grabbed the hose & put out the fire.", "fail date": "  12/03/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "2005 Pilot was repaired under vsa recall in 2013. As of the last couple of weeks, again I experienced same exact vehicle safety issues prior to repair. This past week while I had my three children in the car, we almost lost our lives. A semi driver instead risked his own lives to keep from slamming in the back of us. We took our Pilot to Honda dealership that has serviced our vehicle over the years and they do not want to recognize issue and instead point to the same thing I am now reading here online. The dealership service department states it is the yaw sensor as the issue, not faulty repair. It is not a coincidence that Pilot owners are now once again are experiencing the same issues all over again. How many lives will be lost or changed for the worst before Honda is forced to reckon with this issue? this is wrong and unacceptable. There are other poor design flaws that we think also may have cost us so much more money, such as the vvt issues. However, the vsa repair issue is not something that can be overlooked and must be dealt with now. Specifically, my experience mostly on flat surfaces with exception of one time on a slight incline at a stop light. Both in town driving and intersate and all dry weather conditions except one occasion. The vsa light flashed, vehicle applied brake at without my foot on brake pedal. My foot was on accelerator at the time vehicle was being harshly stopped by the brakes applied. This caused the vehicle to make a bucking motion or jerking motion, also I've experienced the slight swerve. I was driving in a straight direction all of the times this occurred since the repair in 2013. It depended on the amount of pressure and length of time the vehicle acted up. Everything is just as it did prior to the repair in 2013, nothing is any different, all the same. Yet, Honda wants to say I need to cover repair.", "fail date": "  11/04/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "For the second time this week my 2005 Honda Pilot suddenly loses all power and dies, both times I was in a dangerous intersections. It scared me 2 death.", "fail date": "  08/07/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The yaw rate lateral acceleration sensor is faulty and should be included in Honda's 2013 recall of the vsa. The vehicle has the exact symptoms of the vsa recall, which was fixed on my vehicle. I purchased the car last year with very low miles, only drove for a few months before it started having issues. Started out having the vsa triangle light on dash and losing power (limp mode) only after coming out of a turn after driving vehicle for awhile. Increased to the point where after roughly 30 minutes of the vehicle running the vsa issue would happen at least once during the drive. Severity of the vsa/limp mode got worse, no power for longer at a time and the horrible grinding noise directly underneath cabin. Took to Honda complaining of these issues, couldn't replicate it so nothing was wrong. One month ago, my vehicle started having the un-commanded braking problem. Driving at 55 mph, the slightest touch to the brakes causes the vehicle to hard brake, causing a swerve at least going that fast. It has done this un-commanded braking more than once, I have been afraid to drive it and at least got it 30 minutes to my Honda dealer, which I also purchased the vehicle from. It was diagnosed with the faulty yaw rate lateral acceleration sensor. I have argued with Honda for the last three weeks over the issue, ultimately to be told that it was not included in the final recall, even though the investigation names the yaw sensor as possibly being implicated in the malfunction. $994 for the sensor alone. It is absolutely dangerous and even the dealer recommends it be fixed immediately, yet Honda has declared no fault.", "fail date": "  06/01/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Over the last year, we experienced the car's dash warning lights turning on for 1-2 seconds and the radio makes a puff sound prior to this occuring. . . This has been reported prior on your system. See incident# 10458594. Second issue is regarding the interior lights for the heating / ac console. The lights don't work. This has also been reported on your system. See incident # 10440512, 10418459, 10345735. Both issues occur when driving the vehicle.", "fail date": "  09/29/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The brakes are applying randomly without applying pressure on the brake pedal. The vsa light remains illuminated and it is unsafe to drive. 13v092 is the recall bulliten I believe applies to my vehicle, but when I search my VIN, it shows no unrepaired recalls. I have verified that the vsa subharness has not been installed prior to my purchase of the vehicle. My manufacture date falls between the timeline of this recall and also my VIN begins with 2hk, which is specified in campaign 13-026 as requiring vsa sub harness installed. I have taken it to my local Honda dealer and they have told me that it does not qualify for the recall because it is \"VIN specific\".", "fail date": "  09/01/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Faulty electrical issue. Car will just cut off and go dead especially when it rains. This was reported to Honda as a safety concern but no one ever followed up with the complaint. This should have been a recall. Car will just cut off and steering wheel locks. This occurs at any speed unexpectly without warning. Occurs while car is in motion without warning. Worsens with heavy rain. This was reported 10 years ago and even. Again about 8 years ago with no response from Honda. Occurred again today.", "fail date": "  04/07/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Unexpected for the the key ignition stop working. I never have any kind of problems with ignition key stop working with my other cars. This come to safety concern when if it happen when you on a long vacation trip and all the sudden your car ignition key just stop working and you are far from home and work or don't know anyone around there to help. How could anyone expected that this issue would happen to Honda.", "fail date": "  07/21/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The contact owns a 2005 Honda Pilot. While driving various speeds, the btm-4, bfa, abs, and tpm warning indicators illuminated. The vehicle was taken to a dealer, but hey were unable to duplicate the failure or diagnose the vehicle. The manufacturer was not made aware of the failure. The failure mileage was unknown.", "fail date": "  01/18/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Problems with vsa and vtm 4 lock. Vehicle slow dowm while drive around 30 mph.", "fail date": "  09/14/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "First issue. Honda is failing to make proper notifications concerning recalls and extended warrantees. A warrantee extension notice for my 2009 Honda accord was forwarded to me by the person across town who received my notice. Last year the same person forwarded to me a takata airbag recall notice he received for my 2005 Honda Pilot. I purchased my 2005 Honda Pilot direct from Honda and my accord from a private owner. Both vehicles are in the Honda service data base with my correct name, address, and VIN. I have no connection to that address, and the resident there does not have my name or any Honda vehicles. I have spoken to Honda service and the Honda recall center about this. Yet, in March the same issue occurred with my 2009 Honda accord. Additionally, I have not received a notice on my 2010 Honda accord (purchased from a Honda dealer), which, according to the notice, is part of the class of vehicles subject to the same extended warrantee. Honda¿s national service center could not explain to me how the mistake occurred and could not assure me that their records would be corrected for purposes of safety notifications since Honda has had my information correct in their service center database. Second issue: my notice of an extended warrantee on 2008-2010 accords is for a corrosion issue with an internal component in the srs electronic control unit that could potentially result in srs failure. The notice stated that if the dashboard srs light alerts you to an issue, you need to bring the vehicle in for inspection ASAP. The srs light in my 2005 Honda Pilot illuminates intermittently. Honda said it is not covered, but they would diagnose it for $120/hr + repairs. For purposes of vehicle safety, can your office determine if the older Honda Pilots have the same srs ecu issue as the 2008-2010 Honda accord, and thus should be subject to a recall?.", "fail date": "  03/01/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Tl- the contact owns a 2005 Honda Pilot. The contact stated that after recieving a recall repair the front driver side warning air bag light is illuminated. The contact took the vehicle to the dealer who diagnosed that the crash sensor failed and needed to be replaced. The contact had not informed the manufacturer of the failure. The failure mileage was approximately 160,000. Gl.", "fail date": "  11/24/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Tl- the contact owns a 2005 Honda Pilot. The contact stated that while operating the vehicle an electrical burning odor was present inside the vehicle. The contact then noticed smoke and flames coming from the driver side seat adjustment control. The flames were extinguished by a police officer using a fire extinguisher. During the incident the contact sustained a burned right hand. The cause of the failure was not diagnosed or repaired. The manufacturer was not notified. The failure mileage was 148,300. Jft.", "fail date": "  09/10/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "My daughter was driving our family's 2005 Honda Pilot. She applied the brake lightly which resulted in excessive breaking in the left front wheel and then appearance of the vsa light. I brought the vehicle to the Honda dealer who first indicated there was no recall and then indicated there was a vsa wire harness recall (NHTSA 13v-092) but that it did apply the vsa light going on and therefore had nothing to do with the recall. A vsa light diagnostics which I independently paid for indicated a yaw rate failure code (25-01). This light vsa light has continued to intermittently go on and off with an intermittent contemporaneous relationship to braking. On 2/25/15 my daughter was driving the vehicle on the highway (no vsa light on), applied the brakes lightly and the car braked severly even once her foot was off the brake and pulled the car in the same front right direction as before forcing her to swerve along side a passing truck. The vsa light went on after the event occurred. Calling the Honda dealer today, the service manager indicated that Honda does not have a recall on this matter once the part for the 13v-092 recall was replaced. In reviewing safer car. Gov NHTSA campaign id number dp12002 it describes well what has occurred twice and which has not been corrected by the recall service performed. I have also contacted Honda USA. I believe Honda has inadequately evaluated the relationship of similarly reported events regarding unexpected car brake assist with mild application of the brake since the vsa wire harness recall repair did not resolve the unexpected and inappropriate vsa/esc/ba system logic response. It is not clear why Honda is not addressing my matter under this recall (NHTSA 13v-092) and the referenced NHTSA dp12002, and further investigating under a known safety recall.", "fail date": "  02/03/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Electrical components of the car started to fail. Power windows didn't work for a while and then worked again. Now they all work but the main control panel in the driver's side works except for the rear driver's window. It does work if done directly from the door but not from the main control panel. Also, power locks stopped working. I changed the fuse but it blows every time we use the locks. There is some sort of short. Dealership is asking $500 to fix it. There are some other lights in the main panel that go on and off every so often. It just seems that the electrical side to the car is deteriorating by the day.", "fail date": "  11/25/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "When on high, the driver side seat warmer will literally leave burn marks on my right leg. It has worked normal until this fall when I was driving and it burned my leg. It can not be on more than a minute or will leave burn marks on the right leg. The left side still seems normal. I checked and there is not a recall on this, but in looking into it had happened to many others and the seat has started to smoke.", "fail date": "  10/01/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "On numerous occasions during the ownership of the car, especially when it is raining, damp, or snowing while driving the car for no reason it loses power. The steering wheel locks, and the car acts as if the battery has been disconnected. This has happened more than 20 times. This is a defect. I am reporting, because I realize this needed to be reported. It is a safety issue. This loss of electrical power has occurred with the original battery, as well as two other batteries over the life of the car. It appears to be electrically related. The loss of power results in the steering wheel locking and no power. Luckily, each time this has happened, I was driving at 30 miles per hour. If this ever occurred on the highway, it could resulted in an accident.", "fail date": "  08/23/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "While driving around a bend towards a red light, without my foot on the pedal my car made a weird shutter or brake pulsing, I thought I had gone over some ripple strips. When the the light changed, I proceeded to make a right turn in a busy intersection, when going almost 30 & out of the turn, my Pilot came to an unassisted abrupt stop! im so lucky the person behind me didnt rear end me! it sounded like the transmission was grinding & the tires were locked. I waited a few seconds let go of brakes & the vechile began to move but in 5 ft it did it again. Towed to dealer who cant seem to find or recreate the problem. Multiple brake, abs, vsc & electrical alarms were reported by dealer but still no solution. This car is unsafe to drive and by multiple reports this is a widespread problem.", "fail date": "  03/14/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Seat heater was used on drivers side. . Got very hot, smell smoked, leg had superficial burn. Smell plastic burning.", "fail date": "  02/21/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The contact owns a 2005 Honda Pilot. The contact stated that the key became stuck in the ignition. The contact was able to remove the key after some time however, the steering wheel then seized. As a result, the contact was unable to reinsert the key into the ignition. The vehicle was not taken to the dealer for inspection or repairs. The failure and current mileages were 102,000.", "fail date": "  06/19/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "On 6/17/2013 during my daily commute to work I was driving at a normal speed of 65mph when I noticed the \"d\" gear light on the dashboard started to blink continuously. When I got to work I looked into my owner's manual which informed there may be a problem with the transmission and I should take the vehicle to the Honda dealership. When I took the vehicle to the dealership where I mind you I just spent almost $700. 00 on 6/15/2013 for suspension maintenance informed that this issue is very popular with the Honda Pilots and it's most likely my 4th gear pressure switch for the transmission. They then informed me that it will cost $350. 00 to replace this part. When I previously looked up the part needed and how to possibly diy; I found that the part only cost between $34. 00 and $40. 00 and a beginner can change this part in about 45 minutes to an hour. So why is the dealership charging me $350. 00 to change a part that cost $34. 00 - $40. 00 and an hour labor; does technician make $310. 00 an hour these days?! Honda USA knows that they have a defective part on the Honda Pilots and refuse to conduct a recall because they rather cheat their customers than have a smaller bonus! there are articles on-line of drivers transmissions locking up because of this issue which is extremely dangerous; Honda and all other automotive makers need to be held accountable for all faulty parts within their product just any other company.", "fail date": "  06/17/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "This incident has happened on a few occasions with me driving the vehicle and additionally with my wife driving (she drives it the most). I started the vehicle, placed it in gear and started to drive it up the street. As I approached a traffic light, I glanced at the speedometer, and noticed the maintenance required and srs light on. This puzzled me because we never experienced any issues with the vehicle other than regular maintenance lights (filters, oil change, etc). I turned the vehicle off for a few seconds, restarted it and the light went out. Afew weeks later, it happened again. The difference was that this time I noticed it right after putting the vehicle in drive and driving off. Thinking it happened because of a possible glitch in the ignition, I immediately pulled over and turned the vehicle off and restarted it. Just like the first time, the light didn't come back on. The 3rd time it happened, it remained on the entire time I drove and to and from the grocery store. Now, it pretty much does it intermittently - cycling intermittent to steady at various times. After searching online for recalls, I read several complaints from drivers in various states (USA), they are experiencing the same problem and have voiced it to Honda but they haven't issued a recall; thus stating that the airbag may not deploy during an accident and they are not responsible. Instead Honda dealers are willing to charge approx. $120 for diagnostics and $300+ for repair - which is entirely unfair to us consumers. However Honda, issued a recall on the 2005 Honda odyssey which had very similar (if not exact) problems with its srs. Honda is aware of this issue and doesn't seem to care about the safety of the motorists. This is clearly a safety issue and need to be recalled on these vehicles.", "fail date": "  06/12/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Some of the a/c illuminated lights went out and back on again shortly afterwards. A few days later the lights for only some of the a/c controls are off and appear not to come back on. Fan speed, off, recirculate, rear defrost, and the mode buttons are the ones currently no longer on.", "fail date": "  03/18/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Airbag light came on intermittently. After I took it in for the recall, the dealer said the sensor was bad and needed to be replaced for $200. I had that done and the second day following, it was on again. It intermittently lit for about 3 months. Now it is almost always on. I see similar issues listed. God forbid they don't work when I need them. Not thrilled with the Pilot. Transmission light also intermittently lights (blinking d). I had this fixed years ago after the dealer said new trans for $3,000. I didn't bite on that one because the shifting was seemless. Seems that mechanics maybe rely on computer too much. Had switch changed out and it stopped for about 2 years. Now it's on intermittently again. Tire pressure is another problem. Electronics stink!.", "fail date": "  10/16/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The contact owns a 2005 Honda Pilot. The contact stated that while driving approximately 35 mph, the transmission shifted gears in a jerking motion. The vehicle was taken to an independent mechanic where the contact was advised that the computer system would need to be reprogrammed. The vehicle was not repaired. The manufacturer was not notified of the problem. The approximate failure mileage was 110,000.", "fail date": "  09/05/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Vehicle low beams stopped working. Further investigation showed charred wire and melted connector. This issue has been recognized by Honda for the same model on an earlier model year (NHTSA id 12v136000). Honda part designations and failure description match recall. I would recommend Honda expand recall to cover all effected vehicles.", "fail date": "  08/15/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "While driving home after dark, we suddenly lost both dim headlights. Have tried replacing bulbs, fuses, relays, steering column switch and nothing as worked. Checked recalls online and this same problem happened in the 2003 Pilot to which there was a recall. Same parts I understand. Luckily, there was no traffic and we were able to stop and figure out that we still had bright lights and could continue home, but having 3 children in the car and driving blind was a horrific experience and this should be added to the list of recall.", "fail date": "  07/21/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The vsa light and warning light come on within a minute of the first movement of the vehicle. When the light comes on there is a loud clunk noise and the front brake and steering locks for a fraction of a second. It has happened more than once on the highway nearly causing me to be hit from behind.", "fail date": "  02/02/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The climate control lights have gone out on the dashboard of our 2005 Honda Pilot and it has been a common complaint of other owners on internet forums. It becomes a hazard at night because the buttons do not illuminate which I believe is an extreme hazard that takes the eyes off the road for longer than needed to adjust settings. No other place in the dash has had the bulbs stop working but it seems to be happening to everyone's climate control lights. I think this is an extreme hazard similar to someone using a phone in the car and Honda should be held responsible to correct the problems.", "fail date": "  02/01/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Display lights on several buttons on climate control unit are not lit up,this makes it difficult to see & make adjustments at night. Checked all fuses,all ttare intact. Dealer states problem not covered by warranty . I checked various sites & noticed similar complaints . Plz notify if there are any service bulletins or recalls tnks. *.", "fail date": "  12/08/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The climate control lights inside our Honda Pilot have all burned out. It is extremely dangerous to change the settings at night because the light bulbs do not light up. Please fix this Honda!.", "fail date": "  07/01/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Srs warning light goes on and stays on for days, then goes off and seems ok for a while. Sometimes it comes on briefly and goes off. Lately it has come on again and has not gone off for a couple of weeks straight. There has been no accident or airbag deployment in this vehicle.", "fail date": "  06/15/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Srs wargning light on. Dealer determined that both srs front impact sensors are faulty and needed to be replaced. Front airbaigs would not deploy if needed.", "fail date": "  05/14/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "While driving on city road I heard a loud bang and smoke appeared under the vehicle. The vehicle then started running very rough so I pulled off the side of the road. I got out of vehicle and found a coil laying on the ground along with some other plastic pieces. I had the vehicle towed to my mechanic. My mechanic examined the vehicle and found that a spark plug had blown completely out of the engine block head along with the blown coil that I had picked up. The spark plug was never recovered even though I returned to the scene of the incident.", "fail date": "  04/14/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Driving along highway, headlights fail to turn on. Brights work. Unable to use headlights for any driving. Checked fuses all good, though incorrect marking on a 15a fuse slot that is 20a. All lights bulbs are good, even replaced to be sure. Found melted 16 pin connector with combination stalk switch. Unable to repair yet.", "fail date": "  03/07/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "For the second time this week my 2005 Honda Pilot suddenly loses all power and dies, both times I was in a dangerous intersections. It scared me 2 death.", "fail date": "  08/07/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "Make noice.", "fail date": "  10/20/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "2005 Honda Pilot with 145k miles suddenly started to apply brakes without warning while driving on straight, flat, dry roads at moderate speeds. If has also occurred at highway speed, but never associated with skidding, sliding, etc. The brakes appear to apply differentially, causing a swerve that needs to be corrected quickly to avoid collision with traffic. The vsa light comes on, and the triangular vsa disconnect light comes on. They both go out after the car is shut off and restarted. The local Honda dealer says there is no recall for this, but that they had reprogrammed the car's vsa during an earlier service visit.", "fail date": "  09/11/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "Faulty electrical issue. Car will just cut off and go dead especially when it rains. This was reported to Honda as a safety concern but no one ever followed up with the complaint. This should have been a recall. Car will just cut off and steering wheel locks. This occurs at any speed unexpectly without warning. Occurs while car is in motion without warning. Worsens with heavy rain. This was reported 10 years ago and even. Again about 8 years ago with no response from Honda. Occurred again today.", "fail date": "  04/07/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "Felt no power when turning steering wheel and had to pullover. After resting the vehicle I it was ok. I felt it last year in may also and dealer hillside Honda in NY just did service and power steering fluid change and charged me. I will go back thus week.", "fail date": "  02/02/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "My 2005 Pilot model has 108,000 miles. The vsa light started to come on while I was driving the car. Whenever that happens for a fraction of a second the brakes and steering wheel would lock up and vsa light remains on until vehicle is turned off. The stability control recall 13v092000 was performed July 2013, it was to fix this problem. Local Honda dealer found yaw rate sensor failure and wants $1,100. 00 to replace.", "fail date": "  10/17/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "1st incident-I was traveling at a slow rate of speed (approx. 25-30 mph). Heard a growling sound & car suddenly braked on its own. I also felt as if I had lost steering ability. The vsa light flashed on then off during the incident. 2nd incident- same as above only a week later. 3rd incident- about 2 weeks later. My wife was driving the car. Had slowed down to enter the ramp to get on the highway. Again the car made a grinding sound, the vsa light came on momentarily while the car applied the brakes on its own. All of these incidences occurred after the car was serviced for the vsa recall(13-026) on may 6, 2015. Previous to this service, we had never had any issues with the vsa. We believe that by having this recall performed, has caused another malfunctioned as a result. I have read some much more frightening incidences than ours on your site. So we are now driving our car with the vsa off! please investigate before someone seriously gets hurt.", "fail date": "  06/04/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "Yes my 2005 Honda Pilot has developed serious kncking and shaking in suspension steering , called Honda they said its not covered under recall I fell it should be for safety reasons .", "fail date": "  05/16/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "Tl- the contact owns a 2005 Honda Pilot. The contact stated that while driving 40 mph the steering wheel locked up and began to vibrate. The vehicle came to an abrupt stop and the vsa light illuminated on the instrument panel. The vehicle was taken to a dealer where the vehicle could not be diagnosed. The manufacturer was made aware of the failure. The failure mileage was 120,000 and current mileage was 122,000. The vinwas not available. Sr.", "fail date": "  05/01/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "As I was approaching a left turn lane I applied the brakes gently and the left front brake momentarily grabbed causing the vehicle to swerve into the oncoming traffic and the vsa lights activated. This has occurred 9 times in the last 300 miles. I took the vehicle to the dealer immediately and they told me they could not duplicate the problem and they found no problems with the car. Never had a problem until the \"recalled\" vsa module was replaced less than 6000 miles ago. The dealer tells me that the vsa module is not under warranty.", "fail date": "  02/07/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "Began to notice significant clockwise-counterclockwise vibration in steering wheel when driving spouse's car. Attempted to solve problem by having tires checked and balanced; no defects were identified and rebalancing didn't solve problem. When unsuccessful, took to second facility and had tires balanced again without resolution of problem. Took car to dealership, who balanced the tires a third time, with not resolution of problem. Problem continues even after replacing all tires, and wheel alignment. After researching issue on the internet, it appears as though this is a common complaint with Honda Pilot cars for multiple years, and that Honda has not issued any technical advise on how dealers can fix the problem.", "fail date": "  06/17/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "Driving on the highway at approximately 45 mph, my Honda Pilot abruptly pulled to the left. It felt like the anti lock brakes actuated. The vsa and triangle light illuminated. The Pilot was pulled off the highway where it stopped. The ignition was turned off and on an the condition cleared.", "fail date": "  01/08/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "I was driving under slightly wet conditions at a fairly low speed (approx. 25 - 30 mph) and the car seemed, momentarily, as if the left front tire had gone flat and an indicator light with a triangle and an exclamation point and the vsa light simultaneously came on. I pulled over, checked the tire, turned the car off, restarted it and everything was fine for the rest of that day. The next morning, I experienced the same thing after the car had sat all night. After turning it off and back on, the indicator and vsa lights were out, but then came back on less than 30 minutes later while idling. The weather conditions this day were cold, but dry. I made an appointment and took the car to leith Honda. I experienced the same condition while driving it to the dealer. The service advisor told me that there was no indication of a problem and the car's computer didn't indicate that the vsa had even been on. I picked the car up that night, after they had closed, and experienced the problem less than 15 minutes after I left the dealer. I then experienced it again the next day, after a cold start, and then again today, also after a cold start, but this time while idling. This is a scary and potentially dangerous situation and there are lots of reports about this problem floating around the internet. My particular experiences haven't been as bad (yet) as others have described, but the symptoms are the same (front brakes momentarily locking and steering pulling, in my case, to the left).", "fail date": "  01/02/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "Driving along a two lane highway on a 20 degree morning and coasting around a gently curving corner to the right at 45 mph when an unexpected jarring and pulling to the left occurred coupled with a loss of speed and the vsa letters and a triangle indicator lights lit on the dash board. . Needless to say this got my attention and luckily nothing was coming from the other direction. I had not touched the brake pedal until after the initial problem occurred and when I saw the lights and went along maybe 200 to 300 yds it did it again which got me very worried. I pulled over and turned the engine off and tried to reset the car but to no joy so I drove the remainder of my commute to work with the very same lights left on. The remainder of my drive was fine but not sure if I am safe driving with this anomaly and especially the sudden self braking, when will it happen next?.", "fail date": "  11/23/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "This problem began earlier in 2012 and was investigated by the dealer in June. While driving at various speeds (45-75mph), the vsa system engages, locking one wheel for a second or two, and pulling the steering wheel as if in a skid. When this stops, the vsa light is on as well as a yellow triangle with an exclamation point. When the dealer 'fixed' this in June, they repaired a tpms sensor. They also found a brake caliper stuck and fixed that as well as replaced the brake pads. Since June the issue has not occurred until yesterday. It has happened at 3 times in the past 2 days, all at @ 45 mph. This seems to be a widely reported issue and is certainly a safety concern. When this happened in June on the interstate, traffic on both sides of me dropped back because they could tell I lost control of the car.", "fail date": "  09/24/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "The contact owns a 2005 Honda Pilot. The contact stated that while driving 65 mph the front wheels and steering wheel seized abnormally. The contact mentioned that the vsc warning lamp illuminated. The failure recurred several times. The vehicle was taken to the dealer who was unable diagnose the failure but stated that they would replaced the yaw sensor and the abs sensor as a temporary remedy. The manufacturer was not made aware of the failure. The vehicle was not repaired. The VIN was not available. The failure and current mileage was 167,000. Kmj.", "fail date": "  07/16/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "Vehicle pulls to the left and wheels shimmy on freeway. Purchased 4 new tires with front and back alignment, plus tire balancing on 08-01-12. Vehicle still pulls to the left and wheels shimmy when driving on freeway.", "fail date": "  07/02/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "My wife and I have had multiple incidences with our vsa system in our 2005 Pilot over the last several months. While driving anywhere from 5-40mph, the car has locked the brakes and steering. It seems to happen randomly with no prior indications. I did a bit of research online and found no solution to my problem. I saw that the NHTSA was looking into the issue as of October, and I am hoping to find a solution soon. This is a serious issue that has the potential to cause a fatal accident if it happens at the wrong time.", "fail date": "  06/15/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "Braking and steering problems happened several times in a 11 or 12 month time frame took it to dealer 4 times and they could not get problem to duplicate and no repairs done. Accident occurred due to these problems a month ago Honda will not take ownership of problem.", "fail date": "  04/10/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "My Pilot has a very bad shake in the steering wheel whenever I reach speeds of 70mph. I've had three wheel balances (one road force balance), two alignments, rotors and brakes checked with no issues with those items. I've had to of the motor mounts replaced on the vehicle since I purchased it which I never had to do on any other vehicles I've ever owned. I told the Honda dealer that I think Honda corporation should do a recall on the motor mounts because all Pilot owners are complaining about the same issues. I still have the shaking in the steering wheel and I'm afraid that I might have to replace the third motor mount to resolve the shaking in the steering wheel. This is another expense that I can't afford but it doesn't seem Honda cares about their customers so I guess we have no other options since it seems we (Honda owners) can't get through to Honda corporation to help us!.", "fail date": "  03/16/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "It was night, and my girlfriend and I just exited the freeway, we just turned onto a side street and made it 100 yards when all of the sudden it felt like my left front tire went flat or I hit something and it dragged, I immediately pulled over to inspect, and found nothing. I did notice the vsa and vsa activation indicators on, turning the car off and then on again reset the indicators. Oddly concerned we circled back to check for anything in the road, there was nothing. It happened again just a few minutes later, and the indicators came back on. It repeated itself a third time, and I drove home very worried it would happen on the freeway. Each instance was momentary and it pulled hard left each time with a load antilock brake type jarring vibration. From reading other stories I can see that this problem isn't one of a kind, and I haven't seen anyone post a fix for it.", "fail date": "  10/12/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "The vehicle in question, a 2005 Honda Pilot ex shudders at or between 35 to 40 mph. It has almost cost me to lose control and possibly my life. This is a \"known\" torque converter problem to Honda,yet they refuse to address their negligence. Sudden,unexpected braking,without brake application is terrifying and also due to manufacturing defects. The steering controls often veer to the right without any apparent cause.", "fail date": "  09/01/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "I have a 2005 Honda Pilot which I brought at the end of 2006. Every since I have had the car when I run over a rain puddle the steering locks. I thought it was only when it was a hugh puddle but in March 2009 I rain over a puddle that came from a car wash and the same thing happen. I took it to the dealer ship and they informed me that I need a new belt. I had them replace it and 3 weeks later it rained and the same thing happen on the freeway which almost lead to an accident.", "fail date": "  03/08/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "My wife lost control , 2 lane paved road 45 mph (car damage from bumper till rear end) coming to stop in a ditch to her left. No other vehicle/involved, report was filed with insurance, car repaired ( over $10,000 ) I arrived as police officer was interviewing my wife @ our driveway, she was still crying, never had any accidents before, or speeding tickets ( very passive driver, our kids where in the car 3 and 4 years old @ the time) her explanation: the car was going out of the road to my right on its own, I tried to corrected but the steering was not responding,I felt the car going into the ditch, I pulled hard , it responded crossing the lane violently, tried to control it came back to the right hitting the stop ahead sign, swerved again to the left and stopping @ the ditch. 150 feet from the intersection,between telge rd. Westbound and grant rd. Cypress TX 77429 previous owners of Honda crv, we love theirs cars we thought it was just bad luck, things that happen, we moved on. Since then she/complained/brakes will disengaged and engage again. The car will stop but a couple of feet longer that intended. 1st. Time I replace brake pads, 2nd. Time I tried to replicate the experience but no luck. 3rd. Time new brake fluid and complete brake inspection. 12/2012 she told me again. I decided to drive the car to work myself every day. 12/29/2012 coming back from work, stop sing, hit the brakes, right before the car stops the pedal sunk completely , noises came from the wheels as if there was and on/off switch being use for braking. The car stops about 10 feet longer then intended. Being concern about a solution I started looking for any info about this online, so it could fix it this is my kids/wife vehicle. I discover all the similar cases online ,I wonder if the steering really when out of control on its own , like she swore to my in 2008.", "fail date": "  12/15/2008"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "2005 Honda Pilot has been to dealer 4 times have not fixed problem thought it was fixed rotated tires problem is back now tires are wearing on edges alignment done on car 4 times this is not the problem with pttr will go off the road in seconds if not careful this is a safety problem.", "fail date": "  06/18/2005"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "Make: Honda Pilot 2005\nplease also review:. . Read more...\n", "fail date": "  06/01/2005"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Just bought a 2005 Honda Pilot. I was informed by a mechanic that this vehicle was recalled for a rear support system rusting out and falling down. This vehicle has not been repaired. I need it repaired. Already one strut is loose!!.", "fail date": "  10/29/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Tl the contact owns a 2005 Honda Pilot. The contact stated there was an abnormal bumping sound coming from the rear end of the vehicle. The sound was heard intermittently. The vehicle was taken to van's Honda located at (2821 s oneida st, green bay, WI 54304, (920) 499-5483) to be diagnosed. The contact was informed that the tie rods were corroded and needed to be replaced. The vehicle was not repaired. The manufacturer was notified of the failure. The approximate failure mileage was 115,000.", "fail date": "  10/01/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "I recently purchased a 2005 Honda Pilot. It only has 117,000 miles on it. Motor and transmission are excellent. There was a knocking noise in the rear right passenger side. I had the shocks changed and was advised that the entire frame is rusted out. I did not notice the rust but my mechanic pointed it out to me and now I do not feel safe driving this car. Before I was advised of the rust damage I put all new brakes and tires. Im in six thousand on the car and now I have to scrap it. This seems like an issue that Honda should take responsibility for. How can the frame, chasis, and sub frame rot/rust out. This is not okay. I see many forums online discussing that this is common with older Honda vehicles.", "fail date": "  05/15/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "The complaint that I have is with lower subframe and the mounts have rusted out and is no longer safe to drive or any roads above 35mph. The driver side rear mount isnt attacked to anything bc of rust and the passenger side is rusted but not separated. The truck wobbles when u start going faster then 35mph. This happens when going straight, also while turning either direction and makes it hard to keep control if your not ready for it to happen especially. And there is a knocking noise when the truck goes into reverse that's what caused me to inspect the rear end, it's the metal hitting each other bc there is a small gap where there shouldn't be.", "fail date": "  04/13/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Structural failure of both rear suspension sub frame mounts. While driving the vehicle, the abs, awd, traction control, and brake lights all came on. I connected my code reader and it indicated that the left and right wheel speed sensors had an open circuit. Upon visual inspection of the rear wheel speed sensors, wires, and connectors, I discovered that the rear two sub frame mounts had separated from the chassis, causing the rear portion of the sub frame assembly to drop 5-6 inches, which resulted in the rear wheel speed sensor wires getting pulled from their connectors. The rear portion of the sub fram is now resting on the exhaust pipe.", "fail date": "  01/10/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "The rear cradle which has the drive shafts and rear differential has come unattached from rear crossmember due to the attachment points rusting through letting cradle and k member loose from 2 of the 4 attachment points. This seems to be a problem on several vehicles that I have seen. The crossmember rusts out from the inside out and lets the cradle loose from the vehicle causing complete suspension failure and loss of control of vehicle.", "fail date": "  08/29/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "The cross frame where part of the rear suspension is mounted rusted so the mounts are no longer attached to the frame. The suspension hangs from the other points of connection when the vehicle is up on a lift. We drilled trough the section of the frame that was not rusted and reattached the mounts with steel rod. We would not of noticed if the vehicle was not up on a lift.", "fail date": "  03/30/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Yes my 2005 Honda Pilot has developed serious kncking and shaking in suspension steering , called Honda they said its not covered under recall I fell it should be for safety reasons .", "fail date": "  05/16/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Honda Pilot 2004's compliance bushings cracked. If it is totally broken off. It can cause serious car steering problem or crash. I have seen this happen on every single 2004 Honda Pilots that my friends had as well my own Honda Pilot and possible later years of Honda Pilots.", "fail date": "  11/05/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "I took it in for a recall. I was told that the front and right engine mounts are \"cracked\". At about 25-45 mph there is a noticeable shudder under the hood. In searching the NHTSA database I find many other reports of this shudder and several saying that engine mounts are a problem in this model. The reports are in several areas including engine, suspension, drive train, transmission. It seems the engine mounts could be a common denominator. If the mounts go it could cause a catastrophic failure including loss of control.", "fail date": "  11/13/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Vehicle pulls to the left and wheels shimmy on freeway. Purchased 4 new tires with front and back alignment, plus tire balancing on 08-01-12. Vehicle still pulls to the left and wheels shimmy when driving on freeway.", "fail date": "  07/02/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "When approaching 35-40 mph, my 2005 Honda Pilot begins to shutter and I feel a lot of vibration. I have got new tires, rotated, and balanced them thinking this would help the problem to no avail. When I pass 40 mph, the noise/vibration/shuttering stops.", "fail date": "  06/01/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "My Pilot has a very bad shake in the steering wheel whenever I reach speeds of 70mph. I've had three wheel balances (one road force balance), two alignments, rotors and brakes checked with no issues with those items. I've had to of the motor mounts replaced on the vehicle since I purchased it which I never had to do on any other vehicles I've ever owned. I told the Honda dealer that I think Honda corporation should do a recall on the motor mounts because all Pilot owners are complaining about the same issues. I still have the shaking in the steering wheel and I'm afraid that I might have to replace the third motor mount to resolve the shaking in the steering wheel. This is another expense that I can't afford but it doesn't seem Honda cares about their customers so I guess we have no other options since it seems we (Honda owners) can't get through to Honda corporation to help us!.", "fail date": "  03/16/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "I recently purchased an '05 Honda Pilot from butler pre-owned dealership in butler, PA. The vehicle was leased for 3 years, and I worked the deal on the car on the internet. When a price was agreed to, I drove to butler to pick up the vehicle, however, I test drove it first. It had a very noticeable shimmy, and a shudder when driving at 50mph speeds and up. I told the salesman that this was unacceptable, so we returned to the dealership, and drove 3 other '05 Pilots on the lot, all with the same problem. The salesman and sales manager said this was a result of putting new tires on all of these vehicles, and after driving the vehicle for a while, the ride would smooth out. Well, I swallowed this line of crap, hook, line, and sinker, and after returning home, and driving the Pilot for a couple weeks, I replaced the new kumho tires with oem goodyear integrity tires, and had the wheels balanced twice, once at Honda dealer, and again at local tire shop, with latest state of the art balancing machines. After all this, the shimmering and shuddering is still as bad as it was when I brought the vehicle home, and I cannot drive this thing at highway speeds. After much research on the internet lately, I have found literally thousands of complaints from Pilot owners with the same problem that I am having. I paid $16500 for this vehicle, and can't even drive it out of town, and I'm not going to sit still and accept this as my fate. First, at the very least, the dealer mis-represented this vehicle, and I should have some recourse in this respect. Second, Honda has obviously put out a defective product, which they should be willing to fix, or compensate the victims of this type of fraudulent product. I was very happy at the prospect of purchasing a quality vehicle, which my wife and family could enjoy for years to come, and felt justified in spending the money to do so. However, I now feel sick at the prospect of paying for this mistake for the next 6 years. Please help!.", "fail date": "  11/13/2008"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "2005 Honda Pilot vibrates or shutters at low speed approximately 20-40 mpg while pushing the gas pedal. Does not do this every time so back in 2007 when brought in to dealer they couldn't find any problem.", "fail date": "  12/17/2007"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "2005 Honda Pilot developed problems with vibration at speeds of 70 mph. *** no answer required***. The vehicle was taken tot he dealer twice. The first time the dealer's technician balance the wheels but that did not correct the problem. The second time the technician rotated and balanced the wheels but the consumer could still feel the vibration while driving.", "fail date": "  08/25/2005"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Brand new 2005 Honda Pilot exl with res has a vibration between 70 mph and 80 mph. Honda will not fix this because they claim they can't drive over 65 mph and therefore can't prove the problem exists. I've had Honda balance the tires twice and paid to have a goodyear deal balance them. The problem still exists.", "fail date": "  07/27/2005"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "2005 Honda Pilot ex-l was purchased on 7-13-2005 it now has 1210 miles on it. A vibration has occured similiar to out of balance wheels and tires at around 70 mph. Dealer has balanced wheels, sent vehicle out to another tire company for rotation and spin balance. Nothing has cured the vibration. The dealer is helpful, but apparently cannot solve my problem. We feel this is an accident waiting to happen. We also understand this is not an uncommon problem, that Honda refuses to address.", "fail date": "  07/13/2005"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "My vehicle continues to have a front end shimmy at 70 to 75 miles per hour. The dealer has balanced and rotated my tires numerous times with no improvement. A high speed balance by an independent dealer has improved the shimmy but it is still annoying.", "fail date": "  06/20/2005"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "2005 Honda Pilot has been to dealer 4 times have not fixed problem thought it was fixed rotated tires problem is back now tires are wearing on edges alignment done on car 4 times this is not the problem with pttr will go off the road in seconds if not careful this is a safety problem.", "fail date": "  06/18/2005"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Since we purchased our new Pilot, we have experienced a continued steering wheel vibration at approximately 69 mph through 80 mph. Several attempts to repair the vibration have failed. The service manager said that Honda is aware of the condition but is unable to find a solution. Taking this vehicle on a trip is out of the question. We will trade this vehicle in on a different make as soon as we have enough equity to break even.", "fail date": "  06/11/2005"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "At 8,000 miles my 2005 Honda Pilot developed a vibration, or jitter at 65 mph and higher. Moderate steering wheel vibration by 73 mph. Owner had an independent tire dealer check and re-balance the wheels as needed. Vibration remained. 2 more visits to dealer who advised no problem found and go see the goodyear dealer, who wanted no part of this issue. More trips to dealer who advised the vehicle owner should consider replacing the oem tires (now at only 8,500 miles). Owner replaced oem tires with michelin ltx m/s ($700) and vibration remains. Dealer re-balanced tires on hunter 9700 machine resulting in minor improvement but basic jitter remains. Next visit the deal acknowledges jitter, it's annoyance, and blames tread pattern on the now non-oem tires. Filed complaint with Honda north America and waited 312 business hours for a return call. Honda responded when I mentioned arbitration. Honda north America reports the dealer said 'no problem found'. Now at 14,000 miles. Honda says they have no regional rep covering my area (4th largest metropolitan area in the us) and will call me back, soon. The vehicle jitter remains, 65 mph and higher, making the vehicle tiring to drive on trips of distance (vacation travel). The jitter/vibration is distracting and over rides standard 'road feel'. Honda appears to not be interested in my issue, or does not have a solution. Other Honda Pilot owners in my area, and on internet boards, report the same symptom.", "fail date": "  05/20/2005"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "My vsa light came on when I was on the freeway and made my vehicle jerk almost pushing me into the next lane. It has been coming on and turns off when I restart the car and other cars of my same modal and year have recalls for this same issue but my VIN yields no results for a recall.", "fail date": "  05/29/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "On dry asphalt the vehicle stability control (vsc) periodically activates forcing the car either off the road or into the opposing lane. This has occurred 3 times in the past year, always on dry asphalt going in a straight line. Thankfully I live in a rural area, were there other cars on the road one instant could have caused a head-on collision. The vsc light comes on when this happens but no permanent cel lights and the vsc light turns off after a restart. The recall work was done with the capacitor added to the circuit to smooth the signal and the ground connection under the driver side kick panel was cleaned according to the TSB, however, based on my experience and what has been reported by numerous other Honda Pilot owners this cheaper fix to replacing or repairing the yaw sensing circuit is concerning, particularly since Honda charges nearly $1000 for an oem yaw sensor.", "fail date": "  03/20/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Travelling on interstate w/ cruise speed set @ 70 mph. Vsa (vehicle stability assist) engaged with a brief grinding noise & pulled to the right. Very startling event. Vsa activation indicator triangle light came on, as well as, the vsa system indicator light. Have experienced the event a dozen or so times on both the interstate and roads with a speed limit of 35/40 mph, without use of the cruise control. We are original owners of the vehicle and it has been diligently worked on throughout & currently has 230,000 miles on it. Awaiting delivery of a new vehicle, but intend for my newly licensed son to drive the vehicle. Took it to my repair shop, but they couldn't replicate the issue. Replaced both front speed sensors, but the issue occurred on the interstate drive home immediately after. Hope to be able to drop the vehicle off for an extended period once I take delivery on my new vehicle. Worried the issue will occur in rain or snow & be even more dangerous. Repair shop ran diagnostic showing the yaw issue, but said the Honda generated code report only went up to 25 mph. Has always pulled to the right during activation and the grinding noise is very evident & startling. Kinda feels like maybe the abs anti-braking system engages on 1 tire for a brief few seconds in my non auto mechanic analysis.", "fail date": "  10/15/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "My children bought this vehicle for me because I lost my job due to covid aftereffects and I had to return my kia soul 2014 to the creditors. I was delivering food boxes to the elderly when the at temp light came on and the transmission started to lockup I had to pullover because the car was running hot. It was very frightening so I couldn't get home. I have never had that happen to me. Goggleing this Honda brand there has been several complaints about this model but no Honda recall this car is dangerous! and should be either recalled or taken off the market as nto to never be ever resold.", "fail date": "  03/02/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I drove over a dip in the road then heard a noise from the rear of Pilot I thought it was the muffler and it the muffler seamed a bit louder then normal but after looking at it I did not see anything diff. But a couple of days later after driving some friends to the airport and exiting I heard a metal sounding noise so after pulling in the driveway and inspecting the area of the exhaust I noticed the drivers side of the rear frame/ suspension was lower then the right side. And looking closer I saw a bolt or whatever its called that holds the frame cradle rusted off and separated from the main frame also the right side looks very rusted and concerned it could separate as well and the whole rear frame suspension could drop. I now am going to have it towed to a frame shop it is risky to drive it in the current condition. This is very bad. What if when I was driving to the airport with passengers it collapsed on the highway please look into this.", "fail date": "  11/23/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Current problem is the vsa light on the dash will not go off even after resetting the vsa button. Also has caused a triangle with ! on the dash to light up' car starts off stationary, ignition on and running with the triangle with !, after driving the vsa light comes on. Engine is running rough.", "fail date": "  06/19/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "We have been charged for multiple replacement of engine mounts on both vehicles for as long as we've had the vehicles. I've done some research on owner forums and the problem seems to be pervasive. American Honda inc. Has been completely uncooperative in helping owners with these expensive repairs, even when vehicles have been under warranty. It seems as is this problem is endemic and the product of a design flaw or a case planned obsolescence. It is not credible that Honda will not own up to its mistakes . I suppose since no one has been killed by the engine mount failures Honda feels secure. I could find no examples of fatal accidents occurring because of this defect, but perhaps your resources are greater than mine. If such a trend is discovered I would urge your agency to take immediate action against Honda. Many people are reluctant to make the repair because of the exhorbitant price of parts and labor. Thank you very much for your attention.", "fail date": "  03/13/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Starter/electrical the lights on the dashboard continues to come on and stay on. Also the starter does not want to start at times.", "fail date": "  02/01/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "On cold temperatures, and while the car is moving on the highway, the brakes will suddenly apply all by itself and the vsa off and a triangle (with exclamation) light comes on the dashboard. This causes the vehicle to strongly jerk and swerve for a second. Turning off the vsa before driving, the sudden brake will not happen. I checked recalls for my VIN but there are no open recalls. Please investigate.", "fail date": "  12/14/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Curry Honda in chambler GA has baited me in for airbag recall twice, most recently today, and then performed other work and damaged parts requiring even more repairs.", "fail date": "  09/29/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "When accelerating at approximately 35-40 mph the cars shakes and vibrates. If you let off the accelerator the shake will go away.", "fail date": "  05/02/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I experienced a sudden involuntary unintended acceleration, while I was slowly pulling into a perpendicular parking space in at a medical center parking lot. This happened on a nearly empty tank of gas at about 3:15 pm on Saturday 4/16/16. It was a hot day. The parking space was at a slight incline. I was moving very slowly nearly stopped, yet once I was about a third of the way into the space, while still gently breaking, my car suddenly lurched forward with tremendous force if I had completely floored the gas pedal. I reacted fast pushed the breaks hard with all my strength. Which engaged the antilock braking so I heard a \"thud-thud thud\" a loud repeated clunking-locking sound. My Pilot did stop before hitting a tree and the vehicle in the facing parking space. I did not hear the engine rev to the degree of the sudden forward motion. Nor did I hear revving resolve once it stopped. It was a very odd and frightening experience that baffled my mind. I tried to sort out the cause for a while to see if maybe I had without knowing it put my foot on both pedals. But I don't think so. I had sandals on, and in trying to reproduce the situation, or the position my foot would have to have been in to do that, was awkward and I would have felt the pressure on my foot of putting on the gas. And I was only slowly pressing the break not jamming on the break ¿ until I braked to stop the speed of it lurching forward. The degree of acceleration was as if the gas pedal was put to the floor which was not what my breaking foot was doing. The car did come to a stop just in time to not hit what was at the front of the parking space. I did not hear the engine noise rev at all. My best guess at the time was something went terribly wrong with the mechanics or electrical signals of the fuel injection to move so suddenly forward. Now I am worried about the safety of this vehicle.", "fail date": "  04/16/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "On 9-9-15, our 2005 Honda Pilot abruptly stopped on emerald parkway - police assisted. Leaking fluid was clumpy red/brown and vehicle hot. Shop today says radiator and transmission and possibly engine need replaced and instructed us to contact a Honda dealer. This is our second safety complaint on this vehicle - 1st was dangerous \"phantom braking\" or inadvertant application on brakes in 2012, which Honda subsequently recalled in 2013. After reading thru complaints, I see the exact same problem - transmission line in radiator suddenly came loose and transmission fluid leaked into radiator and coolant leaked into transmission, ruining both has occurred numerous times. We anticipate a very expensive repair. . . . We are thankful this did not occur on the highway, during rush hour or with any of our 3 kids in the vehicle, and are angered at Honda's failure to recall this as well - as some said they did for 2003 and 2004 models?.", "fail date": "  09/08/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Was having trouble with the tailgate not registering as closed. Upon inspecting I discovered that the latch on the tailgate was moving freely in the tailgate. It was unsecured. Upon removing the plastic tailgate trim, I spotted three specialized machine bolts. These were trapped by the tail gate trim loose unconnected. I determined that these bolts held the latch in position. I was able to properly secure the tailgate latch to the door and restore proper functionality. I believe that more locks will reveal to be improperly secured from the factory. My vehicle has never been rear ended or had any post factory repairs. The risk of injury due to defective torquing of these machine bolts is real as in the event of a crash the tailgate could come open ejecting people from the rear of the vehicle.", "fail date": "  08/22/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "While driving on the road at speeds betweeb 35-40 miles per hour the car begins to shudder intermitently. Also when driving between speeds of 75 to 80 miles per hour the same shudding occurs. I first thought may be it was the tires, but I purchased the vehicle with 85000miles on it with brand new tires. After several occurrences I took it back to the dealer for service. The service dept informed that it was the torque converter needed to be replaced and my 30 warranty had expired. After researching this I found out this problem exist with many Pilot owners but no recall was done.", "fail date": "  06/15/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "My wife was driving to work when suddenly she heard like a whirring sound and the car just suddenly shut down. She pulled on the side and noticed fluid was leaking underneath the front side of engine. We have the vehicle towed to dealership. Talking to the agent, they told us that tansmission fluid leaked into radiator and radiator coolant/trans fluid leaked into transmission. Cost of repairs: $1130 to flush out the fluids and 5000 to fix transmission. My problem is that we're upto date with the service check-up and upset that this was not prevented from happening.", "fail date": "  12/20/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I had been driving for about 15 minutes when car suddenly failed to maintain speed and slowed from 45 mph to 30-35 mph. I could not get car to accelerate, engine was audibly strained and smoke was shortly evident from under hood. I put on my emergency flashers and pulled off the road as soon as it was safe to do so. No warning lights were illuminated. Smoke ceased when I turned the engine off. Upon exiting the car I observed a heavy stream of brown oily liquid draining from hood and additional blue oily fluid following shortly thereafter. I checked the fluid levels to find totally depleted transmission fluid and rapidly diminishing engine coolant. I called my Honda dealer service dept. And was advised not to drive the car and to have it towed to the service dept. Which I did. It was determined that a hose had disconnected and the radiator would need replacement. He could offer no explanation as to what caused the problem stating it had not seen it before. Total cost: $825. 00. Given the many internet complaints of this identical problem unreported to official agencies combined with those reported to Honda corporate and nhsta I am unconvinced that all Honda dealerships are unaware of this issue. I am, however, totally convinced that serious injury or death would have resulted had I been driving on a crowded highway at 70 mph when this hose disconnected causing an instantaneous loss of speed with impending engine failure. I am equally convinced that Honda corp. Is negligent in not admitting this to be a manufacturing defect worthy of a voluntary recall and financial reimbursement to it's customers. Nhsta is negligent in it's lack of attention to the serious nature of this problem and failure to mandate a recall.", "fail date": "  07/16/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Transmission overheated, over pressurized and sprayed out bleeder valve.", "fail date": "  07/05/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I have been having problems with my transmission since I financed it in 2009. I was driving and the d would constantly flash. I took it back to the dealership and they informed me they put to much fluid in the transmission. A few months back I started hearing hearing funny noises and when I go to make a u-turn the steering wheel will become locked and it will be hard to turn the wheel back. I thought I didn't have enough power steering fluid but once it was checked everything was full. Two days ago I am driving my car and go to turn and the car wouldn't move with the gear in drive. I had to cut it off and back on then it moved and kept stopping until I was able to park it. Once I went to go park it I put the gear in reverse and the car went forward now it don't move in any gear.", "fail date": "  07/02/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Srs warning light will not go out. Cannot afford diagnostics test or new sensors. Should be recalled for safety. Many other Honda Pilot owners have same problem. Thanks.", "fail date": "  04/01/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "We have replaced all four window mechanisms on the Honda Pilot. I would consider this a manufacturer flaw that should be addressed and reimbursed by Honda. At a cost of over $500 for each window, a total of $2,000 for windows, this is a costly repair for a manufacturer defect.", "fail date": "  03/01/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I was driving at normal or crusing safe speed in neighborhood very close to my own. Without cause, collision or the means to activate, all front airbags deployed. The result was a fractured spine, requiring multiple surgeries. This incident needs to be heard.", "fail date": "  11/08/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The transmission line that goes into the radiator was dislodged and all the transmission fluid leaked out as well as coolant. The car had been driven about 4 miles and was parked at the time of the incident. There was no visible damage to the transmission line or the radiator but both had to be replaced according to the Honda dealer. The cost of replacement was $641. 55 and none of this was covered by Honda. We believe that this is a serious defect in the Honda Pilot and is a major problem in both the Honda Pilot and odyssey van. This connection was not damaged and simply let loose. It has occurred in many other vehicles at different amounts of mileage from my vehicle. This connection should never come loose under normal driving conditions and is a serious defect with significant safety concerns. The repair person at the dealer told me that they are seeing a lot of these problems and that the line simply blows out under the pressure from inside the radiator (he said about 110 psi) Honda should be held responsible for this defect and all Honda Pilots and odyssey vans should be recalled and the defect corrected before serious injuries occur. We believe you should investigate this further and have Honda take corrective action. As I investigated this I determined that in some cases the coolant and radiator fluid mix together and cause serious damage to the transmission. This is caused by the same problem but the repair cost go into the thousands $ because of the damage to the transmission.", "fail date": "  07/13/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "While parked, upon normal closing of the rear hatchback door, the license plate & frame came off my car and fell to the ground. I picked it up to re-attach to the door and discovered that the metal surrounding the bolts had sheared off from the car leaving gaping holes in the hatchback door. The license plate can not be attached to the car without some form of body work or creative macgyver type skills. My plate fell off the car while parked. My concern is if it had fallen off while moving at a high speed. It could have headed straight for a vehicle or pedestrian behind/beside me.", "fail date": "  06/17/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Front and right side motor mounts are broken according to va inspection. The vehicle only has 69k miles and being serviced regularly, how could that happen? need to pay over $500. 00 to replace in order to pass va safety inspection. Noticed many owners has the same problem.", "fail date": "  06/14/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Radiator failed, causing loss of transmission fluid, causing loss of motion. The car stopped dead in the road and could not move on its own power. From contact with other Honda Pilot and Honda ridgeline owners, I learned that this type of failure occurs frequently at around 100,000 miles. The single radiator unit cools both the engine and the transmission fluid.", "fail date": "  06/12/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The airbag/seatbelt light came on while pulling out of a parking space. The vehicle has never been in any accidents. Many Honda Pilot owners are having the same problem. Honda says they are not responsible if the airbag does not deploy in an accident. This a known issue Honda should do a recall.", "fail date": "  03/17/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Travelling on interstate w/ cruise speed set @ 70 mph. Vsa (vehicle stability assist) engaged with a brief grinding noise & pulled to the right. Very startling event. Vsa activation indicator triangle light came on, as well as, the vsa system indicator light. Have experienced the event a dozen or so times on both the interstate and roads with a speed limit of 35/40 mph, without use of the cruise control. We are original owners of the vehicle and it has been diligently worked on throughout & currently has 230,000 miles on it. Awaiting delivery of a new vehicle, but intend for my newly licensed son to drive the vehicle. Took it to my repair shop, but they couldn't replicate the issue. Replaced both front speed sensors, but the issue occurred on the interstate drive home immediately after. Hope to be able to drop the vehicle off for an extended period once I take delivery on my new vehicle. Worried the issue will occur in rain or snow & be even more dangerous. Repair shop ran diagnostic showing the yaw issue, but said the Honda generated code report only went up to 25 mph. Has always pulled to the right during activation and the grinding noise is very evident & startling. Kinda feels like maybe the abs anti-braking system engages on 1 tire for a brief few seconds in my non auto mechanic analysis.", "fail date": "  10/15/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "My car will accelerate without me pressing the gas. And my airbag light is on I'm concerned it will explode like the ones on other Honda Pilots.", "fail date": "  04/22/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Tl- the contact owns a 2005 Honda Pilot. The contact stated that while the driver drove at approximately 5mph the vehicle independently accelerated there was no warning lights before during or after the failure occurred. The driver loses control of the vehicle crashes into one parked vehicle and the vehicle came to a stop when the vehicle crashed into a brick wall. The the driver suffered internal injuries and the front passenger also suffered internal injuries. A police report was filed. The vehicle was towed for further inspection, the vehicle was destroyed. The failure mileage was not available. The manufacturer was contacted. The manufacturer provided case number 09042928. Li.", "fail date": "  10/01/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Vehicle stability assist control module is malfunctioning and the brakes are activating by themselves. . . Vehicle stability assist warning light is on and cannot turn the vsa light off. . . Honda doesn't list this VIN number as under recall that it has the same problem as the vehicles under recall. Unibody rear under frame and suspension mount corrodes and rust do to water collecting under vehicle inside the unibody. There is no weep holes for water to drip out and the suspension mounts corrode and have come off the vehicle.", "fail date": "  05/29/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Tl- the contact owns a 2005 Honda Pilot. The contact stated that while driving at about 10 mph, the speedometer dropped down to zero. She stated that the vsa light came on and the breaks automatically engaged. The contact pulled to the side and turned the vehicle off for a few minutes and then restarted it. The failure recurred and the contact notified a local dealer who did not offer any help, citing that the vehicle was not in any recall. The manufacturer was not notified of the failure. The failure mileage was 140,00.", "fail date": "  10/08/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Hace un tiempo tuve un accidente y mientras conducia solo en mi Honda Pilot y lo bolsa DE aire del lado del pasajero exploto aun cuando no habia nadie en el asiento del pasajero y la bolsa DE aire del lado mio, del conductor siendo la mas importante no abri� poniendo mi vida en riesgo.", "fail date": "  06/22/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "I was parking , when the car jolted forward, I hit the brake, but the car accerated going onto the pavement of the shopping centre, breaking two sides of a brick pillar. Both sides of the front of the car doors were destroyed and the main front, the car was a totall loss. The airbags, never came out.", "fail date": "  04/03/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Tl-the contact owns a 2005 Honda Pilot. The contact stated while driving approximately 10 mph, the gas pedal was depressed and failed respond with out warning. The vehicle was towed to a mechanic where it was diagnosed that the radiator and the transmission needed to be replaced. The vehicle was not repaired. The manufacturer was not notified of the issue. The failure mileage was 137000. Ss.", "fail date": "  09/15/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "I had let the car warm up for about 20minutes before I left. About 8:30am Saturday Dec. 14th 2013 my 2005 Honda Pilot started to accelerate on its own at a very high rate of speed. I tried to push on the brakes but it would not stop. I started praying to jesus and saying out loud god please! god please! god please! I know this sounds a little dramatic but it was very scary! I got off on the side of the road and by the grace of god something gave way. Either the accelerator stopped accelerating or the brakes finally worked but I was able to get the car to stop. From one worried car owner to another who may have had this problem or that might have this problem. I now know that I could put it in neutral and maybe turn the key off to also to get it to stop.", "fail date": "  12/14/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "I've just brought my 2005 Honda Pilot in to the Honda dealer to have the recall fixed but now it seems like the random breaking with the vsa on is more frequent after the fixed. The recall for the Honda Pilot 2005 with the vsa did not fix my vsa trouble. The trouble I getting is still the same after the fixed. \"if the control unit was damaged, the vsa system may apply a small amount of breaking force even if the driver has not pressed the brake pedal. \".", "fail date": "  05/11/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "I was driving my 2005 Honda Pilot probably around 40mph, a noise, I turned on the closest road to get out of traffic and was heading up hill, the rpm dial moved irradically, the vehicle did not want to go, there were no engine lights on, the temperature gauge was normal. The vehicle shut off. I had no steering control, because I was on a hill I had to use the emergency brake to stabilize the vehicle. The vehicle had died. I turned the ignition to the off position and then tried to restart since we were on a 2 land road with no guard rail and a steep drop off beside the passenger side. When I tried to turn it on, a light came on the alt temp. I was unable to get the vehicle down and had to wait for assistance. We lifted the hood and it was not hot coming from inside but there was a fluid leaking. My vehicle was towed to the Honda dealership. I was told that this has happened to several other Honda Pilots. We could have been killed if we were on the highway when this vehicle died with no warning or lights. I was told that they think something when with the radiator which leaked fluid into the transmission. They don't know yet if the engine is dead until the work on the rest of the vehicle. The customer service person from Honda, gladys, is not willing to assure me that if my vehicle is repaired it wont happen again and that we will be safe. My family feels that this is a faulty design that cause the vehicle to have a catastrophic break down. We have own Honda's for over 25 years and have never had a complaint.", "fail date": "  04/29/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "I have a 2005 Honda Pilot sometime shuddering between 30-40 mph. To make the shudder stop, I press or release the accelerator briefly. After checking on line about this problems with over 300 complaints. They all state that the torque converter cause the vibration. Honda still not recall. Couple of times someone almost rear end me. Please look into this problem.", "fail date": "  01/20/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Beginning 12/06 the car would slam it's brakes on, independently, when making a left turn. It happened a couple times and the dealer could find nothing. After having it happen yet again, and after detailing how this problem nearly took my life, Honda agreed to take the car and the service rep. Would drive it. I was fortunate and it happened to him very quickly. Under warranty, 1/25/07, a abs/tcs/vsa modulator was replaced. Now five years later the car has decided that if it can't independently slam it's breaks on, well, it will just independently speed up instead. Again, when making left hand turns. Guess what, now we are out of warranty and Honda is out of caring. I would be very curious to know how many people Honda has hurt or killed, just no one figured out why in the world the driver sped up or suddenly slammed on the brakes.", "fail date": "  12/04/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "When I am driving my Honda Pilot, as it is shifting between 2nd and 3rd gear, the entire car starts to shudder and seems to be fighting a stall.", "fail date": "  12/03/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Vsa warning light and ! light come on at the same time when vehicle is in motion. Lights come on after approximately 5 minutes and stay on until the vehicle is turned off and restarted. This problem began about one month ago and happens almost every day. The warning lights seem sensitive to the cold as well. The on board diagnostic computer has no registered any malfunction codes. Fortunately have not yet experienced the intense braking of other owners but there seems to be a significant problem with the vsa system on 2005 Honda Pilots.", "fail date": "  10/22/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "This problem began earlier in 2012 and was investigated by the dealer in June. While driving at various speeds (45-75mph), the vsa system engages, locking one wheel for a second or two, and pulling the steering wheel as if in a skid. When this stops, the vsa light is on as well as a yellow triangle with an exclamation point. When the dealer 'fixed' this in June, they repaired a tpms sensor. They also found a brake caliper stuck and fixed that as well as replaced the brake pads. Since June the issue has not occurred until yesterday. It has happened at 3 times in the past 2 days, all at @ 45 mph. This seems to be a widely reported issue and is certainly a safety concern. When this happened in June on the interstate, traffic on both sides of me dropped back because they could tell I lost control of the car.", "fail date": "  09/24/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "We recently purchased this car used from anderson Honda of palo alto. On several occasions the vsa has engaged for no apparent reason at speeds ranging from 10-35 mph. The vsa engaged at slow speeds when turning and at the faster speeds on the straight-a-way. When the vsa engages the vsa light and warning light turn on. The lights do go off after the car has been turned off and at rest for a few minutes. Most often when the vsa engages the car shudders slightly, both the brake and the gas pedal shudder and vibrate. The car feels like it is slowing momentarily. In the most recent episode on Nov. 27. The car was traveling 35 mph down hill and the steering pulled slightly to the left.", "fail date": "  09/12/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "I saw on the news that the NHTSA was investigating a brake issue on the Honda Pilot 2005. I experienced a similar issue but thought it was a glitch as it only happened one day (although it happened twice that day). I've finally gotten around to filing an official report both with Honda and NHTSA to hopefully aid in the investigation. The braking issue happened on two separate occasions on the same day, roughly 2 months ago. The first incident happened on the freeway. I was going the speed limit when all of a sudden I felt like the car completely lost power. The lights on the dashboard flashed, my speed decreased suddenly although I still had my foot on the gas. It only last a few seconds and then I regained control of the vehicle. An hour later, when I was off the freeway, it happened again, but this time I was going 25 miles an hour driving on city streets. Same exact issue where it felt like the car computer shut down with no power for a few seconds. It hasn't happened since, but I'm very scared that it may happen at any time again. We only have one car and have a 1 year old. I hope Honda and the NHTSA make progress into identifying the issue. Please let me know if I can contribute any more information. [xxx] information redacted pursuant to the freedom of information act (foia), 5 u. S. C. 552(b)(6).", "fail date": "  09/10/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Approximate date I put was today, but this has happened several times to my spouse within the last few years. Today is the first time I had been able to duplicate it. I just started the car, pulled out of the driveway on my way to work. About 300 yards down the road at approximately 25 miles per hour the car braked on its own twice and stopped the car. I had to get to work so I continued on. It occured two more times on my way to work. I was never going faster than 40 miles per hour. It happened once while I was braking and two times while I was at a coast. My wife just told me that it happened again to her as recently as 3 days ago. I am concerned obviously because of the safety aspect of this. I have 3 children and god forbid this happen on the freeway or at high speeds. I have seen multiple complaints on the internet of this same occurence with the 2005 Honda Pilot and they all said to file a complaint with this site.", "fail date": "  07/09/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "This has happened several times to my wife and daughter over the past month or so. They are driving along at any rate of speed and all of a sudden the car looses all power and the vehicle abruptly slows down and then recovers and begins running again. During this time the lights on the dashboard go out and flash and there is a popping sound at times. The last time it happened there was loss of all electrical to dash board system including the radio. The radio needed the code reentered which is normal for when all battery power is lost to the vehicle. I had this checked by a mechanic and they were unable to locate any problems. They checked the alternator, battery, connections and the system for any errors and nothing can be found. This is consistent with all other complaints associated with the esa, vsa/vsc and electrical systems as reported on this forum. I believe there is a major and dangerous bug in the system causing the car to loose power and control and any rate of speed. I also informed Honda customer service but they said that they are unaware of any problems (or I should say owning up to any of thier problems) and to issue a complaint through this forum. I'm afaid it's going to take a major accident and a loss of life, which is bound to happen based on the fact that the car comes to an abrupt halt, in order for Honda to own up to thier responsibility of spending the effort to identify this problem and issue a recall and get this fixed. I've been a Honda owner (currently 3 cars) for over 23 years. I'm beginning to loose loyalty and faith in the company and will definately strongly consider making a change to another make on my next purchase. Please Honda own up to the problem before someone is killed!.", "fail date": "  04/16/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Intermittent vibration in the front passenger side when accelerating, at about 30-35 mph. Sometimes just slightly noticeable and sometimes significant enough so that the entire vehicle vibrates for a few seconds. We just purchased it used yesterday and did not notice the vibrations while test driving it.", "fail date": "  02/20/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "While driving at 40 mph, the vehicle suddenly brake to about 10 mph. There was a vibration in the front end like the abs system was working--even with the foot on the throttle. Drove about 2 blocks to a parking lot. Vsa and triangle with \"!\" was on display. Stopped the vehicle and turned the engine off. After 5 minutes, the vehicle was started and driven back home. There were no display lights or sudden braking. The speed of the vehicle was now 35 mph. After driving for 10 minutes, the vehicle suddenly braked again and decelerated to about 10 mph. The vsa and triangle w/\"!\" display lights reappeared. There was a groaning sound coming from the car and the vibration returned. The more the throttle was pushed, the more the braking effect increased. The vehicle finally made it back to my home. The vehicle was parked at home where it was later towed to a repair facility.", "fail date": "  02/12/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "The vsa light and warning light come on within a minute of the first movement of the vehicle. When the light comes on there is a loud clunk noise and the front brake and steering locks for a fraction of a second. It has happened more than once on the highway nearly causing me to be hit from behind.", "fail date": "  02/02/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Beginning in September of 2010, my 2005 Honda Pilot made a groaning noise around the driver side area, swerved abruptly to the left on its own, while the cruise was set at 56mph. Following the incident the vsa warning light and the light illuminated. After first incident, it was towed to the dealership where they found diagnostic codes for yaw rate sensor failure and battery voltage failure. They found the battery negative terminal to be very loose and they tightened it. Tech's could not duplicate the problem. This occurred 7 more times over the following 3 weeks. When returned to dealership, they were advised by Honda tech's to clean the connectors on the yaw rate sensor. Codes went away and the car was returned to me. The following day the symptoms returned. Honda dealership says they must now replace the yaw rate sensor. We are waiting for our appointment for that to occur.", "fail date": "  09/22/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Saturday may 23rd I was turning left at a stop sign in the middle of a busy intersection and suddenly (as I was pressing the gas) the car began to brake on its own. Trying to move out of traffic, I increase the gas, but the more I did, the more the car resisted. (as if it was braking). It made a horribly loud noise the whole time. I tried to turn into a parking lot to get off the road, and when I barely touched the brake, it slammed stopped. I finally got pulled over, and stopped. Thinking maybe the e brake was stuck, I pushed it on, and off again. Tried to drive and it continued. Stop. Tried again. Finally made it home, and turned off the car. Shortly after, my husband drove it. Nothing happened. We ran errands that night, and Sunday afternoon with no problem. Then sun evening, it happened again. I was driving down the hwy and the car begins to brake on its own, again, making the horrible noise. It doesn't seem to matter if you hit the gas, the brake, or nothing at all. . . The car decides to brake on its own. Its uncontrollable. This is a huge safety issue! I have read forums online that say Honda has replaced computers, modules, wires, batteries, abs, sensors, 4wd, ect. Some worked, some didn't. But according to my local dealership, Honda national tech support has never heard of this issue, and the tech cannot find any problems with any of the components listed on the forum print outs we shared with them. As many complaints as I have read online that are similar to mine, I don't believe that Honda has never heard of this complaint. Sounds like a recall they don't want to acknowledge?! I am concerned for safety of myself, as well as others on the road. Many forums say this happens even when going 70mph on the hwy. Not safe! Honda doesn't have any suggestions and left me with no solution. Yet, they do not want to take credit for any liability.", "fail date": "  05/23/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "The contact owns a 2005 Honda Pilot. When the contact came to a complete stop with the brakes depressed, the rpms increased excessively. When the contact engaged the brake pedal to the floor a second time, it extended to the floor. The back end of the vehicle swung outward. She had to shift into neutral gear in order to decrease the rpms. The manufacturer was not notified. The dealer confirmed that the failure was caused by the accelerator and made the necessary repairs. One year later, the same incident occurred. The contact took the vehicle back to the dealer and the computer was reset. No additional failures have occurred. The failure mileage was unknown. The current mileage was 35,185.", "fail date": "  06/01/2008"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "I was backing out of a parking space, hit a small stanchion with my rear bumper. I put the car in drive to pull forward and there were no brakes, the car continued to accelerate, only stopping when I crashed into a parked car.", "fail date": "  05/11/2006"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Exterior Lighting problems", "description": "The contact owns a 2005 Honda Pilot. The contact stated while driving at 20 mph, the low beams of the vehicle went out inadvertently, almost causing the contact to crash into another vehicle who was coming from the opposite direction. There were no warning lights illuminated. The contact stated she turned on her high beams and was able to continue to drive the vehicle. The vehicle was taken to the independent mechanic who diagnosed that the terminal ends had melt within the wiring harness connector and the wiring harness connector or the lighting switch needed to be replaced. An unknown dealer was notified of the failure and informed the contact that her vehicle could not be repaired under the recall for NHTSA campaign number: 12v136000 (exterior lighting) as her VIN was not included in the recall. The manufacturer was not notified of the failure. The vehicle was not repaired. The approximate failure mileage was 290,000.", "fail date": "  10/06/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Exterior Lighting problems", "description": "Started vehicle to go home and turn my lights on but both low beams would not work but the high beams worked.", "fail date": "  01/08/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Exterior Lighting problems", "description": "Over the last year, we experienced the car's dash warning lights turning on for 1-2 seconds and the radio makes a puff sound prior to this occuring. . . This has been reported prior on your system. See incident# 10458594. Second issue is regarding the interior lights for the heating / ac console. The lights don't work. This has also been reported on your system. See incident # 10440512, 10418459, 10345735. Both issues occur when driving the vehicle.", "fail date": "  09/29/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Exterior Lighting problems", "description": "While driving at night both of our low beam lights suddenly went out. We had to pull over and could not get them to come back on. However, our high beam lights worked and we drove the rest of the way using high beams.", "fail date": "  08/16/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Exterior Lighting problems", "description": "2005 Honda Pilot, when I first start the car the in the morning the red indicator light for the seatbelt and airbag (drivers side airbag) on the dashboard comes on and stays on the entire day this includes stopping and turning off the engine, going into a store and coming back out, starting the engine again, continue driving for each day until I return back home. But at least two (2) days a month when I first start the car in the morning this same red indicator light on the dashboard stays off the entire day while driving the car. This includes stopping and turning off the engine, going into a store and coming back out and starting the engine again and continue driving for each day until I get back home. Each time the red indicator light is stays on or off for the day I drive my car I use city streets 25 mpr. And driving on the turnpike at 75 mph. This started in 2018.", "fail date": "  02/19/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Exterior Lighting problems", "description": "Takata recall.", "fail date": "  09/23/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Exterior Lighting problems", "description": "Vehicle low beams stopped working. Further investigation showed charred wire and melted connector. This issue has been recognized by Honda for the same model on an earlier model year (NHTSA id 12v136000). Honda part designations and failure description match recall. I would recommend Honda expand recall to cover all effected vehicles.", "fail date": "  08/15/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Exterior Lighting problems", "description": "The climate control lights have gone out on the dashboard of our 2005 Honda Pilot and it has been a common complaint of other owners on internet forums. It becomes a hazard at night because the buttons do not illuminate which I believe is an extreme hazard that takes the eyes off the road for longer than needed to adjust settings. No other place in the dash has had the bulbs stop working but it seems to be happening to everyone's climate control lights. I think this is an extreme hazard similar to someone using a phone in the car and Honda should be held responsible to correct the problems.", "fail date": "  02/01/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Exterior Lighting problems", "description": "Display lights on several buttons on climate control unit are not lit up,this makes it difficult to see & make adjustments at night. Checked all fuses,all ttare intact. Dealer states problem not covered by warranty . I checked various sites & noticed similar complaints . Plz notify if there are any service bulletins or recalls tnks. *.", "fail date": "  12/08/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Exterior Lighting problems", "description": "Lights for hvac system do not illuminate. Unable to see controls for defroster, a/c, heat, etc. When driving at night.", "fail date": "  10/11/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Exterior Lighting problems", "description": "Center consol lights are out.", "fail date": "  06/01/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Exterior Lighting problems", "description": "My wife lost control , 2 lane paved road 45 mph (car damage from bumper till rear end) coming to stop in a ditch to her left. No other vehicle/involved, report was filed with insurance, car repaired ( over $10,000 ) I arrived as police officer was interviewing my wife @ our driveway, she was still crying, never had any accidents before, or speeding tickets ( very passive driver, our kids where in the car 3 and 4 years old @ the time) her explanation: the car was going out of the road to my right on its own, I tried to corrected but the steering was not responding,I felt the car going into the ditch, I pulled hard , it responded crossing the lane violently, tried to control it came back to the right hitting the stop ahead sign, swerved again to the left and stopping @ the ditch. 150 feet from the intersection,between telge rd. Westbound and grant rd. Cypress TX 77429 previous owners of Honda crv, we love theirs cars we thought it was just bad luck, things that happen, we moved on. Since then she/complained/brakes will disengaged and engage again. The car will stop but a couple of feet longer that intended. 1st. Time I replace brake pads, 2nd. Time I tried to replicate the experience but no luck. 3rd. Time new brake fluid and complete brake inspection. 12/2012 she told me again. I decided to drive the car to work myself every day. 12/29/2012 coming back from work, stop sing, hit the brakes, right before the car stops the pedal sunk completely , noises came from the wheels as if there was and on/off switch being use for braking. The car stops about 10 feet longer then intended. Being concern about a solution I started looking for any info about this online, so it could fix it this is my kids/wife vehicle. I discover all the similar cases online ,I wonder if the steering really when out of control on its own , like she swore to my in 2008.", "fail date": "  12/15/2008"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "My vsa light came on when I was on the freeway and made my vehicle jerk almost pushing me into the next lane. It has been coming on and turns off when I restart the car and other cars of my same modal and year have recalls for this same issue but my VIN yields no results for a recall.", "fail date": "  05/29/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Just bought a 2005 Honda Pilot. I was informed by a mechanic that this vehicle was recalled for a rear support system rusting out and falling down. This vehicle has not been repaired. I need it repaired. Already one strut is loose!!.", "fail date": "  10/29/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Vehicle stability assist control module is malfunctioning and the brakes are activating by themselves. . . Vehicle stability assist warning light is on and cannot turn the vsa light off. . . Honda doesn't list this VIN number as under recall that it has the same problem as the vehicles under recall. Unibody rear under frame and suspension mount corrodes and rust do to water collecting under vehicle inside the unibody. There is no weep holes for water to drip out and the suspension mounts corrode and have come off the vehicle.", "fail date": "  05/29/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "The complaint that I have is with lower subframe and the mounts have rusted out and is no longer safe to drive or any roads above 35mph. The driver side rear mount isnt attacked to anything bc of rust and the passenger side is rusted but not separated. The truck wobbles when u start going faster then 35mph. This happens when going straight, also while turning either direction and makes it hard to keep control if your not ready for it to happen especially. And there is a knocking noise when the truck goes into reverse that's what caused me to inspect the rear end, it's the metal hitting each other bc there is a small gap where there shouldn't be.", "fail date": "  04/13/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "It was a three car accident. My car was in the middle waiting behind another car for a pedestrian crossing the road. Honda odyssey coming from behind in the other lane, changed the lane and rear-ended my car at ~15 mph. My car hit the front car. Airbags deployed in the car that rear-ended me with substantial engine damage. Driver in my car along with passenger in front passenger seat got a vertical lift with seatbelt constraints holding them in place. My car's airbags did not deploy, which is my primary concern at this point. I have received a safety recall notice from Honda Pilot about drivers front airbag inflator replacement. Is there an issue with the airbags deployment too in the current generation of Honda Pilot? I have this incident noted down with american Honda motor company and they have told me that there is no issue. I want to log in this complaint here, to make sure that we are not ignoring or missing on another recall at the cost of getting humans injured. Thank you for your attention to this matter.", "fail date": "  02/05/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Honda Pilot was serviced at ed voyles Honda on 10/22 and picked up on 10/23. Extensive service performed on car. . . Timing belt, transmission, air bags replaced per recall, engine mounts replaced, oil changed, etc. Picked up car on 10/23. On 10/24 backed out of driveway and put car in drive gear. Car accelerated without me putting foot on acceleration. Could not stop vehicle. Acceleration continued and increased. Only way to stop car was to run into a tree. Not sure if caused by recent work or I have read now that 2005 Honda Pilots have had issues with unprovoked acceleration. Usaa insurance company has totaled car and car is at junk yard now.", "fail date": "  10/24/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "When approaching 35-40 mph, my 2005 Honda Pilot begins to shutter and I feel a lot of vibration. I have got new tires, rotated, and balanced them thinking this would help the problem to no avail. When I pass 40 mph, the noise/vibration/shuttering stops.", "fail date": "  06/01/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Tl-the contact owns a 2005 Honda Pilot. The contact stated that when it rained water penetrated the driver and passenger floor. The vehicle was taken to the dealer. The dealer was unable to duplicate the failure. The manufacturer advised that they were not aware of the failure, and they advised the contact to take the vehicle back to the dealer. The vehicle was not repaired. The failure mileage was 60,000 and the current mileage was 72,000. Li.", "fail date": "  05/01/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "My wife lost control , 2 lane paved road 45 mph (car damage from bumper till rear end) coming to stop in a ditch to her left. No other vehicle/involved, report was filed with insurance, car repaired ( over $10,000 ) I arrived as police officer was interviewing my wife @ our driveway, she was still crying, never had any accidents before, or speeding tickets ( very passive driver, our kids where in the car 3 and 4 years old @ the time) her explanation: the car was going out of the road to my right on its own, I tried to corrected but the steering was not responding,I felt the car going into the ditch, I pulled hard , it responded crossing the lane violently, tried to control it came back to the right hitting the stop ahead sign, swerved again to the left and stopping @ the ditch. 150 feet from the intersection,between telge rd. Westbound and grant rd. Cypress TX 77429 previous owners of Honda crv, we love theirs cars we thought it was just bad luck, things that happen, we moved on. Since then she/complained/brakes will disengaged and engage again. The car will stop but a couple of feet longer that intended. 1st. Time I replace brake pads, 2nd. Time I tried to replicate the experience but no luck. 3rd. Time new brake fluid and complete brake inspection. 12/2012 she told me again. I decided to drive the car to work myself every day. 12/29/2012 coming back from work, stop sing, hit the brakes, right before the car stops the pedal sunk completely , noises came from the wheels as if there was and on/off switch being use for braking. The car stops about 10 feet longer then intended. Being concern about a solution I started looking for any info about this online, so it could fix it this is my kids/wife vehicle. I discover all the similar cases online ,I wonder if the steering really when out of control on its own , like she swore to my in 2008.", "fail date": "  12/15/2008"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "The part that has failed is the front motor mount on my 2005 Honda Pilot ex-l. The events leading up to the failure is normal everyday driving. Nothing out of the ordinary. This is the first time it has occurred. The vehicle is 3 yrs old and has 55,000 miles on it. The consequences are a 390 dollar bill to have the dealer replace the front motor mount. If it is not replaced the side motor mount will eventually give and cause undue strain on the transmission eventually causing total failure of the transmission. Front motor mount replaced. Old mount is available.", "fail date": "  11/04/2008"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Our 2005 Honda Pilot has a leak into the front interior on both driver and passenger side of the car. I have searched on line extensively and have seen a lot of complaints regarding leaks on the early models. Pages of complaints. From what I have read, Honda is not taking any responsibility for the issue. I have tried a number of things to fix the problem to no avail. Is there a recall or a fix for this problem? it seems widespread and needs to be addressed.", "fail date": "  06/01/2007"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "Tl the contact owns a 2005 Honda Pilot. The contact stated while at a standstill reaching back in his seat the seat riser fractured causing the driver's seat to move back and forth in the vehicle. The vehicle was not taken to local dealer to be diagnosed or repaired. The manufacturer had not been informed of failure. The failure mileage was approximately 185,000.", "fail date": "  12/31/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The driver seat left front bracket broke. The chair is able to lean back and is unstable. I researched online and I am not he only one with this issue. It seams to of started with the 2004 model and in the crv. A recall is needed. The dealer wants to charge over a $1000 dollars to replace the base. The bracket part is not being offered. This is crazy. I just sat in my chair and reached to the reached to my backseat for a bag and it snapped. Thank good my wife and kids were not in this thing.", "fail date": "  05/16/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The contact owns a 2005 Honda Pilot. The contact stated that a piece of medal frame was fractured from the front driver's seat without warning. The vehicle was not taken to the dealer. The vehicle was not diagnosed or repaired. The manufacturer was made aware of the failure. The failure mileage was 230,000.", "fail date": "  04/17/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "Tl- the contact owns a 2005 Honda Pilot. The contact stated that while operating the vehicle an electrical burning odor was present inside the vehicle. The contact then noticed smoke and flames coming from the driver side seat adjustment control. The flames were extinguished by a police officer using a fire extinguisher. During the incident the contact sustained a burned right hand. The cause of the failure was not diagnosed or repaired. The manufacturer was not notified. The failure mileage was 148,300. Jft.", "fail date": "  09/10/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "When on high, the driver side seat warmer will literally leave burn marks on my right leg. It has worked normal until this fall when I was driving and it burned my leg. It can not be on more than a minute or will leave burn marks on the right leg. The left side still seems normal. I checked and there is not a recall on this, but in looking into it had happened to many others and the seat has started to smoke.", "fail date": "  10/01/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The driver side seat split in several places and when we took it to be repaired the specialist noted that the heating element had scorched the seat in several places and was in danger of catching on fire. Whole element had to be repaired and seat replaced.", "fail date": "  11/17/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The weld failed on the drivers side seat mounting bracket on one side of the seat causing the drivers seat to move and attempt to recline.", "fail date": "  12/26/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "Driver heated seat started acting up a couple years ago. It would work in spurts and then not at all. Brought this to attention of my Honda dealer, who could not find a problem. I am unsure of exact date or mileage since I took them at their word. At this point in 2011 the seat now has one searing hot spot, when it works, and emits a burning odor. The hot spot is searing hot and will literally leave a red burn mark on your thigh. It is obviously a defective heating element with a short and I consider a live electrical short a safety and liability issue. I am reporting this as a fire since their is a burning and smoke odor . I have made an appointment with Honda economy superstore, hixson TN and will update my complaint accordingly.", "fail date": "  11/02/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": ": the contact stated while the vehicle is driven over 55 mph with the rear windows open, there is a thumping noise throughout the vehicle. This causes discomfort to the occupant's ears. The vehicle has not been seen by a mechanic. Updated 07/03/06. The leather seats were cracking.", "fail date": "  04/28/2006"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Seat Belt", "Sub Problem": "Seat Belt problems", "description": "2005 Honda Pilot, when I first start the car the in the morning the red indicator light for the seatbelt and airbag (drivers side airbag) on the dashboard comes on and stays on the entire day this includes stopping and turning off the engine, going into a store and coming back out, starting the engine again, continue driving for each day until I return back home. But at least two (2) days a month when I first start the car in the morning this same red indicator light on the dashboard stays off the entire day while driving the car. This includes stopping and turning off the engine, going into a store and coming back out and starting the engine again and continue driving for each day until I get back home. Each time the red indicator light is stays on or off for the day I drive my car I use city streets 25 mpr. And driving on the turnpike at 75 mph. This started in 2018.", "fail date": "  02/19/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Seat Belt", "Sub Problem": "Seat Belt problems", "description": "Wife while turning on insde of lot bumbed pole at kroger parking lot. Both front air bags depoyed exploding shrapenal hit my wife cuting into her arms. Honda was said they replace all air bags and assories. They sent one part. Dealer would not repair because they didnt everthing it needed.", "fail date": "  06/03/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Seat Belt", "Sub Problem": "Seat Belt problems", "description": "The contact owns a 2005 Honda Pilot. The contact stated that while driving at 35 mph, the passenger in the middle section was stuck with the seat belt around his neck. The contact merged to the shoulder of the road, attempted to release the passenger but the seat belt seized, and the seat belt buckle was stuck. The passenger sustained injuries that required medical attention. The vehicle was not diagnosed or repaired. The VIN was unavailable. The manufacturer was not notified of the failure. The approximate failure mileage was 200,000.", "fail date": "  08/18/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Seat Belt", "Sub Problem": "Seat Belt problems", "description": "Srs warning light will not go out. Cannot afford diagnostics test or new sensors. Should be recalled for safety. Many other Honda Pilot owners have same problem. Thanks.", "fail date": "  04/01/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Seat Belt", "Sub Problem": "Seat Belt problems", "description": "Srs light is on from researching it, this could be seat belt restraints, or many airbags.", "fail date": "  03/03/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Seat Belt", "Sub Problem": "Seat Belt problems", "description": "A 91 year old passenger could not release the buckle because of placement or necessary strength. The buckle should be near the middle of the waist or chest foe quick release in case of accident or other impairment due to health or if someone is trying to release it for someone. It made me think of the number of our paratroopers that drowned in europe because the release was poorly conceived. The british had a one buckle release right on their chest that saved many lives.", "fail date": "  01/14/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Seat Belt", "Sub Problem": "Seat Belt problems", "description": "My 8 year old grandson was sitting in the seat right behind the passenger front seat. He complained that the seatbelt kept getting tighter and tighter. He released the seatbelt and it retracted all the way back where it has been ever since. It no longer pulls forward more than 2 inches. This is a safety issue in that the seatbelt is no longer functional. Plus, I was very worried for my grandson because it was getting so tight on him. Any small child could become trapped. I was just relieved that he was still able to reach the latch and buckle and safely release it.", "fail date": "  07/03/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Seat Belt", "Sub Problem": "Seat Belt problems", "description": "The airbag/seatbelt light came on while pulling out of a parking space. The vehicle has never been in any accidents. Many Honda Pilot owners are having the same problem. Honda says they are not responsible if the airbag does not deploy in an accident. This a known issue Honda should do a recall.", "fail date": "  03/17/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Seat Belt", "Sub Problem": "Seat Belt problems", "description": "We bought a second hand 2005 Honda Pilot one year ago. The issue is that the front passenger side seatbelt has been worn thin (to the point where it will almost certainly fail in a crash) by what appears to be a poorly made bucikle. Where the seat belt strap runs through the buckle there appears to be a rough edge that has slowly worn through the fabric of the belt itself. The two Honda garages we contacted refused to repair the vehicle under warranty, so we have paid a local garage to fit a new belt. There has been no incident with respect to this, but we are reporting this in case others have had the same issue.", "fail date": "  03/23/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Seat Belt", "Sub Problem": "Seat Belt problems", "description": "Seat belt front passenger unsnaps unexpected while car is in motion. The car warranty covered replacement; dealer replaced seat belt. This is a potential loss of life safety hazard.", "fail date": "  01/11/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Tire", "Sub Problem": "Tire Tread/belt problems", "description": "The contact owns a 2005 Honda Pilot. When the vehicle was at the dealer for regularly scheduled maintenance, the contact was informed that all four tires needed to be replaced due to tread wear. The tires are bridgestone dueler h/t 684 ii. The current and failure mileages were 22,281. Updated 08/07/07.", "fail date": "  06/30/2007"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Tire", "Sub Problem": "Tire Tread/belt problems", "description": ": the contact stated during a general inspection at an independent repair shop, it was determined both rear tire treads were excessively worn and needed to be replaced. The manufacturer was not alerted. The tires were goodyear, p245/70r16, dot number 104s. 8ak.", "fail date": "  11/22/2006"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Problems with vsa and vtm 4 lock. Vehicle slow dowm while drive around 30 mph.", "fail date": "  09/14/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Traveling 45-60 miles per hour, vsa light comes on and vehicle comes to a complete stop, no warning no brake lights nothing, vsa recall has been performed 3 times now, along with yaw rate sensor. After repairs done again on 07/28/2015 lasted until 09/09/2015 when traveling 45 miles per hour and vehicle stopped again almost causing a major accident. Anyone else out there experiencing these difficulties ?.", "fail date": "  07/12/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "I had the manufacturer's safety recall (recall: 13-026 vsa system unexpectedly activates) work done recently. Approximately a week after I had this service done, I experienced sudden acceleration when I made hard left turn. Sudden acceleration persisted for about 3 to 4 seconds. I could not control the vehicle during that time and eventually it subsideed. I am supsecting this has something to with the safety recall fix that was done. I had slightly overshot the left I had to make and made a hard left turn then I realized that vehicle went into a sudden acceleration. I am certain that I did not have my foot on the accelerator.", "fail date": "  05/31/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2005 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "When I am driving my Honda Pilot, as it is shifting between 2nd and 3rd gear, the entire car starts to shudder and seems to be fighting a stall.", "fail date": "  12/03/2012"}]