[{"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Auto start/stop feature failed to restart vehicle and shifted to neutral when foot was taken off the brake. Collision mitigation warning lights came on after vehicle power was shut off and turned back on to restart the motor.", "fail date": "  12/04/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Third time now that my speakers have been popping and crackling. All this leads to \"network connection lost\" and the entire nav screen goes black, also the main dashboard display sometimes. . . Very unsafe. First couple of repairs were the connectors in the dash being replaced. This time my dealer has to call Honda for authorization. Received a call from dealer this morning that my battery was dead and this cleared out all of the warning codes, how convenient and it's only 3 years old. Now it needs to be kept until the warning codes \"possibly\" come back.", "fail date": "  10/28/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Frightening experiences with auto engine idle stop feature. My local mechanic, as well as the dealership where I purchased my brand new 2020 Honda Pilot elite awd were unable to address the issue. Have been experiencing electrical failures associated with my aeis for about a year that have gotten progressively worse. At first, once disengaging from aeis at a red light (by releasing my foot from the brake pedal) the radio would shut off and switch back on, but to am radio. What seemed like a few months later, when aeis was disengaging, my whole dashboard went blank and I received a message to \"shift to park + restart engine\". I have tried to be diligent in turning off aeis immediately after starting my vehicle, but in the few times I have forgotten, and my aeis has failed, the dashboard goes blank and the car shifts to neutral (indicated by the red light becoming illuminated around n). My local mechanic looked at this issue in June of 2022, and said that my battery was only holding a 30% charge, so we replaced it. After my most recent Pilot engine electrical failure, I called Honda, and was advised to contact my dealership since I was still covered by the powertrain warranty (<60k miles). To have a vehicle stalled in the middle of the road, once on i75 in stopped traffic in downtown atlanta, is an obvious safety hazard. I was trusting Honda with my family's safety when I purchased my Pilot, but that trust has been lost. Today, November 01, the dealer told me my battery was bad; it's less than 5 months old, mind you. Went straight to my mechanic, they ran a diagnostic on my battery, and was told it's fine. Called Honda corporate and set up a case investigation today.", "fail date": "  10/27/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The auto engine idle function has been problematic for a while now, causing the engine to stall. It seems to have gotten progressively worse and now happens whenever I forget to disengage the auto engine idle. One time in the spring of 2021, my husband had pulled into the intersection and was waiting for the chance to turn, only to find the engine stall and not respond to anything. It took a good almost two minutes of turning off the engine and trying to push the power button back on. It finally did turn on so we did not need a tow, but it was extremely scary to be in the middle of an intersection with a stalled engine. Subsequently the engine stalled a couple of times, briefly flashing an error message on the dashboard before shifting into neutral on its own and then indicating to shift into park. I have had the diagnostic test ($99) done at the Honda dealership (dublin, OH) and was told that they could not replicate the engine stall and that there were no error records recorded in the engine log. A few times, the engine seemed to hesitate like it was on its way to stalling after being in auto idle engine mode, but would start up when I released the brake. Today the engine stalled again when I was at a red light, briefly displaying an error mode and then shifting into neutral on its own again. I had to power off the car, and try the engine start push button a few times before it finally powered on. I am constantly worried about the engine stalling, which is not a pleasant experience. It is scary to think the engine could stall while driving the kids somewhere.", "fail date": "  10/20/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The Honda auto start stop system has been taxing my battery through daily use and creates unsafe situations. On more than one occasion, similar to the following, I have experienced the Honda Pilot stop the engine via the a. S. S. System. Upon releasing the brake, the system attempts, but fails, to come to ignition and the electrical system lacks the ability to start the engine, creating a need to re-start (or attempt restart). On 1 such occasion, my family was traveling through a city on the interstate. After driving on the interstate for a few hours we came to a stop light and stopped. At the green light, upon releasing the brake, the Honda Pilot attempted to start again and failed. The car went completely dead in the middle of a 4 lane interstate with my family inside. The car did not start again until the 3rd time attempting to restart the vehicle. Approximately 10 seconds later than intended, we were able to clear our vehicle from the interstate intersection. On normal occasions, such as the course of business with the Honda a. S. S. System, driving in situations that would be categorized as \"start/stop\" situations, the Honda a. S. S. System leads to stalled response and delayed lurching into traffic creating situations due to the delay in response. Multiple times this has been reported to my dealer. They acknowledge it as a \"battery\" problem. They test my battery per Honda warranty and tell me it \"passes\". They basically are just charging my battery and sending me out the door. The time between vehicle events is decreasing. Please help address this obvious vehicle shortcoming. There is no permanent means to disable it. Thank you.", "fail date": "  10/15/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Engine fails to restart on its own from a complete stop at a traffic light or road intersection with the auto start/stop function engaged. I was at an intersection at 10:30pm and it was extremely dangerous as my car would not start and was completely black. I could not even turn on hazards or put the car in nuetral to move out of the way. I had to call 911 and have the police assist. My car was towed to the dealership and I am waiting for an update. This will be the 4th time I have had my vehicle there for service for an electrical issue.", "fail date": "  10/08/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "My vehicle has had repeated instances of the audio \"infotainment\" system causing loud, unexpected popping and crackling noises. During these instances, the infotainment system sometimes quits working completely and often the handsfree telephone function quits working. When this occurs, the volume control and audio on off button have no effect whatsoever. It can occur with or without my telephone connected to the system. The only way to temporarily correct the condition (and it only works sometimes) is to pull off the road, turn the car off completely, and then restart it. This issue has occurred during three seperate time periods, and each time, it has progressed from intermittent to continuous. The first time I took it to the dealer and they replaced some small wiring harness connectors. The second time, they had a Honda field engineer look at the car and replaced the entire dashboard harness system (July 2022). Then today, it began doing it again. I have reported this to my Honda dealer (hendrick Honda pompano beach, FL) and they said they are contacting Honda for more information.", "fail date": "  10/03/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "When stopped at a red light, the car went into idle stop mode. When I released the brake, the car did not restart. The electrical flashed. An error message was displayed to put the car in park, press the brake and engine restart button. That did not resolve the problem. The car would not start. We could not shift it from park to move it. I was in the traffic lane on the down side of an overpass with limited visibility behind me. I was concerned about getting rear ended. The car had to be towed and the battery replaced. The original Honda dealership performs all routine maintenance with the most recent service in June 2022. There has been no prior indication that the battery was weak or needed to be replaced.", "fail date": "  09/20/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Stop/start system shutdown the engine and failed to restart while at stop light. It occurred twice on 9/8/2022 and twice on 9/9/2022.", "fail date": "  09/09/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "I understand there may be an investigation of Honda's stop-start system, the system which is meant to improve fuel economy by shutting the engine off when the vehicle comes to a stop. I experienced this one (1) time while stopping at a traffic light, date unknown. The engine went off, as it was supposed to, but when I took my foot off the brake and pressed on the accelerator nothing happened, the engine had not restarted. I attempted to restart the car by pressing on the start button but since I was in drive it wouldn't start. I think I tried to shift the transmission into park (it's been several months since the incident) but I'm not sure if it shifted or not. I turned the car off by pressing the start button, waited briefly and then pressed the start button again to start, which it did. I shifted into drive and pulled away. That was a long time, probably not as long as it seemed, sitting at the light as others were going around me or blowing their horn at me. I have not had any further incidents since that time but wanted to register this one with you.", "fail date": "  09/07/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "I have owned the 2020 Honda Pilot touring since Jan. 2021. Up till now, theses similar situations have happened 4-5 times. It always happens when I am gradually slowing down to a complete stop at crossroads. My 2020 Honda Pilot has shut off a few times while stopping at a red light. Each time has been after coming to a complete stop at a red light and sitting there for a couple minutes. Suddenly there is a beep sound and the engine shuts down. Only the entertainment system is left on. The gear changes to n by itself and I am unable to change it to any other gear. With my foot on the brake, trying to change the gear and trying turn off the car for about 3 minute in the middle of traffic with my kids in the car, eventually I was able to shut off the engine completely off. I immediately try restart the car to avoid a car accident. It put itself in n (neural) and the dashboard screen said “put it in p (park) and hit bottom to restart car. ” the car wouldn’t let me push anything. The power button did nothing and even if you pushed the p for park it stayed in n. The battery light immediately came on when this happened also. And went away as soon as it worked again. I scheduled an appointment after the third time the this happen leaving the car for them to run tests. They ran the tests and when I returned to pick it up, the technician said they tested the battery, wiring, and engine and that everything was good. Nothing was provided to me but they did show me the report as they talked about the results I am sure I can obtain if requested. They almost changed me for the testing but waived the fee which I was thankful. I am concerned and at times scared for the safety of my kids and I. I really hope Honda finds a fix for this and recalls for whatever the issues are as quickly as possible. I like the car but it really is making me want to get a new car and never purchase from Honda again.", "fail date": "  09/06/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "There is a popping and crackling sound that comes from the speakers whether it is on or off. When this occurs the infotainment system, rear entertainment system, and blue tooth stops working. This happens every single time the vehicle is used. This causes distracting driving because the noises happen all of a sudden when driving. Second problem-the car seems to shut off and turn back on by itself after pressing the gas when its on auto idle shut off. For a few seconds when I let go of the brake peddle, instead of turning on from the auto idle shut off it just shuts off, then I press the gas and it turns on. It has done this several times that it is concerning and I fear it can cause an accident if it moves forward when I think it shut off on its own.", "fail date": "  08/17/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Issues with infotainment system, a continuous crackling sound, sounds like electric spark. This occurs for several days and now the system is not working and this affects the operation of backup camera.", "fail date": "  08/12/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Vehicle has died when at a stop light, would not automatically restart. Days later the vehicle’s electrical system would not allow the car to start, many code warnings on display. Have had it towed. Battery would not jump and vehicle would not shift into neutral. Found out it needed a specialized tool only the Honda service had.", "fail date": "  08/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "When I drive the 2020 Honda Pilot it has started to make a cracking noise when I turn or go over any bumps in the road. It cuts off navigation and phone conversations from my infotainment system. The cracking noise happens if the system is on or off. It makes it difficult to even carry on a conversation with someone in the car. Not what I expected when I paid over $40k.", "fail date": "  07/29/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Died and switched into neutral by itself, wouldnt start or switch into drive mode- in the middle of a busy intersection! it was scary and dangerous trunk doesn't open/close properly infotainment center dies unexpectedly, freezes, won't restart on it's own. Have to pull over and restart car a few times or let the car sit off for a while speakers crackle at random times took the car numerous times to marin Honda, the computer they plug the car into showed \"no codes\" so they said there wasn't an issue. No warning lights of any kind. Electrical just shuts down.", "fail date": "  07/28/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The vehicle radio/nav, display goes completely out. Sometimes it just goes full volume. Makes full volume popping noises out of the blue. Sometimes is blacked out and sometimes it just won't turn on or shut off. Symptoms have be getting progressively worse and worse. I'm afraid of the other systems this will effect due to the bus system. It is very scary to my wife when it just goes full blast and I'm afraid it's going to cause an accident. It's been doing things for a year since 12000 miles or so, but it had just recently gotten terrible.", "fail date": "  07/25/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Vehicle shut down and failed to start at stoplight. It was as of it shifted off or in to neutral. Battery light showed red when initially tried to restart. Finally engine started after tuning off and back on again. I believe it was a failure of the auto engine stop system currently under investigation. It has had repeated issues lately getting going at stop lights but this was the first couple shutdown.", "fail date": "  07/11/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "My Pilot has approximately 25,000 miles. I was stopped at a red light, my vehicle has the ignition shut off feature, which engaged while I was stopped. When the light changed and I went to accelerate, instead of the engine restarting, the entire car stalled and would not restart. There were a variety of flashing lights and the car appeared to have power but the engine would not turn over. I immediately turned my hazard lights on, but each time I tried to restart the car, the hazards would turn off which was particularly concerning. The police responded and we looked for options to get the car into neutral so we could move it out of the intersection but there appears to be no option for a layman to manually override the transmission and place the car in neutral. As a result I was stranded in my vehicle for nearly 3 hours in an intersection while I waited for a tow truck. There had been no prior indication of any issues with the vehicle. It was purchased used and I have only put approximately 2,000 miles on it since purchasing. The vehicle was towed to the dealership and is awaiting inspection. While my experience was terrible, I am terrified to think of how much worse this could have been if I had stalled in traffic on a highway or with my children in the car.", "fail date": "  06/30/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Incident happened 3 times in 1 week (June 8th, 11th, & 15). When stopped at a light or in traffic the car shuts down. The engine does not restart when it's supposed to, leaving us with a dead vehicle. The car had to be jump-started to get the vehicle moving again. In worst cases, the battery doesn’t even hold a charge. Other issue would be when pressing the gas the car would stall sometimes before accelerating.", "fail date": "  06/15/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Auto engine idle engaged and the vehicle died and would not restart. The vehicle has died a couple of times in the past in similar circumstances but always restarted until the most recent incident. This left us stranded in the middle of the road at an intersection with no way to put the vehicle in neutral and push it to the side of the road which is another unrelated safety complaint. The car cannot be taken out of park when not running. The component has not been inspected as of the time of this complaint but is being scheduled for review by the service shop. There were no warnings or messages prior to the incidents occurring.", "fail date": "  06/04/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The radio began making crackling noises. After a week or so, the entire system (navigation, clock, charging ports, dvd, radio/ sound system) stopped working completely. Shortly there after, the battery became completely drained. The dealership refused to honor the 100 month battery warranty, so I was forced to purchase a new battery. The radio & electrical system began to work again, but only for a week. Then the crackling sound began again, followed shortly thereafter with the entire system not working again.", "fail date": "  05/10/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The infotainment system makes a popping/crackling sound. The dash display and infotainment display flickers on and off at times. This condition makes impedes the use of the the user controls and feedback systems. The vehicle went in for service on October 15, 2021 to have a technical service bulletin update implemented. The vehicle started exhibiting the issue again on February 9, 2022 in a much more extreme and severe way. It went back for service on February 15, 2022 to have the original work \"inspected\". The dealer said everything was fine and did nothing. Honda as implemented a couple of technical service bulletins, but no permanent fix has been implemented. The dealer mentioned that they apply this TSB to approximately 2 Pilots per day.", "fail date": "  02/09/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Since new, the audio/navigation system has repeatedly turned off and on, had crackling noises emitted from the speakers and issues system warnings. I retuned my first Pilot for the same issues and now this Pilot is demonstrating the same issues. I have had the vehicle at the dealer several times and they just say that it’s common with this vehicle model and the passport with navigation systems. Honda national service does not return calls and this issue is noted on many Honda forums. This condition is unacceptable and dangerous.", "fail date": "  01/26/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Stopped and put the car in park and the entire vehicle shut completely down. No electrical power. Wouldn't start up again. Took about 3-5 minutes before I could restart it.", "fail date": "  01/21/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "I was driving and a loud cracking popping noise started coming from the dash. The stereo went dead and the instrument panel went dead. I was startled at the noise and almost lost control of the car. I can’t see my speed or other functions of the car. Honda has no permanent fix for this.", "fail date": "  12/27/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "On multiple occassions, my engine auto idle start/stop has malfunctioned. In particular, when the car goes into idle while stopped at a traffic light, there are times when the car completely shuts off. This is dangerous at any time because it has been unpredictable. The problem gets more frequent until finally the car won't start. Upon taking the car to keating Honda in conroe TX twice for the inability to start the car, I have had my battery replaced twice within the last year. They have not been able to identify any parasitic drains to the battery. At 39,000 miles, my 2020 Honda Pilot elite required it's 3rd battery. The problem has been labeled battery failure, but frankly the problem has been the engine auto idle start/stop feature and I am certain this feature is directly related to the battery failing.", "fail date": "  11/01/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "My 2020 Honda Pilot has stalled 4 times in the past two weeks after the auto engine idle occurs at a red light. The engine will shut off automatically, but when I lift my foot from the brake, the car engine does not turn back on, and the car shifts into park, and acts as if stalled. In order to get the car to restart, I have to power down completely, open the driver side door(!!!) and “reset” the whole system before I can apply the brake and press the ignition button. Even then a couple of times it doesn’t start for me doing that, and I have to cycle through the entire process a second time. This happened to me with my 3 children in the car twice on very busy (50mph) roads, and is incredibly dangerous. The second major issue I have noticed, but less frequently (about 3-4 times in the past 6 months), is that the auto braking system will randomly alert and apply the brakes while I’m driving down a straight road with no traffic in front of me! needless to say, terrifying. This thankfully only lasts a few seconds before I regain control of the car, but also incredibly dangerous. I am scheduling service with Honda to evaluate ASAP, but I have read *many* accounts of the exact same problem online and every single person says Honda has never been able to find any cause. Some say replacing the battery helps, others say the stalling issue remains after battery replacement. If we can’t solve this problem, or have the auto engine idle completely and permanently disabled, I will be selling this car very soon. 16,104 miles driven as of today.", "fail date": "  10/25/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The infotainment screen in the vehicle which includes the backup camera display, navigation, radio, bluetooth and other important vehicle functions and settings, shuts down and reboots in a continuous loop and sometimes turns off (blank screen) completely. This results in a backup camera function that is no longer useable as the screen does not/cannot display the camera image behind the vehicle. This is an SUV with a large rear blind spot that cannot be viewed simply by turning your head especially if there are short/small objects below the view of the rear glass. The other functions that rely on the screen also do not work and this constant rebooting/flashing is very distracting to the driver. There are also strange noises emanating from the sound system regardless of whether the system is on or off. This appears to be a widespread problem with this vehicle that still does not have a permanent solution. Several repair attempts by the oem have not fixed this issue.", "fail date": "  10/01/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "I'm reaching out to you because I have no options and am completely frustrated. After looking into it (simple google search), I know I'm not alone. There appears to be hundreds (or thousands) of 2020 and other year Honda Pilots where the infotainment system is failing. It begins with \"pops\" & \"crackles\" and just keeps getting worse. Also, intermittently, you will get error messages or a blank screen which could be dangerous. The problem comes and goes which makes it even more frustrating. I have personally taken my 2020 Pilot elite (msrp near $50,000) into my local Honda dealer 4 times already. Ten days after the most recent \"repair\" it has started all over again. In the past they have admitted they really don't know how to fix it and just keep replacing harnessing and wiring. They want me to bring it in again for a 5th time. Why should I bring it in when they clearly have no fix? the Pilot was purchased from shottenkirk Honda (cartersville, GA) in may 2020 and currently has around 30,000 miles on it. . My father lives in another state and he asked his local Honda dealer if they knew of the issue. They quickly admitted they did and again, admitted they don't know how to remedy it. If you do any simple research you will see it over and over. You can start with this simple google search: Honda Pilot infotainment problems. As I said, I haven't found anyone who states it's been fixed permanently. I do appreciate the efforts and kindness of my local dealership (shottenkirk) but at what point will Honda step up and do something of substance to fix the issue or replace the vehicles? this, in my opinion, is not a \"shottenkirk\" problem, it is a \"Honda\" problem. I have tweeted Honda north America and Honda customer service and simply got a reply that says they've created a file and will look into it.", "fail date": "  09/24/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Head unit has supposedly been \"fixed\" already, still losing all electronics, black out screen, loud and startling popping noises. Been asking Honda to fix for months, assigned a case, they just do not seem to care and now vehicle is undrivable due to loud, startling sound that may cause an accident, as well as not knowing if any of the safety electronics are working or not. It almost sounds like shorting out and that means possibility of electrical fire. Honda is dragging their feet doing anything on this obviously as this has been going on for months.", "fail date": "  08/25/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The contact owns a 2020 Honda Pilot. The contact stated that the vehicle was experiencing hard starts. Additionally, the contact stated that the autostart function of the vehicle failed to engage automatically while attempting to drive from a complete stop. There were no warning lights illuminated. The contact stated that the failure reoccurred and the vehicle shut off while at a complete stop. The contact was able to restart the vehicle. The vehicle was taken to the dealer where the battery was replaced. However the failure persisted. Additionally, the contact stated while driving in an intersection, the vehicle stalled. The contact was able to restart the vehicle after several attempts. The vehicle was taken to the local dealer where it was diagnosed that the battery needed to be replaced. The vehicle was repaired. The manufacturer was not notified of the failure. The failure mileage was approximately 30,000.", "fail date": "  06/08/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "When vehicle is on, in drive-braked-or parked status, an incremental sound of electrical crackling and popping increasingly develops both in noise level and intensity, and emits throughout the vehicle. Culmination of this erratic electrical activity results in a loud chromatic/bursting \"crack\" sound and shutdown of the audio system. Component - appears to be in the wiring harness and electrical system connections. Safety issue - total distraction to driver's attention, disturbing, and alarming concern to passengers. Problem confirmed or reproduced - yes. Diagnostic errors captured and recorded on multiple occasions, with shutdown randomly occurring. Warning and appearance - no warning or apparent related catalyst is evident. First occurrence at 7,000 miles and continues.", "fail date": "  05/01/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "My vehicle was recalled twice before 2,500 miles for wiring harness connector issues (snapping, popping, crackling). I was told I could lose visibility with all dash functions, navigation, radio, etc. After the first and second recall service fix I continued to experience the same symptoms. I opened a case with Honda in June, 2021, and notified my local dealer. The Honda case number is 12314702. I have heard nothing from either Honda and my local dealer, and I am concerned nothing is being done on this issue and I will lose visibility of my dash at some point, putting myself and family in danger.", "fail date": "  04/17/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Tl the contact owns a 2020 Honda Pilot. The contact stated that while driving at various speeds, the vehicle intermittently stalled as the brake warning light would illuminate on the instrument panel. Each time, the contact would coast to the side of the road and resume normal driving soon after failure. The contact also stated that upon approaching a stop light, the brake pedal depressed to the floorboard as the brake made an abnormal grinding sound. The brake warning light illuminated on the instrument panel. The contact had taken the vehicle to Honda of tomball (22727 TX-249, tomball, TX 77375) on three occasions and each time the mechanic were unable to duplicate failure. The manufacturer was not notified of the failure. The vehicle was not repaired. The failure mileage was unknown.", "fail date": "  03/30/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Engine fails to restart on its own from a complete stop at a traffic light or road intersection with the auto start/stop function engaged. I was at an intersection at 10:30pm and it was extremely dangerous as my car would not start and was completely black. I could not even turn on hazards or put the car in nuetral to move out of the way. I had to call 911 and have the police assist. My car was towed to the dealership and I am waiting for an update. This will be the 4th time I have had my vehicle there for service for an electrical issue.", "fail date": "  10/08/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I understand there may be an investigation of Honda's stop-start system, the system which is meant to improve fuel economy by shutting the engine off when the vehicle comes to a stop. I experienced this one (1) time while stopping at a traffic light, date unknown. The engine went off, as it was supposed to, but when I took my foot off the brake and pressed on the accelerator nothing happened, the engine had not restarted. I attempted to restart the car by pressing on the start button but since I was in drive it wouldn't start. I think I tried to shift the transmission into park (it's been several months since the incident) but I'm not sure if it shifted or not. I turned the car off by pressing the start button, waited briefly and then pressed the start button again to start, which it did. I shifted into drive and pulled away. That was a long time, probably not as long as it seemed, sitting at the light as others were going around me or blowing their horn at me. I have not had any further incidents since that time but wanted to register this one with you.", "fail date": "  09/07/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "There is a popping and crackling sound that comes from the speakers whether it is on or off. When this occurs the infotainment system, rear entertainment system, and blue tooth stops working. This happens every single time the vehicle is used. This causes distracting driving because the noises happen all of a sudden when driving. Second problem-the car seems to shut off and turn back on by itself after pressing the gas when its on auto idle shut off. For a few seconds when I let go of the brake peddle, instead of turning on from the auto idle shut off it just shuts off, then I press the gas and it turns on. It has done this several times that it is concerning and I fear it can cause an accident if it moves forward when I think it shut off on its own.", "fail date": "  08/17/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "While driving down the highway, we heard a loud, sudden pop and then wind. The sunroof shattered and the cover was closed so all glass ended up on the cover. There were no overpasses above us or vehicles in front of us that could have caused anything to fall on the sunroof. There was nothing other than glass found on the cover and no damage to the top of the vehicle (as if something would have hit the glass and bounced off). The driver was startled and, if the cover had not been closed, the glass would have ended up in the face of our backseat passenger. Prior to this, I had no problems with the sunroof and there had been no prior damage to it. When I took the Pilot in for repair at the Honda service center, I was told that they have heard of a few cases like this where the sunroof spontaneously imploded, but that it was not a safety recall or under warranty. I have photos of the shattered sunroof.", "fail date": "  08/13/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I can't remember if I reported this already but here goes. My daughter was driving my 2020 Honda Pilot with 41,400 miles on it. She had baby in the back and was in slow traffic in millsboro delaware. She thought she smelled something burning. Then she got out of the vehicle, took the baby out and called 911. Fire started coming out of the engine compartment and the vehicle totally burned up.", "fail date": "  07/29/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I have owned the 2020 Honda Pilot touring since Jan. 2020. Up till now, theses similar situations have happened 4-5 times. It always happens when I am gradually slowing down to a complete stop at crossroads. Then suddenly a beep sound appears, then the engine shuts down to only the radio is playing, gear shifts to n by itself and I’m unable to restart the car. After about 1-3 minutes of unable to control the car, sitting in the middle of the highway, then I was able to shut off the engine completely, then restart the car. When it happens, the dash board would have the battery light on and commend would say “you can not start the engine, shift to park”, but it was on p, and I couldn’t shut of the engine anyway. It was not controllable. My car drives great normally and no messages would pop up on the dash board. I brought this issue to the dealership, left my car there for a total check. I even said I have it in video when it happened. They didn’t want to even watch it. They said the computer will tell them, so they don’t need to see my video. They returned with nothing wrong, they could not find the problem. Since they did not see anything wrong, there is nothing to repair. They ask me to bring it back next time it occurs so they will have it on record. They did not solve any problem for me. I was frustrated and worried when it would happen to me again. It is a hazard for me to drive on fast traveling highways not knowing when this will occur and the worst part is that the dealership isn’t willing to go above and beyond to solve it.", "fail date": "  07/17/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Automatic idle engine shut off had been the problem. I will come to a red light or stop sign, the car will do the engine shut off, and it will hesitate to start back up. There have been times that the car has complete shut down and I had to restart it in the middle of traffic. When that happens, it is very slow and hesitant to start back up. It is also common for it to restart the car and wipe out the radio and bluetooth. The radio will turn to static. I have been unable to start my car completely while it has been parked. I have had this looked at multiple time but there is never a solution.", "fail date": "  11/01/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "N/a.", "fail date": "  10/15/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The infotainment screen in the vehicle which includes the backup camera display, navigation, radio, bluetooth and other important vehicle functions and settings, shuts down and reboots in a continuous loop and sometimes turns off (blank screen) completely. This results in a backup camera function that is no longer useable as the screen does not/cannot display the camera image behind the vehicle. This is an SUV with a large rear blind spot that cannot be viewed simply by turning your head especially if there are short/small objects below the view of the rear glass. The other functions that rely on the screen also do not work and this constant rebooting/flashing is very distracting to the driver. There are also strange noises emanating from the sound system regardless of whether the system is on or off. This appears to be a widespread problem with this vehicle that still does not have a permanent solution. Several repair attempts by the oem have not fixed this issue.", "fail date": "  10/01/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The vehicle makes uncontrolled loud noises. It is very intermittent and sounds like loud cracking/exploding of windshield. It sometimes startles the driver and makes the driver cringe. Leading to uncontrolled movement of steering wheel. Potential hazardous. Honda has acknowledged that there is a problem with several hundred thousand cars and done service bulletins (a19030b version 3) and others. Our car now has been in for the same problem 7 times. Twice a specialist was working on the car in the last 22 months but the problem persists and is getting worse by the month. This is unacceptable and can lead to an accident but Honda does not want to take responsibility.", "fail date": "  07/29/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The paint of my car started chipping on the hood roof of the car and moved to the top of my car, making spots all over my car. The front chrome part of the car has started to wrinkle and is looking as it will be peeling soon as well. The radio part inside the car is also wrinkling, on top.", "fail date": "  07/26/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "\"upgraded\" from odyssey to Pilot. The rear tailgate is motorized, like our old odyssey. Unlike the odyssey, when something collides with the motorized tailgate, there is nothing that stops the closure. When unloading the trunk, I pressed the button to close. I reached back into the vehicle to grab one more item and it hit my head and kept closing. It did not stop. Afterwards, I tried multiple times for it to reverse and the force needed to trip the safety is excessive for what would be considered safe. Knowing what the odyssey was like, this is a major safety hazard.", "fail date": "  07/14/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "My vehicle was recalled twice before 2,500 miles for wiring harness connector issues (snapping, popping, crackling). I was told I could lose visibility with all dash functions, navigation, radio, etc. After the first and second recall service fix I continued to experience the same symptoms. I opened a case with Honda in June, 2021, and notified my local dealer. The Honda case number is 12314702. I have heard nothing from either Honda and my local dealer, and I am concerned nothing is being done on this issue and I will lose visibility of my dash at some point, putting myself and family in danger.", "fail date": "  04/17/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Software update required to maintain rear view camera back up visibility. Two safety recalls on vehicle. I am stationed in germany and can't have any service recalls and I leave for the states April 6. Germany currently doesn't have the capabilities to do the software update.", "fail date": "  01/01/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Multiple times this vehicle indicates that my car has crossed center line when it hasn't and has activated one or more \"safety\" features including an alarm and steering wheel shaker. Today my vehicle actually applied the brakes when another car was approaching me in the opposite lane. I have had car into dealership 1 time for these issues and they said it was fixed.", "fail date": "  10/28/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Issue #1 : I was driving in highway with garmin navigation turned on, the display reboots with an error \"network connection lost\". Issue #2: while connecting my iphone with google navigation, the display gets stuck and reboots again. Serious issue while driving this car with navigation on. Issue #2: rear camera sometimes doesn't show up or there is a delay when gear is switched to reverse. Issue #3: when a usb is connected to play audio/video, the display freezes after sometime and reboots automatically. Similar issue with blue ray dvd.", "fail date": "  10/05/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Random popping noise, like sound of small rocks hitting windscreen. Occasionally the display where speedometer is goes out. Audio problems with random volume issues. Popping noise occurs whether audio system is on or off. Notice it more while in motion and going over bumpy road. Been to dealer 5 times and replaced wiring, amp, head unit, and still have issue.", "fail date": "  09/10/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The infotainment center goes blank, statics when on, sometimes the speedometer screen goes off, or the the entire infotainment center goes away.", "fail date": "  08/05/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "While driving on the highway at 75 mph the speakers made a terrible popping even thought the audio system was off and then entire dash screen with the speedometer went out and rebooted so I had no idea what speed I was going for 10 seconds. . We had cruise control on and the whole system went haywire. It was beyond scary. The car doesn't feel safe to drive.", "fail date": "  07/12/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "It started with a popping sound coming from speakers, the info screen would then shut down and you would be unable to determine your speed and have no use of backup camera. After this occuring 6 or 8 times (the car has less than 2000 miles) the display will no longer even come on. I have left with the dealer today to repair. This problem occured at random times, I was driving each time resulting in no use of instruments for speed of backup camera.", "fail date": "  07/02/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The cmbs (collision mitigation braking system) is too sensitive. Multiple times, the cmbs has activated without a valid reason. 1 example, I was on an interstate highway in the left lane passing a slow moving 18 wheeler in the right lane. I was passing the 18 wheeler in a curve and my SUV suddenly braked because it thought I was going to crash into the 18 wheeler. I was in control of the vehicle the entire time and I can only think the system was confused by the speed differential between my vehicle and the truck in a tight curve. Several other times on two lane roads, the system will flash \"brake\" even if I am not crossing the center line. I think the cmbs is too sensitive.", "fail date": "  07/01/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "When you drive the car after 2 or 3 days there is clicking noise coming from the front when I turn left and when I hit breaks and when the vehicle is slowing down and sometimes if I drive straight the I heard the noise. I checked with dealer but they couldn't find what the problem is. Sometimes when I shift gear from parking to drive I heard noise. The dealer told me that is because you are not driving every day that might the problem of clicking noise.", "fail date": "  06/08/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "My infotainment center and dashboard speedometer have been going out for the past three months while I drive. Looking online this was an issue with the 2019 models and no solution to the problem was made. I was not informed when purchasing the vehicle that these issues existed and when taking it into the dealership no long term fix to the problem is offered. I purchased this vehicle for the navigation and dvd options that I now am now able to use yet I still pay the payment for them. To me Honda is negligent because they are aware of the problem yet they have not fixed it when I call about doing anything to it I am told they have to experience the problem while driving it which could take seconds or it could take a week then they offer no time table on how long it will take to fix it. They also do not offer a courtesy vehicle while they fix the defect. No recalls have been issued for this problem either this problem can occur on any type of road at any time driving or parked. The last time it was on was 7/12/2020 and it has been off since.", "fail date": "  05/12/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Rear window exploded. Vehicle was parked on the street and was going to put in driveway. Opened driver side door, got in vehicle, close door, rear window exploded.", "fail date": "  04/28/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I drive an 2020 Honda Pilot elite. After 6 months of driving the car the windshield has started making noises. It wounds like the windshield just shattered or is shattering. The next sound is like a thousand small peddles hitting the windshield. When the noise first happened it almost made me wreck because I thought someone threw something into the windshield. This happens when you are driving in motion. I have contacted Honda USA twice and the car has been to the dealer twice. Absolutely nothing has been repaired or fixed or done to take care of this issue. I have noticed other.", "fail date": "  04/14/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The 2020 Pilot infotainment system freezes while driving: 1. When the infotainment system freezes, the backup camera does not work 2. Phone connection becomes unavailable; can't place calls in case of emergency 3. The navigation system freezes, which can cause distraction while driving 4. Other safety systems, if linked to the infotainment system, may not work properly this has happened several times in the last 2 months while driving on freeways and city roads.", "fail date": "  01/01/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I bought this 2020 Honda Pilot touring oct 2019. I noticed the popping in the speakers after having the car a month maybe. I also noticed dvd issues and connection problems. Every single time I get in my car I hear popping noises throughout the speakers. Occasionally I have \"lost network connection\" and once my whole dash/speedometer went black. It only came back on 3 days later when I took it to the dealership. Leith Honda in southern pines/aberdeen, nc acted \"surprised\" with these issues. They said they had never seen a speedometer go out. I don't believe them. I've heard one of the doctors in the area raised cane in the dealership and they replaced his Honda Pilot with a new one. This popping in the speakers, dvd issues, and other major electrical problems are very distracting and therefore dangerous. I have videos of the popping and pictures of everything else. Unfortunately the videos will not upload to this safety complaint. Evidently this has been going on since 2017ish. I would have never purchased this Pilot if I'd known there were electrical issues!!!! worse $41,000 cash I have ever spent! shame on Honda for not correcting the problem and continuing to sell problem automobiles to customers! please consider these electrical problems as a danger. We need our automobiles repaired by Honda before something terrible happens on the highways!.", "fail date": "  11/15/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The engine completely shut down in the middle of the road after driving with auto idle on after stopping due to traffic. The car's engine would not restart. I had to shut down the car completely to have engine on again. (push the start/stop button to shut it down, and then to start it again). This was during a busy traffic and resulted in cars cutting in to my lane when I had to wait for the car to restart. This has happen a few times on the street as well, when stopping for red light, but the engine does not auto-start again when ready to drive on green light. Note that, this feature of auto-idle come auto start every time the car starts unless you manually turn it off. I feel like this can be dangerous and can result in accidents due to the fact that the car stopped completely while others might expect you to move as the light change/ traffic free up ahead.", "fail date": "  12/06/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The Honda auto start stop system has been taxing my battery through daily use and creates unsafe situations. On more than one occasion, similar to the following, I have experienced the Honda Pilot stop the engine via the a. S. S. System. Upon releasing the brake, the system attempts, but fails, to come to ignition and the electrical system lacks the ability to start the engine, creating a need to re-start (or attempt restart). On 1 such occasion, my family was traveling through a city on the interstate. After driving on the interstate for a few hours we came to a stop light and stopped. At the green light, upon releasing the brake, the Honda Pilot attempted to start again and failed. The car went completely dead in the middle of a 4 lane interstate with my family inside. The car did not start again until the 3rd time attempting to restart the vehicle. Approximately 10 seconds later than intended, we were able to clear our vehicle from the interstate intersection. On normal occasions, such as the course of business with the Honda a. S. S. System, driving in situations that would be categorized as \"start/stop\" situations, the Honda a. S. S. System leads to stalled response and delayed lurching into traffic creating situations due to the delay in response. Multiple times this has been reported to my dealer. They acknowledge it as a \"battery\" problem. They test my battery per Honda warranty and tell me it \"passes\". They basically are just charging my battery and sending me out the door. The time between vehicle events is decreasing. Please help address this obvious vehicle shortcoming. There is no permanent means to disable it. Thank you.", "fail date": "  10/15/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "When stopped at a traffic light my Pilot's engine stops because of the fuel conservation feature of the car. The engine is supposed to restart when I take my foot off the brake. However, 4 or 5 times in the last month the engine did not restart. A message would flash that my car is in neutral (I did not put it in neutral) and that I needed to shift to park. Once I put it in park I have to hit the start/stop button several times to get the engine to restart. The radio becomes inoperable during all of this and even after I eventually get the engine to start again. The radio is inoperable until I drive, park the car, shut it off and restart it. This is a major hazard to me and my family. My car has stalled in city traffic and it takes a few minutes to get it restarted. I'm concerned that this could cause an accident at some point. My Honda dealership is not aware of this problem or how to fix it. I found that there is an open investigation with Honda and the NHTSA. I hope this can be fixed soon.", "fail date": "  09/12/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Stop/start system shutdown the engine and failed to restart while at stop light. It occurred twice on 9/8/2022 and twice on 9/9/2022.", "fail date": "  09/09/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I understand there may be an investigation of Honda's stop-start system, the system which is meant to improve fuel economy by shutting the engine off when the vehicle comes to a stop. I experienced this one (1) time while stopping at a traffic light, date unknown. The engine went off, as it was supposed to, but when I took my foot off the brake and pressed on the accelerator nothing happened, the engine had not restarted. I attempted to restart the car by pressing on the start button but since I was in drive it wouldn't start. I think I tried to shift the transmission into park (it's been several months since the incident) but I'm not sure if it shifted or not. I turned the car off by pressing the start button, waited briefly and then pressed the start button again to start, which it did. I shifted into drive and pulled away. That was a long time, probably not as long as it seemed, sitting at the light as others were going around me or blowing their horn at me. I have not had any further incidents since that time but wanted to register this one with you.", "fail date": "  09/07/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I have owned the 2020 Honda Pilot touring since Jan. 2021. Up till now, theses similar situations have happened 4-5 times. It always happens when I am gradually slowing down to a complete stop at crossroads. My 2020 Honda Pilot has shut off a few times while stopping at a red light. Each time has been after coming to a complete stop at a red light and sitting there for a couple minutes. Suddenly there is a beep sound and the engine shuts down. Only the entertainment system is left on. The gear changes to n by itself and I am unable to change it to any other gear. With my foot on the brake, trying to change the gear and trying turn off the car for about 3 minute in the middle of traffic with my kids in the car, eventually I was able to shut off the engine completely off. I immediately try restart the car to avoid a car accident. It put itself in n (neural) and the dashboard screen said “put it in p (park) and hit bottom to restart car. ” the car wouldn’t let me push anything. The power button did nothing and even if you pushed the p for park it stayed in n. The battery light immediately came on when this happened also. And went away as soon as it worked again. I scheduled an appointment after the third time the this happen leaving the car for them to run tests. They ran the tests and when I returned to pick it up, the technician said they tested the battery, wiring, and engine and that everything was good. Nothing was provided to me but they did show me the report as they talked about the results I am sure I can obtain if requested. They almost changed me for the testing but waived the fee which I was thankful. I am concerned and at times scared for the safety of my kids and I. I really hope Honda finds a fix for this and recalls for whatever the issues are as quickly as possible. I like the car but it really is making me want to get a new car and never purchase from Honda again.", "fail date": "  09/06/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The contact owns a 2020 Honda Pilot. The contact stated that while driving approximately 65 mph the brother who was in a second vehicle ahead could see flames present in the front grill of the vehicle. White smoke began to enter the cabin of the vehicle and the contact pulled over, parked and exited the vehicle. Smoke and flames were present coming from under the hood of the vehicle. The fire department was called to the scene and extinguished the flames. No injuries were reported. The vehicle was towed away. A fire and police report was taken at the scene. The cause of the failure was not determined. The manufacturer and local dealer were not yet notified of the incident. The failure mileage was 100,000.", "fail date": "  08/29/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "There is a popping and crackling sound that comes from the speakers whether it is on or off. When this occurs the infotainment system, rear entertainment system, and blue tooth stops working. This happens every single time the vehicle is used. This causes distracting driving because the noises happen all of a sudden when driving. Second problem-the car seems to shut off and turn back on by itself after pressing the gas when its on auto idle shut off. For a few seconds when I let go of the brake peddle, instead of turning on from the auto idle shut off it just shuts off, then I press the gas and it turns on. It has done this several times that it is concerning and I fear it can cause an accident if it moves forward when I think it shut off on its own.", "fail date": "  08/17/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "My 2020 Honda Pilot (touring edition) has begun having a rough restart after stopping and the auto engine idle function has turned the engine off. Once it seemed to turn the vehicle off and the radio turned off and back on quickly. I've read about the investigation into Pilots with this issue and wanted to add my car to those that are affected. I called the dealership where I bought the car and explained the issue to a service technician and he indicated that he'd never heard of the issue. Since it just started having the issue in the last couple of weeks and so far it happens intermittently, I haven't taken it into the service department yet.", "fail date": "  08/11/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Vehicle has died when at a stop light, would not automatically restart. Days later the vehicle’s electrical system would not allow the car to start, many code warnings on display. Have had it towed. Battery would not jump and vehicle would not shift into neutral. Found out it needed a specialized tool only the Honda service had.", "fail date": "  08/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I can't remember if I reported this already but here goes. My daughter was driving my 2020 Honda Pilot with 41,400 miles on it. She had baby in the back and was in slow traffic in millsboro delaware. She thought she smelled something burning. Then she got out of the vehicle, took the baby out and called 911. Fire started coming out of the engine compartment and the vehicle totally burned up.", "fail date": "  07/29/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The contact owns a 2020 Honda Pilot. The contact stated while his daughter was driving at an unknown speed when she smelled an odor of smoke coming from the vehicle, then she noticed fire coming from the vehicle. She was able to exit the vehicle safely as it started to burn. The fire department was able to extinguish the fire. No one was injured, and a police report was filed. The vehicle was towed collision center. The manufacturer was contacted, and a complaint was filed. The failure mileage was 42,000.", "fail date": "  07/29/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Died and switched into neutral by itself, wouldnt start or switch into drive mode- in the middle of a busy intersection! it was scary and dangerous trunk doesn't open/close properly infotainment center dies unexpectedly, freezes, won't restart on it's own. Have to pull over and restart car a few times or let the car sit off for a while speakers crackle at random times took the car numerous times to marin Honda, the computer they plug the car into showed \"no codes\" so they said there wasn't an issue. No warning lights of any kind. Electrical just shuts down.", "fail date": "  07/28/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I have owned the 2020 Honda Pilot touring since Jan. 2020. Up till now, theses similar situations have happened 4-5 times. It always happens when I am gradually slowing down to a complete stop at crossroads. Then suddenly a beep sound appears, then the engine shuts down to only the radio is playing, gear shifts to n by itself and I’m unable to restart the car. After about 1-3 minutes of unable to control the car, sitting in the middle of the highway, then I was able to shut off the engine completely, then restart the car. When it happens, the dash board would have the battery light on and commend would say “you can not start the engine, shift to park”, but it was on p, and I couldn’t shut of the engine anyway. It was not controllable. My car drives great normally and no messages would pop up on the dash board. I brought this issue to the dealership, left my car there for a total check. I even said I have it in video when it happened. They didn’t want to even watch it. They said the computer will tell them, so they don’t need to see my video. They returned with nothing wrong, they could not find the problem. Since they did not see anything wrong, there is nothing to repair. They ask me to bring it back next time it occurs so they will have it on record. They did not solve any problem for me. I was frustrated and worried when it would happen to me again. It is a hazard for me to drive on fast traveling highways not knowing when this will occur and the worst part is that the dealership isn’t willing to go above and beyond to solve it.", "fail date": "  07/17/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Vehicle shut down and failed to start at stoplight. It was as of it shifted off or in to neutral. Battery light showed red when initially tried to restart. Finally engine started after tuning off and back on again. I believe it was a failure of the auto engine stop system currently under investigation. It has had repeated issues lately getting going at stop lights but this was the first couple shutdown.", "fail date": "  07/11/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "My Pilot has approximately 25,000 miles. I was stopped at a red light, my vehicle has the ignition shut off feature, which engaged while I was stopped. When the light changed and I went to accelerate, instead of the engine restarting, the entire car stalled and would not restart. There were a variety of flashing lights and the car appeared to have power but the engine would not turn over. I immediately turned my hazard lights on, but each time I tried to restart the car, the hazards would turn off which was particularly concerning. The police responded and we looked for options to get the car into neutral so we could move it out of the intersection but there appears to be no option for a layman to manually override the transmission and place the car in neutral. As a result I was stranded in my vehicle for nearly 3 hours in an intersection while I waited for a tow truck. There had been no prior indication of any issues with the vehicle. It was purchased used and I have only put approximately 2,000 miles on it since purchasing. The vehicle was towed to the dealership and is awaiting inspection. While my experience was terrible, I am terrified to think of how much worse this could have been if I had stalled in traffic on a highway or with my children in the car.", "fail date": "  06/30/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Incident happened 3 times in 1 week (June 8th, 11th, & 15). When stopped at a light or in traffic the car shuts down. The engine does not restart when it's supposed to, leaving us with a dead vehicle. The car had to be jump-started to get the vehicle moving again. In worst cases, the battery doesn’t even hold a charge. Other issue would be when pressing the gas the car would stall sometimes before accelerating.", "fail date": "  06/15/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Start/stop function engaged at a red light, stopping the engine. Engine would not restart. Car and driver were stranded in the middle of a busy intersection for almost 2 hours until car could be jump started. Car would not restart on its own, leading to a very dangerous situation for driver and other motorists.", "fail date": "  06/13/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Auto engine idle engaged and the vehicle died and would not restart. The vehicle has died a couple of times in the past in similar circumstances but always restarted until the most recent incident. This left us stranded in the middle of the road at an intersection with no way to put the vehicle in neutral and push it to the side of the road which is another unrelated safety complaint. The car cannot be taken out of park when not running. The component has not been inspected as of the time of this complaint but is being scheduled for review by the service shop. There were no warnings or messages prior to the incidents occurring.", "fail date": "  06/04/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Auto start/stop feature; engine failed to restart from a complete stop at a red light, happened on multiple occasions. I would have to press on the brake and accelerator and press the start button to start the car and be able to drive.", "fail date": "  05/25/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "When engine auto-shutoff was on (as it is automatically every time the car is started) I came to a complete stop and the vehicle turned off completely. I was in the middle of the road on every occasion this occurred. The vehicle would not restart for at least 30 seconds.", "fail date": "  05/19/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Over the last few years, after a long highway drive of approx. 20 miles when I stop and sit and idle, a strong gasoline smell is entering the vehicle via the hvac heating system. Also, after the same longer drives, when I return home, turn off and park the SUV in my garage, shortly after my garage smells of gasoline as well from the front passenger side of the SUV nearest the hood cowl. It does not happen 100% of the time but this winter it has occurred more frequently (a few times a week) during our mon-fri commutes.", "fail date": "  03/02/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Upon acceleration up a hill of speeds 10 mph -25 mph the transmission \"lurches\" causing the rpm to jog up and down. While traveling the speeds of 35 mph - 60 mph, regardless of being on flat ground or not, the transmission has the same \"slipping\" and \"lurching\" feeling while jogging the rpm up and down (can happen on cruise control as well). Both incidents will shake the Honda Pilot. These incidents havae increased in frequency and intensified in sensation.", "fail date": "  03/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "On multiple occassions, my engine auto idle start/stop has malfunctioned. In particular, when the car goes into idle while stopped at a traffic light, there are times when the car completely shuts off. This is dangerous at any time because it has been unpredictable. The problem gets more frequent until finally the car won't start. Upon taking the car to keating Honda in conroe TX twice for the inability to start the car, I have had my battery replaced twice within the last year. They have not been able to identify any parasitic drains to the battery. At 39,000 miles, my 2020 Honda Pilot elite required it's 3rd battery. The problem has been labeled battery failure, but frankly the problem has been the engine auto idle start/stop feature and I am certain this feature is directly related to the battery failing.", "fail date": "  11/01/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "My 2020 Honda Pilot has stalled 4 times in the past two weeks after the auto engine idle occurs at a red light. The engine will shut off automatically, but when I lift my foot from the brake, the car engine does not turn back on, and the car shifts into park, and acts as if stalled. In order to get the car to restart, I have to power down completely, open the driver side door(!!!) and “reset” the whole system before I can apply the brake and press the ignition button. Even then a couple of times it doesn’t start for me doing that, and I have to cycle through the entire process a second time. This happened to me with my 3 children in the car twice on very busy (50mph) roads, and is incredibly dangerous. The second major issue I have noticed, but less frequently (about 3-4 times in the past 6 months), is that the auto braking system will randomly alert and apply the brakes while I’m driving down a straight road with no traffic in front of me! needless to say, terrifying. This thankfully only lasts a few seconds before I regain control of the car, but also incredibly dangerous. I am scheduling service with Honda to evaluate ASAP, but I have read *many* accounts of the exact same problem online and every single person says Honda has never been able to find any cause. Some say replacing the battery helps, others say the stalling issue remains after battery replacement. If we can’t solve this problem, or have the auto engine idle completely and permanently disabled, I will be selling this car very soon. 16,104 miles driven as of today.", "fail date": "  10/25/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Once the engine stops (idle engine auto stop feature) on the intersection when I yield to another vehicle before a left turn and auto-starts but teh car refused to move - was solved by shutting down the car and starting it again. All that on a busy intersection in the middle of the road. Very uncomfortable and unsafe situation to be in.", "fail date": "  07/05/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Brakes are too low and soft. Idling is rough during cold start. I brought to the dealer last September 28,2020 but dealer did nothing. Technician said there is nothing wrong with it. The dealer is holler Honda in orlando florida. This is my fourth Honda and only experience this. Brakes are like that all the time. Always stopping too close to the vehicle in front of me.", "fail date": "  09/28/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Stopped at a red light waiting to make a right turn. After traffic cleared pressed on the gas and car immediately started revving really loud. Looked and it said it was at 6000 rpm even though I was barely touching the gas. The car then started decreasing speed without me taking my foot off the gas. I quickly pulled off the road and it wasn't until I put the car in park that it finally stopped revving so loud. I shut the car off and let it sit for a few minutes before starting it again and driving. It then started flipping from showing the blu-ray info to apple carplay repeatedly on the info screen.", "fail date": "  08/10/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I got this car only 1 week; I heard the noise from steering wheel and the problem when I hit gas and shift the transmission. On July 13, I drop the car to fix for 2 days. Then, only 2 week after I have experienced cannot hit gas and I cannot hit the brakes. The all engine light, break light, tsa light and other 3 lights is coming. I have to tow my car to dealer shop. This car is bad car.", "fail date": "  08/07/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Bought new 2020 black edition Honda Pilot on may 2,2020 with 11 miles on it. It caught on fire on 6/15/20 after driving only 3 miles I noticed a bad burnt smell as I was entering a parking garage, not thinking it was my car because it was new and there were no display lights indicating anything. I then noticed smoke coming from my hood about 30 seconds later. I immediately parked and turned engine off. Got out of vehicle to see a fire ball drop from under the front of my hood. There had been no previous alerts on the car panel that anything was wrong. We hadn't driven this car much due to covid, probably only had around 400 miles on the car. Car fire is being investigated as far as I know.", "fail date": "  06/15/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "This malfunction has been described to the dealer (s) on multiple occasions. They stated that is how it functions. I disagree. These typically happen on 2 way remote highways not multicar lane express ways. If on a two way roadway and you are turning right. Your vehicle sees and oncoming vehicle in the other lane and emergency braking happens. The emergency braking system also has gone on when travelling straight for no know reason. It happened recently on a 2 way back road in washington olympic area and my daughter was driving. The brakes just went on and she could not see why? the car in the rear had to emergency brake as well to prevent rear ending us. It has happened multiple times for no apparent reason? it is aggravating and not safe. Honda seems to not believe me so I thought that I would bring the issue to a higher authority.", "fail date": "  06/25/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The contact owns a 2020 Honda Pilot. Upon purchase of the vehicle, the contact heard an abnormal, screeching noise emit from the front driver side tire. The contact's husband took the vehicle to a dealer where they found no defect with her rotors or tires. The contact stated that while in stop and go traffic, the brake warning light appeared on the instrument panel as the vehicle independently came to a sudden stop; the contact was able to resume normal operation after the failure. On a separate occasion while traveling downhill at approximately 20 mph, the brake pedal depressed to the floorboard without warning. The contact panicked and pumped the brake pedal but to no avail. The contact steered the vehicle into the grass to avoid oncoming traffic. The contact hit a neighbor's mailbox and then a tree, which stopped the vehicle. The airbags did not deploy upon impact. The contact nor her daughter were physically injured by the accident but both have suffered traumatic mental anguish due to the failure. A police report was filed. The vehicle was initially towed to an independent tow yard and was later towed to an independent body shop for repair by insurance. The manufacturer was notified of the failure and offered no assistance. The vehicle had yet to be repaired. The failure mileage was approximately 28,000.", "fail date": "  06/19/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The automatic collision avoidance system continually gives false warnings, shaking the steering wheel and beeping, while flashing a brake warning. This occurs even if there is no other traffic on the road, which could cause an accident by startling the driver when it unexpectedly activates. The automatic brakes are also overly aggressive, which could cause a rear end collision.", "fail date": "  03/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The contact owns a 2020 Honda Pilot. The contact stated that while, her son was driving approximately 55 mph the brake pedal was applied however failed to respond the vehicle crashed into a fence. The wheel assembly detached. There were no warning indicator lights illuminated. The driver sustain muscle injuries and medical attention was provided. A police report was filed. The air bags deployed. There was no reported fire. The vehicle was towed to an independent mechanic. The local dealer was not contact the vehicle was not diagnosed or repaired. The manufacturer was notified however, no further assistance was provided. The approximate failure mileage was 18,000. The insurance company deemed the vehicle a total loss.", "fail date": "  10/11/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Tl- the contact owns a 2020 Honda Pilot. The contact stated while driving approximately 1mph while turning and depressing the brake pedal the vehicle lost functionality in the brakes, which resulted in the contact crashing the vehicle into a wall. 1 person was injured (the contact) and sustained soreness is body but medical treatment was not seeked. The contact stated no warning light was illuminated and a police report was not taken. The vehicle was driven to contacts residence. The vehicle was not repaired. The manufacturer was not informed of failure. The failure mileage was approximately 2,000. Dl.", "fail date": "  03/17/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "2020 Honda Pilot touring 1,156 miles - 3 months old. Vehicle began to stall when pulling into garage and applying breaks. Loud sounds coming through speakers as if you're driving through hail. Tuner lost, network connection failed, dashboard black. Vehicle can also apply breaks when no other car is around. Latest system failure car stalled when applying breaks at an intersection. Also driver passenger mirrors independently move while driving. Software update to control box and gauge control module without fix. Now tightened wires behind blu-ray player. Sensing/break issues are unknown to Honda and have not been fixed.", "fail date": "  10/31/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Brakes are too low and soft. Idling is rough during cold start. I brought to the dealer last September 28,2020 but dealer did nothing. Technician said there is nothing wrong with it. The dealer is holler Honda in orlando florida. This is my fourth Honda and only experience this. Brakes are like that all the time. Always stopping too close to the vehicle in front of me.", "fail date": "  09/28/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Tl the contact owns a 2020 Honda Pilot. The contact stated that while applying the brakes, there was an abnormal popping sound coming from the vehicle. The vehicle was taken to frank fletcher Honda (2921 moberly ln, bentonville, ar 72712) where the contact was informed that the sound was normal. The vehicle was not repaired. The manufacturer was not notified of the failure. The approximate failure mileage was 3,100.", "fail date": "  09/01/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Ever since I have purchased this car I have had nothing but issues. First started with cracking and popping sounds with the speakers, even when all audio was off in the car it would still make the noise. Then the dvd player stopped working. Next the cracking and popping started all the time and it was near impossible to make phone calls with bluetooth in the car. Finally after the 3rd time back the speakers were 80% fixed after a Honda representative came out from corporate. Then my automatic braking starting having significant issues. At first it was a random occurrence and only once in a blue moon. Now, like the other issues, it is progressively getting worse. I have already had it in once and they stated they could not replicate it but were able to see that it had been triggered. Since I have had my car back in less than two full weeks it has occurred at least 12 times on different roads (open highway, places with no cars or trees, at night or day it doesn't matter). I am now awaiting another call back about getting this issue fixed. Oh and there was that time that my backup camera stopped working completely, can't forget that. Overall, incredibly upset about how much we spent on a brand new lemon.", "fail date": "  08/25/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "I got this car only 1 week; I heard the noise from steering wheel and the problem when I hit gas and shift the transmission. On July 13, I drop the car to fix for 2 days. Then, only 2 week after I have experienced cannot hit gas and I cannot hit the brakes. The all engine light, break light, tsa light and other 3 lights is coming. I have to tow my car to dealer shop. This car is bad car.", "fail date": "  08/07/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The large amber brake warning indicator on the dash and the associated buzzer comes on giving a false positive indication periodically in two way traffic even on straight roads with adequate traffic separation. There is no specific pattern to getting this false indication and it is very annoying. I am concerned that it could also automatically apply the brakes when it is not necessary. In my normal commute of 20 miles it may occur five or more times. I have read online that other 2020 Honda Pilot owners are having the same problem and that dealers have been unable to correct it.", "fail date": "  07/28/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The forward collision system in our 2020 Honda Pilot will alert us to brake, shake the steering wheel back and forth and beep with nothing in front of us or will do it when another vehicle is out of the alert zone in the opposite lane. We have taken it to our local dealer and they have not found an issue. We can be on backroads, main streets and recently on empty bridges.", "fail date": "  07/21/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "1. Car flashes brake and sometimes brakes on its own when it detects an object along the side of the road or when a car may be approaching in the opposite lane or in a center turning lane. This has nearly caused an accident on two different occasions. Each time the lane we are in is clear and usually doesn't even have a vehicle in front of us. 2. When in cruise control the acc will detect a vehicle in front of us going maybe 2 mhp slower than our set speed and our car will abruptly slow down to about 10 mph below the acc set point. Then it detects there is clear distance to the vehicle in front and will abruptly accelerate till it again detects the vehicle and then repeats the same actions - abrupt slowdown - abrupt acceleration and so on vs. A gradual slowdown to match the vehicle in front speed and holding steady at that speed. I have set the distance detection to each setting and it makes no difference. 3. Lane keep assist is plain down dangerous. Tried to merge onto a busy highway with turn signal on and the lka would not let us merge and jerked the wheel back to the right and the vehicle abruptly hit the brakes when there was nothing in front of us. Nearly caused traffic behind to rear end us. 4. Hands free cell feature is not hands free if connected to apply car play. This was not what we were lead to believe at the time of sale. Honda has some serious issues with the Honda sensing and a recall is a must as these issues will eventually cause an accident and I have to assume already have. To date the car is unsafe with the sensing on and if I turn it off I risk liability with my insurance as they provide discounts because of the Honda sensing safety features.", "fail date": "  07/02/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The cmbs (collision mitigation braking system) is too sensitive. Multiple times, the cmbs has activated without a valid reason. 1 example, I was on an interstate highway in the left lane passing a slow moving 18 wheeler in the right lane. I was passing the 18 wheeler in a curve and my SUV suddenly braked because it thought I was going to crash into the 18 wheeler. I was in control of the vehicle the entire time and I can only think the system was confused by the speed differential between my vehicle and the truck in a tight curve. Several other times on two lane roads, the system will flash \"brake\" even if I am not crossing the center line. I think the cmbs is too sensitive.", "fail date": "  07/01/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "I was driving down the highway , had the cruise control set . 75 no other cars around when is slammed the breaks and the screen flashed a big red brakes box . Scared the life out of me . At random times the red brakes box with pop up.", "fail date": "  01/15/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The collision mitigation system (brakes) will slam on the brakes with no hazard in the area. The system frequently flashes a message on the display to brake in red and black. At least once the system has actually slammed on the brakes and nearly caused an accident. The salesman said this is a known problem and that I should shut the system off. Honda apparently does not contemplate a fix to the system.", "fail date": "  12/12/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "This malfunction has been described to the dealer (s) on multiple occasions. They stated that is how it functions. I disagree. These typically happen on 2 way remote highways not multicar lane express ways. If on a two way roadway and you are turning right. Your vehicle sees and oncoming vehicle in the other lane and emergency braking happens. The emergency braking system also has gone on when travelling straight for no know reason. It happened recently on a 2 way back road in washington olympic area and my daughter was driving. The brakes just went on and she could not see why? the car in the rear had to emergency brake as well to prevent rear ending us. It has happened multiple times for no apparent reason? it is aggravating and not safe. Honda seems to not believe me so I thought that I would bring the issue to a higher authority.", "fail date": "  06/25/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "This has happened since I bought this vehicle brand new. Whenever I am on a 2 lane road, the brake warning light and brake warning chime activate fairly often but intermittent when traffic coming from the opposite direction. If I am on a 4 lane road and in the lane that is closest to the oncoming traffic , it will send a false brake warning and brake warning chime. I have video taped this and sent to waltrip Honda in franklin, TN. Their technician verified the problem and replaced the radar unit on the vehicle, but it is still doing this even after the new part has been replaced. Feel free to call me 419-360-3601 or email robbwbrown@gmail. Com. Thank you robb brown.", "fail date": "  04/12/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "Automatic emergency braking engaged while I was driving on the highway with no cars and no warning brake light on dash. There were no cars in front me ( this is the second time). Periodically the braking light flashes on the dash if I’m driving on a two way road in the curve part of the road.", "fail date": "  04/06/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "The automatic collision avoidance system continually gives false warnings, shaking the steering wheel and beeping, while flashing a brake warning. This occurs even if there is no other traffic on the road, which could cause an accident by startling the driver when it unexpectedly activates. The automatic brakes are also overly aggressive, which could cause a rear end collision.", "fail date": "  03/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "My Honda often displays the brakes warning and on rear occasion apply brake in response to oncoming traffic on two-lane roads. I already went with onboard camera recalibration at one of the safe glass location but this problem persist on narrow two-lane roads.", "fail date": "  12/25/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "The automatic emergency braking system will sometimes just start flashing as if there is an object in front of me. There are no objects in front of me and it would flash. There has been 2 occasions where the vehicle would slam on the brakes and then release even though no objects are on the road. This has happened at least 10 times where the warning would flash. Also, the adaptive cruise control would slam on the brakes even though we are following at a safe distance. Of all the times I have used the acc, the car would slam on the brakes 80% of the time.", "fail date": "  12/23/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "My 2020 Honda Pilot has stalled 4 times in the past two weeks after the auto engine idle occurs at a red light. The engine will shut off automatically, but when I lift my foot from the brake, the car engine does not turn back on, and the car shifts into park, and acts as if stalled. In order to get the car to restart, I have to power down completely, open the driver side door(!!!) and “reset” the whole system before I can apply the brake and press the ignition button. Even then a couple of times it doesn’t start for me doing that, and I have to cycle through the entire process a second time. This happened to me with my 3 children in the car twice on very busy (50mph) roads, and is incredibly dangerous. The second major issue I have noticed, but less frequently (about 3-4 times in the past 6 months), is that the auto braking system will randomly alert and apply the brakes while I’m driving down a straight road with no traffic in front of me! needless to say, terrifying. This thankfully only lasts a few seconds before I regain control of the car, but also incredibly dangerous. I am scheduling service with Honda to evaluate ASAP, but I have read *many* accounts of the exact same problem online and every single person says Honda has never been able to find any cause. Some say replacing the battery helps, others say the stalling issue remains after battery replacement. If we can’t solve this problem, or have the auto engine idle completely and permanently disabled, I will be selling this car very soon. 16,104 miles driven as of today.", "fail date": "  10/25/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "Vehicle brakes automatically when operating at highway speeds when passing a vehicle that is either moving slowly or stopped in a turn lane waiting to turn left. Occurs when collision mitigation system is in both the on and off position and when cruise control is engaged and disengaged. This has occurred approximately twice a month since purchasing new in July of 2020. Vehicle also breaks when encountering an approaching vehicle on the highway while going around a corner when turning to the right. One time the vehicle behind me almost hit me and had to go onto the shoulder to avoid a collision. I reported this to the Honda dealer in the winter months and they said it was likely caused by road salt. It's now June and there is no road salt and problem is still occurring. The orange break indicator when on turning the automatic breaking.", "fail date": "  06/11/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "We purchased a 2020 Honda Pilot exl awd. The collision mitigation system engages arbitrarily, no vehicles or obstacles in front of me and the system activates. Honda dealership said they can't find a problem. However, there is a class action lawsuit against Honda, filed in California, for this and other problems with their safety system. Most recently drove the car on a 560 mile trip, the collision mitigation system warning came on 5 times when there were no cars or obstacles in front of me. Hopefully NHTSA can apply some pressure on Honda to address this issue. It is very frustrating when you have problems with a new vehicle and Honda will not correct them.", "fail date": "  05/14/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "I passed a walker on my side of the road by slowly moving over the center line to the other lane to give the pedestrian a wide birth. The lane departure migration system was turned on. I did not use a turn signal. There was not a car behind me or approaching me in the opposite lane. The car started to warn me I was going out of my lane by shaking the wheel and flashing a brake/lane departure warning at me. I ignored it since I didn’t want to hit the pedestrian and continued to move into the other lane. Then the car took over the wheel, braked and brought me almost to a complete stop suddenly. If a car had been following behind me, I would have been rear ended. I no longer trust the lane departure warning system. If I forgot to use a turn signal on the highway or suddenly had to leave my lane on the highway to avoid a car or object, this system could cause a serious accident. Thank you!.", "fail date": "  04/05/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "My 2020 Pilot has several issues. 1. The dashboard and infotainment system blackout. In sept 2020, Honda replaced the most module and said this would fix the problem. Several weeks ago, my infotainment system again went blank (3/6/2021), I had no back up camera or information. This fix obviously did not work. I took video on my phone. I took the vehicle to Honda, they would not look at my video and said that they needed to recreate it (3/26/21). They did nothing. I also got the following message several days later (3/12/21), \"unfortunately, com. Honda. Telephonyservice has stopped. \" I also showed this to the Honda service center, they said interesting, we have never seen that. They did not want my picture, and could not recreate, so they did nothing. The crackling/popping noise is also back after it was supposed to be fixed, with the Honda repair. They could not recreate this either, so they did nothing. 2. I have issues with the forward collision braking, auto sensing. I live in a rural area and when driving on two lane roads, head on to the other traffic the vehicle constantly brakes. When driving over two lane bridges, which I do often, it brakes several times a trip trying to get over the bridge. This is not safe. One time I was on 66 in va (1/27/21), at night, an 18 wheeler was coming off an exit ramp, I was in the right lane. The vehicle slammed on the brakes and dropped my speed approximately 20-25 mph for no reason. The 18 wheeler was still on the exit ramp. I was almost rear ended by the vehicle behind me. The brake sensing it too sensitive. I have taken it in for this, they could not recreate and told me to turn it off. That is not an answer. If a vehicle has safety options, we should be able to use them and not be told to turn them off! the 2020 Pilot has a lot of issues that are not being fixed. This vehicle should be taken off the road.", "fail date": "  01/27/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "The auto emergency braking (forward collision mitigation) will trigger and brake hard frequently on 2 lane roads. This has surprised me multiple times. Honda service says that this is normal and they don't seem interested in fixing it. I have read that there is an investigation into this issue on certain Honda sedan models, and wanted to be sure that the Honda Pilot was included in the investigation. This has occured multiple times since I've purchased the vehicle new.", "fail date": "  06/02/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "The vehicle is showing the same issues as found in the Honda service bulletin 20-029 for \"9-speed a/t hard upshift with steady acceleration\", and an occasional hesitation or slip. Our Honda Pilot has a Honda 6-speed automatic transmission and awd. The transmission has just had a full service, which included a \"transmission fluid exchange to include torque converter lines\" and replacing the transmission filter. When watching the vehicle shift, the tachometer will spike rpms, then drop well below, and rise to settle in-between with a hard upshift. This issue was extreme prior to the transmission service, especially given the vehicle has only 49k miles and was purchased brand new. The constant hard shift and slip is a safety hazard.", "fail date": "  10/17/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "I have been dealing with the issue of my stereo crackling for over a year. The first appt is listed below. I have taken my car in 4 different times for this issue and am still as of today waiting on the part to come in to fix my car. I had an appt today and was told that the part was in and after dropping off my car was told the part is not in stock and they don't know when it is coming in. This is a dangerous and unsafe driving situation. The navigation turns off, the radio completely shuts off including my dashboard so I don't know how fast I am going. The crackling noise continues if the car is on or off. This is very distracting and loud especially since you cannot control the level of the noise. I think waiting a year for this to be resolved has been long enough and I expect the dealership to step in and provide some options.", "fail date": "  10/09/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Stopped at a red light waiting to make a right turn. After traffic cleared pressed on the gas and car immediately started revving really loud. Looked and it said it was at 6000 rpm even though I was barely touching the gas. The car then started decreasing speed without me taking my foot off the gas. I quickly pulled off the road and it wasn't until I put the car in park that it finally stopped revving so loud. I shut the car off and let it sit for a few minutes before starting it again and driving. It then started flipping from showing the blu-ray info to apple carplay repeatedly on the info screen.", "fail date": "  08/10/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "The infotainment center goes blank, statics when on, sometimes the speedometer screen goes off, or the the entire infotainment center goes away.", "fail date": "  08/05/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Follow-up on complaint #11340119. July 26, 2020. As previously noted in complaint, 2020 Honda Pilot information system popping noise: now the electrical service to information system is completely blacking out: no speedometer information, no telephone, no back-up camera. All information systems go black from 10 seconds to several minutes. Just before this happens emergency breaking notification is displayed. No display on freeway for speed, lane assist malfunctions and backing sensors do not work. Car is unsafe to drive and Honda says it cannot fix system. Only have 1900 miles on vehicle. Thousands of lives are at stake. What are you going to do nhsta? wait for folks to die?.", "fail date": "  07/26/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "The infotainment and sometimes the dash go blank. Prior to losing all signals and visual, there is loud popping noises around the windshield. The noise sounds like rocks hitting the windshield, but it ends up with infotainment losing all communication and dash sometimes going blank. This happened in January 2020 with about 1000 miles on the vehicle and has happened on/off over the past few months. In July it has been a daily occurance and no longer safe to drive.", "fail date": "  07/15/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "It started with a popping sound coming from speakers, the info screen would then shut down and you would be unable to determine your speed and have no use of backup camera. After this occuring 6 or 8 times (the car has less than 2000 miles) the display will no longer even come on. I have left with the dealer today to repair. This problem occured at random times, I was driving each time resulting in no use of instruments for speed of backup camera.", "fail date": "  07/02/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "It first started a couple weeks before this with a crackling in the speakers. Then it wouldn't play anything plugged into the usb. Then on the 20th it wouldn't play the radio. It would say radio unavailable. Then when trying to access the radio, it would say network communication lost and everything would go black. No speedometer, no gauges, nothing. It would then restart the system. Then the bluetooth stopped working. Now it just constantly loses network communication, blanks out and restarts. It did it about 8 times in my 10 minute drive home. I got a video of it while someone else was driving but it won't let me upload it. It happens at all speeds, even being stopped at a light.", "fail date": "  06/20/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Last week 4/8/2020, my 2020 Honda Pilot elite starting making cracking noises through the speakers while driving. A couple of seconds later the entire radio, navigation, and information center with speedometer, gas and other vital information of engine systems went black. The system came up and stated that it was rebooting and did not have data access. I called the dealer and they told me how to conduct a hard reboot. I did this and it worked for about 20 minutes and then did it again. When I called the Honda dealership back they stated that Honda was aware of the problem but did not yet have a software fix for the problem. During my research on the internet, I have found that this is a huge issue well documented on the internet for 2017 - 2019 model Pilots. In fact there is a class action lawsuit for those model years for the same exact issue. But now, having been to the NHTSA site, I see that it is also an issue for new 2020 models with very low mileage. This is a big problem and needs to be investigated immediately as everything that the driver needs to safely monitor their driving is affected by this problem and vehicle owners are not getting help from their local Honda dealership service departments. A national recall for safety needs to be issued right away and pressure on Honda to find a solution and fix should be required by law! our local Honda dealership did state that there appears to be a problem with the wiring harness, but it only temporarily fixes the issue after being replaced.", "fail date": "  04/06/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "The Honda auto start stop system has been taxing my battery through daily use and creates unsafe situations. On more than one occasion, similar to the following, I have experienced the Honda Pilot stop the engine via the a. S. S. System. Upon releasing the brake, the system attempts, but fails, to come to ignition and the electrical system lacks the ability to start the engine, creating a need to re-start (or attempt restart). On 1 such occasion, my family was traveling through a city on the interstate. After driving on the interstate for a few hours we came to a stop light and stopped. At the green light, upon releasing the brake, the Honda Pilot attempted to start again and failed. The car went completely dead in the middle of a 4 lane interstate with my family inside. The car did not start again until the 3rd time attempting to restart the vehicle. Approximately 10 seconds later than intended, we were able to clear our vehicle from the interstate intersection. On normal occasions, such as the course of business with the Honda a. S. S. System, driving in situations that would be categorized as \"start/stop\" situations, the Honda a. S. S. System leads to stalled response and delayed lurching into traffic creating situations due to the delay in response. Multiple times this has been reported to my dealer. They acknowledge it as a \"battery\" problem. They test my battery per Honda warranty and tell me it \"passes\". They basically are just charging my battery and sending me out the door. The time between vehicle events is decreasing. Please help address this obvious vehicle shortcoming. There is no permanent means to disable it. Thank you.", "fail date": "  10/15/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "I have owned the 2020 Honda Pilot touring since Jan. 2021. Up till now, theses similar situations have happened 4-5 times. It always happens when I am gradually slowing down to a complete stop at crossroads. My 2020 Honda Pilot has shut off a few times while stopping at a red light. Each time has been after coming to a complete stop at a red light and sitting there for a couple minutes. Suddenly there is a beep sound and the engine shuts down. Only the entertainment system is left on. The gear changes to n by itself and I am unable to change it to any other gear. With my foot on the brake, trying to change the gear and trying turn off the car for about 3 minute in the middle of traffic with my kids in the car, eventually I was able to shut off the engine completely off. I immediately try restart the car to avoid a car accident. It put itself in n (neural) and the dashboard screen said “put it in p (park) and hit bottom to restart car. ” the car wouldn’t let me push anything. The power button did nothing and even if you pushed the p for park it stayed in n. The battery light immediately came on when this happened also. And went away as soon as it worked again. I scheduled an appointment after the third time the this happen leaving the car for them to run tests. They ran the tests and when I returned to pick it up, the technician said they tested the battery, wiring, and engine and that everything was good. Nothing was provided to me but they did show me the report as they talked about the results I am sure I can obtain if requested. They almost changed me for the testing but waived the fee which I was thankful. I am concerned and at times scared for the safety of my kids and I. I really hope Honda finds a fix for this and recalls for whatever the issues are as quickly as possible. I like the car but it really is making me want to get a new car and never purchase from Honda again.", "fail date": "  09/06/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "My Pilot has approximately 25,000 miles. I was stopped at a red light, my vehicle has the ignition shut off feature, which engaged while I was stopped. When the light changed and I went to accelerate, instead of the engine restarting, the entire car stalled and would not restart. There were a variety of flashing lights and the car appeared to have power but the engine would not turn over. I immediately turned my hazard lights on, but each time I tried to restart the car, the hazards would turn off which was particularly concerning. The police responded and we looked for options to get the car into neutral so we could move it out of the intersection but there appears to be no option for a layman to manually override the transmission and place the car in neutral. As a result I was stranded in my vehicle for nearly 3 hours in an intersection while I waited for a tow truck. There had been no prior indication of any issues with the vehicle. It was purchased used and I have only put approximately 2,000 miles on it since purchasing. The vehicle was towed to the dealership and is awaiting inspection. While my experience was terrible, I am terrified to think of how much worse this could have been if I had stalled in traffic on a highway or with my children in the car.", "fail date": "  06/30/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Over the last few years, after a long highway drive of approx. 20 miles when I stop and sit and idle, a strong gasoline smell is entering the vehicle via the hvac heating system. Also, after the same longer drives, when I return home, turn off and park the SUV in my garage, shortly after my garage smells of gasoline as well from the front passenger side of the SUV nearest the hood cowl. It does not happen 100% of the time but this winter it has occurred more frequently (a few times a week) during our mon-fri commutes.", "fail date": "  03/02/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Car was stopped at a traffic light and when it turned green, I pressed the accelerator. Initially the engine raced but the car did not move. After a few seconds, the car slowly began to move and then fully 'engaged' and moved forward.", "fail date": "  03/28/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The auto start/stop feature of the 2020 Honda Pilot is defaulted to on. At three times in the last two weeks, at a stop light, the vehicle lost all power, directed me to put the car in park and restart the vehicle. I had to press the start/stop button several times to get the vehicle to start again.", "fail date": "  11/13/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "While driving my 2020 Honda Pilot it jerks very hard when accelerating. It continues to do this when shifting gears. It’s also slow to accelerate and drags with the gears getting stuck until it finally jerks and shifts. I just had the transmission flushed 7k miles early yesterday 10/21 due to Hondas recommendation. I get regular scheduled maintenance and this is the 2nd flush with my car only having 50k miles. Now they say I will need to keep coming back getting repeated flushes at my expense until the fluid is cycled through. My car is driving worse than before the second flush. I’m afraid to drive it on the highway due to these jerks and stalls in shifting because it might freeze up causing a life threatening situation.", "fail date": "  10/19/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The vehicle is showing the same issues as found in the Honda service bulletin 20-029 for \"9-speed a/t hard upshift with steady acceleration\", and an occasional hesitation or slip. Our Honda Pilot has a Honda 6-speed automatic transmission and awd. The transmission has just had a full service, which included a \"transmission fluid exchange to include torque converter lines\" and replacing the transmission filter. When watching the vehicle shift, the tachometer will spike rpms, then drop well below, and rise to settle in-between with a hard upshift. This issue was extreme prior to the transmission service, especially given the vehicle has only 49k miles and was purchased brand new. The constant hard shift and slip is a safety hazard.", "fail date": "  10/17/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "There is a grinding/vibration or \"rumble strip\" sound around 44mph. This happens during cruising and not necessarily accelerating or decelerating. I took it to the Honda dealer and a special Honda tech came out and reported that this happens when the 5,000lbs towing package is installed which contains a transmission cooler and the cooler is where the sound is coming from. There is no fix. Cars, especially new cars, should not grind, and there is no fix from Honda and this issue effects all Honda makes and models with the 9 speed transmission since 2016 (so the dealer said).", "fail date": "  04/13/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2020 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The infotainment went out after less than 20 miles and 1 week of owning the vehicle brand new. There is no backup camera now - which is mandatroy, and no radio or anything from the dash. This happened while driving on local street and the speedometer also goes in and out. The vehicle is unsafe to drive. Tried leaving the positive battery unhooked for a while but it didn't fix anything. Seeing the other complains about this, this appears to be a lemon right from the factory and Honda is mass producing them, knowing this is a defect with no fix. The dealer needs my new car for 2 days to rewire the whole dash and they claim it won't fix it. They say that after that doesn't work, a special Honda tech gets flown in to try to fix it, but there is no guarantee that will work. Just great, my new car is junk and I'm stuck paying for it.", "fail date": "  07/08/2020"}]