[{"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2022 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "Wednesday 9/28, some cloud cover but nothing on the deck, mild temps, straight highway– traveling on I-90 eastbound at 10am, and past north bend and the 436th Ave se exit, our 2022 Pilot braked suddenly from 70 to about 40 mph accompanied by the red flashing braking light. At that point the west bound traffic is some 100 feet away from the eastbound. We were in the left line with a speed of 70 mph with acc activated. Just prior, I noticed an ambulance, westbound, with lights on – in the westbound left lane, as our cmbs went bonkers eastbound. Luckily, there were no other cars near us.", "fail date": "  09/28/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2022 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "I have only owned this car, purchased new from the dealer, for a few weeks. Three times already the collision mitigation braking system has almost gotten me rear-ended (and almost got me punched by one of them who thought I slammed on my brakes on purpose. ) -once was on the expressway when I was changing lanes. I guess the car thought I was too close to the car in the lane I had already left, but it slammed on its brakes anyway causing a car behind me to have to avoid a collision with me. - the second was at a stop light waiting for a left turn arrow. There were several of us in line (obviously in close proximity to each other) and, when the green arrow came on to allow the turn, I started moving and the car slammed on its own brakes. The car behind me had to panic brake to avoid rear-ending me. He then started getting out of his car; furious that I'd just done that. - the third time was again from a stop at a red light, but going straight this time. The light turned green, I started moving, and after a couple seconds the car slammed on its brakes again almost getting me hit. There needs to be a way to permanently disable this feature rather than defaulting to \"on\" at every start. I will work on remembering to manually turn it off every start-up, and hopefully I can remember 100% of the time before someone gets injured.", "fail date": "  08/18/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2022 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "While driving on the freeway my vehicle suddenly brakes without me pressing the brake. There were no vehicles in front of me to trigger the automatic brakes sensors. The brake warning light turned on and began flashing. I was almost hit from the back by the car behind me. My car is available for inspection upon your request. I have take my vehicle to dealer service center for other electrical issues.", "fail date": "  05/05/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2022 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "When driving on highways and interstate the vehicle flashes brake when the is no reason to brake. This happens multiple times per day, in our commute. The 2nd thing (and most dangerous) is the auto braking. Several times on the interstate the car has done a hard brake while going interstate speeds, only there wasn’t a reason for it. No other vehicles were in front of us at the time. It has also happened several times on the state road that we drive daily. We have taken it to the dealership and were told it is functioning normal. It’s not. I have contacted Honda and I have a case number with them, but they have failed to contact me when they said they would (2 weeks late) we see this as an absolute danger to our family. We need an advocate. The issue is ongoing.", "fail date": "  05/02/2022"}]