[{"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "I have had multiple time of my vehicle's auto stop start feature failing to start after being engaged. When you come to a stop, the car turns off. When you lift off the brake to go the engine cranks for a second, but does not start. The screen says \"shift car to p\". I am often stuck at an intersection and traffic gets upset we are not moving. There is no warning light or lamp. I have had the vehicle repeatedly serviced by the dealer. They said they cannot replicate the issue. The battery has been replaced several times.", "fail date": "  12/06/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The vehicle does not restart when at a stop. The auto idle shut off will not work. This has happened multiple time since we purchased the vehicle. It has been to the dealer multiple times with this problem. When it happens, you must put the vehicle in park and restart the engine. This causes a problem for traffic as sometimes it is very hard to restart.", "fail date": "  12/05/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "When coming to a stop the vehicle engine’s automatic stop/start system stops the engine then multiple warning lights are on and the vehicle fails to restart automatically. Driver must work through a series of steps while sitting at an intersection or stoplight resulting in a vulnerable position.", "fail date": "  12/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Hi, today my 2016 Pilot elite stop working on a red light. Once the brake pedal was released, the engine stop and warning lights appeared on the dash board: neautral message light and battery light. My wife and two daughters were scared and helpless. Cars were honking. After around 2 minutes and at least three tries to turn on, it finally did. We are happy to know that Honda is working on this matter, thanks.", "fail date": "  11/10/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Auto start for idle fails at start intermittently. If stopped at an intersection, when proceeding to go, engine cuts off and gear shifts to n, requiring a shift to p and start pressed before then going to d and continuing. This is always at intersections and the delay puts driver in jeopardy.", "fail date": "  11/06/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Keyless access unit failure/malfunction per Honda service center. While park and turned off, vehicle randomly turns on to accessory mode causing drain on battery and/or alarm to sound when locked/set. No codes or warning or issue prior or since. This issue has noticed and continues.", "fail date": "  10/31/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "When car stops due to auto idle it then stalls and the engine completely cuts off. Then having to restart the car. This has happened to me an immense amount of times, in streets, freeways and it is going to kill someone. I have on. Numerous had near misses where people have barely avoided rear ending me. I have reported to dealer, american Honda and nothing has been done. Every time it has gone into dealer for this they just say they can not replicate it. It is a lemon and a dreadful defect in this car. Something has to be done before someone is killed.", "fail date": "  10/24/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "My 2016 Honda Pilot will not restart after it idles at a stoplight. This has happened multiple times and is happening more frequently (twice today). Both times today I was in a line of traffic and was in fear that someone behind me would hit me. The dashboard message said to put the car in park but that did not work. I had to turn the car completely off and restart it. The second time it took me three tries to get the car started. The guy behind me was very angry, gesturing and yelling. Road rage is scary too. I had the car looked at several months ago due the same issue and they could not find anything wrong when they ran diagnostics. I cannot recreate the problem on demand. It is sporadic. And scary.", "fail date": "  10/20/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "On multiple occasions, but the latest being 10/19/2022, my car will not restart after the auto idle start/stop feature malfunctioned while at a stoplight this afternoon. The battery is not old, and we recently had it checked because it has been doing this a lot lately. It checked out fine when tested. Something is majorly wrong with the electrical parts when this happens. Lights flash, my hazards didn’t even work today, which was very scary and not safe. The only door that would open was my driver side door. This is a huge safety concern and I am now looking for a new car. This has happened at least 20-30 times, but today was the worst. It took awhile to get it jumped off. In the middle of traffic, with my hazard lights not working. Honda really needs to fix this. We took it to the dealership once about this issue and they said nothing was wrong. Please investigate this issue before it causes injury.", "fail date": "  10/19/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The contact owns a 2016 Honda Pilot. The contact stated while driving at approximately 35 mph, the charging system error light and brake system error lights illuminated. The contact had not taken the vehicle to a local dealer or independent mechanic. The vehicle had not been diagnosed. The vehicle had not been repaired. The contact had researched online and related the failure to NHTSA campaign number: 15v668000 (electrical system). The manufacturer had not been informed of the failure. The failure mileage was approximately 100,000.", "fail date": "  10/17/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Stop/start failure. Engine fails to restart after stopping.", "fail date": "  10/17/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The infotainment screen and system frequently shut off as you are driving down the road. It has been doing it for years and I’ve brought it in to the dealer for them to update the software and other tricks they said they could do. It did not help and the problem is getting more frequent.", "fail date": "  10/14/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The start/stop turn the car off and when I tried to restart the car nothing happen. The battery is good and I heard a click sound but it won't start back for a few minutes sometimes.", "fail date": "  10/07/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "When at a stop, t he start/stop feature is enabled and the engine shuts off as expected. When I lift my foot off the brake, it doesn't always restart, and I am left stranded in an intersection or at a light, and almost in accidents. Very unsafe. I have to turn it off every time I get into the car. When I forget to turn it off, it always fails to restart.", "fail date": "  10/05/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The idle stop shuts off my engine as designed but then it fails to restart approximately 10% of the time. When this occurs I have to put my car in park, turn off the car completely, turn it back on and put it in drive. While this most frequently happens at stop lights it has occured on the freeway when I have needed to stop. The frequency in which this is happening seems to be increasing. I have already had the start button on the car replaced twice. The issue continues to happen with increasing frequency.", "fail date": "  10/03/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Driving in traffic. Idle stop system kicked in to turn off the engine. I let my foot off the brake pedal to turn left in the intersection, and the engine failed to restart after stopping. I put the car in park, and the car would not re-start. Ultimately, I had to turn the car fully off and then back on before it would restart. I was blocking traffic for over a minute with the car unable to restart. There had been several prior instances where the car almost didn't re-start, but this is the first time that it would not restart. I have seen prior notices that the NHTSA odi is currently investigating this issue.", "fail date": "  09/22/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "2016 Honda Pilot touring model issue: idle-stop feature while driving the vehicle and comes on the intersection/stop light when you hit brakes the idle-stop feature will turn off your engine but once you release the brakes the engine wont turn on. To able to turn on the engine, you need to turn off the vehicle by pressing ignition button then you need to press it again to turn on engine (is like starting the vehicle again). Here some stances happened while this idle stop didnt work well. Driver at the back, you're using cellphone, start honking and when they by pass you yelling stop using cellphone. Or simple honk you and when you look they're confused as we're you what's going on. Honda or other people saying its related to battery but even with new battery this still happened. If this will not be fix or resolve soon, this cause an accident. Either remove this feature or fixed this issue.", "fail date": "  09/22/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The auto start/stop feature activated while I was at a stop and shut the vehicle off. When I removed my foot from the brake the vehicle stalled and would not restart. Had to place the vehicle in park and apply the brake to get it to restart. The restart took multiple pushes of the start button. This was a busy intersection where I immediately became a hazard.", "fail date": "  09/13/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Engine fails to restart after an automatic engine idle stop while completely stopped at a stop sign.", "fail date": "  09/13/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The engine's idle-stop feature shut off my car while stopped at a busy intersection in urban traffic, and took 15 seconds to restart the automobile. The idle-stop feature kicked in when at an intersection. When I took my foot off the brake to accelerate forward, the car instead turned off. The dashboard prompted me to shift the car into park, put my foot on the brake, and press the engine ignition button. I did so, but the car did not restart, even when I repeated the process 2-3 times. Finally, on the fourth time, the car restarted.", "fail date": "  09/12/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "I own a 2016 Honda Pilot (touring) model. Upon start-up the idle-stop feature is defaulted to enabled. When the vehicle comes to a stop the idle-stop feature shuts down the engine but leaves some features such as air conditioning and radio running. Upon disengaging the brake, the vehicle should automatically restart. However, on many occasions both on residential and freeway the vehicle has failed to restart and stalled. After putting the vehicle in park and attempting to restart it, it does not restart right away. Because of the stall, the vehicle appears to be left in an indeterministic state making restart more difficult and time consuming. After several tries of applying the brake and pressing the on/off button to restart the vehicle, the vehicle finally restarts. When the vehicle stalls, many of the dashboard lights come on. . . Maybe all of them do. The major safety issue is that the vehicle becomes non-operative on busy streets or freeways. The driver will be required to turn on his hazard lights while trying to restart the vehicle. This failure places the driver and passengers at risk of being hit because it is non-operational in an environment/situation where other motorists believe you should be moving. I have made an appointment with my dealership to have it inspected. The problem has occurred multiple times on both the street and freeway. It is not always easily reproducible but has been witnessed by passengers in my vehicle. There appears to information from the public regarding this type of failure on social media.", "fail date": "  09/09/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The contact owns a 2016 Honda Pilot. The contact stated that after stopping at a red light the auto shut off feature activated and turned the engine off to consever fued. After releasing the brake pedal the engine restarted but immediately shut off after the vehicle had rolled into the busy intersection. The vehicle would not immdiatly restart. The message \"keyless start problem\" had displayed. The cause of the failure was not determined. The local dealer was notified of the failure. The manufacturer was not contacted. . The failure mileage was 120,000.", "fail date": "  09/05/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The contact owns a 2016 Honda Pilot. The contact stated that after stopping at a red light, the auto stop/start feature activated and turned the engine off to conserve fuel. After releasing the brake pedal the engine restarted but immediately shut off after the vehicle had rolled into the busy intersection. The vehicle could not be immediately restarted. The message \"keyless start problem\" was displayed. The cause of the failure was not yet determined. The local dealer was notified of the failure. The manufacturer was not contacted. The VIN was not available. The failure mileage was 120,000.", "fail date": "  09/05/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "When auto stop/start engages the vehicle occasionally will experience a complete engine and electrical shut down when auto start is supposed to engage; the is often leads to a dead vehicle in traffic at an intersection. Occasionally it will have extreme difficulty with a restart, often only starting after several attempts at push button starting. Fuel injectors and battery have all been replaced recently, fuel injectors under recall/manufacturer issue and battery at replacement lifetime. Is often unpredictable when it will cause issues and when it will operate correctly. Has occurred intermittently for several years with a somewhat unpredictable pattern.", "fail date": "  09/03/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "When stopped at a red light with my foot on the brake and the engine in idle, the engine turned off when I put my foot on the gas peddle. The engine idle stop was on. This occurred while stopped in city traffic (6/2022) and again when I was stopped at a red light on a highway (9/3/2022). The car rolled backward. I had to put the car in park and restart the car. I now have manually turned off the engine idle stop.", "fail date": "  09/03/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "This issue has occurred twice. First occurrence was when stopped in traffic. Auto stop engaged. When brake was released auto start caused vehicle to stall-out. Vehicle restarted after multiple attempts. Second occurrence was when stopped at traffic light. Auto stop engaged. When brake was released auto start caused vehicle to stall-out. Vehicle restarted after one attempt. For both occurrences, radio was on, air-conditioning was on and outside temperature was +85 degrees. This is a serious safety concern.", "fail date": "  08/27/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "My 2016 touring Honda Pilot has an issue with the idle stop/start feature. I exited the highway and the vehicle shit down as I was decelerating. All of the dash lights flashed and the car would not accelerate. The flashing warning toggled bw engine idle problem and transmission. I was unable to shift gears even into neutral. After shutting the car off, it acted normally for a few weeks. Now, the car is doing it again and I had to have it towed to the dealership bc the lights continued flashing and the I couldn’t shift gears. Dealer says it’s an electronic control issue and costs $900 to repair.", "fail date": "  08/27/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Car has auto engine stop/restart as a fuel saving measure. Several times the car has failed to restart after turning off. This happens in highway stop/go traffic, at traffic lights. This is dangerous, as my foot comes off the brake, cars behind me think I am moving, and then the engine fails as it is restarting. I have to then put my foot back on the brake, put the car in park, and restart the engine before being able to drive again. This happened on 8/25, and 3 other times within the last month. This did also happen perhaps a year or 2 ago, the dealer did examine the car but I don't believe they found any issues to be repaired.", "fail date": "  08/24/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "My 2016 Honda Pilot touring stalls out at a red light while using the auto stop-start. It happens occasionally when I take my foot off the brake and put my foot on the gas. Instead of coming out of idle with the engine starting up again, the car would stall completely and I would have to put the car in park, press the brake pedal and push the start button to get it on again. I took the car into the dealer and they told me that there was no software update and that they couldn’t do a update anyways because check engine light wasn’t on. Also have a issue with transmission not switching gears smoothly on take off. Jerks on take of. Once again they told me transmission was fine and there was no software update and that they couldn’t do a update anyways because check engine light wasn’t on.", "fail date": "  08/23/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "When start-stop feature is \"on,\" the car will not start again in certain instances when the engine is shut down after a complete stop. The NHTSA currently has an investigation opened in this matter (opened in June 2022).", "fail date": "  08/22/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "With increasing frequency of occurrence, the car will not start after the auto stop/start mechanism has been invoked. For example, when stopped at a red light, the engine will turn off as the car is not moving. However, once the light turns to green and the brake is depressed, the car will not start and/or will start and then the engine will cut-out. To start the engine, the car needs to be fully turned off, gear put into park and then restarted. There appears to be something at fault with the automatic stop-start mechanism and/software. My car is a 2016 Honda Pilot touring with less than 28k miles.", "fail date": "  08/20/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The auto engine idle feature malfunctions. When stopped in traffic and at intersections the auto engine idle feature turns off the engine; however fails to restart. I can put the car into park, but the brake remains engaged and the ignition button blinks white. I have attempted many different things to 'reset' the computer. Putting the car in park, waiting, unlocking seatbelt, open/shut door. The last time, I had to walk away from the vehicle with the key fob in traffic. Locking and unlocking the car seemed to reset the computer. This placed me in dangerous traffic. It has happened in a construction zone on interstate, at intersections several times, during rush hour when it was impossible to leave the vehicle due to high speed traffic, and once while towing. Each episode has generally taken about 15 minutes for computer to shut down/reset. There is no message on the dash before , during or after. I now disengage the auto engine idle button when driving due to fear of being stranded in dangerous traffic situations. If I forget to turn it off, it is likely to malfunction. I have contacted the dealership about this problem before. There was no code, so the problem was deemed a mystery and remains unresoved by Honda.", "fail date": "  08/18/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The engine fails to restart on its own from a complete stop at a traffic light or road intersection with the auto/start stop function. This happens intermittently, but has put my family in danger on several occasions. When the light turns green, the car turns off, and has to be put in park and restarted. I have come close to being rear-ended during these situations, as approaching vehicles have to stop suddenly because my car is disabled. I have taken a video of these incidents, but Honda is unable to recreate the issue and has not offered a solution.", "fail date": "  08/10/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "2016 Honda Pilot stalls during idol-start stop. Driver is forced to put it into park and restart vehicle. I took the vehicle to manchester Honda (CT) for service over a year ago, but no issues were found. They updated the software, but it did not help. The issue is getting worse - sometimes it takes multiple attempts to restart the vehicle. This is a serious safety concern as it has happened in the middle of a busy intersection and in the middle of the highway in traffic. It is currently not possible to disable the system and I don't always remember to manually shut it off every time I start the car.", "fail date": "  08/02/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "I driving home from a local costco and slowed to a stop at an intersection not far from my home. The car stalled and would not restart. After several attempts the car completely shut off and I was unable to even turn on any of the accessories. Ultimately I had to have the vehicle towed to a local shop because I was obstructing traffic and was at a dangerous intersection. I late continued to have similar issues after several battery replacements and jump starts. I had my vehicle serviced at a local dealer and they advised that it was the central power module that was bad. I was advised that this also controls the intermittent idle control function that is designed to save gas when the car is idle and not running. The car was was not under warranty so I had to pay for the new part and installation. The car is now experiencing similar issues. The car will randomly loose power and most recently will be completely non operational and jump starts are necessary to restart the car. A keyless start system error has now been appearing randomly. Their is a TSB out for this particular part but have been advised that code has to be present in order the the local dealership to initiate a repair. I am going to attempt to have the vehicle brought to a local dealer for inspection.", "fail date": "  08/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "1) engine failure - several times our 2016 touring has stalled at a stoplight. It takes time to start back up. I have to turn on hazard light, and it is getting worse every occurrence. This has happened since I bought new, and when it happens, all of the lights come up on the dash. There is a investigation in the state of California, but nothing in ohio yet. 2) I just had to replace my drive shaft that goes from from to back on center bottom of the car. They said the rear is failing, and that may be part of the problem with sluggish acceleration. 3) transmission: sluggish acceleration is this zf 9 speed (outsourced) by Honda issue. I will be accelerating on the freeway, and all of the sudden, it would down shift to like second gear, causing me to slow down suddenly. Dangerous if cars are behind in rush hour. I also had 4 incidents where I could have lost my life because I could not accelerate (the gear would not engage). Dealer informed me that all of the updates are uploaded, and it should be okay. But it's not okay when you are carrying your children, spouse, or CO-workers. I have informed the dealer many times that this car is not safe. I personally ran a business as tier 1 supplier to Honda and visited many Honda factories. Nothing ever got done. It will be too late before they can help us. All of the data and information is at Honda marysville (ohio) dealership. All of my services (including oil change) are done there.", "fail date": "  12/08/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I have had multiple time of my vehicle's auto stop start feature failing to start after being engaged. When you come to a stop, the car turns off. When you lift off the brake to go the engine cranks for a second, but does not start. The screen says \"shift car to p\". I am often stuck at an intersection and traffic gets upset we are not moving. There is no warning light or lamp. I have had the vehicle repeatedly serviced by the dealer. They said they cannot replicate the issue. The battery has been replaced several times.", "fail date": "  12/06/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The vehicle does not restart when at a stop. The auto idle shut off will not work. This has happened multiple time since we purchased the vehicle. It has been to the dealer multiple times with this problem. When it happens, you must put the vehicle in park and restart the engine. This causes a problem for traffic as sometimes it is very hard to restart.", "fail date": "  12/05/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "When coming to a stop the vehicle engine’s automatic stop/start system stops the engine then multiple warning lights are on and the vehicle fails to restart automatically. Driver must work through a series of steps while sitting at an intersection or stoplight resulting in a vulnerable position.", "fail date": "  12/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Several times when stopped the auto shut off for the engine does not restart and engine completely turns off with the car in drive and me unable to move. This leaves me at an intersection while cars are trying to go and I have to restart my car. I have been almost hit when cars coming up to the intersection assume I am going to be moving soon. I have brought this up to my Honda dealer several times. One time they claimed it was my battery so I paid to have my battery replaced only to have it continue to happen. The last time I was in the Honda dealer they said they have had a number of complaints and Honda has no solution. I asked if they could disable the feature so that I didn't have to worry about it happening. They said no. I have to manually disable it every time I start the car. There are no indicators or lights showing that there would be a problem.", "fail date": "  11/22/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I am experiencing the same issue as is described in NHTSA action number: pe22005 for my 2016 Honda Pilot. It has been in for service numerous times and Honda has no solve for it. The auto idle stop turns the engine off correctly, however, it has failed to restart more than a dozen times over the last 2-3 years. Honda has replaced the battery twice since the start of this issue. This stall has caused dangerous situations and has impeded traffic while I get the car restarted. I see the ntsb has an open investigation about this issue and I would like to add my name / car to the list of people reporting the issue. The date I am listing in this report is the last time it happened.", "fail date": "  11/12/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Hi, today my 2016 Pilot elite stop working on a red light. Once the brake pedal was released, the engine stop and warning lights appeared on the dash board: neautral message light and battery light. My wife and two daughters were scared and helpless. Cars were honking. After around 2 minutes and at least three tries to turn on, it finally did. We are happy to know that Honda is working on this matter, thanks.", "fail date": "  11/10/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "When I was driving my Honda Pilot 2016 on highway 59, suddenly my car lost power and jerking. Multiple warning light went on. It was very dangerous and almost got me killed. It turns out that Honda knew this problem, TSB# a18010i, due to a part is out of spec. Honda should recall this problem.", "fail date": "  11/10/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Auto start for idle fails at start intermittently. If stopped at an intersection, when proceeding to go, engine cuts off and gear shifts to n, requiring a shift to p and start pressed before then going to d and continuing. This is always at intersections and the delay puts driver in jeopardy.", "fail date": "  11/06/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The engine completely stopped working while driving on the interstate. The engine only has 130,000 miles on it and I am now facing a $15,000+ repair on a known issue with the Pilots.", "fail date": "  11/04/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Auto start/stop feature fail to restart multiple times. Leave me stranded on a busy highway and road.", "fail date": "  10/29/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "When car stops due to auto idle it then stalls and the engine completely cuts off. Then having to restart the car. This has happened to me an immense amount of times, in streets, freeways and it is going to kill someone. I have on. Numerous had near misses where people have barely avoided rear ending me. I have reported to dealer, american Honda and nothing has been done. Every time it has gone into dealer for this they just say they can not replicate it. It is a lemon and a dreadful defect in this car. Something has to be done before someone is killed.", "fail date": "  10/24/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Emission system problem light - is very common 2016-2018 Honda Pilot. Why is there no recall/permanent fix for this? this is a Honda defect in manufacturing/workmanship. Honda should resolve!.", "fail date": "  10/24/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The auto stop/start has left me stranded numerous times. The car won't start.", "fail date": "  10/23/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "My 2016 Honda Pilot will not restart after it idles at a stoplight. This has happened multiple times and is happening more frequently (twice today). Both times today I was in a line of traffic and was in fear that someone behind me would hit me. The dashboard message said to put the car in park but that did not work. I had to turn the car completely off and restart it. The second time it took me three tries to get the car started. The guy behind me was very angry, gesturing and yelling. Road rage is scary too. I had the car looked at several months ago due the same issue and they could not find anything wrong when they ran diagnostics. I cannot recreate the problem on demand. It is sporadic. And scary.", "fail date": "  10/20/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Two weeks ago after a 4 hr drive, I pulled in to by gas and when I tried to restart the car, all the panel lights came on but the car would not \"crank\" on. Tried it several times with same result. Outside lights ok, interior lights ok. Added problem as the car would not start there is no way to get it into neutral and the car was unmovable !! fellow driver offered to jump it and it started right up. Took it right to the dealer and test the battery. Tested good. I then turned it off and on several times and it worked. I have driven it over the last two weeks and have not had a problem. Last night the same think happened in a parking lot. Again a jump started it right up and has worked \"normal\" since. This could happen anywhere, anytime (safety) and the inalienability to move the car out of the way is a road hazard.", "fail date": "  10/19/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Repeatedly, the engine idle auto-stop function fails. The dealership and authorized Honda repair facilities say it is a known issue to them but not acknowledged by Honda. They state it must be due to driver error. When this function fails, it is random and creates an immediate emergency situation. The engine auto-stop feature is on by default. We try to remember to turn it off every time. But when we forget, we come to any stop (light, traffic etc), the engine will go from idle to stall! no notice, no warning, no indicator light. The car will completely turn off with the car in drive. You need to put the car in park, try to restart the car, get back into drive and hope an accident doesn't occur. We have a college teen now who drives this Honda Pilot. Soon to have a high school teen. They do not have enough driving experience to react to something like this. My fear is that a serious accident may incur. Last year this same engine had some type of issue where every light on the dashboard would light up. Apparently a know problem with a defective fuel injection system. We were never notified about this issue from Honda. Honda repaired it at no cost but, it was another know issue about a major engine flaw. Now this auto idle which is going out of control. Honda needs be accountable before fatalities occur. This car is becoming a lemon.", "fail date": "  10/16/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "When driving and stopped, the fuel saving features shuts the engine off to save fuel, it should restart the engine after letting your foot off the brake. At least 25 times now, the car fails to restart. In a panic, you have to put your foot back on the brake, put the car in park, restart the engine by pushing the start button, then put the car in drive before you can resume. This has nearly caused us to be hit by other vehicles that assume you will start to move when traffic resumes. On the interstate there was an accident ahead and the car did this when a semi was moving at great speed toward us with our family. I’m not sure this car is safe. The Honda service department suggested we have valves adjust at a cost of $700-$800 claiming that could help. There are no warning lamps. The car has had the battery replaced in the last year and starts every time, the first time when we begin a trip. Our teenagers can’t drive this car due to this safety issue. This started about a year ago and is becoming more frequent. It happened three times in the last week.", "fail date": "  10/13/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I was exiting a highway and entering a right hand turn lane. There was traffic in the turn lane and I came to a complete stop. When I stopped my car shut down. I attempted to restart by pushing the engine start/stop button but the car did not restart. It took about 30-60 off trying the butting, attempting to shift into drive and opening/closing the door and trying to restart before I could get the car to restart.", "fail date": "  10/10/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The start/stop turn the car off and when I tried to restart the car nothing happen. The battery is good and I heard a click sound but it won't start back for a few minutes sometimes.", "fail date": "  10/07/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "When at a stop, t he start/stop feature is enabled and the engine shuts off as expected. When I lift my foot off the brake, it doesn't always restart, and I am left stranded in an intersection or at a light, and almost in accidents. Very unsafe. I have to turn it off every time I get into the car. When I forget to turn it off, it always fails to restart.", "fail date": "  10/05/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Engine has failed to restart after stopping on multiple occasions. When stopped, the engine shuts off and the dash prompts you to place your foot on the brake and press the ignition button. The engine may start back up after several attempts. All lights on the dash flash intermittently with each attempt to restart the vehicle.", "fail date": "  09/30/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Car's auto start feature for fuel savings has failed to function on numerous occasions and required shutoff and manual restart. There is no provision to permanently disable this feature but requires disabling every time car is started.", "fail date": "  09/15/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "When the car stopped at red light, sometimes it can not restart. I got a few time too hard to restart to drive.", "fail date": "  09/14/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The contact owns a 2016 Honda Pilot. The contact stated that on several occasions without warning, the vehicle stalled. Additionally, the contact stated that a year ago, the vehicle stalled with several unknown warning lights illuminated. The vehicle was taken to the dealer where the battery was replaced and the contact was informed that the start/stop switch needed to be replaced. The vehicle was repaired however, the failure recurred. The dealer was notified of the failure and the contact stated that she was informed that there was no fix for the failure. The vehicle was not diagnosed or repaired. The manufacturer was notified of the failure and the contact was informed that an appointment was scheduled for September 20th for a diagnostic test. The failure mileage was 89,529.", "fail date": "  09/14/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The engine's idle-stop feature shut off my car while stopped at a busy intersection in urban traffic, and took 15 seconds to restart the automobile. The idle-stop feature kicked in when at an intersection. When I took my foot off the brake to accelerate forward, the car instead turned off. The dashboard prompted me to shift the car into park, put my foot on the brake, and press the engine ignition button. I did so, but the car did not restart, even when I repeated the process 2-3 times. Finally, on the fourth time, the car restarted.", "fail date": "  09/12/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "On numerous occasions, the auto-engine stop/start feature that turns off the engine when the car comes to a stop has had issues where the engine does not restart and the car enters into an error state. I must then turn off the car, then turn it back on. Sometimes this happens after I've pulled out into an intersection but have to stop before proceeding.", "fail date": "  09/03/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "When auto stop/start engages the vehicle occasionally will experience a complete engine and electrical shut down when auto start is supposed to engage; the is often leads to a dead vehicle in traffic at an intersection. Occasionally it will have extreme difficulty with a restart, often only starting after several attempts at push button starting. Fuel injectors and battery have all been replaced recently, fuel injectors under recall/manufacturer issue and battery at replacement lifetime. Is often unpredictable when it will cause issues and when it will operate correctly. Has occurred intermittently for several years with a somewhat unpredictable pattern.", "fail date": "  09/03/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "When stopped at a red light with my foot on the brake and the engine in idle, the engine turned off when I put my foot on the gas peddle. The engine idle stop was on. This occurred while stopped in city traffic (6/2022) and again when I was stopped at a red light on a highway (9/3/2022). The car rolled backward. I had to put the car in park and restart the car. I now have manually turned off the engine idle stop.", "fail date": "  09/03/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "No restart after auto start/stop engages.", "fail date": "  09/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "This issue has occurred twice. First occurrence was when stopped in traffic. Auto stop engaged. When brake was released auto start caused vehicle to stall-out. Vehicle restarted after multiple attempts. Second occurrence was when stopped at traffic light. Auto stop engaged. When brake was released auto start caused vehicle to stall-out. Vehicle restarted after one attempt. For both occurrences, radio was on, air-conditioning was on and outside temperature was +85 degrees. This is a serious safety concern.", "fail date": "  08/27/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The engine will stall at stoplights. It appears the auto start/stop feature fails when engaged. Car has stalled 4xs in the past week. To fix issue: you have to put the car in park, foot on brake, and hit the start engine button in order to restart the car. Also put hazards on for safety reasons. Once car starts, you can put into drive and go forward. We've been fortunate not to have an accident. It's a significant safety issue stalling at stop lights with traffic behind you. Local Honda service center could not replicate the issue. I instructed them that you have to drive car for ~20-25 minutes before it will stall. Car was scheduled for regular a156 maintenance. They are looking at the stall issue today, 8/26/2022.", "fail date": "  08/26/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Car has auto engine stop/restart as a fuel saving measure. Several times the car has failed to restart after turning off. This happens in highway stop/go traffic, at traffic lights. This is dangerous, as my foot comes off the brake, cars behind me think I am moving, and then the engine fails as it is restarting. I have to then put my foot back on the brake, put the car in park, and restart the engine before being able to drive again. This happened on 8/25, and 3 other times within the last month. This did also happen perhaps a year or 2 ago, the dealer did examine the car but I don't believe they found any issues to be repaired.", "fail date": "  08/24/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "My 2016 Honda Pilot touring stalls out at a red light while using the auto stop-start. It happens occasionally when I take my foot off the brake and put my foot on the gas. Instead of coming out of idle with the engine starting up again, the car would stall completely and I would have to put the car in park, press the brake pedal and push the start button to get it on again. I took the car into the dealer and they told me that there was no software update and that they couldn’t do a update anyways because check engine light wasn’t on. Also have a issue with transmission not switching gears smoothly on take off. Jerks on take of. Once again they told me transmission was fine and there was no software update and that they couldn’t do a update anyways because check engine light wasn’t on.", "fail date": "  08/23/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "When start-stop feature is \"on,\" the car will not start again in certain instances when the engine is shut down after a complete stop. The NHTSA currently has an investigation opened in this matter (opened in June 2022).", "fail date": "  08/22/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "All warning lights turned on during a normal drive. The dealer said it is a harness issue and needs to replace the harness to fix the issue. Surprised that a part that does not move had to be replaced. It has happened a couple of times before.", "fail date": "  11/12/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Hi, today my 2016 Pilot elite stop working on a red light. Once the brake pedal was released, the engine stop and warning lights appeared on the dash board: neautral message light and battery light. My wife and two daughters were scared and helpless. Cars were honking. After around 2 minutes and at least three tries to turn on, it finally did. We are happy to know that Honda is working on this matter, thanks.", "fail date": "  11/10/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "On multiple occasions, the engine fails to restart after the auto start/stop function has engaged. I have previously had this addressed by a Honda dealer at which time they replaced some parts having to do with the ignition system. The problem is still occurring and the only remedy is to manually shut off the auto start/stop function each time the vehicle is driven.", "fail date": "  09/30/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "2016 Honda Pilot touring model issue: idle-stop feature while driving the vehicle and comes on the intersection/stop light when you hit brakes the idle-stop feature will turn off your engine but once you release the brakes the engine wont turn on. To able to turn on the engine, you need to turn off the vehicle by pressing ignition button then you need to press it again to turn on engine (is like starting the vehicle again). Here some stances happened while this idle stop didnt work well. Driver at the back, you're using cellphone, start honking and when they by pass you yelling stop using cellphone. Or simple honk you and when you look they're confused as we're you what's going on. Honda or other people saying its related to battery but even with new battery this still happened. If this will not be fix or resolve soon, this cause an accident. Either remove this feature or fixed this issue.", "fail date": "  09/22/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "My car often does not start back up at stop signs/traffic lights. I feel very much in danger. It is difficult to get my car to start back up after it fails to start back up. I usually have to press really hard on the brake and even this is difficult to get it to restart. This is supposed to save fuel but I’m so afraid that someone is going to crash into me and put us all in harms way. Please help!.", "fail date": "  09/20/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "My 2016 Honda Pilot touring model won’t restart after idle stopped. I have to place car in park and restart using the start button. Issue occurs only when can idle stops. This has happened to us about 5 - 6 times over a course of 1 year. Detailed says they are unable to find the issue after a software scan. This is a serious safety concern.", "fail date": "  09/05/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "This like the third time this has happened where the stop-start feature on my Honda Pilot almost have gotten me into a serious accident. It has happened during stop and go on i95 when I was heading to maine and I stopped and it literally almost shutdown after I got ready to go forward. Most recently it happened 4 Sep 2022 at about 11:05am est and was in a turning line in chelsea, MA and it when it into stop idle shutdown feature but then completely shut off and it took about 2 to 3mins to get it to start back up. The car behind almost hit the back thinking I was pulling off but my Honda Pilot shutdown right when I was getting ready to take off. This is serious danger and defect in this when I see other vehicles operate with no problem with this feature. This could cause someone to get into a serious accident especially in massachusetts.", "fail date": "  09/04/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The vehicle stalls at stop signs, traffic lights and in stopped traffic. Sometimes takes multiple trys to restart the vehicle. Been happening regularly for several years. Have had multiple repairs done with no affect.", "fail date": "  09/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "When you start the car it is always in economy mode so that the engine can shut off when you are stopped. I like to turn this feature off manually as a few times if I don’t the car has stalled and also goes into neutral. Happened while I was on California highway 80 in stop and go traffic which was pretty scary as I was in the center lane. This was about two months ago. It happens about 10% of the time when I am in this mode if not completely stalling it splutters and feels like it won’t start or delays to restart. Happened yesterday at a light. Became a safety issue as cars tried to go around me by getting into the next lane which was flowing freely. Basically if I don’t turn the function off when I first start the car it is not safe. The dealer took a look about a year ago and found nothing and said they had not heard of the issue. I pointed out I had read about the issue in Honda forums they could find them easily it however they had no interest, maybe because they focus on known issues? love the car apart from this issue.", "fail date": "  08/27/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "On multiple occasions when the auto idle engages the car stalls. The dashboard looks like the car is running by its not. In order for me to be able to drive it I have to put it in park, turn it all the way off, and then restart. This has happened at dangerous intersections where I’ve almost been in an accident. I read that it’s a known problem but Honda isn’t doing anything about it the last time it happened is noted below.", "fail date": "  08/20/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "After turning a corner vehicle turned off, in the middle of the road, stated put in park and press engine start button, had to press 2x for the car to start.", "fail date": "  08/18/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The auto engine idle feature malfunctions. When stopped in traffic and at intersections the auto engine idle feature turns off the engine; however fails to restart. I can put the car into park, but the brake remains engaged and the ignition button blinks white. I have attempted many different things to 'reset' the computer. Putting the car in park, waiting, unlocking seatbelt, open/shut door. The last time, I had to walk away from the vehicle with the key fob in traffic. Locking and unlocking the car seemed to reset the computer. This placed me in dangerous traffic. It has happened in a construction zone on interstate, at intersections several times, during rush hour when it was impossible to leave the vehicle due to high speed traffic, and once while towing. Each episode has generally taken about 15 minutes for computer to shut down/reset. There is no message on the dash before , during or after. I now disengage the auto engine idle button when driving due to fear of being stranded in dangerous traffic situations. If I forget to turn it off, it is likely to malfunction. I have contacted the dealership about this problem before. There was no code, so the problem was deemed a mystery and remains unresoved by Honda.", "fail date": "  08/18/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The engine fails to restart on its own from a complete stop at a traffic light or road intersection with the auto/start stop function. This happens intermittently, but has put my family in danger on several occasions. When the light turns green, the car turns off, and has to be put in park and restarted. I have come close to being rear-ended during these situations, as approaching vehicles have to stop suddenly because my car is disabled. I have taken a video of these incidents, but Honda is unable to recreate the issue and has not offered a solution.", "fail date": "  08/10/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "My 2016 Honda Pilot is displaying a \"keyless start system problem\". There is a service bulletin 20-117 that extends the warranty for affected vehicles so they can be repaired under the warranty for free. The service bulletin states that all trim levels are affected vehicles, however, my VIN #5fnyf6h31gb046547, does not come up as an affected vehicle. My vehicle needs to be included in and covered by the service bulletin 20-117, which will extend the warranty so I can have my vehicle repaired. Please address at your earliest convenience. Thank you.", "fail date": "  08/05/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The stop/start system isn’t working properly. When I stop at a light or stop sign the car will stop and the engine will stop like it is supposed to. But when I take my foot off the brake the car doesn’t start back up. The lights on the dash light up. The dash then tells me to put the car in park and press/hold the start button. It will then start. This has been going on for over a year now. I normally just try to remember to disable it by pressing the button but I shouldn’t have to.", "fail date": "  08/04/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "While stopped at a stop light the car totally shuts off when you go to start to move again causing you to have to put the car in park. Then start the car back up a begin to drive. This has happened 8 times now. There are no warning lights. The engine just seems to shut totally off in mind stream. What am I supposed to do with this issue that causes this to happen.", "fail date": "  08/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I driving home from a local costco and slowed to a stop at an intersection not far from my home. The car stalled and would not restart. After several attempts the car completely shut off and I was unable to even turn on any of the accessories. Ultimately I had to have the vehicle towed to a local shop because I was obstructing traffic and was at a dangerous intersection. I late continued to have similar issues after several battery replacements and jump starts. I had my vehicle serviced at a local dealer and they advised that it was the central power module that was bad. I was advised that this also controls the intermittent idle control function that is designed to save gas when the car is idle and not running. The car was was not under warranty so I had to pay for the new part and installation. The car is now experiencing similar issues. The car will randomly loose power and most recently will be completely non operational and jump starts are necessary to restart the car. A keyless start system error has now been appearing randomly. Their is a TSB out for this particular part but have been advised that code has to be present in order the the local dealership to initiate a repair. I am going to attempt to have the vehicle brought to a local dealer for inspection.", "fail date": "  08/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The auto stop on my 2016 Honda Pilot is causing the car to not restart and have to put in park, restart and then put back into drive. If it doesn't stall completely, everything with shut off (ac, radio) and then start back.", "fail date": "  07/30/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Vehicle frequently fails to restart after stopping after stopping while auto idle stop feature is on (default is \"on\"). In thes cases, one has to completely turn off the vehicle and restart. This is a safty hazard because the engine stalls when it's supposed to come back on to e. G. Cross the intersection. Honda dealership / service department were not able to fix it.", "fail date": "  07/28/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I’m having problem with the start/stop feature if my Honda Pilot 2016. For a couple of incidents already, when the car idle on a stop, it will not start back. It happened today 7/23/22 in fletcher Ave in fort lee, NJ. I had to jump start the car and it caused traffic for a while.", "fail date": "  07/23/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "My vehicle is equipped with with an automatic engine shutoff. The vehicle shuts off at traffic lights and then fails to turn back on. I have contacted Honda but only told that there is not currently a recall and it would cost 200$ for a diagnostic test to be ran and if they don’t find the problem I am still responsible for the 200$ charge.", "fail date": "  07/22/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I have a Honda Pilot 2016 with a keyless start system issue. I see a recall document service bulletin 20-117 dated December 9, 2020; however, when I type my VIN number for my vehicle, I do not see a recall. I have been having the keyless start system issue for the past 3 days.", "fail date": "  07/22/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "When coming to a complete stop, the vehicles' start/stop feature was engaged and the car's engine turned off. Instead of turning back on when the brake was released, the car did not turn back on. Hitting the ignition button also did not start the vehicle back up immediately. This happened to me two times in the past month. Both times, I was stopped at a red light and the car left me stranded in traffic. After a few attempts of hitting the ignition button, the car would start back up. The vehicles start/stop feature malfunctioned and it would be available for inspection upon request. This put my family's safety at risk because the car left us stranded in the middle of a busy intersection. The vehicle has not been inspected yet. There were no warning lamps prior to the problem.", "fail date": "  07/09/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "My car shuts off and goes into park at intersections or highway while stuck in traffic if the auto engine idle is not manually disabled. It can take up to 3 minutes to restart my car.", "fail date": "  07/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I was driving with the intention to turn left at a major intersection. I was the first car to pull into the left hand turning lane. I put my blinker on and pushed down on the brake waiting for the light to turn green so I could make the left hand turn but the car just shut down. At first I thought it was the auto engine on/off feature but I tried to lift my foot off the brake and the car did not restart. I tried to put the car in park and turn the car completely off (then on again) to see if that fixed the issue but the brake pedal was completely locked and I could not push it down. I ended up having to call the police and a tow company to tow my car out of the intersection. Both the police and the tow company tried to start the car with no luck. They could not even start it to put it in neutral and had to flat bed the car. There were not warning lights or messages on when this occurred. Although no one was hurt, it was an extremely busy intersection where this occurred and I was with my 4 year old daughter. While waiting for the police I had to cross multiple lanes of traffic carrying my daughter because it didn't want someone to rear end my car with her in it. It was also during the start of rush hour and caused a huge traffic back up. My car was subsequently towed to the Honda dealership where I purchased the car and they were able to start it the next morning multiple times with no issue. When they checked for error codes, nothing popped up. The battery was tested with good results. They requested other services be performed: brake system service, fuel system service, etc. But I was told these were unrelated to the break down. I ended spending close to $400 in towing fees and over $800 these additional services. I saw there was an official investigation into the Honda Pilot's start/stop feature and I believe this sounds very similar to what I went through.", "fail date": "  06/15/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The idle stop on the car is defective, if not turned off which had to be turned off everytime we start the car, the car will randomly idle stop at intersections and won't come back on, will have to forcefully turn off the car and turn it back on. Couple this happened on dangerous intersection and traffic lights. Honda has not resolution, they just say turn off idle stop everytime.", "fail date": "  06/15/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Ocassionally when stopped at intersections my 2016 Honda Pilot touring edition will go into idle stop mode and not restart. Upon trying to proceed the engine will try to start and stall out. The engine goes dead and I am unable to accelerate out of the intersection. The info dash system indicates the vehicle was in neutral and that I needed to shift to park to proceed. After putting the vehicle in park the info dash system instructs me to start the engine by pressing the brake and pushing the start button. This action is not possible when the vehicle has stalled out as described above and continues to prevent the driver from accelerating out of the intersection. The only solution I found that works is to remove my foot from the brake and power down the vehicle completely. Only when the vehicle is completely powered down is it possible to restart the vehicle by pressing the brake and pushing the power button. This event has happened 4 times in the past 3 months on my Pilot. The mileage on my Pilot is ~125,000 miles.", "fail date": "  06/04/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Auto stop/start feature will leave vehicle disabled and stranded at lights , and or in the middle of busy roads. Has happened to my wifes 2016 Honda Pilot 5 times now. Luckily 3 of those times were in parking lots , but twice on a busy highway with kids in the vehicle.", "fail date": "  06/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Car went into auto idle at stop light and then didn’t start back up. After about 5 minutes and multiple attempts and restarting it finally started. Very dangerous situation.", "fail date": "  05/20/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The engine fails to restart on its own from a complete stop at a traffic light or road intersection with the auto start/stop function engaged, it have happened many times. I have taken the vehicle to the dealer for assessment and they keep telling me that it is due to all the electronics going on at the same time.", "fail date": "  05/20/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Air conditioning compressor went on my 2016 Pilot. Upon researching, I see that Honda has issued technical service bulletin #19-091 for 2016 - 2018 civics for condensers that caused the ac to fail. I'm not sure if this is related, but I want to put the information out there anyways as Honda has already addressed an ac issue in similarly aged vehicles. My car has low mileage and is just 6 years old. Compressors should last well past that, and my service person at the authorized dealership said I may be the second he's seen come in that soon with the issue.", "fail date": "  05/08/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "2016 Pilot stalled at a stop sign after releasing break and pressing the gas. The engine had been off due to the auto stop/start function and did not restart upon release of break.", "fail date": "  03/27/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Our 2016 Honda Pilot recently had dash panel flickering, relays clicking and alarm going off after car was locked up. Reading more about this issue, it seems that a lot of people with the same year 2016 Honda Pilot were having the same issue. . Read more...\n", "fail date": "  02/09/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Stop-start fuel saving system don't work properly.", "fail date": "  01/30/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "My 2016 Honda Pilot has been experiencing a problem with the auto idle stop (ais) feature. Randomly when the ais engages the vehicle will shut off completely and switch to neutral. It displays a message to put in park and apply brake and press start. This does not always work and can take several attempts to restart the vehicle. This happens when in the middle of the road in traffic making it very hazardous. This has occurred more than 20 times over the past 4 years. I have had the battery replaced 3 times, yet the problem continues.", "fail date": "  01/10/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "1) engine failure - several times our 2016 touring has stalled at a stoplight. It takes time to start back up. I have to turn on hazard light, and it is getting worse every occurrence. This has happened since I bought new, and when it happens, all of the lights come up on the dash. There is a investigation in the state of California, but nothing in ohio yet. 2) I just had to replace my drive shaft that goes from from to back on center bottom of the car. They said the rear is failing, and that may be part of the problem with sluggish acceleration. 3) transmission: sluggish acceleration is this zf 9 speed (outsourced) by Honda issue. I will be accelerating on the freeway, and all of the sudden, it would down shift to like second gear, causing me to slow down suddenly. Dangerous if cars are behind in rush hour. I also had 4 incidents where I could have lost my life because I could not accelerate (the gear would not engage). Dealer informed me that all of the updates are uploaded, and it should be okay. But it's not okay when you are carrying your children, spouse, or CO-workers. I have informed the dealer many times that this car is not safe. I personally ran a business as tier 1 supplier to Honda and visited many Honda factories. Nothing ever got done. It will be too late before they can help us. All of the data and information is at Honda marysville (ohio) dealership. All of my services (including oil change) are done there.", "fail date": "  12/08/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Vehicle rpms will vary and not be steady on light to medium acceleration between 20 to 60 mph. Rpm guage needle will bounce up and down slightly while accelerating. Torque converter seems to not be locking up resulting in judder. No engine lights or warnings. Dealer was able to confirm the same thing and isssues went away when replaced and flushed transmission fluid. But the problem slowly returned 20k miles later. .", "fail date": "  08/24/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "My 2016 Honda Pilot touring stalls out at a red light while using the auto stop-start. It happens occasionally when I take my foot off the brake and put my foot on the gas. Instead of coming out of idle with the engine starting up again, the car would stall completely and I would have to put the car in park, press the brake pedal and push the start button to get it on again. I took the car into the dealer and they told me that there was no software update and that they couldn’t do a update anyways because check engine light wasn’t on. Also have a issue with transmission not switching gears smoothly on take off. Jerks on take of. Once again they told me transmission was fine and there was no software update and that they couldn’t do a update anyways because check engine light wasn’t on.", "fail date": "  08/23/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The engine begins to idle rough, after a few days of driving a lot of cluster lights come on starting with check engine light, vsa as well as others. Disconnecting battery works to clear the the codes, engine will appear to idle ok but after a week of driving it will start idling rough again, then the cluster lights will light up as before. I believe this is due to service bulletin 20-100 or service bulletin a20-100 which states that issues with the fuel injectors were found relating to quality control. The TSB listed above states that if your vehicle is affected by these symptoms your warranty will be extended to 10 years of manufacture date or 150,000 miles. Our Pilot currently has under 80,000 miles on the odometer.", "fail date": "  07/18/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The auto start/stop feature of the vehicule has stopped working on several occassions. We would be coming off the highway and or off a red light and the car will stall of the auto start/stop function is on. This has happened a few times in a very busy intersection or street.", "fail date": "  07/12/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Transmission has hard shifts and jerking when accelerating at a normal rate and approaching your designated speed. This occurs almost daily as the problem persist and started occurring approximately 36,000 miles. I also had an issue when I was trying to accelerate up a mountain where the transmission did not want to switch to a lower gear and accelerate. Instead the gear was stuck and I had to remove my foot from the gas pedal and try again. I have taken the vehicle too two different dealerships and they could not replicate the problem. One dealership checked the transmission cooler and stated it was in good condition. I believe they cannot replicate it because every time a technician takes the vehicle on a test drive they accelerate at a high rpm level which the vehicle will not replicate the issue. Now it is doing it through more than one gear change. Feels like the transmission is going to break at any point.", "fail date": "  06/20/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Multiple times the idle-stop feature has caused my car to stall out at an intersection. The idle-stop will engage, but when I take my foot off the break (or move the steering wheel), the car does not start again, instead it will try to start but then turns off completely. At that point I have to re-engage the break, put the car in park, turn off the car and then try to turn it back on as normal. When this happens at a green light it's very stressful and dangerous as cars are behind me. This has happened probably 10 times in my ownership period, it is always worse when it's hot outside since so many parts are running (including the ac). I have brought the car in to fix this a bunch of times, they never find anything wrong at the dealer. The last time they replaced the starter button at no charge saying that this piece was known to be faulty. It has happened once or twice since replacing that part.", "fail date": "  06/06/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Ocassionally when stopped at intersections my 2016 Honda Pilot touring edition will go into idle stop mode and not restart. Upon trying to proceed the engine will try to start and stall out. The engine goes dead and I am unable to accelerate out of the intersection. The info dash system indicates the vehicle was in neutral and that I needed to shift to park to proceed. After putting the vehicle in park the info dash system instructs me to start the engine by pressing the brake and pushing the start button. This action is not possible when the vehicle has stalled out as described above and continues to prevent the driver from accelerating out of the intersection. The only solution I found that works is to remove my foot from the brake and power down the vehicle completely. Only when the vehicle is completely powered down is it possible to restart the vehicle by pressing the brake and pushing the power button. This event has happened 4 times in the past 3 months on my Pilot. The mileage on my Pilot is ~125,000 miles.", "fail date": "  06/04/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Around 60,000 the transmission started to shift erradically. The key indicator is the tachometer is not steady. My mechanic suggested to change the transmission oil which I did. It resolved the problem, except now at 68,300 thr problem has returned.", "fail date": "  03/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Multiple times the vehicle wouldn’t start. The start stop switch is the culprit after 7 months of dealing with it and taking it to dealership finally. Car will cut off at stop light but won’t turn back on. Takes like 4 tries to get it back on. Also at 126k or 128k engine had a knocking sound and needed replaced and it cost $7000 the air conditioning doesn’t work and this is very upsetting this isn’t why I buy Hondas. The start stop event happens everyday and every time I start the car and don’t deactivate the start/stop system.", "fail date": "  01/13/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "There is no way for the driver of the car to put the transmission into neutral if needed with an electrical/battery failure. According to Honda, there is a special mechanical device that tow truck drivers would have that physically attaches to the engine to shift the car into neutral. In addition, the Honda mechanic that I talked to today said even if the average driver had one of these devices, they would not recommend they use it due to likelihood of causing damage to the engine or transmission. This is fine if the car is already in park, since it would most likely be located in a parking lot, residence, etc. The two times that would be a safety issue and could very easily cause an accident would be if the car was in drive, stopped at a traffic light with the engine off due to the auto start/stop feature, and suffered a battery failure, preventing the engine from starting. Now the car would not be able to start, but more importantly couldn't even be pushed off to the side of the road and clear the intersection, since there is no way to move it into neutral. Another example could be with an alternator failure while driving, where the battery then surges and drains itself, with the engine and car now shut down. If you are unable to move the car to the side of the road as this is happening, maybe stuck in traffic or stopped at a traffic light, the car is now unmovable until a tow truck driver arrives and installs this mechanical neutral unlock device. There should be a way with an electrical problem to be able to place the car into neutral and move it. Otherwise, this turns a routine auto problem (that has had an acceptable solution) into a true safety issue, both for occupants and other vehicles and their operators.", "fail date": "  12/29/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Throughout last trip I noticed the transmission would make jerking shifts. While on the interstate during a pass travelling at 73 mph the transmission down shifted and made a loud banging sound, engine lost power but was revving high, I could not accelerate to get away from surrounding traffic. A transmission error come up as I maneuvered the vehicle out of the road to avoid being hit by other vehicles. The awd error came one and later an emissions error. Once the car was out of the road safely I was able to engage the e-brake then put it into neutral then park. Awd and emissions error remained on. After a minute turn car off then on, emissions error remained on and the car could operate. This scared the family as we could have been rare ended in traffic. Honda dealership in my town could not diagnose the issue. This is the second time this has happened.", "fail date": "  12/27/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Two incidents occurred: 1) on 12-6-21, while travelling in the high speed lane, my wife's car shut down causing her to become stranded on the side of the highway. The first system report from the incident can be found attached as indicated permanent transmission codes of p0716 and p0700. Our body shop consulted with a Honda dealership, neither could pinpoint the issue, but they were able to get the car running. 2) on 1-21-21, at a stop light, the car shut down and ran through all the error codes on the dash . My wife was able to turn car on, but could only put it into neutral. The second system report indicated permanent transmission codes of p0730, p07a6, p190b, p286d and temporary transmission codes of p0730, p07a2, p07a6. My wife discovered a thread of comments about others who experienced the issue and they said a new battery fixed the issue. A new battery was put in the car but it only drove in reverse. Our body shop consulted with the same Honda dealership discovered Honda service bulletin 19-004, which mentioned a transmission software issue, much like my wife experienced the first time, not the second time. Our body shop indicated the only fix would be a new transmission, which was confirmed by a Honda dealership.", "fail date": "  12/06/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "For the last couple of months, the transmission has had gears slipping out of gear and takes a few seconds to find the gear to accelerate up to speed. I've taken it to the dealer twice to address the issue but it's still causing an issue.", "fail date": "  12/01/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The car on prior occasions would not start and it would show emission alert as well as other alerts, have the car for servicing and they started checking and replacing everything. Same problem happened 2 weeks ago but resolved on its own. Today while driving, all the emergency lights came on including emissions malfunction, as well as other malfunction and then accelerator was not working, d was flashing and started making clicking sounds in transmission. Luckily we were close to a fire station house and stopped there, where the car was not going into park, was not changing any gears to reverse or neutral and when turned on, all emergency lights were flashing and could not even get it into neutral to push it away as it seemed to be transmission wheel jammed. Also a burning smell came from the engine when we attempted to restart and put in gear and the transmission clutch made horrible sounds and the car was revving up on its own. If we were on a major highway this situation could have been a disaster with the family in the car , as the car was stalling on the road and could have resulted in a crash, loss of life or injury to others. The novel is an elite 2016 Pilot and has given my wife recurrent similar issues but we’re lucky it happened in a parking lot. The dealership always states the problem is assessed and fixed but at year 5 and only 75000 miles this is a disappointing situation. We bring this to the notice of NHTSA as this could be a life threatening issues for family owner drivers.", "fail date": "  11/27/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Auto engine idle shut/off malfunctioning. At red light. . . When turned green, took foot off brake to accelerate. . . Car completely shut off. Dashboard lights came on and instructed to shift vehicle to park and restart. Vehicle in rear view coming up fast and thought I was going to be rear-ended and quickly found hazard lights and luckily driver was paying attention and shifted to other lane. Never happened when brand new now happening few times a week. Of course am making an appt with Honda but if they can't replicate the problem in the shop they can't/won't fix. This is a safety issue and people are going to get rear ended! Honda needs to rectify this situation as I have seen many threads with others stating the same problem.", "fail date": "  10/01/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "My vehicle shut down while driving with error messages on screen: emissions transmission, vehicle stability assist, hill start assist, trailer stability, assist, power steering, road departure,collision mitigation, blind spot, transmission, battery light, oil light. Coasted into safe place and had towed. Could not turn car back on other than seeing the above warnings.", "fail date": "  05/21/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The contact owns a 2016 Honda Pilot. The contact stated while driving approximately 35 mph, the transmission failed to shift up to a higher gear. The contact mentioned that the rpms was shifting faster than the speed. The local dealer was contacted. The vehicle was not repaired. The manufacturer was not notified of the failure. The approximate failure mileage was 50,000.", "fail date": "  04/01/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "While changing lanes (car in motion 65 mph) in the city, warning lights in the instrument claster started to appear. Engine lost power ( could not accelerate) had to change lanes in traffic almost got hit by semi trucks. Managed to drift to side of the road, car went into neutral and could not get into park. Used parking break to keep car from rolling. The instrument cluster finally made up its mind and settled on emissions error. Before that in was showing all sorts of errors. Turned off the car waited a few minutes and was able to drive home. Very scary with kids in car. ## #vpic# 1 - check digit (9th position) does not calculate properly #vpic#.", "fail date": "  03/21/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The contact owns a 2016 Honda Pilot. The contact stated while driving 20-30 mph, the vehicle would shudder. The dealer was made aware of the failure and scheduled an upcoming appointment for diagnostic testing. The manufacturer was not made aware of the failure. The failure mileage was approximately 80,000. The VIN was unavailable.", "fail date": "  03/01/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Unpredictably when my auto idle is engaged my vehicle will stall, resulting in me being unable to move my vehicle without forcing a prompted restart. This occurs at very random times to include when I am stopped at a stop light, waiting in a drive-thru line, in traffic, or any additional times when the auto idle engages. This is very dangerous because it results in my vehicle being an unexpected stalled obstacle for all participants on the road. The vehicle has been inspected and the engine start/stop button has been replaced twice. Unknown if there were any warning laps messages or other symptoms.", "fail date": "  12/05/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "All of my warning lights turned on back in oct 2020. . We did some driving the day before,. But nothing crazy. . . Every light went off . . So took it to dealership and they said it was fuel injectors. . So they replaced it all . . And said it should fix the problem. . . Then I drove it to southern CA during thanksgiving and then all of sudden coming down from (grapevine) the car stalled, I press the gas and nothing . . I was able to coast it to side of the road. . Attached is a pic of what was coming up. . Then I put car in park and and the rpm started to go up 4-5 rpm without me pressing gas, so I would turn off car. . 10 min later I started the car and was able to drive it off the freeway. . But couldnt drive more than 50 mph. . So the transmission would change. . So after getting towed and took few days. . Took to Honda dealership in ventura CA. . Worst service ever. . Pretty much didnt want to look at vehichle. . So then took to another dealership more helpful. . All the error light was gone. . They told me only error was some oil pressure down. . And suggested that oil filter wasnt n authentic oil filter and thats what could have caused problem. . Yes idont typically send to dealership but I do go to a authentic oil change company. . . So pretty much this error has caused twice in 3 months. . Vehicle only at 61k when the 2nd one happen. . And not real solution. . I had my 2 kids and my wife when this all happen. . Not safe at all. . Please find a solution. . My local dealership offered to take my vehcile and drive it home with a technician to see if anything come up. . But now im seeing a lot of people having the same problem. . Either transmission. . Oil change. . Reason I took Honda is due to the safety and relaiability. . But now im havign doubts. . Please help!!. . Luckily all under extended warrenty. . But for how long?.", "fail date": "  11/24/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "We have a 2016 Honda Pilot touring. Since early 2018 we have been having issues with the idle stop system. The problem is when we are driving and we come to stop in traffic at a light, the idle stop system engages and shuts the engine down, like it is suppose to do. Once the light turns green for traffic to move, I release the brake and the idle stop system tries to engage and turn the engine on again, but fails and shuts the whole vehicle down, inoperable. The lights flash and I cannot turn the car on again for at least 1 to 2 minutes. Vehicles are honking and traffic is blaring across us, but I cannot turn the vehicle back on. After 2 minutes, I can restart the vehicle by pushing the button and brake and then the vehicle moves. This is a safety issue, since you never know when it wil lol happen, but it has always happened while in heavy trafffic or a busy intersection. In 2019, I took vehicle in for service, they said it was a bad battery. I replaced the battery in March 2019. The same identical problem still continued to occur multiple times. November 10 took the same dealer, howdy Honda, austin,TX. They again told me the battery was reading bad, but I had the battery tested at another shop and at the place of purchase, and the battery was more then fine and tested great in and out of the vehicle. The dealer of course said they could not recreate the issue and did not see anything when they tested the system. They just pawned it off on the battery, even though the battery is less than 2 years old and testing just fine. There is no way to permanently disable the system and if I forget to push the idle stop disengage button every time I start the vehicle, I could end up on the road in the middle of traffic and some driver decides not to pay attention and run into me and my disabled vehicle. This is unacceptable and such a hazard and Honda does not seem to care.", "fail date": "  11/05/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The contact owns a 2016 Honda Pilot. The contact stated while driving 10 mph, the vehicle started to jerk forward. There was no warning light illuminated. The contact stated he continued to drive to his destination. The contact called local dealer norm reeves Honda superstore cerritos located at 18500 studebaker rd, cerritos, CA 90703, (562) 345-9100 and made the dealer aware of the failure. The vehicle was not diagnosed nor repaired. The manufacturer had not been informed of failure. The failure mileage was approximately 73,000.", "fail date": "  10/01/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The contact owns a 2016 Honda Pilot. The contact stated that the while operating the vehicle, the check engine warning light remained illuminated, and the vehicle would not properly accelerate while depressing the accelerator pedal. The vehicle was taken to the local dealer who replaced the engine heater coil, the fuel injectors, and the camshaft however, the failure recurred. The fuel injectors were replaced a second time however, the vehicle continued to experience the hesitation while attempting to accelerate. The vehicle was taken back to the dealer who diagnosed that the torque converter needed to be replaced. The vehicle was not yet repaired. The manufacturer was not yet contacted. The failure mileage was 40,000.", "fail date": "  09/20/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "My car will die after being stopped (ex. At a red light, stop sign) and will not restart right away. Sometimes it doesn't die completely. When it does you are unable to put the car into park or engage the emergency lights. This has happened where we were stopped at a red-light and the car died and would not restart. A car behind us was approaching the light and saw that it was green, quickly came up behind us honking their horn and lucky was able to move to the other lane to avoid hitting us. This seams to happen when we forget to turn off the auto idle stop. This is something you have to push everyone you start the car. I took the car to the dealer they put in a new transmission and changed the timing belt. Previously I had the cars fuel injectors replaced. After all this work the car is still dying and it is happening more frequently. The dealership says they have heard of this problem but don't know of a fix yet.", "fail date": "  09/05/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "I was driving the car and suddenly ever single warning light went on, I heard a loud noise and the vehicle stopped running and would not start back up. I was told I had a timing belt failure and that my engine threw pistons and was destroyed. This vehicle had 78k and had every oil change required.", "fail date": "  08/22/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "My timing belt failed at under 80k mile and at less than 4 years old. I was driving and could have been seriously injured as my car died in the middle of the road. The belt then destroyed my entire engine.", "fail date": "  08/22/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Check engine light (cel) appears, randomly when parked or in motion, indicating a problem with emissions system. Cel began to appear at approximately 77,000 miles. Car now has over 85,000 miles. I purchased the vehicle used, when it had 68,000 miles. I have never driven outside of the u. S. . Cel appears at various speeds between 0 and 60 mph. When in motion and cel is displayed, engine hesitation occurs causing me to increase vehicle speed and engine rpm to ensure I have sufficient power complete a turn, pass another vehicle, or make it up a hill. I am never sure I will have enough power. Additionally, the mileage economy display changes from shades of green to solid white. Cel remains visible on dashboard until it randomly disappears. Cel will remain lit ranging from 30 minutes to several days and disappear at various speeds. When it disappears, engine hesitation stops and economy display returns to shades of green depending on whether accelerating or decelerating. I first believed it to be a problem with the fuel tank cap. However, the cap is a hinged flap that returns to the closed position after I have finished refueling. I predominantly use e87 octane with ethanol. But e89 fuel makes no difference because the cel and hesitation randomly still occur. I have not taken to a repair shop because I have not had the opportunity to when the cel is displayed. The repair shop stated they can only diagnose when the cel is displayed. . Read more...\n", "fail date": "  08/17/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "On August 9, 2020, I was driving, at 75, with the cruise control on, I needed extra speed to pass a vehicle on the right side, I pressed the gas pedal with the cruise control still engaged and the vehicle went into a power down mode with the dashboard flashing codes and then went blank. The engine downshifted and the engine speed increased to 7,000 rpm. The car completely shut down, at 75 mph, and restarted with the dashboard lighting up again. After panicking, tried to give the car gas and it would not go. Now at 65 mph, I pulled over to the right lane and coasted down to 40 mph and the car started having power again. We pulled over and shut off the car. I restarted the car and an \"emissions system problem\" was displayed on the dashboard. The car has 56,217 miles on it. I have a video of this problem. The dashboard warning system displayed the following codes, \"emissions system problem\"; \"all wheel drive system problem\"; \"transmission system problem\" and the \"d\" drive symbol was flashing on & off. An earlier incident, may 6, 2020, happened to my wife while driving the car in local traffic. Driving at 50 mph, the engine speed increased and the car would not move forward. She also tried to give more gas and the car would not move. She stopped on the side of the highway and shut off the car. She restarted the car and pulled off the highway. She called the Honda dealership and immediately took the car into the service center. They took the car and drove it around the building and said they checked the computer for codes, but none where present. At this time the car only had 55,000 to 56,000 miles. They told her next time this happens to take a video so they can see what happens to the car. Take a video while driving a car that is shutting down is their suggestion. . . .", "fail date": "  08/09/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "When stopped at a stop light or stop sign the transmission changes from drive to neutral to park and sometimes dies. Car won't restart when following directions on display screen or any other way except sitting and trying to start it over and over after turning on flashers and waving traffic around us.", "fail date": "  08/02/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Tl the contact owns a 2016 Honda Pilot. The contact stated that while driving at 35-57 mph, the vehicle hesitated and jerked without warning. The vehicle was taken to an independent mechanic to be diagnosed. The mechanic was unable to duplicate the failure or provide a cause for the failure. Neither the dealer nor the manufacturer were notified of the failure. The approximate failure mileage was 122,000.", "fail date": "  07/01/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "I was driving on a dual two lane highway at 55 mph. At a cross road a traffic light was red, and I stopped the vehicle. The automatic idle stop shut off the engine for 1/2 to 1 minute, before the traffic light turned green. When I took my foot off the break, the car should have started, but it didn't. . Many of the dashboard lights came on, the car shifted into neutral. The cars around me moved forward and several honked, because I wasn't moving. Other cars were approach me from behind at speed. I tried to turn the ignition off and restart it. Nothing happened because the shift was in neutral. I exited the car and pushed it to the right turn lane just ahead and pushed the brake to stop once I was out of the driving lane. I put the car in park with my foot on the brake and tried to start the engine 2 or 3 times before the starter turned the engine over. Several cars went by at speed, and luckily no one wanted to turn right. The car is just over 5 years old and I am very familiar with its operation with the automatic idle stop feature, but this time it surprised me. I had replaced the battery after 2. 5 years of driving, and it is only 1 year and 10 months since it was replaced. I have read anecdotal accounts of similar incidences by other 2016 Pilot owners who had no reason for the incident. The car did not have any further problems that day, because I cancelled the idle stop feature for the trip home. I feel I could easily have become a statistic along with my wife had the traffic been moderately greater that evening. Other have registered complaints about this problem on this website. I am having the battery replace tomorrow, even though the dealer hasn't yet evaluated its condition.", "fail date": "  06/27/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "�driving at 35 mph on my way home on a side street and my car jolted and stalled and several (5)warning lights came on. Vehicle stability, brake, trammision warning, and a couple other lights. I turned the vehicle off and restarted the car. I tried to drive it in a parking lot so I was able to get safely out of oncoming traffic . And it would not shift properly and I couldn+t drive it at all as I would try to start and it wojld rev to 4000-5000 rpms and would pop in and out from gear to park. . I had it towed from the parking lot I was in to my machanic . My concern is that I don+t feel safe driving on the highway with shifting issues, stalls and jolts that have happened if I were on the highway when that happened, going at 65 mph, it would have caused unnecessary accidents. It+s extremelyndangerous with my children in the car as well as innocent bystanders still no recall for my vehicle.", "fail date": "  06/27/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Issue: car is unable to start when on a city street and auto-start is enabled (stalling). This has happened on several occasions over the last couple years. My wife is the primary driver she often has the kids in the car which creates a large safety issue for my family. When the problem first presented itself, there was one time where the car unintentionally accelerated on it's own with my family in the car. Unfortunately that was not able to be replicated as well nor have we experienced it again. Potential solution 1: battery has been replaced which temporarily stopped the issue, however within months the issue is back. Potential solution 2: it's worth noting that the transmission was replaced recently, however it was not due to this the stalling issue, there was an actual issue with the transmission. The stalling stopped for a while as well, then came back again. Concerns: we are concerned with our safety in this vehicle which doesn't give ownership of this car a good feeling. While we can chose to sell this car and pass this issue to someone else who in turn could get hurt or killed if they are in the wrong place at the wrong time and that should not be the case. We shouldn't wait for people to get hurt/killed by this to do something about it. We're hoping with the continued reports of this issue there will be something done by Honda to resolve this. We're no longer proud of our ownership of this car due to the safety hazard this has presented to our family. Time of incident mileage provided was from 7/2018 - it occurred prior to that and after.", "fail date": "  05/18/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Emission system problem light - is very common 2016-2018 Honda Pilot. Why is there no recall/permanent fix for this? this is a Honda defect in manufacturing/workmanship. Honda should resolve!.", "fail date": "  10/24/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "On multiple occasions, but the latest being 10/19/2022, my car will not restart after the auto idle start/stop feature malfunctioned while at a stoplight this afternoon. The battery is not old, and we recently had it checked because it has been doing this a lot lately. It checked out fine when tested. Something is majorly wrong with the electrical parts when this happens. Lights flash, my hazards didn’t even work today, which was very scary and not safe. The only door that would open was my driver side door. This is a huge safety concern and I am now looking for a new car. This has happened at least 20-30 times, but today was the worst. It took awhile to get it jumped off. In the middle of traffic, with my hazard lights not working. Honda really needs to fix this. We took it to the dealership once about this issue and they said nothing was wrong. Please investigate this issue before it causes injury.", "fail date": "  10/19/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "There is an emissions warning system that pops. Upon diagnosis, it is determined that the fuel injectors need replacement (all 6 of them) because the parts were manufactured with contaminants in them. There was no recall and due to the nature of the incident, it is not covered by an warranties once you pass a certain mileage (80,000, I believe). Unfortunately, this issue/alarm did not pop until after I had passed that mileage point and because it falls under an emissions system problem, not a drivetrain, I have to pay out of pocket. If this problem stems from a manufacturing issue, it should be a safety recall.", "fail date": "  09/14/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "With increasing frequency of occurrence, the car will not start after the auto stop/start mechanism has been invoked. For example, when stopped at a red light, the engine will turn off as the car is not moving. However, once the light turns to green and the brake is depressed, the car will not start and/or will start and then the engine will cut-out. To start the engine, the car needs to be fully turned off, gear put into park and then restarted. There appears to be something at fault with the automatic stop-start mechanism and/software. My car is a 2016 Honda Pilot touring with less than 28k miles.", "fail date": "  08/20/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "The engine begins to idle rough, after a few days of driving a lot of cluster lights come on starting with check engine light, vsa as well as others. Disconnecting battery works to clear the the codes, engine will appear to idle ok but after a week of driving it will start idling rough again, then the cluster lights will light up as before. I believe this is due to service bulletin 20-100 or service bulletin a20-100 which states that issues with the fuel injectors were found relating to quality control. The TSB listed above states that if your vehicle is affected by these symptoms your warranty will be extended to 10 years of manufacture date or 150,000 miles. Our Pilot currently has under 80,000 miles on the odometer.", "fail date": "  07/18/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "While stopped at a red light, with the auto start enabled, the car would not turn back on and placed the car in “neutral”. The dash info message prompted me to put the car in “park”. I did. It then instructed me to depress the brake and hit the “start” button to turn the car on. It did not after I tried a few times. Finally to get it started I pushed the “start” button with the key fob. It then turned on and allowed me to put it in “drive”.", "fail date": "  07/14/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "The auto start/stop feature of the vehicule has stopped working on several occassions. We would be coming off the highway and or off a red light and the car will stall of the auto start/stop function is on. This has happened a few times in a very busy intersection or street.", "fail date": "  07/12/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "When idling at a stop light, the auto shut off feature engaged and turned off the engine. When I engaged the gas to start moving again, the engine would not restart. I applied to brake, put the car into park and then tried to manually restart the car using the start button on the dash. The car engine would not start. The auxiliary power to the accessories would not go off when I pushed the stop/start button on the dash, but the engine would not restart either. I attempted to restart the car several times. It did not attempt to turn the engine over, but did literally nothing. I paused and waited for a minute and then attempted to restart the car again with the stop/start button and the car engine finally turned on. The exact same sequence of events has happened and two separate occasions some weeks apart. This incident put my and my passengers’ safety at risk by stranding me at very busy intersections with no way to move the vehicle out of the road. The auto-shutoff feature has engaged while in stop and go traffic on the freeway and if this had happened then, the results could be catastrophic. I now always manually turn off this feature due to fear of this happening again and would disengage it entirely if possible, but was informed by the dealer that was not possible. No one has inspected the vehicle as the problem is not reproducible on demand, but I am willing for any necessary inspections to occur.", "fail date": "  06/20/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Every single time I get in my car to drive. I experience julting when I am speeding up but it mostly happens in between 30mph and 50mph. Sometimes in between 70mph and 80mph as well. It has been going on for a year and a half and no one can figure out what it is. There needs to be a recall because it is dangerous for myself and other drivers. To the point where I am going to sell this car and get a different make.", "fail date": "  05/28/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "While at a stop light, with the engine \"auto start/stop\" switch engaged, I released my foot from the brake, and the car died. I was totally confused as to what occurred. After a minute or two I was able to restart the car. I was very concerned about being re-ended as when the light changed to green is when the car died. I had no advance warning of a problem, and it just died unexpectedly as I released my foot from the break. No lights on the dash either. I notified my dealer, who had never heard of this happening, and said when I can, please bring it in. In as much as the incident occurred in may 2022, and hadn't happened since, I did not take my car into the dealer. I can take my car in at any time to be examined.", "fail date": "  05/16/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "The problem has happened at-least 5 times won’t restart on its own from a complete stop at a traffic light or intersection with the stop-start feature in use. Brought to Honda dealership and they stated the do not see a problem. This is a safety problem that needs to be addressed. It stopped completely when I was in traffic also almost caused an accident.", "fail date": "  05/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Unknown. Background: driving vehicle and engine warning came on. Looked up code and it was due to injector failure. Dealership changed injectors and reprogrammed. Now vehicle gets nowhere the gas mileage and the start/stop has stopped. That doesn't bother me as bad due to it shut off at light one day and would not start back for about a min. Then started and went it's way.", "fail date": "  04/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Driving the vehicle started to quickly lose power for about 15 seconds and it stalled while at speed on an interstate. Luckily I was in the right lane and was able to pull out of traffic onto the shoulder. The car had all the lights flash on the dashboard. The check engine, the hill assist, the oil, power steering, etc. . . I mean all the lights. I turned the car off through its power button and waiting about a meeting and attempted to restart the vehicle. It would not restart. I repeated this action. After two more failed attempts I went and opened the hood to check to see if there was a visible problems or potential a lose sensor connection. The engine looked ok. The main sensors were connected. I again tried to restart the car. The car started and drove about half a mile before losing power again. I repeated all of the above. Again. After about 45 mins the vehicle started even though nothing had actually changed. I didn't do anything. I took the car with the check engine light still on to autozone where they plugged the computer in to tell me my fuel pump wasn't working. Code p0087 registered. The next day the computer cleared itself and has been running. My mechanic said Honda had released a TSB pertaining to the fuel pump with new lines. Unfortunately there is a nation wide shortage of those parts so my car cannot be fixed. I feel unsafe. I dont know if the car will work or not. Its terrifying.", "fail date": "  03/31/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "I received a letter in the mail from Honda north America in early 2022 stating that my vehicle/VIN was covered under an extended warranty on emissions systems problems. Honda TSB 20-100. I took my car in to the local dealer, dealer performed a software update, 2 days after software update, all warning lights turn on in dash and do not go away. Check engine light, power steering problem , hill start assist, vehicle stability control, trailer assist, traction control. Took vehicle back to the dealership. The service advisor takes the car back and when I return a few hours later he states that his technician informed him the injectors must also be replaced when the software update is done. Then I am informed that due to previous salvage history (from 2017) the vehicle emissions warranty extension will not be covered by Honda and I will be required to pay roughly $1,500 for this repair. The TSB states that all 2016 Honda Pilots are covered. The faulty injectors were an issue from the factory on every single last 2016 Pilot that was produced. The dealership caused these lights to come on and now wants me to pay to fix the additional issues they caused.", "fail date": "  03/16/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Fuel lid keep looked or can't be closed.", "fail date": "  02/24/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Throughout last trip I noticed the transmission would make jerking shifts. While on the interstate during a pass travelling at 73 mph the transmission down shifted and made a loud banging sound, engine lost power but was revving high, I could not accelerate to get away from surrounding traffic. A transmission error come up as I maneuvered the vehicle out of the road to avoid being hit by other vehicles. The awd error came one and later an emissions error. Once the car was out of the road safely I was able to engage the e-brake then put it into neutral then park. Awd and emissions error remained on. After a minute turn car off then on, emissions error remained on and the car could operate. This scared the family as we could have been rare ended in traffic. Honda dealership in my town could not diagnose the issue. This is the second time this has happened.", "fail date": "  12/27/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Since buying my 2016 Honda Pilot elite in June of 2021 I have had innumerable instances of my vehicle's auto stop start feature failing to start after being engaged. I believe the first instance was in sept 2021 (after the lemon law time frame passed for my state). When my vehicle is stopped, I try to hit the gas and the vehicle does not go. At this same time an error happens on the screen that says \"shift car to p\". The first few times this has happened I tried to shift to p and that did not help. I figured out that it is best (I. E. Quickest, I am not sure it is the best for the vehicle) to just turn the car off. Wait a few seconds, and then turn the car back on and put it back into drive and go. Keep in mind that I have cars peeling by me, screaming at me, honking, yelling, etc. All with my 6/7yo daughter in the vehicle. I am often stuck in an intersection going left. Additionally, sometimes but not always, the radio and heat/ac turn off when this happens. This has occurred far more times than I can count but a few examples in bumper to bumper city traffic, when waiting to make a left hand turn in intersections, while taking turns at a stop sign both flat and uphill (which is terrifying), just while being stopped at red lights and having the light turn green, when taking turns to enter a rotary, when trying to go at a yield sign, etc. There is no warning light or lamp. The warning lights/sounds occur while/after its already happened. Sometimes the radio turns off and the heat/ac. I have had the vehicle repeatedly serviced by the dealer I purchased it from. They said they cannot replicate the issue. They have asked me to take video of it which is infuriating and unsafe as I am in the vehicle with a child in traffic, sometimes in the middle of an intersection, trying not to get t-boned. We have changed the battery. The dealer has cleaned carbon build up out of something. They continually say it is not an issue and cannot be replicated.", "fail date": "  09/20/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "In the past 4 months, each time my Honda Pilot is stopped at a light or in slow traffic, the idle stop will engage and shut off the engine. In order for the engine to turn back on, we have to put our foot on the brake, place car in park, and push the start button to get it to start again. Each time we have taken it to the dealer or a car repair shop, they test the battery and it is fine. While we have not had an accident yet, we have come close due to cars behind us not knowing our vehicle is having an issue. The most recent time occurred in a toll booth line leaving nyc with a line of traffic behind us. Another issue we have experienced is with our fuel injector. Our Pilot was manufactured when there were known failures with fuel injectors. The fuel injector malfunctioned while driving with our three kids down a hill. The car lost power and we had to coast down a hill. Thankfully, an exit was nearby and we were able to come to a stop. Vehicle was serviced at a local dealer. Although there were know issues with fuel injectors, we still had to pay for the replacement and the vehicle's manufacturers warranty was still valid.", "fail date": "  08/05/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Recurring problem with idle stop feature causing car engine to shut off completely (even when disabled), resulting in an error message and requiring the car to be turned off and on. This is a safety issue while driving, especially if in an intersection while turning. . Read more...\n", "fail date": "  05/06/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Twice in the last week my Honda Pilot has shut off when auto-idling at a stop light. The car should remain in drive but when I looked down it had shifted to neutral. The first message on the dash briefly flashed �crash mitigation problem� and then instructed me to put the car in park and push the engine start button. After this incident, I turned off the crash mitigation system. A couple days later (today), the same thing happened. No crash mitigation system flash but instructions to put the car in park and press then engine start button. Both times the engine was on and in drive. Auto idling was enabled. I have only owned this car for two months.", "fail date": "  03/10/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "The fuel tank leaks when it become near full which could put me and others at risk of fire. The vehicle hasn't been inspected and I notice this safety defect when I refill the gas tank.", "fail date": "  03/09/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "When pressing the gas pedal, the vehicle has a hesitationin to it. My foot remains on the gas pedal and still has the hesitation or jerking motion, which can be felt in the front passenger seat. We had the oil changed the week before we left to go out of state. It has continued on since then.", "fail date": "  10/23/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "During driving the vehicle, emissions system failure warning came on the display on sept 1. Vehicle was driving ok, called dealer could get appointment for 9/11/2020. During driving my kid to practice, the sign came on again, and the vehicle started to sputter violently. Was forced to pull over in the middle of an active traffic and had the car towed to dealer for diagnostic.", "fail date": "  09/07/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "My car will die after being stopped (ex. At a red light, stop sign) and will not restart right away. Sometimes it doesn't die completely. When it does you are unable to put the car into park or engage the emergency lights. This has happened where we were stopped at a red-light and the car died and would not restart. A car behind us was approaching the light and saw that it was green, quickly came up behind us honking their horn and lucky was able to move to the other lane to avoid hitting us. This seams to happen when we forget to turn off the auto idle stop. This is something you have to push everyone you start the car. I took the car to the dealer they put in a new transmission and changed the timing belt. Previously I had the cars fuel injectors replaced. After all this work the car is still dying and it is happening more frequently. The dealership says they have heard of this problem but don't know of a fix yet.", "fail date": "  09/05/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Emission system problem light came on at 36,942 miles. I am being told that the fuel injectors will need to be replaced at a cost of $1,500. This problem has occurred at 942 miles out of warranty. Emission system problem light came on while driving at highway speed.", "fail date": "  09/04/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "The fuel injectors failed just before 70,000 miles on my 2016 Pilot and had to be replaced at a cost of $1000. After some research, I have discovered this is a ridiculously common occurrence on the 2016 Pilot; so common that I cannot believe Honda hasn't done anything about it. The fuel injectors should not be failing. . . Period. I'm disappointed with Honda and done with Honda after this car.", "fail date": "  09/01/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "On August 9, 2020, I was driving, at 75, with the cruise control on, I needed extra speed to pass a vehicle on the right side, I pressed the gas pedal with the cruise control still engaged and the vehicle went into a power down mode with the dashboard flashing codes and then went blank. The engine downshifted and the engine speed increased to 7,000 rpm. The car completely shut down, at 75 mph, and restarted with the dashboard lighting up again. After panicking, tried to give the car gas and it would not go. Now at 65 mph, I pulled over to the right lane and coasted down to 40 mph and the car started having power again. We pulled over and shut off the car. I restarted the car and an \"emissions system problem\" was displayed on the dashboard. The car has 56,217 miles on it. I have a video of this problem. The dashboard warning system displayed the following codes, \"emissions system problem\"; \"all wheel drive system problem\"; \"transmission system problem\" and the \"d\" drive symbol was flashing on & off. An earlier incident, may 6, 2020, happened to my wife while driving the car in local traffic. Driving at 50 mph, the engine speed increased and the car would not move forward. She also tried to give more gas and the car would not move. She stopped on the side of the highway and shut off the car. She restarted the car and pulled off the highway. She called the Honda dealership and immediately took the car into the service center. They took the car and drove it around the building and said they checked the computer for codes, but none where present. At this time the car only had 55,000 to 56,000 miles. They told her next time this happens to take a video so they can see what happens to the car. Take a video while driving a car that is shutting down is their suggestion. . . .", "fail date": "  08/09/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Multiple warning lights on dash when car was turned on. Engine is running rough and occasional misfiring, especially around 30-40 mph. Mechanic tells me fuel injectors are clogged, and possible damage to catalytic converter. 72k miles on car so past it's warranty. Service bulletin 18-025 issued but I do not believe it should be owner's responsibility to pay for the damage being caused by faulty fuel injectors with intense psi which is causing metal particles to contaminate fuel. This should warrant a recall as it is a safety issue if not repaired and Honda should have the burden of paying, not the consumer.", "fail date": "  07/31/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Car hesitates from 0 mph while revs are increasing on highway or city streets and while gears are changing or when acceleration is requested then the engine feels like it's hesitant to increase power. Also when going uphill or on inclined bridges on cruise control it hesitates to maintain speed and feel like its jumping forward. I have read many other similar complaints from other Pilot owners and if it was because they recommend from the factory to use regular gas, maybe its an octane problem. Bottom line it hesitates when stopped and starts in motion and also when you request some more power while on highways. It is never happened before. I do not drive my Pilot like a sports car I'm careful and take care of my investment.", "fail date": "  07/21/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Emissions system error notification began shortly after vehicle purchase at 38,000k miles. Light would come on and go back off periodically, contacted local dealership and brought vehicle in. Was advised that code could not be reviewed at that time but as warranty was close to expiration, note would be added and may assist if light stayed on. Took my vehicle to a new dealership when we relocated, this time mileage at 58,000, was advised vehicle needed fuel injectors replaced as well as fuel pipe. Review of message boards and service bulletin 018-25 appears to show issue is ongoing and widespread. Contacted Honda service and was advised outside of warranty and Honda would not assist. Assistance or lack thereof appears to be based on reprentative, several customers report financial assistance vouchers offered others, myself included were told good luck and goodbye. Honda dealerships regularly advising that parts on national backorder due to known issue but refuse to recall. Problem first began only on very warm days but would disappear when temperatures dropped. Is now ongoing. Vehicle also occasionally fails to re-engage after the auto shutoff on idle.", "fail date": "  07/07/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "I went to the Honda dealership in fredericksburg because I had a sign on my car saying emissions system problem and all wheels drive system problem. Once I got to the Honda dealer they said the fuel injectors failed and you need new ones. I was shocked because I just bought this car 3 years ago partially new with little miles on it. To get the fuel injectors replaced the dealership is asking me $1500. That is insane because its clearly not my fault this car never got into a accident and I maintained it top notch. I went online again adn did my research on this matter come to know there are over thousands of complaints. How is that possible that this is never been recalled. I will not pay for something that is a manufacturer problem. I am a single mom with four kids it is not safe for me to drive like this.", "fail date": "  07/07/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "The fuel emissions system light keeps coming on.", "fail date": "  07/03/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Vehicle shutdown after start when moving from park to reverse. Keyless start system problem appeared. Emissions system warning reappeared after having it cleared at Honda dealership 2 days earlier.", "fail date": "  06/30/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "#1 keyless remote entry has not worked for over a year now, dealership wants to charge $300. Automatic lock feature is not working any more. Based on my research it is a known issue that Honda keep guessing on and charging for replacing, with no real fix. #2 when driving, all of the sudden all engine lights start coming on, break, power steering, vehicle stability. . . All of them one by one. At the time my Pilot started \"pulling\", and rpm gage was jumping up and down. A few days later took it to the mechanic and this time, it only had the engine light on and a code p0304 was detected. Changed all spark plugs and coils, engine light went away for a week. Again, driving on the highway all lights start coming up again and the same \"pulling\" happens. This is definitely not safe to be driving on. Other Honda Pilot same year drivers are having the same issue.", "fail date": "  06/15/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Bought my Honda in February a month later a emission system started popping up I have replaced all 4 sensors maf map sensors still isnt fixed they are telling me it's the fuel injectors and I have no warranty said it's a Honda thing and needs recalled can cause poor driving Honda really needs to fix it and the awd light pops up and goes away and comes back no mechanics can figure that out.", "fail date": "  03/25/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "I've had several issues with my 2016 Honda Pilot in the past few months. I currently have 110k miles on my vehicle but my problems began at around 80k. My check engine light and several other lights illuminate constantly. At first they would light up and go away. Brought it to service. They said there were no recalls and they change my spark plugs and told me to drive my car on at least a half tank of gas. Problem continued and then my car started running rough and idling rougher. I brought it in again and was told I needed to replace my fuel injectors. That was taken care and I still have a check engine light illuminates along with emissions system problem warming and my car still runs rough and has trouble accelerating. Song with all of these issues I've also had to replace my ignition and key fob and my auto start is not working. I have over a100k on the car which I understand can cause wear and tear but all of these problems far exceed the definition of normal wear and tear. I'd like to know if there is a recall on anything and what can be done to remedy these situations. My car is at service yet again trying to find out what is causing it to run so rough. Any feedback would be greatly appreciated. Thank you.", "fail date": "  10/09/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "Was at a light electronica stop and goal control kicked in the car went off when I went to hit the excelerator to go the car did not restart just the electronica stayed on shut the car totally off try to restart it would not start turn the car off again tried to restart it the car started and drove fine.", "fail date": "  09/16/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "When stopped at a busy intersection on a city street, the automatic stop-idle function did not restart and my car stalled when the light turned green. Multiple warning lights flashed at attempts to restart vehicle. I was unable to restart the car for approximately 10 minutes, causing a significant safety issue, as I had 3 children in the car on the way to school. We could have easily been rear ended as we were blocking traffic. The car was towed to a dealer for a repair. At this point, I question the repair, as my car has come close to stalling again 3 times since this occurrence.", "fail date": "  08/31/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "Intermittently receive dash error code \"�keyless start system problem � \" it comes and goes. Also vehicle struggles to restart when the a engine idle engages at a stop light. This has created safety issues in the winter when I can't go at a green light or others aren't paying attention and my vehicle won't start. There is no way to fully deactivate this feature except to shut it off after turning in car every time. This is a safety issue that seriously need to be addressed.", "fail date": "  08/05/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "�driving at 35 mph on my way home on a side street and my car jolted and stalled and several (5)warning lights came on. Vehicle stability, brake, trammision warning, and a couple other lights. I turned the vehicle off and restarted the car. I tried to drive it in a parking lot so I was able to get safely out of oncoming traffic . And it would not shift properly and I couldn+t drive it at all as I would try to start and it wojld rev to 4000-5000 rpms and would pop in and out from gear to park. . I had it towed from the parking lot I was in to my machanic . My concern is that I don+t feel safe driving on the highway with shifting issues, stalls and jolts that have happened if I were on the highway when that happened, going at 65 mph, it would have caused unnecessary accidents. It+s extremelyndangerous with my children in the car as well as innocent bystanders still no recall for my vehicle.", "fail date": "  06/27/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "#1 keyless remote entry has not worked for over a year now, dealership wants to charge $300. Automatic lock feature is not working any more. Based on my research it is a known issue that Honda keep guessing on and charging for replacing, with no real fix. #2 when driving, all of the sudden all engine lights start coming on, break, power steering, vehicle stability. . . All of them one by one. At the time my Pilot started \"pulling\", and rpm gage was jumping up and down. A few days later took it to the mechanic and this time, it only had the engine light on and a code p0304 was detected. Changed all spark plugs and coils, engine light went away for a week. Again, driving on the highway all lights start coming up again and the same \"pulling\" happens. This is definitely not safe to be driving on. Other Honda Pilot same year drivers are having the same issue.", "fail date": "  06/15/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "�keyless start system problem� appear after 40,xxx mileage. The Honda dealer is just guessing right now they replace my battery but after a day the same error reappear. There is definitely a manufacture defect as there so many issues regarding this if you google it. My car wont start then got towed to the dealer and it might die again now that it reappear.", "fail date": "  05/15/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "The car threw multiple errors including emission system, power steering, vehicle stability, trailer stability, hill assist, and road departure mitigation. Result was key safety features, including autonomous braking, road departure mitigation, power steering, and lane keeping were rendered inoperable. The engine power was reduced while in motion at 50 mph. The errors came on shortly after ignition was engaged.", "fail date": "  05/13/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "Warning light keeps indicating there is a problem with my keyless remote. I've changed the battery, but that didn't help. Sometimes the light doesn't come on. It's about 50% of the time. It happens when I first start the car as well as when I'm in motion.", "fail date": "  03/06/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "Multiple warning lights on the dash, check engine light is on including road departure mitigation warning, trailer stability assist warning, hill start assist warning, vehicle stability assist warning, emissions system control warning, all wheel drive system warning, power steering warning and acc warning where all came up at the same time with a sudden jerk and car cannot go beyond 20 mi/hr while I was driving in the highway that almost got me into an accident with an individual on the rear almost bumped me. Now I'm afraid to drive it. I actually got the attention of my dealer (norris Honda) when the jerking started at the mileage of 34,100 miles and happened several times but with no warning light coming on. They did a test drive and it so happened that it didn't happen when they tested it and no check engine light on. They told me that they have had several incidence of the same problem with other customers with Honda Pilot 2016 and 2017 and is a common issue and ended up having to change the fuel injectors and have solved their problem. The problem though is, my car is only 3yrs old and having all these problems now and they charge $1800. 00 to change the injectors, which I think is way too much for a fairly new car with dealer being aware of the first jerking problems before the warranty ended. I have been having all Honda cars since I started having a car because of its reliability and performance and now this happened. It has been a very common problem but no recall has been made. I hope that there will be no accidents with one losing life before a recall is made. I hope you can help me out with this, thank you.", "fail date": "  01/10/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "Car brakes by itself, shakes the steering wheel and shuts off and loses power ranging in speeds from 20 -60mph. On double lane roads to interstates in the rain and sunny dry days.", "fail date": "  11/21/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "Tl-the contact owns a 2016 Honda Pilot. The contact stated that the key-less start system problem message was displayed. There were no warning lights illuminated. The local dealer was not contacted and the vehicle was not diagnosed or repaired. The manufacturer was not contacted. The failure mileage was 38,109. Ap.", "fail date": "  10/04/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "Keyless start system problem, warning comes and goes, car wont start at times.", "fail date": "  09/04/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "Once my Honda Pilot hit miles of 34,000, dashboard is shows warning \"keyless start system problem\". Shortly after I am having problem with start button which won't start one press, I have to press many times to start the car. . . I have changed my key fob battery, and still have same problems. Dealership won't cover this issue once the car drove over 30,000 miles. I did research on this issue specifically Honda Pilot 2016 model. There are a lot people who have same issues. I am afraid that my car won't start one day. Never had issue with other Honda models. . . Also this model 2016 Honda Pilot has issue with music dashboard, example: the radio display will black out during when I am driving, so had to turn off my car and turn on to get my radio display back or all of sudden I can not change the music volume etc. . . God knows what is the next problem?!.", "fail date": "  09/01/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "My vehicle has about 50k miles and all of a sudden I receive a dashboard message that says \"keyless start system problem\" when I turn on the vehicle. The message stays displayed while the vehicle is on, and will only go off when the vehicle is turned off.", "fail date": "  07/18/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "Keyless start system problem light comes off and on.", "fail date": "  06/25/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "I was driving at 15 mph and my car jolted and stalled and several (5) warning lights came on. Vehicle stability, brake, power steering, and a couple other lights. I turned the vehicle off and restarted the car. I tried to drive it a few miles and it would not shift properly and I couldn't drive it more than about 20 mph. I had it towed from home to the closest Honda dealership. The vehicle had around 40k miles on it at the time. Honda said it's a known issue with a bulletin - stating that the cam shaft assembly needed to be replaced along with a sensor. They told me the cam shaft assembly was under the power train warranty but I had to pay for the sensor. When I did a little research, I found that Honda was giving extended warranties to newer models having the same issue and even doing recalls but my VIN didn't qualify. A few months down the road and my car started having shifting problems again. So, I take it in and they are saying the transmission needs to be serviced but the service only gets a little bit of the fluid out so they wanted to do the service 3 times and charged me for doing the same thing 3 times. After some research, I find out that it's a known issue that they are willing to give a limited warranty on up 80k miles. My concern is that I don't feel safe driving on the highway with shifting issues, stalls and jolts that have happened within 4 months of each other. If I were on the highway when that happened, going at 60 mph, it would have caused unnecessary accidents. It's dangerous but, still no recall for my vehicle and it's like fighting tooth and toenail with Honda to get them to do what is right. I don't know when or if it will happen again. I purchased my Honda brand new. This vehicle needs to be off the roads until the issues are fixed. I think I have a lemon!.", "fail date": "  06/21/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "First a lot of different lights were coming on saying different stuff was wrong. So had it fixed. They replaced the spring harness in the steering column. Then not long after the battery died replaced it and now the battery died again then all of a sudden the keyless remote start problem light turned on and the mitigation system doesn't always work it just work then sometimes doesn't work, their is no light that come on to tell me it not working I just know be I'm driving and might raft I drift over a white line and nothing happens and sometimes it work let's me know I'm going over the white line also if I'm coming up on another car to fast it doesn't let me no by beeping and sometimes it does and the center touch screen doesn't work at all and the ac/heat doesn't work either. My Pilot only has 45,000 and about 38,000 when I first started having the problems.", "fail date": "  05/15/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "Keyless start system problem.", "fail date": "  04/29/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "My vehicle just drove 20k miles, I am getting a popup \"keyless start system problem\" very frequently when ever I start my car. Mine is 2016 Honda Pilot touring awd. I went to dealer, first day he reset some code and the warning message went off. But immediately on next day it came again. I went to dealer again and they did 2 hours of investigation and told , they will replace the battery and they ordered a part. Yesterday my part was ready and they said they have replaced the part and replaced the fob batteries. The warning was went off on that day but, it came again today. I am totally frustrated with this behavior. When I search on the forums most of the Pilot customers had the same issue and they have reported in this forum. I am not sure how you will take it up but I am bit concerned on the vehicle safety how it behavior. I am getting this message when ever I start the vechile. Tried with both key fobs and with new batteries but no luck. My dealer is Honda of concord, bruton smith blvd, concord. Nc.", "fail date": "  03/11/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "I am getting a \"keyless start problem\" error on my dash but my car is working fine. I have already replaced fob batteries and reset system by disconnecting battery. From my research online, this has been a big issue for Honda Pilots.", "fail date": "  03/01/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "I was driving in stop and go traffic on a freeway, my foot was on the brake and car was in drive, when I took my foot off break and pushed gas pedal the car would not go. I tried to put it in park and it would not go, I tried to turn off car and it wouldn't turn off. The message on the dashboard said to push brake and turn on car (same message as when I remote start car) after 2 solid minutes, the car finally drove. The problem seems to be impacted by the econ mode which shuts off engine when brake pedal is fully engaged. You are able to turn this mode off on the gear shift but have to do it every time you start the car.", "fail date": "  12/03/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "Our 3 year old car at about 28,000 miles started displaying the warning message \"keyless start system problem\" nearly almost every time it is started. (note, this problem developed the month after it's warranty expired. . . ) when the message first displayed we took it to the dealer, they could not find any problem with the starting system, only that our electronics system needed an update. With the update, the message disappeared for a few weeks, but has now returned and is appearing nearly every time we start the car. This happens regardless of whether mine or my wife's key is used, and changing the battery in the keys has not changed anything either. We have never had an actual issue with starting the car, it's just that we now have to live with this constant warning light. In looking online, there are multiple forums dedicated to this exact issue for 2016 Honda Pilot's and it sounds like it is fairly well established issue for this make / model.", "fail date": "  11/17/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "Honda Pilot 2016 model with 30000 miles has stalled on highway interstate suddenly within 2 min of signalling messages of engine temperature too hot, transmission system problem, emission system problem etc. . . And went into neutral mode with failure of brakes. Car would not respond to brakes as it went to neutral state. Also noticed a burning or gasoline smell inside the car . I had to apply parking brake to stop the vehicle from moving on highway which could have led to a major crash. As I was not on the speeding lanes, things were not worse. I had to call 911 and they helped me move my car to a shoulder and later towed to Honda dealership. This was the second time happening for the same issue where earlier it happened on a local road. The same dealer kept the car for a week and returned the car saying its fixed. Within 30 min of driving into the highway, it stalled again this time the situation being on highway. The car is now returned to same dealer who fixed first time and is under investigation.", "fail date": "  10/05/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "My vehicle was in motion on a neighborhood street when several alerts went off on my dashboard: road departure mitigation system problem, trailer stability assist problem, hill start assist problem, vehicle stability assist problem, emissions system problem, power steering system problem. I could find no reason for these alerts. I took my car into a dealership the next day and was told there was no issue and the lights were turned off. 10 days later they all came on again as I was driving on a local street. The next day when I went to take my car to the dealer, the lights had turned off. I took it in anyway, and they again said there was no issue. I reported the issue to Honda corporation and was told by one agent that this wasn't the first time the issue had come up in a newer model Pilot. Again 2 days ago, all the lights came on and now also the brake assist alert is also on. I will take it to the dealership again. I am concerned all the false alarms may be hiding an underlying issue that could result in a dangerous accident. I also feel that Honda global is not taking me seriously as I am active duty stationed overseas and have to rely on local Honda dealerships that do not have much experience with the Honda Pilot. The dates of the lights were 17 sept, 27 sept, and 6 oct 2018.", "fail date": "  09/17/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "During idle (such as at a red light), the auto engine idle stop function causes the engine to cut out (this is normal) and the engine is supposed to come back to life when the brake is released. However, sometimes the engine and electrical system cut out completely (most easily identified by the radio cutting out) and the engine does not come back on when the brake is released and the car must be put into park and restarted, which can take quite a bit of time - it often has trouble restarting when this occurs. There is usually some kind of error code when this occurs; the code varies but is most often \"collision mitigation system problem'. This condition can be quite hazardous, especially when in an intersection. There is an override of the engine idle stop, but it must be activated each time the car is restarted, which is easily forgotten. This problem was occurring several times a week until I started using the override.", "fail date": "  06/01/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "The tpms system isn't monitoring the wheels sensors. The sensors were check and are good. The problem is that tpms system that not appear in the control panel to reset this. The light of tpms system is on all the time. This occured to 37,000 milles aprox.", "fail date": "  03/29/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "I've been having issues with my car stalling when I try to drive after being stopped at a red light. It doesn't happen every time but at random times. I had this issue back in February 2018 and took it to my local Honda dealer in jacksonville and they hadn't seen the issue before. They reported it to american Honda, took a few days and then replaced the starter and said it was a failed starter issue. It was working fine until August 2018 when it stalled again. It instructed me to put the car in park and then start the engine again. I took it to the local dealer an hour after it happened but they wanted me to leave my car so they could report it and I'm a stay at home mom and need to have my vehicle so I told him I'd try to bring it back another day but instead decided to report the problem directly to Honda to see if there is any update or correction at this time. Honda directed me to report it to a dealer so I've since reported this issue to another dealer in st. Augustine, florida who is aware of my vehicle having this issue. To date, it has not occurred again but I anticipate that this will be a recurring problem with the car if it wasn't a starter issue. The issue seems to occur when I'm in stop and go traffic and I press down on the brake pedal and go to release it to drive the car when the engine is going into the auto-idle function - almost as if it hesitates to start back up because it was too quick of a response for the auto-idle function to take.", "fail date": "  02/01/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "During extremely cold weather, all system failure indications scroll on the display. Happens intermittently and will reset itself over time. I renders the systems useless as well. Alarms include hill start assist, trailer stability assist, road departure mitigation assist, emissions, awd and eps. Many of these systems are safety features and no longer respond until battery cable is removed or reset after time.", "fail date": "  01/04/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "Tl- the contact owns a 2016 Honda Pilot. . The contact stated that when the accelerator pedal was depressed, the vehicle violently hesitated to drive while jerking. The vehicle was taken to colonial Honda of dartmouth 225 state rd, dartmouth, MA 02747 (508) 996-6800 where the contact was informed that the software needed to updated so that the vehicle wont overheat as well as a vehicle flush. The vehicle was not repaired. The. The manufacturer was contacted and informed the contact that there were 0 recalls on the VIN number. The failure mileage was approximately 50,000. Dr.", "fail date": "  01/01/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "Vehicle randomly cuts power to engine. While vehicle is in motion, stability control symbol flashes when accelerator is pressed and power is cut from the engine causing vehicle to slow. Releasing accelerator allows vehicle to coast and stability control symbol on dash goes away. As soon as accelerator is pressed again, stability control symbol flashes and power is once again cut from engine. Very scary on freeway. Pulling over and putting into park and drive does not correct issue. Vehicle must be turned off and turned back on to reset. Imagine how scary this will be doing 70 on the freeway and power being cut from the engine surrounded by traffic and unable to get to the shoulder to turn the vehicle off and reset the system.", "fail date": "  12/09/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "On numerous occasions, beginning just months after purchase, I have had all of the indicator light turn on on my dash, including the lkas, collision mitigation, adaptive cruise control, road departure and various notifications for my bluetooth, radio and navigation come on. Also, my backup camera will have a black screen and then my maps will be gray with no information. My car will suddenly brake when there is no one in front of me and surge forward as I'm to coming to a stop and the rpm's will raise, it's like I'm sliding over ice for a short period of time. I also can't make phone calls using the system, as it won't recognize any of my voice tags. And instead will give me every contact in my phone book with a home number when I ask for it to call home. Recently the abs is activating as I turn my wheels to the right while backing our of parking spaces, either on a driveway or flat surface. These may happen while driving or stationary and just turning the car on. It just isn't safe. I've had people slam on their brakes to avoid hitting me as my car decides to suddenly stop for no reason and have fear that I may rear end someone due to it lurching forward while stopping, so now I stop even further away from vehicles and objects - just in case. I'm also experiencing a popping noise coming from my speaker system that seems to occur whenever my ac compressor switches on or off or if I'm using my door locks, leading me to wonder if I'm actually having electrical issues. I've taken it to the dealer numerous times and they of course say that they can't duplicate the issues. So I show them all of my photos and videos. I'm not alone with many of these problems. I see others complaining of similar issues as well. Honda needs to repair our vehicles or buy them back. I've always loved Hondas but after my experience with this vehicle, they may have lost my business.", "fail date": "  11/27/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "On numerous occasions I have had all of the indicator lights on on my dash, including the lkas, collission mitigation, adaptive cruise control, road departure, and various notifications for my bluetooth, radio, and navigation come on. Also, my back up camera will have a black screen and then my maps will be gray with no information. My car will suddenly brake when there is no one in front of me and surge forward as I'm trying to come to a stop, like my brakes aren't working. I also can't make any phone calls using the system, as it wont recognize any voice tags and instead gives me every contact in my phone book that may have a home number. Recently the abs is activating as I turn my wheels to the right while backing out of parking spaces. These may happen while driving or while stationary. It just isn't safe. I've had people slam on their brakes to avoid my car as it suddenly stops for no reason and have feared that I may rear end someone due to it lurching forward, so now I stop really far back from other vehicles. I'm also experiencing a popping noise coming from my speaker system that seems to occur whenever my ac compressor switches on and off, leading me to wonder if I'm experiencing electrical issues with this vehicle. I've taken it to the dealer so many times and they say that they can't \"duplicate\" this. So I show them the photos and the videos. I'm not alone with many of these problems. I see others complaining as well. Honda needs to repair our vehicles or buy them back. I've always loved Honda's but after my experience with this vehicle, they may have lost me as a customer. My family's safety is too important to leave in the hands of a corporation that cares more about their bottom line, than their customers.", "fail date": "  11/27/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "Honda Pilot 2016 touring. Vehicle battery drains overnight or in a few hours for no reason. The vehicle would not start and would have to be transported to the dealership or have battery recharged for a long time. After recharge, safety equipment such as sensors, emergency stop, etc. Stop working. Contacted Honda and took vehicle to dealership multiple times. One time they replaced the battery and other times did something else but they are unable to resolve the problem. We believe vehicle is unsafe to drive. This problem seems to be encountered by many Honda Pilot 2016 owners which is reported online. They all complain of taking their vehicle to Honda dealership only to be told the dealership unable to resolve the issue.", "fail date": "  07/23/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "Sometimes can not stop 2016 Honda Pilot with foot off gas and firmly pressing down on break peddle. It has taken me 4 times into intersections. Yesterday I was going to make a left hand turn at a 4 way stop and the engine surged and I had to go straight to avoid hitting a car. The dealer checked breaks and gas peddle and found no problems. The touch screen radio controls sometimes does not work. Dealer mechanic said computer controls that and car gas too, therefore I think it is a software issue that needs to be addressed immediately. I have a code number with America Honda. They are checking into the matter and hope they find a solution before I wreck or worst kill someone. I have had this new vehicle about 6 weeks. Only 1300 miles on it.", "fail date": "  02/26/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Hood - flutters and wobbles significantly at highway speeds. Per recall check, this vehicle is not included. Seat belt - more of a personal thing, but the driver's seat belt cuts into the driver's neck, even when high of shoulder strap is adjusted. When using a device to help control where the shoulder strap lays, it was found that the driver's seat belt is much shorter than all other in the vehicle. Therefore not allowing the driver to use something to adjust the shoulder portion and still safely check blind spots.", "fail date": "  07/23/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "I have a 2016 Honda Pilot, color, pearl white. The paint started to peel appointmently one month ago. The area is on the roof in front of sunroof behind the front windshield. There is a recall on the same color, make, year and model. Peeling in the same area. I was told by Honda of America that it was only for Honda that were painted at a certain factory that are covered by the recall. I did have the vehicle inspected by Honda and a body shop that they sent me too. Total estimate is around $1200. They both confirmed that it's the same area as the recall. I do have the email with pictures that they took to send to Honda. Honda is only willing to cover 25% and told me to put a complaint into your department. Per Honda they said if there is enough complaints. There would be a recall for the other VIN numbers to cover the paint job. We find there response unacceptable based on pass practice and previous recalls.", "fail date": "  07/15/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "On the highway I can see the hood is vibrating and air is getting under it. I had a recall for the hood latch and believe I completed that service but am concerned that it’s still not safe.", "fail date": "  04/09/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "A roof moulding flew off my vehicle on the expressway. Apparently there is a Honda service bulletin that came out to the dealership that indicates these mouldings need to be secured better. However, they listed only some of the vins and mine wasn't one of them, but the moulding ended up flying off anyway. It sounds like is a problem for other vins that Honda didn't indicate.", "fail date": "  09/16/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Molding trim on roof of the vehicle is lifting and not secured. Molding trim around windshield is not secured and a plastic screw deteriorated and fell out. Trim won't stay in clips on the roof or on the windshield. I noticed the trim around the windshield was lifted while driving on a city street. I noticed the roof trim lifted when I arrived home and the screw on the windshield by the vent.", "fail date": "  02/17/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "While driving on the highway, in strong winds, or passing larger vehicles or semis, the hood flexes as if it is going to unlatch and fly off the car. This is not a minor flex, the hood can bounce 2-3 inches. It is extremely unnerving and after time, the latch on the hood will fatigue and eventually break. It is becoming loose. There are currently no recalls by Honda. This is a serious oversight. The dealerships have tried to fix it, but never with success. Please look into this. Thank you.", "fail date": "  09/30/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "We were hit on the drivers and passengers sides of the vehicle by another vehicle that was travelling at an estimated 90-100 mph, and the airbags did not deploy. My vehicle was travelling at about 50 mph on an interstate when it was struck on the driver's side first. The force of that impact pushed my vehicle into a large box truck on the passenger's side. The police stated that the airbags should have deployed with the extreme force of the impact.", "fail date": "  02/03/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "The rear lift gate has been malfunctioning periodically since we purchased this vehicle new in 2016. It has been repaired several times but keeps malfunctioning. The issue is that the lift gate starts to open, but then closes itself for no reason and does not stop closing even if a person or obstacle is underneath. Sometimes the lift gate also will not reopen. Our ongoing concern is that a child or other person will be crushed beneath the malfunctioning lift gate. This has happened in all types of scenarios - when the car is parked flat, on an incline, inside, outside, etc. And there does not seem to be a consistent cause. Also, our Honda dealer is often unable to identify the problem using their computer system - they have told us nothing is wrong with the lift gate until they have watched this happen.", "fail date": "  12/09/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "I bought this vehicle as a \"certified pre owned by Honda\" and four days after the purchase the car was parked in my driveway, in \"park\" when I hit the start/stop engine button and the vehicle didn't start. Alarms started to go off so I assumed it was the key was still inside the house. As I went inside to check, maybe a few seconds, when I went back outside the vehicle was gone. I found it in my front yard. It had rolled off while in park without engine on. After getting it towed to Honda, days later I was informed that there was a problem with the start/stop engine system and that it also needed the entire a/c system replaced. Attached you will find the photo I took of the vehicle still in park when I found it in my front yard.", "fail date": "  07/14/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Roof moldings have been popping off without having anything damaged them or affected then in any way. They are coming off on their own.", "fail date": "  06/21/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "The hood flexes in the wind when driving at higher speeds on a windy day. Unnerving to see it pop up and down. Took to dealer and they adjusted the \"knobs\" on each side. Didn't help. Then logged a ticket with them and they replaced the latch. Still a problem. We've tried adjusting the knobs again, but if on the highway on a windy day, it still flexes. We've seen others' complaints on the internet of the same problem. Afraid the hood is going to pop up if a gust catches it and kill someone. It has happened multiple times over the time we've owned it (3 years). The latest was on April 29, 2019.", "fail date": "  04/29/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Drivers side window. When the button is pressed it brings the window down. However this feature is automatic for rolling the window up and down. This is not working. Keyless start stopped working, and the most important concern is the ignition for button start is acting up. Today it worked in the morning but later in the afternoon the car would not start. Dash board lights were flickering. This evening tried again and it worked fine now. This is an important safety concern.", "fail date": "  02/18/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "At highway speeds, the hood was bouncing and when a semi truck passed me the hood would bounce up to 1 inch. I took it into the dealer and they adjusted it but it did not fix the problem. Now, after a few months the hood looks like it is going to come off of the car and people passing me are indicating that the hood is coming off. Rudolf Honda said that it is up to spec. I am bringing it back to the dealer soon.", "fail date": "  12/17/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "While driving on residential street going 10 to 15 mph both airbags front passenger and driver side airbags deployed did not have any accident did not hit anything enclose is pic and videos of the vehicle with no visible damage to body or under carriage of vehicle.", "fail date": "  05/27/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "While driving on residential street 5 to 10 mph both airbags deployed front passenger and driver side vehicle did not have any accident or hit no undercarriage damage I also have more photos plus a video showing vehicle did not have any damage.", "fail date": "  05/27/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "If it is windy, I'd um traveling over 65 mph or if a drive alongside a big rig the hood of my car flexes in four directions (when two or more of these factors come together it is quite bad). I've pulled over to be sure it is closed correctly (it is) but the problem persists. It feels as if the hood is going to fly up. There is a lot of space between the body of the car and the hood (thick seal). I can see from the driver's seat the mat the hood is not flush with the body.", "fail date": "  04/03/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Surge while braking during parking caused vehicle to accelerate ahead and hit vehicle parked in front. This caused damage exceeding $1600. 00. See Honda service bulletin 16-008. This bulletin was not brought to my attention until after this incident even tho my vehicle had been serviced by my Honda dealer only since ii purchased it new.", "fail date": "  02/09/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "When I am driving on the highway at 65 or higher, the hood will flex up and down like it is not locked. It is worse in high winds. No vehicle I have ever driven before has done this. The first time it did it, I slowed down and got off the first exit I could. I didn't pop the hood because I wanted to see if it was open by itself. I couldn't open it and it seemed sealed. I popped the hood, checked it over and shut it. When I got back on the highway, it continued to flex up. It made me so nervous. I am so afraid to drive it on the highway with my kids. It has to be weakening it! eventually, it will let go and fly up, possibly smash the windshield, it could fly back into a car behind me and I don't want to think about the personal injury that it could cause. Honda needs to fix this now. There are many people having the same issue. No one knows how to fix it in the service dept. So are they going to wait until someone is dead? with all the problems popping up with this vehicle, I am starting to think I made a mistake.", "fail date": "  12/14/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Driving at freeway speeds I noticed the hood was shaking. This car has about 3500 miles on it. I pulled over to check the hood to ensure it was secure, got back up to freeway speeds and it continued to shake. It looks like it might fly off at any time. Also concerned about fatigue of the joints over time due to the vibration.", "fail date": "  11/10/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "At high speed and especially when passing oncoming large vehicles hood shakes violently as if coming loose and threatening to fly up. . Greg may Honda of waco TX service department was useless in resolving.", "fail date": "  09/14/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Since purchase 3 months ago, the hood shakes violently at speeds above 55 mph and especially under windy conditions. It is exceptionally bad in high wind and when passing oncoming vehicles. It is obvious the hood is not sufficiently strong enough to withstand these wind pressures without causing some kind of damage in the future. Feels like it is only a matter of time before the hood actually bends or breaks at 80 mph highway speed limit.", "fail date": "  09/01/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "My family was in our 2016 Honda Pilot touring. We stopped our vehicle and started to get out. My eleven year old niece was sitting in the middle seat of the second row. She was in between my two sons, both in carseats. When she removed her seatbelt the belt quickly snapped back and the buckle hit my three year old in the head. He was sitting in his forward facing carseat that is appropriate for his age, height, and weight. His seat is on the driver's side of the second row. The buckle hit him on the right side of his forehead right under his hairline. Two large knots, one for each side of buckle, popped up. One knot was large enough that it actually split open and bled. It was incredibly painful and took almost two weeks for bruising to go away.", "fail date": "  07/30/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "The hood vibrates violently in speeds of 60+ miles an hour. When a large truck or vehicle drives passes the car the hood vibrates violently. When on a two lane road and on coming traffic goes by the car the hood vibrates violently. This issue has been present since I purchased the car in June 2016. The Honda dealership stayed this was within the design specs for the Pilot. I have made every adjustment I can make with the rubber grommets with no success. Honda tells me ther is no adjustment. I am a port enginner and I manage ship repair. This is a serious issue. The vibration will over time cause the hood hinges to fail from fatigue. This will create a situation where a consumer driving the 2016 Honda Pilot to potentially have hood fly off the vehicle during normal driving causing catastrophic failure and injury to the driver and passengers.", "fail date": "  06/22/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "We were driving down the street, veering left and the rear passenger door attempted to open. A warning went off on the instrument panel showing which door was \"open\". Because the door was locked it didn't open all the way. In order to close it the driver had to push the unlock button. Had the door not been locked I'm afraid the door would have opened completely, putting my passenger at risk.", "fail date": "  06/19/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "I am experiencing the same issues others mentioned of the hood flexing when driving. Under certain conditions when driving down a two lane highway and a semi goes by in the other direction or when passing a semi on the interstate you can see the movement of the hood from the front to the back as the air flows underneath. It looks like the hood lifts from latch and then flexes, moves or shakes as air flows guess that's best way to describe it. On the interstate I have even noticed shaking/movement when driving if it's windy without passing a semi. Car wash dryer also causes the hood to shake. I have taken to dealer and they tried adjusting the latch - that didn't help. Stopped by another dealer and they said to adjust the rubber bumpers on each side under hood but that didn't help either. It's pretty scary to see this happening. What if the latch doesn't hold one of these times? the hood flying off going 65-75mph is not a pleasant thought. Over time will the flexing and movement and the hood cause paint to crack and decrease integrity of the hood?.", "fail date": "  05/26/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "~tl the contact owns a 2016 Honda Pilot. While driving 70 mph, the vehicle lunged forward and the contact smelled fumes. Also, the vehicle stalled while driving various speeds. The contact pulled over and it took numerous attempts to restart the vehicle. While driving various speeds, a piece of the fender on the front driver and passenger sides fractured and struck a person in the head. All the warning indicators illuminated on the instrument panel. The vehicle was diagnosed and repaired by multiple dealers and independent mechanics and the catalytic converter was replaced four times and two injectors were installed; however, the failures continued. The manufacturer was notified. The failure mileage was 83,000. The VIN was invalid.", "fail date": "  05/01/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "I have a 2016 Honda Pilot elite and I noticed on my last road trip that the hood on the vehicle moves violently when I pass on coming vehicles especially large trucks. I also noticed that this happens during high wind situations as well. I made a service appointment for this week to address this with Honda. On both occasions I experienced this was at highway speed of 55 or faster.", "fail date": "  03/22/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Engine hood bends in all directions in high winds & when passing commercial trucks: looks like it will come off at any moment, to strike the windshield. Experienced this on the same highway on every trip from California to arizona and back. Speed was 75 mph (legal limit). Will video tape this on the next trip. Very frightening! has been to dealer three times re this issue: they have no answers and no repair offered.", "fail date": "  01/26/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "While driving straight on a highway, I heard a loud noise from the top of my car. The sunroof glass had spontaneously shattered. When I looked through my rear view mirror I could see some pieces flying. Thankfully, the car behind me was far away enough that they were not hit by these glass pieces and also had my interior slider closed. A serious accident could have occurred if both my slider wasn't closed and/or the car behind me was close to me. I've had the car for less than 3 months, I contacted Honda and advised them of the incident and brought it in to their service department. They claimed to have never heard of anything like this happening before. They have ordered a replacement glass for my sunroof. I'm still waiting for it come in. I also went online and researched sunroofs breaking out of nowhere and did come across many other similar complaints. It seems that it may be happening more frequently with newer vehicles because they are built lighter with thinner metals and thinner glass. The glass used on sunroofs more commonly is tempered glass, not laminated glass. Tempered glass is more prone to shattering when pressure builds up inside the car. When I spoke to Honda corporate and the dealer, neither one could tell me what kind of glass was on the sunroof because they didn't know. I hope this matter can be further looked into. I hope it doesn't happen again. This was a very frightening experience that could have very easily been worse.", "fail date": "  01/21/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "The four doors must receive an usual amount of force for normal closure. We are always leaving a door ajar when we exit. From the inside must pull door with more than usual force. Best to keep hand on door until closed which I have never had to do in a new car and I have purchased numerous new cars over the years. The door feels like dead weight - has almost no closure force. It helps some to open a window or another door to relieve the back pressure but still is not a normal door closure. I have gone to three dealers and nothing they can do since no there is no adjustment. I had a 2009 Pilot and the doors worked just fine. One Honda dealer said the door is likely too heavy for hardware.", "fail date": "  11/02/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Roof rail covers blew off at highway speeds. Poor fit on front roof rail cover moldings leaves air gap. At highway speeds this can cause the 8 foot strips of rubber, pastic moldings to fly off vehicle. This has serious accident potential at highways speeds. Online forums are flooded with similar issues on all trim levels of the 2016 Honda Pilot.", "fail date": "  09/11/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "When's next motion going about 50 mph or above, traveling on a two lane road, and a large truck passes us going the opposite direction, the hood flexes quite a bit. Also flexes and bounces when going through the drying stage at a car wash. It is extremely noticeable and concerning. I am concerned with the possibility of it lifting and becoming a safety issue to either myself or the cars behind me.", "fail date": "  08/21/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "1) engine failure - several times our 2016 touring has stalled at a stoplight. It takes time to start back up. I have to turn on hazard light, and it is getting worse every occurrence. This has happened since I bought new, and when it happens, all of the lights come up on the dash. There is a investigation in the state of California, but nothing in ohio yet. 2) I just had to replace my drive shaft that goes from from to back on center bottom of the car. They said the rear is failing, and that may be part of the problem with sluggish acceleration. 3) transmission: sluggish acceleration is this zf 9 speed (outsourced) by Honda issue. I will be accelerating on the freeway, and all of the sudden, it would down shift to like second gear, causing me to slow down suddenly. Dangerous if cars are behind in rush hour. I also had 4 incidents where I could have lost my life because I could not accelerate (the gear would not engage). Dealer informed me that all of the updates are uploaded, and it should be okay. But it's not okay when you are carrying your children, spouse, or CO-workers. I have informed the dealer many times that this car is not safe. I personally ran a business as tier 1 supplier to Honda and visited many Honda factories. Nothing ever got done. It will be too late before they can help us. All of the data and information is at Honda marysville (ohio) dealership. All of my services (including oil change) are done there.", "fail date": "  12/08/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "5 times we have experienced p2135 code. 4 times this year, causing the dash warning lights to flash numerous warnings and the vehicle goes into immediate limp mode. Unable to accelerate normally and unable to drive faster than 30-35 mph on the freeway causing us to drive on the shoulder until we are able to safely exit the freeway . This has occurred while on a hill going up to an intersection not allowing me to accelerate to get through intersection safely. Unable to recreate the situation at the dealership, they see the code but unable the diagnose the root cause. We had the throttle body replaced at our expense per dealership recommendation. It reoccured again within 200 hundred miles. Dealership has had it for 2 days and they are unable to reproduce or diagnose the problem.", "fail date": "  08/10/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Several times, while driving on the freeway, I've taken my foot off the accelerator to naturally slow (rather than brake) for traffic in front of me. When I put my foot back onto the accelerator to speed back up, the car actually decelerates before catching with a \"clink\" noise and then finally accelerates. This has only happened to me while driving at higher speeds (65 mph) on the freeway and is quite a safety issue as those behind me wouldn't necessarily know my car was suddenly decelerating. It is extremely scary when this occurs and has me scared to drive in any middle lanes, in the event I need to get over to an emergency lane suddenly. My car has been to the dealership three times now and they cannot find the root of the problem.", "fail date": "  10/05/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "My wife was driving the kids to school, stopped at a busy intersection. The engine idle-stop feature stopped the engine, and when my wife hit the gas, the car wouldn't restart. It required several attempts. This happens sporadically with the car, and it's happened on numerous occasions. . Read more...\n", "fail date": "  09/21/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Since buying this vehicle the transmission and computer module have already been replaced once due to similar problem. While my son was driving around a corner on a city block so turning left at 15 miles per hour the transmission suffered a failure and error message and accelerated forcing him off the road. Dealer has denied any assistance.", "fail date": "  10/21/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "I went to the Honda dealership in fredericksburg because I had a sign on my car saying emissions system problem and all wheels drive system problem. Once I got to the Honda dealer they said the fuel injectors failed and you need new ones. I was shocked because I just bought this car 3 years ago partially new with little miles on it. To get the fuel injectors replaced the dealership is asking me $1500. That is insane because its clearly not my fault this car never got into a accident and I maintained it top notch. I went online again adn did my research on this matter come to know there are over thousands of complaints. How is that possible that this is never been recalled. I will not pay for something that is a manufacturer problem. I am a single mom with four kids it is not safe for me to drive like this.", "fail date": "  07/07/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "The car threw multiple errors including emission system, power steering, vehicle stability, trailer stability, hill assist, and road departure mitigation. Result was key safety features, including autonomous braking, road departure mitigation, power steering, and lane keeping were rendered inoperable. The engine power was reduced while in motion at 50 mph. The errors came on shortly after ignition was engaged.", "fail date": "  05/13/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Tl-the contact owns a 2016 Honda Pilot. The contact stated that the vehicle was taken to the dealer bob lanphere beaverton Honda, 10760 sw canyon rd, beaverton, or 97005 for a schedule maintenence. Two weeks after, the vehicle accelerated spontaniously while driving approximately 45 mph. The vehicle was taken back to the dealer bob lanphere beaverton Honda, 10760 sw canyon rd, beaverton, or 97005, they wanted to charge for the diagnostic. The contact also stated that the failure occurred at least 10 times since the vehicle was taken for service ( it never happened before ). The manufacturer was not notified of the failure. The vehicle was not repaired. The approximate failure mileage was 31,000. Bp.", "fail date": "  10/25/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Honda Pilot awd 2016 has rpm variation / hesitation during normal driving from rev range 1500 to 2500rpm. It is a continual hesitation or spluttering of revs. If accelerarting extremely hard it is not as evident but is always there. Appeared out of nowhere, car has no other issues, serviced professionally as needed/scheduled. Horrible comfort/ safety issue - needs to be addressed has 75k miles, has been occurring for last 10k doesnt seem to do it under no load (neutral) but always under normal driving. Eco mode on or off doesnt matter - no difference.", "fail date": "  10/08/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "When going down a straigt hill going around 15mph my rpm's go up to 5 and 6. If I press the gas they go up higher. I usually have to pull over when this happens so it the rpm's stop climbing higher. This also happens somethimes when going on a backroad going around 20-25mph but the rpm's only go between 2-3. It seems like the gears are not shifting.", "fail date": "  09/26/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "2016 Honda Pilot sudden rough acceleration while pulling up to the driveway. This happened after accelerator was released before the approach. Fortunately the brakes were applied on time before crashing into the property.", "fail date": "  06/14/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Error display: keyless start system problem vehicle was stationary, after started. In motion, while driving error displayed and mp/h change without accelerating to even over 100 mp/h when if fact driving about 60 mp/h.", "fail date": "  04/05/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Takata recall my Honda Pilot only 83000 miles. Transmission problem and emmission problem both lights came on at the same time. I was driving to work when I felt the car not wanting to accelerate, I immediately turned into a lot and I am waiting here ever since because the car isn't moving forward.", "fail date": "  01/04/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "There is jerking when accelerating my vehicle. This takes place typically while driving between 20 and 60 mph. This seemingly transmission problem is very worrying for my 2016 Honda Pilot. I started noticing it at around 20k miles. At the current time, my mileage is at 50k. I worry what will happen down the years. I am almost thinking of disposing the car. A manufacturer like Honda needs to own this problem and help its customers with a fix.", "fail date": "  01/01/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "On Saturday November, 24, at approximate 9:45 am I was driving uphill and noticed my engine was making an odd sound. It made it when I accelerated, but stopped as soon as I took my foot off the gas. As I got to the top of the hill, there was no more sound. About 1 minute later I pulled into a shopping center, the car was on a slight upward angle, and I was going to turn into a parking spot, when all of a sudden my car accelerated on its own valition. I was approximately 2-3 feet away from a parked car, and my car felt like it was going full speed towards this car. At the time, I believe my foot was on the brake, which made it even more shocking why the car was propelling forward. I quickly stomped on the brake again and the car came to a stop. It hit the parked car with two occupants.", "fail date": "  11/24/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "2016 Honda Pilot a/c grinding noise after activated at cold start after more than 36-48 hours parked. When a/c activated while driving vehicle belt system slips and pulls forward loosing speed. A/c compressor damage confirmed by dealer and Honda confirmed and acknowledged problem due to severe loop on the a/c suction hose design on this model causing issues with the oil flow. Issue found at 12,444 miles and current mileage 17,874 . Ongoing issue since 2016. No fix at the moment according to Honda. According to this there's an issue with the clutch engagement which explains the loss of power on the belt system.", "fail date": "  11/06/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Honda Pilot 2016 model with 30000 miles has stalled on highway interstate suddenly within 2 min of signalling messages of engine temperature too hot, transmission system problem, emission system problem etc. . . And went into neutral mode with failure of brakes. Car would not respond to brakes as it went to neutral state. Also noticed a burning or gasoline smell inside the car . I had to apply parking brake to stop the vehicle from moving on highway which could have led to a major crash. As I was not on the speeding lanes, things were not worse. I had to call 911 and they helped me move my car to a shoulder and later towed to Honda dealership. This was the second time happening for the same issue where earlier it happened on a local road. The same dealer kept the car for a week and returned the car saying its fixed. Within 30 min of driving into the highway, it stalled again this time the situation being on highway. The car is now returned to same dealer who fixed first time and is under investigation.", "fail date": "  10/05/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "[2016 Honda Pilot exl awd with sensing, 28 k miles and 2. 4 years since purchase] on Friday Aug/24/2018 while driving home (around 40mph) the vsa light came on and stayed on for barely 4-5 seconds and then turned off. Did not notice any major issues then. On Sunday 26/Aug/2018 while driving at around 30-35 mph, the car suddenly lost power and came to a complete stop almost like the brakes had been applied (did not notice the orange brake sign or the collision warning beep sound). I was on the right lane with no one behind or ahead of me and no obstacles in front. Turned on the hazard light and then noticed that the vsa light was on. Car would not move and just kept revving when I tried to accelerate. Put the car in park and then in drive, no change. Pushed the vsa button to turn off vsa and both the vsa light and the vsa off light stayed on but the car would still not move. Shut down the car and restarted it after which the lights went off, and the car started moving (although slowly). Drove home with vsa turned off and at a speed of around 20-30 mph. The abrupt braking/stopping was particularly dangerous and would have caused a collision even in regular traffic on any other day. Note: the key fob was low on battery and the only other warning I had on the console was one informing about the key fob battery being low.", "fail date": "  08/26/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "I was traveling on a two lane highway at a speed of around 75mph. I needed to slow down so pulled my foot off accelerator and slowed by about 10mph. When I went to accelerate again I had no power and the car began to decelerate for the next 10-15 seconds. I had no power and had a car coming in close behind me and a big rig to my right. This was a dangerous situation. The car finally kicked into gear after several attempts to accelerate. After taking it to Honda to be checked they said they could not \"duplicate\" this nor find anything in the log but Honda has placed an extended warranty on the transmission. An extended warranty isn't going to save our lives if this situation occurs again. Honda needs to address this issue.", "fail date": "  07/06/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Vehicle randomly cuts power to engine. While vehicle is in motion, stability control symbol flashes when accelerator is pressed and power is cut from the engine causing vehicle to slow. Releasing accelerator allows vehicle to coast and stability control symbol on dash goes away. As soon as accelerator is pressed again, stability control symbol flashes and power is once again cut from engine. Very scary on freeway. Pulling over and putting into park and drive does not correct issue. Vehicle must be turned off and turned back on to reset. Imagine how scary this will be doing 70 on the freeway and power being cut from the engine surrounded by traffic and unable to get to the shoulder to turn the vehicle off and reset the system.", "fail date": "  12/09/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "I had pulled out of a parking place and was waiting in the traffic lane to exit the area. There were two cars in front of us. The cars were stopped. I was approximately 20-25 feet behind the car in front of me. I took my foot off the brake in my car to let it idle forward. As I approached the yukon I reapplied the brake. The car accelerated to what sounded like full rpm's and I applied the brakes as hard as I could and nothing happened. The car slammed into the yukon with such an impact that both front airbags deployed. The driver side airbag hit me in the face. The passenger airbag did not reach my wife in the passenger seat. She immediately experienced severe chest pain and rapid heart beat. Bystanders called 911 and two park rangers arrived in approx. 15-20 minutes. The rangers finished taking pictures and asked me to pull in to a parking spot out of the travel lane of the parking lot. I started the car and proceeded slowly and turned into a parking spot. As I applied the brake to park, the same phenomenon occurred again. The car accelerated forward over a curb and walkway and struck a pedestrian before coming to a stop on a retaining wall. I desperately tried to stop the car without success. The ems was there shortly after this occurrence. A ranger asked me how fast I was moving and I stated I had no idea. I asked him to ask the ranger who was right behind me and he said 5 mph. I exited the vehicle after they transported the pedestrian on the backboard. The ambulance was ready to take my wife to the hospital so I approached the park ranger and told him that I needed to ride in the ambulance with my wife.", "fail date": "  09/24/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Purchased a 2016 Pilot ex-l certified used with 8k. While pressing the brakes, they would go pretty far down before engaging. If I let up on the pedal and press again, they immediately grab like they are supposed. I have taken the vehicle in several times, brakes bled and flushed, still the same. I was informed that Honda says the distance of brake pedal pressing down is 2\" is normal. I also had issues with the screen going out, and the driver side vent wouldn't stay up, and the a/c wasn't cooling property. Also the system wont connect to my phone randomly. I now had a problem with the transmission. Makes a rattling noise while driving/coasting at any speed. Have taken it in and was told it was the bumper and hood noise. After paying for that, I still have the noise. The rpms jumps from under 2 to just above two, then down again. When the rpms do this the noise happens and also the econo mode turns off to white, then green again. Now it feels like when this happens the transmission feels as iff it is trying to go into gear, slipping. Now when driving and trying to pass, it seems to slip. It is definitely a safety issue! come on Honda please fix the issues.", "fail date": "  09/01/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "My family traveled in this vehicle to carlsbad last week for vacation, including myself, my wife, our 13 year old daughter and 11 year old son. The vehicle worked perfectly until we were on our way home Saturday, July 22, 2017. We were on I-10 approximately 1 hour east of phoenix in the right lane with the cruse set at the 75mph speed limit. There were no cars in front of us for at least a mile. All the sudden, without any warning whatsoever, nearly all the vehicle system lights came on and the vehicle slowed at an emergency rate down to approximately 40mph in about 2 seconds. I immediately hit �cancel� on the cruise and stepped on the gas, but the vehicle continued to slow quickly. I immediately started to move to the shoulder of the road and noticed the 18 wheel tractor trailer behind us make an emergency swerve to the left and missed hitting us by inches. We were nearly involved in an accident that could have easily been fatal. All this took place in about a 5-10 second timeframe. After stopping on the shoulder of the road I made note that the vehicle was showing a transmission problem, an emissions problem, an awd problem and I think just about every other issue light was lit up. I tried to get the vehicle back on the road, but it would not go any higher than 3rd gear and the dash kept indicating a transmission and awd problem. I pulled over again and turned the vehicle off and back on. At that point the only indicator light that lit up was the emission system problem (see attached picture). I reentered the interstate and the transmission was working properly again. We stopped at the next gas station and filled the gas tank and upon restarting the engine the emission light was still on. We carefully drove home at 65�70mph. The following day (Sunday), the emission light was no longer on.", "fail date": "  07/22/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Vehicle has a lurching jolt when at a stop and go into 1st/2nd gear. Very noticeable downshift when breaking as well, with more lurching jolts.", "fail date": "  09/02/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "This is a follow up to complaint 10881962 in which one of my fears has come to fruition. I was driving my car in the normal mode (acc and lkas disabled) on a normal two lane paved road when the car in front of me made a slow right turn. I was not following very closely and came to a complete stop on my own to avoid running into the other car. I stopped about 15 feet away from the other car. The other car then completed the turn to the extent that the other car was no longer in the way of me driving forward in a straight line. When I pushed the gas to then proceed the collision mitigation system started flashing the \"brake\" message and producing an audible warning. At this point I was possibly going 10 mph again. After verifying that there was definitely not anything in my way, I kept applying the gas. My car then started braking on its own, at which point I pushed the gas harder to presumably over-ride the braking. A moment or two later, my car then made a sudden and hard brake on its own that brought my car to a complete stop, despite the fact that I was pushing hard on the gas. The other car that had turned was well clear of the lane by this point, and was easily 1 ft away from my path of travel when I started accelerating in the first place. My only explanation is that the collision mitigation system was confused by the lack of a shoulder lane marker (only a raise cement curb was present) and somehow thought the car was still in the \"road. \" in either case, the system malfunctioned to the point that my car was suddenly brought to a complete stop, and the car behind me very nearly rear-ended me in a situation where I had already come to a stop, and the obstacle in front of me had cleared / continued to become increasingly more clear of my path. The situation was dangerous and clearly misinterpreted by my car.", "fail date": "  08/11/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Hi, I got a strange problem in my car as per the attached image. Thanks,.", "fail date": "  06/09/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Vehicle loss acceleration while traveling at 65 mph (engine still running) speed slowed to 25-30 mph then returns to full control. This happened in rush hour traffic in atlanta and several times on open highways. Honda updated the pcm and tcm and it did not solve the problem. Dealerships say they cannot replicate the problem so they can not fix it. This has happened 3 times.", "fail date": "  04/13/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "There is pulsating vibrations when applying brakes. This vehicle is rarely driven and has only logged 25,642 miles since I first bought it in 2016. I believe the rotors are warped. Must be a defect as this vehicle is rarely used.", "fail date": "  05/30/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "There have been multiple times where the automatic emergency braking system engaged almost causing an accident with no car ahead of me. The latest incident caused a whiplash related injury to my daughter's neck. The tractor trailer behind me also locked up the brakes and luckily did so in time to avoid colliding with my car.", "fail date": "  02/12/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Steering wheel shaking violently when braking especially at highway (down hill) speed.", "fail date": "  08/01/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The Pilot defaults to the automatic engine shutoff when the brake is pressed. Several times, my car would shut off at the stop, but not restart when I took my foot off the pedal. When I'd go to restart the car, pressing the start engine button would just turn on accessories - it would never engage the gas/ignition. I'd have to give it a few minutes. I took it to my dealership who replaced the push button ignition. I had googled the issue and saw others had the same issue and warning message about the brake mitigation system, I saw that it was likely related to the brake booster/vacuum hose. I brought it back to the dealer the following month as the shut off had happened again and explained again about finding the brake booster as the issue. They replaced the part and the stall out hasn't happened again. It was never a consistent issue. I don't know what caused it to shut off, as it happened in cold or warm weather. Having to press the brake really hard is not a natural step in driving, so I'm thinking there's something wonky with the system. Even when I remote start my car, I have to press the brake pedal extremely firmly to have it remain started when I go to drive. Otherwise, the car will just switch to the accessory mode. This is a risk because the car defaults to the auto engine shut off when in traffic. If a car is unable to restart when the brake pedal is released, accidents can happen.", "fail date": "  02/01/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Since buying this vehicle the transmission and computer module have already been replaced once due to similar problem. While my son was driving around a corner on a city block so turning left at 15 miles per hour the transmission suffered a failure and error message and accelerated forcing him off the road. Dealer has denied any assistance.", "fail date": "  10/21/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "While idol at red light, the automatic idol kicked in for power save yet jerked and all red light indicators turned on, including parking breaks, and car seized up. No power, no ability put car in park or drive. On/off switch no reaction to turn car on or off. No brake function. I sat in an unresponsive vehicle at very busy intercetion. Luckily the vehicle behind me was stopped and only laid on their horn for 2 red light cycles rather than hitting me. I activated my emergency flashers yet other driver did not respond. I repetitively kept pushing power button in effort for car to respond and restart, eventually did and was able to drive off. Have appt with dealership in am.", "fail date": "  07/10/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "It engine is idle all the time when the ac is on.", "fail date": "  04/18/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "My vehicle was in motion on a neighborhood street when several alerts went off on my dashboard: road departure mitigation system problem, trailer stability assist problem, hill start assist problem, vehicle stability assist problem, emissions system problem, power steering system problem. I could find no reason for these alerts. I took my car into a dealership the next day and was told there was no issue and the lights were turned off. 10 days later they all came on again as I was driving on a local street. The next day when I went to take my car to the dealer, the lights had turned off. I took it in anyway, and they again said there was no issue. I reported the issue to Honda corporation and was told by one agent that this wasn't the first time the issue had come up in a newer model Pilot. Again 2 days ago, all the lights came on and now also the brake assist alert is also on. I will take it to the dealership again. I am concerned all the false alarms may be hiding an underlying issue that could result in a dangerous accident. I also feel that Honda global is not taking me seriously as I am active duty stationed overseas and have to rely on local Honda dealerships that do not have much experience with the Honda Pilot. The dates of the lights were 17 sept, 27 sept, and 6 oct 2018.", "fail date": "  09/17/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The contact owns a 2016 Honda Pilot. The contact stated that while driving approximately 80-85 mph uphill, the accelerator pedal was depressed and the warning message \"transmission overheating\" was illuminated. The contact stated that he continued to drive at a slower speed. The vehicle was taken to the dealer who informed the contact that they could not replicate the failure. The contact stated that the failure reoccurred while driving uphill. The vehicle was taken to a second dealer, moss bros. Honda (27990 eucalyptus Ave, moreno valley, CA 92555) who did not diagnose the vehicle but informed the contact that the transmission fluid needed to be flushed and replaced. The vehicle was taken to an independent mechanic and the transmission fluid was replaced. The contact also stated that the steering wheel was shaking whenever the brake pedal was depressed. The vehicle was taken to the independent mechanic where it was diagnosed that the front rotors needed to be replaced. The contact stated that he was unable to replace the front rotors himself as there were abnormally small compared to the replacement parts. The contact also stated that the front rotors were abnormally smaller than the rear rotors of the vehicle. The vehicle was not repaired. The manufacturer was notified of the failures and a case was opened. The contact was awaiting a call back from the manufacturer. The failure mileage was approximately 33,000.", "fail date": "  02/25/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "I am hearing a clicking noise when I step on the brakes. I took it ro Honda and they said it's something people complaining about and they don't have a fix and thwy know about it. They don't know how to address the situation.", "fail date": "  10/13/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "I had pulled out of a parking place and was waiting in the traffic lane to exit the area. There were two cars in front of us. The cars were stopped. I was approximately 20-25 feet behind the car in front of me. I took my foot off the brake in my car to let it idle forward. As I approached the yukon I reapplied the brake. The car accelerated to what sounded like full rpm's and I applied the brakes as hard as I could and nothing happened. The car slammed into the yukon with such an impact that both front airbags deployed. The driver side airbag hit me in the face. The passenger airbag did not reach my wife in the passenger seat. She immediately experienced severe chest pain and rapid heart beat. Bystanders called 911 and two park rangers arrived in approx. 15-20 minutes. The rangers finished taking pictures and asked me to pull in to a parking spot out of the travel lane of the parking lot. I started the car and proceeded slowly and turned into a parking spot. As I applied the brake to park, the same phenomenon occurred again. The car accelerated forward over a curb and walkway and struck a pedestrian before coming to a stop on a retaining wall. I desperately tried to stop the car without success. The ems was there shortly after this occurrence. A ranger asked me how fast I was moving and I stated I had no idea. I asked him to ask the ranger who was right behind me and he said 5 mph. I exited the vehicle after they transported the pedestrian on the backboard. The ambulance was ready to take my wife to the hospital so I approached the park ranger and told him that I needed to ride in the ambulance with my wife.", "fail date": "  09/24/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Purchased a 2016 Pilot ex-l certified used with 8k. While pressing the brakes, they would go pretty far down before engaging. If I let up on the pedal and press again, they immediately grab like they are supposed. I have taken the vehicle in several times, brakes bled and flushed, still the same. I was informed that Honda says the distance of brake pedal pressing down is 2\" is normal. I also had issues with the screen going out, and the driver side vent wouldn't stay up, and the a/c wasn't cooling property. Also the system wont connect to my phone randomly. I now had a problem with the transmission. Makes a rattling noise while driving/coasting at any speed. Have taken it in and was told it was the bumper and hood noise. After paying for that, I still have the noise. The rpms jumps from under 2 to just above two, then down again. When the rpms do this the noise happens and also the econo mode turns off to white, then green again. Now it feels like when this happens the transmission feels as iff it is trying to go into gear, slipping. Now when driving and trying to pass, it seems to slip. It is definitely a safety issue! come on Honda please fix the issues.", "fail date": "  09/01/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Vehicle is 16 months old with only 5,200 miles on it. Braking action currently seems unaffected, however, the brake fluid reservoir had green algae on the strainer, heavy black sediment on the floor of reservoir, and the fluid was brown. The reservoir was never opened until 2 days ago when I noticed the fluid was brown while looking through the side of the reservoir as I was checking the fluid level and decided to investigate further. The cap was properly sealed because there was a slight suction as I began to lift the cap after twisting and the seal was in perfect condition. The Honda dealer stated that Honda would not cover under warranty a fluid flush because they assume it was from something I did and further assumed it would not be from contaminated fluid they put in at the factory. As a result I just flushed the system myself with dot 3/4 synthetic fluid. My complaint is that Honda may have used contaminated brake fluid at the factory that could have affected other cars or, if not, something specifically happened to my vehicle prior to my purchasing of it from Honda.", "fail date": "  03/12/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "I was driving in the rain at about 30 miles and hour towards a red light. I began to slow down with the brakes, but the car would not stop and skidded right through the red light. I also tried steering the car to the right, but the car would not steer right and kept skidding through the red light until it slightly hit the median and stopped. Luckily, no oncoming cars were coming or my car would have went right into them. The tires claim to be \"all weather tires\" which are bridgestone dueler tires, 245/60r18. On other occasions in the rain, I have felt the car skid when tapping on the breaks while turning, but not to the extent of yesterday when I could have been in a terrible accident. I also read on line of another person reporting skidding while turning in the rain in a Honda Pilot. Something happens with this car in the rain that causes the brakes to not stop the car and instead skid as if it is on ice without control of the steering at the same time.", "fail date": "  01/03/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "I have the Honda awd 2016 touring model with z transmission. Since purchase, the vehicle will acceralte by itself when driving down the slope between 25 -30 miles per hour, the break will not stop the speeding, and actually will reduce the speed and it appears transmission will force the speed goes up against the break. During the drive, at this range, when accelarate, the vehicle will make a squik sound by the tire level, almost feel the tire is trying to catch up with the speed of transmission and won't turn as fast as it could and hence the squik sound, the vehicle is about 24 k miles and very challenging in driving this car. Need this to be replaced as the z transmission recall is starting by other manufactures. . The worst is the speed of the car at drive down slope and could kill anyone due to it actually automatically start speeding even though my foot is on brake.", "fail date": "  10/01/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Collision mitigation braking system (cmbs) does not work in stage 2 or stage 3. Only the warning light comes on. Brakes are never applied. Going more than 10 mph faster than the car ahead of you, only stage 1 comes on with a warning notice. No light braking for stage 2. No hard braking for stage 3. I am emergency vehicle operator course trained. I had someone who I know keep a constant speed of 30 mph and then retested again going 50 mph. I would approach going 10 mph faster than the lead car and only stage 1 warning would activate, even when I was only 10 feet away before I had to manually apply the brakes hard. Apparently Honda/accura had an earlier issue with the cmbs falsely activating due to being too sensitive. They did a software update but now it is not activating stage 2 or stage 3. This occurs no matter what setting ( long, normal, short) you have the cmbs set to. I brought it in twice to the dealer and although the service tech test drove it and couldn't get the brakes to work the computer stated everything was fine. Honda tech line was also called by the dealer and they said if the computer said there was no errors there is nothing to do. I called Honda corporation and they also said there was nothing that could be done. Automatic cruise control works so it can't be the radar or camera. This is a 2016 Honda Pilot elite with cmbs.", "fail date": "  04/23/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "I moved car out of driveway so friend could leave garage. When I went to put car back in driveway, the car would not stop and hit the car in other side of garage. When I put the car in reverse to move away from car/garage the car would not stop in reverse. I turned the wheel to prevent car from hitting trucks in driveway across the street I hit neighbors mailbox and broke tail light and left a paint scratch along entire driver side of vehicle. I called a tow truck drive who said there was something wrong with car brakes when he moved car to bed of his truck. He used emergency brake to stop car. The Honda dealer I had the car towed to was in myrtle beach, SC. The tech said he ran all the diagnostic tests and did not find anything except an ac issue. The area service representative also tested the car and said it was \"safe to drive\". I did drive it to raleigh later in the week and then home to chantilly va. I have had no repeat issues but I am very cautious when I apply the brakes at a low speed for a stop sign or red light.", "fail date": "  03/21/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "2/4/backed out of garage, put car in park, lowered garage door. Was about to exit vehicle to adjust passenger side mirror, car surged forward, crashing through garage door. Brakes would not stop vehicle as it was crashing through the garage; immediately applied emergency brakes, car finally stopped against shelving in garage and wten became wedged in garage. Car experienced severe damage to front, hood, top, sides and could not be removed from garage until garage doors were removed by garage door company the next day. On 2/5/16 took car to Honda dealer. Said they needed time to investigate, would need until Monday, 2/15 when manufactuere's rep could be there; gave loaner vehicle to use in interim. Car still had dealer tag, one month old. On 2/17, received a call from service manager stating that Honda rep's investigation found nothing wrong with vehicle and that I would need to look to my insurance company to repair vehicle. I was told to return loaner vehicle that day, which we did. There was over $2,000 damage to home; and $8,836 damage to vehicle. I find it amazing that Honda could find nothing wrong with vehicle. I know for a fact that the car was in park and nothing would make it stop. The car is brand new - Honda knows that something is wrong; there are other vehicles that have had the same problem. I will not feel safe in the car for one minute when the repairs are completed (taking 24 days to repair). And, it is a damaged vehicle with the dealer tag still on it!.", "fail date": "  02/04/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "2016 Honda Pilot surge while trying to stop on a city street and 2 times ended up part way in the intersection. No warning lights on dash. Had Pilot about a month. Only drove about 500 miles. Concerned, so keep longer distances in traffic. Setup an appointment today with local dealer to inspect per his schedule in 4 days.", "fail date": "  02/03/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "When stopped at a red light with my foot on the brake and the engine in idle, the engine turned off when I put my foot on the gas peddle. The engine idle stop was on. This occurred while stopped in city traffic (6/2022) and again when I was stopped at a red light on a highway (9/3/2022). The car rolled backward. I had to put the car in park and restart the car. I now have manually turned off the engine idle stop.", "fail date": "  09/03/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "While driving on the highway on cruise mode, the car was driving fine. Then suddenly, cruise mode turns off, and the following four lights appeared on the dash: emissions system problem, vehicle stability assist problem, hill stability assist problem, and steering problem. When the car attempted to accelerate, it would not go above 50 mph on a 70mph highway. When it did go above 50mph, the car would bounce as if it was on a bumpy road even though the road was smooth. Additionally, when the problem would appear again, the car would suddenly slow down, increasing risk for an accident with the other cars driving so fast. We have bought many cars in the past but this was the first time we have ever experienced a problem like this with a Honda vehicle. I came on here to send this message to make other drivers aware that this is a common problem that 2016 Honda Pilots have been experiencing, according to some mechanics.", "fail date": "  06/20/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "�driving at 35 mph on my way home on a side street and my car jolted and stalled and several (5)warning lights came on. Vehicle stability, brake, trammision warning, and a couple other lights. I turned the vehicle off and restarted the car. I tried to drive it in a parking lot so I was able to get safely out of oncoming traffic . And it would not shift properly and I couldn+t drive it at all as I would try to start and it wojld rev to 4000-5000 rpms and would pop in and out from gear to park. . I had it towed from the parking lot I was in to my machanic . My concern is that I don+t feel safe driving on the highway with shifting issues, stalls and jolts that have happened if I were on the highway when that happened, going at 65 mph, it would have caused unnecessary accidents. It+s extremelyndangerous with my children in the car as well as innocent bystanders still no recall for my vehicle.", "fail date": "  06/27/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "Multiple warning lights on the dash, check engine light is on including road departure mitigation warning, trailer stability assist warning, hill start assist warning, vehicle stability assist warning, emissions system control warning, all wheel drive system warning, power steering warning and acc warning where all came up at the same time with a sudden jerk and car cannot go beyond 20 mi/hr while I was driving in the highway that almost got me into an accident with an individual on the rear almost bumped me. Now I'm afraid to drive it. I actually got the attention of my dealer (norris Honda) when the jerking started at the mileage of 34,100 miles and happened several times but with no warning light coming on. They did a test drive and it so happened that it didn't happen when they tested it and no check engine light on. They told me that they have had several incidence of the same problem with other customers with Honda Pilot 2016 and 2017 and is a common issue and ended up having to change the fuel injectors and have solved their problem. The problem though is, my car is only 3yrs old and having all these problems now and they charge $1800. 00 to change the injectors, which I think is way too much for a fairly new car with dealer being aware of the first jerking problems before the warranty ended. I have been having all Honda cars since I started having a car because of its reliability and performance and now this happened. It has been a very common problem but no recall has been made. I hope that there will be no accidents with one losing life before a recall is made. I hope you can help me out with this, thank you.", "fail date": "  01/10/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "My vehicle was in motion on a neighborhood street when several alerts went off on my dashboard: road departure mitigation system problem, trailer stability assist problem, hill start assist problem, vehicle stability assist problem, emissions system problem, power steering system problem. I could find no reason for these alerts. I took my car into a dealership the next day and was told there was no issue and the lights were turned off. 10 days later they all came on again as I was driving on a local street. The next day when I went to take my car to the dealer, the lights had turned off. I took it in anyway, and they again said there was no issue. I reported the issue to Honda corporation and was told by one agent that this wasn't the first time the issue had come up in a newer model Pilot. Again 2 days ago, all the lights came on and now also the brake assist alert is also on. I will take it to the dealership again. I am concerned all the false alarms may be hiding an underlying issue that could result in a dangerous accident. I also feel that Honda global is not taking me seriously as I am active duty stationed overseas and have to rely on local Honda dealerships that do not have much experience with the Honda Pilot. The dates of the lights were 17 sept, 27 sept, and 6 oct 2018.", "fail date": "  09/17/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "When starting the car it shows the message on the screen \"power steering system (eps) problem. This problem started within 6 months I bought this car, but I did not take it as serious, but now it always shows this message. At first this problem was only on extreme cold weather, but now it shows at least once in a week.", "fail date": "  04/26/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "When starting the car it shows the message \"power steering system (eps) problem\". First I noticed this problem within 6 months of I bought this car and at that time I did not take it as serious, but now at least once in a weeks it shows this message.", "fail date": "  04/26/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "On my 2016 Honda Pilot, all the lights come on in the dashboard ex; vsc, check engine, abs, power steering. Took it to Honda and they performed a software update. Two days later the same problems occurs.", "fail date": "  01/05/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "Steering wheel is not straight since I bought the car. I took the SUV several times and they said that is a defect on the chassis or something like that . They said that Honda's engineer are working on this issue. Now is more than a year and my SUV has same problem still.", "fail date": "  03/02/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "I was driving in the rain at about 30 miles and hour towards a red light. I began to slow down with the brakes, but the car would not stop and skidded right through the red light. I also tried steering the car to the right, but the car would not steer right and kept skidding through the red light until it slightly hit the median and stopped. Luckily, no oncoming cars were coming or my car would have went right into them. The tires claim to be \"all weather tires\" which are bridgestone dueler tires, 245/60r18. On other occasions in the rain, I have felt the car skid when tapping on the breaks while turning, but not to the extent of yesterday when I could have been in a terrible accident. I also read on line of another person reporting skidding while turning in the rain in a Honda Pilot. Something happens with this car in the rain that causes the brakes to not stop the car and instead skid as if it is on ice without control of the steering at the same time.", "fail date": "  01/03/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "My car has a variety of dangerous behaviors in the driver assist functionalities that could either cause or fail to prevent an accident. I have only driven it 2,000 miles but observed these many times. I reported these to the dealer and was told the car was fine. Adaptive cruise control issues: - fails to detect vehicles in odd situations, such as a truck where the rear of the body protrudes out from the rear wheels, as if the radar is only at ground level, or if a vehicle is driving in my lane but one tire is in the other lane, or a wide load which occupies all of the adjacent lane and half of my lane, or a \"bobtail\" truck. - after an empty stretch, upon coming up to a slower car, rather than slow gradually by easing off the gas, the car will get very close to the car and then rapidly brake, causing drivers behind me to nearly rear-end me. Collision mitigation: - all of these trigger \"brake\" messages to be displayed, which is just 1 step before the brakes being auto-applied, which could cause me to be rear-ended. - false alarms while merging from lefthand onramps where a pending collision with the jersey barrier is detected - false alarms by the hills adjacent to the road when going around a sharp turn on back roads - false alarms when cresting a hill with a curve after the hill and it thinks an oncoming car will be hit, because it can't see the lane markings past the hill lane keep assist: - partially goes into exit ramps on its own if in the right lane, causing other drivers to think I am leaving the lane and start to merge themselves - is confused by lines of tar and will depart the lane on its own - often \"fights\" with the lane departure mitigation around corners - tries to prevent me from giving other vehicles some buffer when passing them, if they are wider or drifting toward me. - does not alert when it stops being able to detect the lines.", "fail date": "  09/01/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Hi. Soon after I bought the car the steering wheel is making a loud cleacking noise. I took it to the schaumburg Honda dealer and they replaced the cable reel under the airbag 4 times. They replaced the wrong part while the car was under the manufacturer warranty. Now the car has no warranty and they said Honda knows about the faulty airbag and they do not want to replace it. When you turn the steering wheel to the right or to the left is making a loud cleacking noise. I have all the paperwork. Please help me so no one will get injured or killed on the road. Thank you.", "fail date": "  10/26/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Got into a frontal collision and the airbags didn't deploy. Srs airbag system problem appeared on the dash.", "fail date": "  05/03/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Keyless start system problem goes on and off.", "fail date": "  08/26/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Vehicle is in motion on highway when getting airbag system (srs) problem.", "fail date": "  01/05/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Passenger's seat airbag connector will not connect to the original airbag.", "fail date": "  03/15/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "While driving on residential street 5 to 10 mph both airbags deployed front passenger and driver side vehicle did not have any accident or hit no undercarriage damage I also have more photos plus a video showing vehicle did not have any damage.", "fail date": "  05/27/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Headlights problems", "description": "On January 13th, I left my home to pick up my son, julian, 3 years old, at preschool. His preschool is approximately 3 miles from our home. I picked him up, and drove the same distance back to our house, arriving home around 4:45pm. I had no unusual warning notifications or any unusual experience driving to and from the preschool. I parked the car in our driveway. Julian and I exited the vehicle, and walked to our front door. As we approached the front door I smelled smoke, and looked back at the car. I noticed a small flicker in the passenger side lower headlight. Upon closer look, I realized this was in fact a flame. Julian and I left our bags on the porch, stepped off of our front porch, and moved away from the house and car, and called 911. As we waited for the fire department, we watched this small flame grow to full flames, engulfing the engine, front hood, and front of the car. The police and fire department arrived, and put out the fire. The car was towed out of our driveway. A police report was filed with the montclair police dept. Officer anthony swan #232 patrol division montclair police headquarters, 647 bloomfield Ave. , montclair NJ 07042 aswan@montclairnjusa. Org report # 20-005325 I then called our insurance provider, usaa, following the incident. They have taken the car into their possession and initiated an origin & cause investigation. We purchased the car new. We have not been in a collision. The car has been serviced twice annually. It was serviced last week. It has ~30,000 miles on it. The dealer that sold us the car, paul miller Honda, in NJ, has been unresponsive, telling us to reach out the the national Honda office. I have filed a case with Honda, and have been told someone will reach out to me. That has not happened.", "fail date": "  01/13/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Headlights problems", "description": "The contact owns a 2016 Honda Pilot. The contact stated that the illumination level from the headlights was at an unsafe brightness level. The contact had difficulty seeing while driving at night. The vehicle was taken to the dealer, but was not diagnosed or repaired. The manufacturer was notified. The VIN was unknown. The failure mileage was 40.", "fail date": "  09/22/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Headlights problems", "description": "The contact owns a 2016 Honda Pilot. The contact recently purchased the vehicle; however, the headlights were dim. The contact adjusted the headlights and stated that they could not replace the headlights. The failure mileage was unknown.", "fail date": "  10/02/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "I purchased a brand new 2016 Honda Pilot ex. After the salesman pitch about adding top-notch safety, I paid extra for the Honda sensing package (include collision mitigation braking system) as it was not a standard in 2016. Currently my SUV has less than 14000 miles. The collision mitigation braking system (cmbs) has been warning and applying brakes when it should not for many years. Recently I drove on a highway that had construction for about 3 miles on a clear day. The car was the previous day and had nothing obstructing the camera on windshield or the radar behind the Honda badge. One lane was closed and there were flat surfaced traffic barrier (similar to cones) has been setup for the entire construction strip. About half into the construction zone, my SUV instrument panel had a warning that read \"collision mitigation system problem\". When I noticed the warning sign is not disappearing after restarting several times, I disconnected the battery and connected it after a day. The warning sign did not go away. Then I took the SUV to the dealer from whom I purchased the vehicle. They washed the car but the warning sign is still active. The warning sign cannot be turned off using the physical button for the cmbs on the dash. Searching through the internet, I see that this is common problem among Honda owners. Many owners who experience this issue report that when they took the SUV to the dealer, they reported that the cmbs was overwhelmed by the construction barriers and the only way to fix this is to recalibrate the cmbs at dealer that costs about $500. However, this is only a temporary fix until the SUV drive through a construction site. I purchased Honda sensing for the safety of my family. Instead Honda has provided defective system that fails when driving through a construction site. Construction sites are common occurrence in everyday driving. Honda sensing cmbs is a good money maker for dealers as they get to recalibrate the system for high fee.", "fail date": "  06/11/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "Automatic brake light comes on at random times while driving at higher speeds. Afraid that one of these times it will stop the car at high speeds.", "fail date": "  02/24/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "There have been multiple times where the automatic emergency braking system engaged almost causing an accident with no car ahead of me. The latest incident caused a whiplash related injury to my daughter's neck. The tractor trailer behind me also locked up the brakes and luckily did so in time to avoid colliding with my car.", "fail date": "  02/12/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "I have manually turned this feature off, it has o. Three separate occasions applied the brakes without any vehicle's around. Honda diagnostic was ran shows nothing wrong. So I have turned it off.", "fail date": "  11/19/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Wheel", "Sub Problem": "Wheel problems", "description": "I was driving at 15 mph and my car jolted and stalled and several (5) warning lights came on. Vehicle stability, brake, power steering, and a couple other lights. I turned the vehicle off and restarted the car. I tried to drive it a few miles and it would not shift properly and I couldn't drive it more than about 20 mph. I had it towed from home to the closest Honda dealership. The vehicle had around 40k miles on it at the time. Honda said it's a known issue with a bulletin - stating that the cam shaft assembly needed to be replaced along with a sensor. They told me the cam shaft assembly was under the power train warranty but I had to pay for the sensor. When I did a little research, I found that Honda was giving extended warranties to newer models having the same issue and even doing recalls but my VIN didn't qualify. A few months down the road and my car started having shifting problems again. So, I take it in and they are saying the transmission needs to be serviced but the service only gets a little bit of the fluid out so they wanted to do the service 3 times and charged me for doing the same thing 3 times. After some research, I find out that it's a known issue that they are willing to give a limited warranty on up 80k miles. My concern is that I don't feel safe driving on the highway with shifting issues, stalls and jolts that have happened within 4 months of each other. If I were on the highway when that happened, going at 60 mph, it would have caused unnecessary accidents. It's dangerous but, still no recall for my vehicle and it's like fighting tooth and toenail with Honda to get them to do what is right. I don't know when or if it will happen again. I purchased my Honda brand new. This vehicle needs to be off the roads until the issues are fixed. I think I have a lemon!.", "fail date": "  06/21/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Wheel", "Sub Problem": "Wheel problems", "description": "The tires made by goodyear and sold under the brand continental appear to be failing. My vehicle 2016 Honda Pilot touring wish I have had for approximately 18 months appears to be factory installed tire that are a potential road hazard that may lead to serious injuries and or death. I drive in California with posted speed limits of 70 miles per hour. A blow out at this rate of speed may and have caused deaths in the past. Which have included but not limited to Ford motor CO. Vehicle explorer vehicle recall. I do not want to see my daughter in a casket just because a company refuses to take responsibility for faulty equipment. My tires are missing chunks and it make it hard to drive safely.", "fail date": "  04/30/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Wheel", "Sub Problem": "Wheel problems", "description": "The tpms system isn't monitoring the wheels sensors. The sensors were check and are good. The problem is that tpms system that not appear in the control panel to reset this. The light of tpms system is on all the time. This occured to 37,000 milles aprox.", "fail date": "  03/29/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Wheel", "Sub Problem": "Wheel problems", "description": "1. I am getting static on the radio, the dealership is not solving this issue completely. I know by turning on and off the car it will resolve it for an amount of time and it comes back. This occurs when driving and not driving. 2. Issues with tire low pressure the dealership is not solving this issue completely. I know by adding air it will resolve it for an amount of time and it comes back. This occurs when driving and not driving.", "fail date": "  09/20/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Wheel", "Sub Problem": "Wheel problems", "description": "I was driving in the rain at about 30 miles and hour towards a red light. I began to slow down with the brakes, but the car would not stop and skidded right through the red light. I also tried steering the car to the right, but the car would not steer right and kept skidding through the red light until it slightly hit the median and stopped. Luckily, no oncoming cars were coming or my car would have went right into them. The tires claim to be \"all weather tires\" which are bridgestone dueler tires, 245/60r18. On other occasions in the rain, I have felt the car skid when tapping on the breaks while turning, but not to the extent of yesterday when I could have been in a terrible accident. I also read on line of another person reporting skidding while turning in the rain in a Honda Pilot. Something happens with this car in the rain that causes the brakes to not stop the car and instead skid as if it is on ice without control of the steering at the same time.", "fail date": "  01/03/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Wheel", "Sub Problem": "Wheel problems", "description": "I have the Honda awd 2016 touring model with z transmission. Since purchase, the vehicle will acceralte by itself when driving down the slope between 25 -30 miles per hour, the break will not stop the speeding, and actually will reduce the speed and it appears transmission will force the speed goes up against the break. During the drive, at this range, when accelarate, the vehicle will make a squik sound by the tire level, almost feel the tire is trying to catch up with the speed of transmission and won't turn as fast as it could and hence the squik sound, the vehicle is about 24 k miles and very challenging in driving this car. Need this to be replaced as the z transmission recall is starting by other manufactures. . The worst is the speed of the car at drive down slope and could kill anyone due to it actually automatically start speeding even though my foot is on brake.", "fail date": "  10/01/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Wheel", "Sub Problem": "Wheel problems", "description": "Hi, I got a strange problem in my car as per the attached image. Thanks,.", "fail date": "  06/09/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "There is loud clicking from the driver's power seat while attempting to adjust the height of the seat. The height of the seat cannot be adjusted, which inhibits the driver's ability to see things in front of and around the vehicle. The vehicle was inspected by a Honda dealership. The dealership said that the entire seat must be replaced at a cost of $2600.", "fail date": "  01/20/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "\"takata recall\" the passenger's side airbag of our 2016 Honda Pilot spontaneously deployed as my daughter was driving approximately 45 mph straight along route 195 in mansfield, CT on may 11, 2019. At the time of the deployment she had passed over a storm drain that sticks out into the narrow road. The drain causes a slight depression in the roadway, which the wheels rolled over. There was no impact. There was no accident. She managed to keep her wits about her so she didn't get hit on the busy, narrow road. The outside of the car is pristine. The interior is a mess. The side curtain airbag is down, blocking visibility, and the side airbag deployed from the front passenger's seat. The deployment took out the headliner and tore the passenger's seat apart. Our car has been sitting at a Honda dealership and now at a body repair facility for two weeks. Honda tells us it's not their fault. They claim we have a bent control arm on the passengers side front of the car. However, we have felt no pulling, shaking, tremors, bumping or other effects our mechanic assures us would happen with a bent control arm. We were told by the Honda dealer that repairs could cost $5,000 to $10,000 but have no official estimate. We have turned the case over to our insurance company.", "fail date": "  05/11/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "My vehicle has multiple system error messages that have come on and off when turning on the car and some have became much more frequent and remain on while driving. 1. Keyless starting system error- happens frequently when vehicle is turned on and remains on while driving. 2. Antilock brake system error- when vehicle is powered on and remains on for about 20 mins after driving vehicle and returns when car is powered on. 3. Charging system error- was coming on occasionally and as of today has came on every time the vehicle is powered on and remains on while driving. 4. Brake system problem- occasionally comes on when car is powered on and comes off after driving vehicle. Also, the most recent issues I've had was the driver seat does not warm up when seat warmer is turned on and while driving the vehicle at approximately 30mph vehicle begins to jerk as if it is struggling to drive. These problems have become much more frequent and have become a safety concern for me and my children.", "fail date": "  01/17/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "Drive seat no longer adjusts. Makes clicking noise when trying to push the button for adjustment. Short person can no longer drive because can't see over steering wheel.", "fail date": "  06/29/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The 2016 Honda Pilot has a bad headlights being too dimmed during night drives, this is especially true when your windows and windshields are tinted. Secondly, the reverse or backup lights are located in a very low position down at the bumper, wherein it may not be seen by cars from behind when we're reversing. These lighting issues are a safety risk. Third, the front seats are quite uncomfortable, poorly designed for long-drives and is a safety risk especially for hard and tight turns where we slide off to the sides of our seats.", "fail date": "  07/07/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "While driving along the highway, sunroof exploded. Small pieces of glass pieces went flying everywhere.", "fail date": "  11/01/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "I was driving down the interstate, no other vehicles in front of or beside me. I heard a loud explosion sound and saw most of my sunroof land on the road behind me. No rocks or other projectiles impacted the glass before it happened. There was no previous damage to the sunroof. There were no warnings or indications that there was about to be an issue with it. The weather was cloudy with a temperature of approximately 70 degrees.", "fail date": "  02/23/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "I am experiencing water leaking by the passenger seat. I took it to the shop and I was explained that they will have to remove the whole front part including the steering wheel to be able to fix the problem. According to the mechanic there is a sealant on rubber band that it underneath the windshield that has to be replaced since the band is really tin and need to be replace since the quality of it is not so good as the one that was used in the 2014-2015 Pilots. So I live in a state where is always raining and so the water is getting in to my car, and I have to constantly change the towels as the passenger side floor gets so wet if I do not use anything to absorb the water. This fix will take at least 5 days to be repair and will cost me over $2000 to have it repair, when this is an issued cause for the bad rubber quality that Honda used.", "fail date": "  12/04/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "Passenger and back left passenger windows either came off track or track became \"gummed up\". Both issued occurred while in motion and within a few months of each other. Window made this grinding noise when lowering and would not go back up. No incident was reported other then taking the car to the Honda dealership to get an estimate. The grinding noise sounds like glass on metal when window is raised or lowered. Required fix from dealership was a new track installed and window regulator replacement. Repairs were quoted at $750 per window. One window goes bad and chalk it up as a fluke. Same issue on both windows. . . Manufacturer defect!.", "fail date": "  12/01/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "While driving 65 mph on the highway a sudden loud bang occurred which sounded exactly like a gunshot going off and glass showered down on my head. Startled, I swerved on the highway, but luckily did not hit any other vehicles. I pulled off the freeway and found that my sunroof had exploded with no outside influence. It was shattered and the glass was blow out in an upward fashion, as if it had happened from the inside of the vehicle. I immediately took the vehicle to the local Honda dealership and they stated that it was not from an outside source. I was given a loaner car and the dealership said they would take care of it, but this happened 9/23/2016 and it is yet to be seen if I will need to front any money out of my pocket.", "fail date": "  09/23/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Gasoline Fuel System", "Sub Problem": "Fuel Injector problems", "description": "Tl the contact owns a 2016 Honda Pilot. The contact stated while driving 65 mph, the emission system warning light was illuminated. The contact drove to his destination. The vehicle was taken to an independent mechanic and was informed that the oxygen sensor needed to be replaced. The vehicle was repaired however, the failure persisted. The vehicle was taken back to an independent mechanic and was informed the fuel injector and catalytic converter needed to be replaced. The vehicle was taken to autosport Honda (1201 us-22, bridgewater township, NJ 08807; (908) 722-5566) to be diagnosed. The contact was informed that the fuel injectors needed to be replaced. The contact also stated the abs sensor, 4 wheel drive, trailer stabilizer warning light were illuminated. The vehicle was not repaired. The manufacturer had been informed of failure. The failure mileage was 80,000.", "fail date": "  09/01/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Gasoline Fuel System", "Sub Problem": "Fuel Injector problems", "description": "The contact owns a 2016 Honda Pilot. The contact stated that while attempting to accelerate above 30 mph, the vehicle shuddered with the emission warning light illuminated. The contact stated that the failure caused the transmission to shake. The vehicle was taken to a hoehn Honda (5454 paseo del norte, carlsbad, CA 92008) to be diagnosed. The contact was informed that the fuel injectors needed to be replaced. The vehicle was repaired however, the failure recurred. The contact was advised by the same dealer to have the transmission flushed. The contact referenced NHTSA campaign number: 17v219000 (fuel system, gasoline) however, the VIN was not included. The manufacturer was not made aware of the failure. The approximate failure mileage was 92,000.", "fail date": "  05/15/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "My car keeps displaying �key start system problem� it comes on and off. Sometimes for a week or just a few days. I have now taken to the dealership twice and they can not figure out why it comes on then turns off. This last time lasted a week and it felt like my car was struggling to move when I accelerated. This is consistent problem with the Honda Pilots. I checked online and other customers are experiencing the same problem, they tried replacing the push to start button, key batteries and the harness. This happens when I start my car only, I have not made any alterations to my vehicle. I just got my car in April of this year.", "fail date": "  07/05/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "I write to you to convey my safety concerns regarding a new Honda 2016 Pilot. My attempts to resolve my concerns with american Honda motor CO. , inc. Were met with tepid reluctance and a cavalier neglectful attitude. 1. At high speeds (55-75 mph) the vehicle oversteers and during emergency avoidance maneuvers becomes unstable. Twice while avoiding dear on interstate highways, I have almost lost control and was seriously concerned about rolling the vehicle over. I own and have driven a 2003 Pilot for over 180,000 miles and never experienced this sort of issue. I believe the suspension is incorrectly designed and that unexpected and unnecessary rollovers are imminent. 2. The ¿auto idle off¿ feature turns the engine completely off at certain times and under certain circumstances. It takes between 900 and 1,300 milliseconds to recover power to the wheels when this happens. Unlike hybrid vehicles (from which this feature was taken), there is no alternative electrical motor to provide torque to the drivetrain while the engine restarts and as a result, there is delay in accelerating. In the vast majority of times, this is of no consequence however in a small fraction this delay increases the risk of collision. About once per week, I experience a delay in entering dense traffic within short interstate merge lanes. This delay of about one second is enough to remove my margin of error and increases the risk of collision during a merging maneuver. While there is a switch to defeat this feature, it resets every time the vehicle is turned off and remembering to override it every time is inconsistent with human memory and performance.", "fail date": "  11/04/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2016 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Front end creeking/loud pop when taking off and turning. Not continuous. Had it test driven by Honda dealership mechanic twice. I was told it was normal. . . And never check under the vehicle. Also, Honda recalled software for navigation panel. . . But the same issues have arisen again.", "fail date": "  11/02/2015"}]