[{"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "I recently bought this car used and the car and the airbag icon was on and the dealer from where I bought the car. He said that it was a Honda air bag recall passenger side and I went to Honda to go and get it replaced and once they fixed it the airbag icon was still on. The car has never been in an accident and the driver side is the issue. I went to the dealership where I bought the car and they gave me a code that they read from the diagnostic test and it read 31-11. The car has never been in a car accident and the driver side is the issue. They said that when Honda made the car they didn't do it right so they should fix it. I need help!.", "fail date": "  08/31/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The air bag deployed when something hit my windshield causing me to lose control of the vehicle and ending with the vehicle being on its side and the jaws of life being used to remove my body. I literally drove 1/10 of a mile when this happened at a speed of 40 mph on a side street.", "fail date": "  07/10/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall.", "fail date": "  08/28/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Car was purchased and not one word was did about the drive recall from February 2018, purchased this vehicle in March.", "fail date": "  07/11/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "My boyfriend hit a deer at a high rate of speed.", "fail date": "  09/05/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Traveling to va beach with family of 6. Talked to lisa a case manager. She told me that Pilot is designed for a 8 passenger. And I am not qualified. Asked where I will put the luggage and the golf clubs. This is the purpose of the trip. She said. Even if am qualified, the rental I will get is a compact car. This sound like a crap to me. The reason I got a Pilot is to travel comfortably with my family and like the smooth ride.", "fail date": "  08/29/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "I have called the walnut creek Honda service center twice to schedule a safety recall for my vehicle (the last time was 8/26/16). They have not returned my phone call and have not been diligent in getting this recall taken care of. I would like someone to help me get this resolved. I don't want my passengers hurt in case of an accident.", "fail date": "  08/26/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata airbag. Honda sent me a letter stating I should not allow a passenger in the front passenger seat, but this is the exact reason I bought a Pilot. It is large, and safe as I take my 82 year old mother everywhere, and I wanted her safe. Now, I am supposed to put her in the back seat with my boyfriend's grandkids, and she will have no airbag if something goes wrong? I was told by my dealer that Honda had a million dollars for rentals, and now that is exhausted. How is that my issue? I paid for a safe car to drive my mom around, and now I have none! I need a rental car until this issue can be fixed. How are takata airbags still being put into new vehicles? I need Honda to respond. To date, my 3 calls to their talking heads at 888 234 2138 have not been answered. I want a guarantee that my driver airbag is safe, and I want to know if the passenger airbag goes off with no one in the passenger seat, am I guaranteed none of the debris will hit me? I know airbags are not supposed to go off if no one is sitting there, but they are supposed to kill people with shrapnel either. Please help.", "fail date": "  08/07/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2010 Honda Pilot. The contact received notification of NHTSA campaign number: 16v346000 (air bags); however, the part needed to repair the vehicle was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was notified of the issue. The contact had not experienced a failure. VIN tool confirms parts not available.", "fail date": "  08/04/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall: recall paperwork received July 2016. Phoned Honda service on 7/21/16 to inquire about parts. It has been over 60 days.", "fail date": "  07/21/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2010 Honda Pilot. The contact received notification of NHTSA campaign number: 16v346000 (air bags) however, the part to do the repair was not available. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure. VIN tool confirms parts not available.", "fail date": "  07/20/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "I have contacted the dealer rick case Honda in davie FL. Several times since early July to schedule my vehicle for the recall repair. Since then they have not repaired my vehicle. It has been over 60 days. I have had this problem with other recalls as well. I want my vehicle fixed. I will contact an attorney soon if not remedied.", "fail date": "  07/18/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2010 Honda Pilot. The contact received notification of NHTSA campaign number: 16v346000 (air bags); however, the parts for the recall repair were not available. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was notified of the issue. The VIN was invalid. The contact had not experienced a failure. VIN tool confirms parts not available.", "fail date": "  07/18/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata air bag recall. Notified on 18 July 2016. Told to avoid having passenger in the front seat. Local Honda dealer said no parts to repair are available. They have been told to say, expect 2 weeks to 2 months (or more) until parts are available. I called Honda automobile customer service, and they seemed aggravated by my call, told me parts are not yet available, and I need to expect at least two weeks - up to 2 or more months - before parts are available and they will inform me in writing when to bring my automobile in for repair. This is unacceptable to have limited use of my automobile. It is very poor customer support to to be unable to fix a dangerous situation.", "fail date": "  07/18/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2010 Honda Pilot. The contact received notification of NHTSA campaign number: 16v346000 (air bags); however, the part to do the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The VIN was unknown. The contact had not experienced a failure. Parts distribution disconnect.", "fail date": "  07/18/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Received recall info and not to use passenger seat. Was told I would hear from case manager regarding loaner/rental car in 2-3 days. 5 days later, 3 phone calls and nothing. Leaving on trip in am with no option but to use front seat. Honda helpline is a fraud. Dealership said they aren't authorized to give loaner cars and it was illegal to disable the faulty airbag.", "fail date": "  07/18/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2010 Honda Pilot. The contact received notification of NHTSA campaign number: 16v346000 (air bags); however, the part to do the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was not notified of the issue. The contact had not experienced a failure. VIN tool confirms parts not available.", "fail date": "  07/15/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. Dealership not responsive. 60+days. Live in florida an area of high absolute humidity.", "fail date": "  07/12/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall no one from Honda has ever contacted me even though they have had my email and cell number for years. Nor have I been given any information as to when I might expect this recall to be acted on.", "fail date": "  07/12/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owned a 2010 Honda Pilot. While driving approximately 20 mph, the air bags deployed unexpectedly. As a result, the contact crashed into a concrete block divider. A police report was filed and there were no injuries. The vehicle was towed to a tow yard and deemed destroyed by the insurance company. The failure mileage was unknown.", "fail date": "  07/07/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall - we received the initial recall letter from Honda and immediately took our vehicle in for service. We were told that parts would be ordered and it could take 3 months. 6 months have passed and the airbag has not been repaired. With 2 small children who ride in the vehicle each day, this is unacceptable. We ask for your help in getting our airbag(s) replaced.", "fail date": "  06/15/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2010 Honda Pilot. The contact stated that the recall notice for NHTSA campaign number: 16v346000 (air bags) was received in June of 2016. After contacting the dealer and the manufacturer on multiple occasions, the contact was informed that the parts needed to repair the vehicle were still not available and no estimated time for receiving the parts could be given. The contact had not experienced a failure.", "fail date": "  06/01/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2010 Honda Pilot. The contact received notification of NHTSA campaign number: 16v346000 (air bags). The part to do the repair was not available. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure. VIN tool confirms parts not available.", "fail date": "  05/29/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2010 Honda Pilot. The contact received notification of NHTSA campaign number: 16v346000 (air bags); however, the part to do the repair was not available. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure. VIN tool confirms parts not available.", "fail date": "  05/23/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall I have received notice of the recall. Called my dealership in June, they told me they would order airbags. I am still waiting for the airbags to be replaced. I wrote american Honda asking for a rental car because I have children in my car for carpool to/from school and have been told no that \"Honda is not prepared to do that\". But I am still waiting for the airbags. It has been 3 months; that is much too long.", "fail date": "  05/23/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The contact owns a 2010 Honda Pilot. The contact stated when driving at various speeds and making right turns and idled, there was no power steering. The contact then stated that the oil light check engine warning lights were illuminated. The vehicle was taken to an independent mechanic where it was diagnosed that the rack and pinion needed to be replaced. The dealer was contacted and informed the contact that there was no recall. The manufacturer was not notified of the failure. The failure mileage approximately was185,000.", "fail date": "  08/08/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The contact owns a 2010 hondo Pilot. The contact stated while driving 65 mph, the vehicle was vibrating. The contact pulled over safely to the side of the road. The contact stated that an unknown warning light was illuminated. The vehicle was towed to the local dealer. The dealer diagnosed a failure with the piston and spark plug. The vehicle was not repaired. The manufacturer was notified of the failure. The approximate failure mileage was 114,361.", "fail date": "  07/08/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "When I drove back from atlanta airport on highway I-85 on December 27, 2021, the car started shaking and check engine light was flashing. It was very dangerous on the highway. I immediately drove to nearest gwinnett place Honda. The dealer found the second cylinder misfired and replaced piston rings 1-3.", "fail date": "  12/27/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Engine consuming oil. Engine went from full to empty in oil capacity between oil changes.", "fail date": "  07/20/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Excessive vibration in front end when eco light turns on indicating cylinder shut down and when driving over 30 mph problem began after approx 50,000 miles.", "fail date": "  04/01/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I took my vehicle to all star Honda in milwaukee WI when I received a letter of recall for bushings. I explained I had been having multiple other issues that I had not had time to be without my car to leave it for repair. The service agent explained spark plugs were recalled which would resolve the sluggish take off I reported. She also said the transmission switch I had replaced was in need of an update which would further cure my problems. Finally they were to check the bushings due to recall. She assured me the recalls would cure all but the radio issue I had but they would check that out while they had my vehicle. They found nothing but the bushings. I filed complaint with Honda corp that dealer wont uphold recalls as they dont get error codes. They told corp rep they had my car several days which is a lie. They had it about 4 hours from when they opened until I picked up. Corp rep said nothing else we can do. Meantime, I have no brakes on cold winter days and my car puts along getting on the freeway until it jerks, rpm's drop and then I zoom up to speed quickly. I would have to check receipts for exact date I was at dealer & filed complaints.", "fail date": "  10/15/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Tl-the contact owns a 2010 Honda Pilot. The contact stated that while depressing the brake pedal at approximately 5 mph the vehicle accelerated without warning causing the contact to crash into the vehicle that was in front of him. After impact the vehicle continued to accelerate while the contacts foot was depressing the brake pedal. A police report was filed. The vehicle was towed to the dealer and was not diagnosed. The manufacturer was made aware of the failure. The approximate failure mileage was 45,515. Sw.", "fail date": "  03/05/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "My wife was driving down the street and she was going to get into another lane she checked her mirrors and took a glance over he shoulder. When she looked back she noticed a car had stopped in the lane. She then slammed on her brakes in which at that time she said it felt that like the car was still pulling against her braking. After she hit the person in front of her pushing the adverse vehicle forward. Her car then continued accelerating as she was braking and slammed into the adverse vehicle again. Her car only stopped by putting the car in park.", "fail date": "  12/24/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Our Honda Pilot routinely becomes sluggish and hesitates during acceleration. This pattern only takes place at speeds between 20-35 mph. This is very dangerous when entering a highway and attempting to accelerate to join the flow of traffic. Scott wolfe.", "fail date": "  06/01/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Driving along at normal highway speeds and the emission management indicator light started blinking. Took vehicle to Honda dealership for inspection and found out that there was a software update needed for the fuel management control systems as Honda was getting multiple complaints of early spark plug fouling due to incorrect management of the eco drive state. We found out that we had lost 4 out of 6 cylinders due to the spark plugs being fouled. This could have been a serious safety issue and could have caused a major accident on a interstate highway had all the cylinders been lost at one time. Was traveling with wife and 2 kids at time of incident. To me there should be a recall for 2010 Honda Pilots as this is a known problem through Honda. The software update was still covered under warranty but the replacement of the plugs was not as they are considered a normal wear and tear item even though they lasted for less than half of the expected life of a spark plug.", "fail date": "  08/03/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Cruising on the highway the \"check engine\" light came on and car started putting and decelerating (loss of power). Pressing on the gas paddle could hardly sustain speed. Drove to dealership and it was determined that it was a faulty spark plug. The same has happened before with another spark plug (that time under warranty) . According to Honda dealer spark plugs are replaced at 100,000 miles and this vehicle has 40,000 miles. Since it happened twice already most likely it will happen again and it is a defective series of spark plugs. Honda us declined to assist stating that it is out of warranty (even though the dealership did include it under warranty understanding that this is un-acceptable). This seems to be a prevalent problem in Honda Pilot (see other complaints on the internet). Can you help? I would like Honda to replace all spark plugs.", "fail date": "  03/14/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Car has been burring oil for years. I have talked to and taken it to Honda several time. I always get the same answer. It's normal to burn a quart every 1000 miles.", "fail date": "  09/04/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Streeing wheel seriously vibrates when breaking over 60 mph. Front bushings need replaced at 76,000 miles and dealer said that there was a leak in the hydrolics controling the timing belt which will lead to possible enging replacement. Dealer quoted $2500 to fix. The information on the bushings and timing belt was discovered while have the air bag replaced. Also, there was another customer that got the same news on his car. After looking at the complaints these are common problems which Honda does not help with and you don't know if the same problem will reoccur if you do fix. It does appear to be a manufacturing/engineering problem that Honda knows well but there is no help for the customer. The dealership seems to be looking for these known problems for more profit potiental. This vehicle has been well serviced and used for mostly long road trips. Honda needs to fess up and help their customers since these type of problems/failures can be very dangerious to the passangers while driving not to mention exorbitant costs.", "fail date": "  05/11/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "The contact owns a 2010 Honda Pilot. The contact stated that the compliance bushings caused the vehicle to shake while driving. The vehicle was taken to the dealer where it was diagnosed that the compliance bushings needed to be replaced. The vehicle was not repaired. The failure mileage was 119,000.", "fail date": "  07/11/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Excessive vibration in front end when eco light turns on indicating cylinder shut down and when driving over 30 mph problem began after approx 50,000 miles.", "fail date": "  04/01/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Recently has been giving rattling noises from under the passenger side frontwheel while going over bumps. Diagnosed by Honda dealer to be an issue with worn compliance bushings. Although vehicle under Hondacare extended warranty, they would only cover replacement of the bushing. I have to bearcost of wheel alignment which is a consequence of the defective part from Honda. That is 118 dollars for wheel alignment. Drove the car out of the dealership and again hear the rattle over bumps. So having to go again to the dealership if they can diagnose the problem.", "fail date": "  03/02/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "My wife was driving down the street and she was going to get into another lane she checked her mirrors and took a glance over he shoulder. When she looked back she noticed a car had stopped in the lane. She then slammed on her brakes in which at that time she said it felt that like the car was still pulling against her braking. After she hit the person in front of her pushing the adverse vehicle forward. Her car then continued accelerating as she was braking and slammed into the adverse vehicle again. Her car only stopped by putting the car in park.", "fail date": "  12/24/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "During regular maintenance for a 2010 Honda Pilot with 42501 miles, owner was informed of an unsafe condition resulting from a routine inspection. Dealership informed customer that the front compliance bushings were worn/loose. Dealership informed customer that this unsafe condition could result in excessive tire wear, vibration & possible loss of control of vehicle if not corrected. Vehicle is out of warranty and it will cost $628. 00 to replace both front bushings and another $98. 98 for an alignment that will be needed after bushings are replaced. Total cost of 726. 98. Customer had not noticed any problems, before taking car to the dealership. Customer had noticed while researching Honda compliance bushings on the internet an excessive amount of complaints for low mileage vehicles. Hard to believe that a company like Honda that preaches quality can have an excessive amount of suspension complaints on low mileage vehicles and have not addressed the problem with a voluntary recall. Saw at least 3 complaints on this site alone, just for the 2010 Pilot. Also appears to be a common problem on other models.", "fail date": "  07/11/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Front suspension bushings degrade quickly and vehicle does not keep alignment. Also allows car to shake during high speed braking. Bushings were replaced at 29990 mi, now at 34,500 mi same problem is occurring.", "fail date": "  09/09/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Tl- the contact owns a 2010 Honda Pilot. The vehicle was being serviced for regular maintenance when the contact was informed that the bushings were defective. The vehicle was repaired by replacing the bushings. The contact had not experienced any issues because of the defect. The manufacturer was not made aware of the failure. The approximate failure mileage was 33,500. Kmj.", "fail date": "  08/30/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "I brought the vehicle to Honda city, liverpool, NY because of an issue with compliance bushing identified by an independant mechanic. The mechanic and service advisor both agreed that the bushing has signs of previous leak and is visually damaged which can be seen by cracked rubber. They also told me that since the TSB says it has to be a visual leak or popping it doesnt qualify for replacement. Therefore I currently and drive a vehicle with a defective suspension bushing which the manufacturer knows about but because of the wording of the TSB they will not replace. I am not sure how this works or what can be done but I'm trying to figure out if I have to be involved in a accident resulting from the failure of this component before my concern will be taken seriously by the dealer and manufacturer.", "fail date": "  09/17/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "My battery light was on and after charging the battery overnight my wife drove to her workplace, parked the Pilot and then a coworker stated there was a car on fire in the parking lot and it turned out to be mine! the fire department was finally able to put out the fire but the whole front end of the car is totally burnt and part of the cabin inside was also burnt.", "fail date": "  05/11/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Tl- the contact owns a 2014 Honda Pilot. The contact stated that the headlights needed to be replaced every 3 months. The vehicle was not taken to a dealer or independent mechanic for a diagnostic test or repairs. The manufacturer was not made aware of the failure. The failure mileage was 112,000. Dr.", "fail date": "  08/01/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "My boyfriend hit a deer at a high rate of speed.", "fail date": "  09/05/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "At 7:15am in a public parking lot of a strip mall setup, I approached a parking place but first letting an employee of panera bread cross in front of me before I approached the space. Upon approaching I was gliding in using the brake to slow me when all at once the engine reved while my foot was on the brake accelerating me and the vehichle into a tree 8 feet past the parking space, deploying the air bag and bouncing me back around 16 feet. The vehichle had at least accelerated to 20mph to accomplish what had happend. My husband had told me as well as the officer at the scene, that this had happened to him 3 times in the recent past on a graduated intensity. I suffered hand lacerations as well as forehead with chest bruising from the seat belt and a hand burn from the deployed air bag. I also had a slightly bleeding lip and was released at the scene from the ambulance with a strong suggestion to follow up if necessary. It is a shame that your own insurance company would rather look the other way then get involved and attorneys only want \"severe\" hospital ridden patients to move forward on a case. My insurance company wants to fix the Honda Pilot and put me back behind the wheel. I had spoken with one individual who works on Honda's at a Honda garage and isn't it interesting he suggest it may be a sensor or electrical issue with the acceleration system. . . . . . But oddly enough, he hasn't heard of this either, but upon research, I've found it all over the internet. I told my insurance company, \"shouldn't we start somewhere. \".", "fail date": "  06/16/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Electrical short in driver's side outside power mirror. When adjusted in, a short blows fuse #36 (10a). It also looses power heater, defoggers (front and rear). 63,000 miles.", "fail date": "  12/19/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "I took my vehicle to all star Honda in milwaukee WI when I received a letter of recall for bushings. I explained I had been having multiple other issues that I had not had time to be without my car to leave it for repair. The service agent explained spark plugs were recalled which would resolve the sluggish take off I reported. She also said the transmission switch I had replaced was in need of an update which would further cure my problems. Finally they were to check the bushings due to recall. She assured me the recalls would cure all but the radio issue I had but they would check that out while they had my vehicle. They found nothing but the bushings. I filed complaint with Honda corp that dealer wont uphold recalls as they dont get error codes. They told corp rep they had my car several days which is a lie. They had it about 4 hours from when they opened until I picked up. Corp rep said nothing else we can do. Meantime, I have no brakes on cold winter days and my car puts along getting on the freeway until it jerks, rpm's drop and then I zoom up to speed quickly. I would have to check receipts for exact date I was at dealer & filed complaints.", "fail date": "  10/15/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Tl-the contact owns a 2010 Honda Pilot. The contact stated that while depressing the brake pedal at approximately 5 mph the vehicle accelerated without warning causing the contact to crash into the vehicle that was in front of him. After impact the vehicle continued to accelerate while the contacts foot was depressing the brake pedal. A police report was filed. The vehicle was towed to the dealer and was not diagnosed. The manufacturer was made aware of the failure. The approximate failure mileage was 45,515. Sw.", "fail date": "  03/05/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "2010 Honda Pilot touring\nhit a bump in the road and the abs and vsa sensor wires were severed causing both features to be disabled. The sensor wire goes from the middle of the undercarriage to each rear wheel and is totally unprotected. Also, the sensor and wire are one piece and should have a connector rather than one piece so it could be repaired. Additionally, the wire should be encased in a wire conduit (the flexible wire conduit that could be purchased from a parts store. ) this would add some level of protection. And a mere tree branch in the road can sever the cables. The manual suggests that the illuminated warning lights, if ignored, can cause injury or death. I was in a long tunnel and could not even pull over. After researching on line, this is a common problem with this flaw. The dealership claims the vehicle can still be driven without these two features functioning. I feel this is dangerous.", "fail date": "  05/11/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Sun roof exploded and glass shattered while driving with no other vehicles in front.", "fail date": "  04/28/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The vehicle will randomly start vibrating in the front dashboard. Not sure if it is transmission, engine or suspension or alignment related. Driving over 45 mph the entire front dashboard and steering wheel will begin to vibrate. It will last for about 10 seconds and then stop. It does a lot going uphill. Even on flat land it will just randomly start violently vibrating. I just purchased this used vehicle on April 19 of 2018. I am starting to regret it. I have read many reports of the Honda Pilots vibration issues. I have read that it is mainly due to the vcm.", "fail date": "  04/19/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Strong gas/exhaust smell in car cabin. Replaced air and cabin filters. Brought to Honda dealership in morgan hill, CA and they say nothing was wrong, or that the diagnostic information did not return any issues. The smell was acute. Happening all of a sudden and we did not notice it getting stronger with time. The smell is evident in the cabin with the a/c on/off, heat on/off, even with the recirculation set to off. Have to drive with the windows down to deal with the fumes.", "fail date": "  07/13/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Recall. I have been waiting for the recall parts to come in. They are telling me not to drive the car until it is fixed. What am I suppose to do now?!.", "fail date": "  11/07/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "My vehicle had been reposes breaking the bridge of peace. I live in a closed gated condominium,the tow company took break into the condominium. Took my car without notice,no notes left no telling the property manager. No telling the insite security service,the Honda financial repo department do not want to talk to me customer service just said to wait until they call me but every day is money for storage and they dont resolve the issue,I pay last September,they yold me that a letter was mailed to my house but they mistake my address from 1331 correct to 1313 so I wasnt aware. I make 5yrs of payment just need to do 5 more to finished my contract owe them now 2 month that I wasnt aware because I made payments online. They took my payment last month and never said a work. This is a fraud to stole my car that is worth $25. 000. Need help I buy it new from dealer at California 2009 currently register to me in miami florida since 2013.", "fail date": "  10/14/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Driving along at normal highway speeds and the emission management indicator light started blinking. Took vehicle to Honda dealership for inspection and found out that there was a software update needed for the fuel management control systems as Honda was getting multiple complaints of early spark plug fouling due to incorrect management of the eco drive state. We found out that we had lost 4 out of 6 cylinders due to the spark plugs being fouled. This could have been a serious safety issue and could have caused a major accident on a interstate highway had all the cylinders been lost at one time. Was traveling with wife and 2 kids at time of incident. To me there should be a recall for 2010 Honda Pilots as this is a known problem through Honda. The software update was still covered under warranty but the replacement of the plugs was not as they are considered a normal wear and tear item even though they lasted for less than half of the expected life of a spark plug.", "fail date": "  08/03/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Noticed that my Pilot was vibrating after taking it in for a routine oil change at speeds from 45-60mph. Took back in and they explained new tires, alignment and balance would fix. After spending 280$ on brakes 218$ on balancing and alignment and 700$ on new tires still have a vibration. Didn't notice it to be as much but there still is a vibration. I plan to take it in again but refuse to spend anymore money for they to try and figure out what's wrong with it. This is only a 2010 with 38,000 miles . After looking online I have seen other complaints that are very similar. I want to go on a family trip this summer but feel I can't take it on a long trip!!! have seen that it could be a transmission problem so don't want to make matter worse. Honda needs to recall!!!.", "fail date": "  02/15/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The spark plug #3 goes off.", "fail date": "  06/23/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Engine seized at 109. 369mi unexpectedly on the highway with regular maintenance and clean full oil and gasoline. . Read more...\n", "fail date": "  05/31/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "My vehicle has about 145k miles. For a couple years now, it has shuddered when accelerating between 25-40 mph. Feels like transmission issue. I have maintained to the letter. When I did some research, I found that this is a very common problem with this model and Honda has yet to remedy it. I took it to an independent dealer and they confirmed it was transmission overhaul needed based on computer error codes and troubleshooting. I wanted to report this as I believe Honda is turning the other way on a critical system (that can be safety related) on this model.", "fail date": "  06/16/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Excessive vibration in front end when eco light turns on indicating cylinder shut down and when driving over 30 mph problem began after approx 50,000 miles.", "fail date": "  04/01/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "The air bag deployed when something hit my windshield causing me to lose control of the vehicle and ending with the vehicle being on its side and the jaws of life being used to remove my body. I literally drove 1/10 of a mile when this happened at a speed of 40 mph on a side street.", "fail date": "  07/10/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "The contact owns a 2010 Honda Pilot. The contact stated that the compliance bushings caused the vehicle to shake while driving. The vehicle was taken to the dealer where it was diagnosed that the compliance bushings needed to be replaced. The vehicle was not repaired. The failure mileage was 119,000.", "fail date": "  07/11/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "My wife was driving down the street and she was going to get into another lane she checked her mirrors and took a glance over he shoulder. When she looked back she noticed a car had stopped in the lane. She then slammed on her brakes in which at that time she said it felt that like the car was still pulling against her braking. After she hit the person in front of her pushing the adverse vehicle forward. Her car then continued accelerating as she was braking and slammed into the adverse vehicle again. Her car only stopped by putting the car in park.", "fail date": "  12/24/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "A lady hit my car, she was pulling out of a parking spot in a supermarket whitout looking,my car was already out of the spot. She crushed my rear bumper. At 3 to 5 miles per hora ,no big incident, bumper had scratch she broke her rear light mica,I had my wife and 3 yrs old kid with me,she had her husband and 30 yrd old son. 1pm on 9/1/2014 we together wait 3 hrs for the police,talking,sitting,eating,everybody was fine,police arrive no ticket,now my insurance told me they asking for money. The 3 of them asking for medical. She hit my car on porpose to commit fraud.", "fail date": "  09/01/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "Driving on highway with not rock or debris striking the vehicle, sunroof glass completely shattered . This is the original Honda glass with 114,000 in 93 degree heat.", "fail date": "  07/04/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2010 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "Car windshield cracked without impact or visible trauma. A large crack appeared in the car windshield after car was parked in the sun. Crack starts to run from about 5 inches below the top of the windshield on the passenger side and then travels approximately 16 inches mostly straight down to the bottom of the windshield and then travels the entire width of the windshield to the bottom of the driver's side. Car was not being driven at the time of the incident. There are no visible chips, impact pits or any such indications that windshield was stuck by an object, stone, rock, etc. Along the entire length of the crack.", "fail date": "  05/19/2014"}]