[{"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "New car, problems just uncovered.", "fail date": "  07/29/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Was in a front end accident going 30 mph and no air bags deployed. The peraon I tboned all of his deployed. None of mine went off.", "fail date": "  12/05/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The light of the airbag is on every time the mechanic check and he say the airbag have a defect.", "fail date": "  12/18/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Rear wiper prob - could not turn off ,last resort pulled fuse for wiper, fuse also controled passenger air bag. , why are they on same fuse? prob. With wiper could eliminate airbag.", "fail date": "  02/03/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall notice of recall received June 2016 in July 2016 I called northwest Honda of owings mills to schedule appointment to have recalled part replaced and was told the part was on back order and I would be notified of its arrival via email notification of part arrival in pink card received in the mail on 11/1/16, 4 months after the recall notice. Appointment scheduled with appointment desk at northwest Honda of owings mills upon receipt of card for 11/8/16 to replace air bag. Upon arrival at northwest Honda I was told the appointment was never scheduled, they were booked and I had the option to wait 2 hours to be serviced. I have waited 5 months for a recalled part to be replaced in my car and after waiting 5 months I am told to wait 2 additional hours after the dealer made a mistake in their scheduling. I requested for the existing defective airbag to be removed and was advised this cannot be done because it is against the law. I requested for the part to be given to me so I can have another dealership install it, I was told they are not allowed by law to do this either. So I am forced to wait for northwest Honda to not mess up my rescheduled appointment on 11/21, or get rid of the part which per pink notification will only be on hold until 11/14.", "fail date": "  11/08/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2008 Honda Pilot. The contact received a recall notice for NHTSA campaign number: 16v344000 (air bags). The contact stated that the parts needed for the recall remedy were still not available. The manufacturer exceeded a reasonable amount of time for the recall repair. The contact had not experienced a failure. Parts distribution disconnect.", "fail date": "  09/30/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2008 Honda Pilot. The contact received recall notification of NHTSA campaign number: 16v344000 (air bags) however, the part to do the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was not made aware of the issue. The contact had not experienced a failure. Parts distribution disconnect.", "fail date": "  08/31/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall have contacted classic Honda of 4000 w colonial dr, orlando, FL 32808 more then 4 months ago and was told the airbag would have been there in 2 weeks. Still have not had a call back and the part is still not in. Service isnt open on sundays and thats my only day off also.", "fail date": "  08/01/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. I contacted brown's Honda city at 712 north crain highway, glen burnie, MD 21061 to address this recall. My initial contact was on 7/8/16. I was given an appiontment of 7/15/16 to have the problem fixed. They then cancelled my appointment and since then they keep putting me off saying they don't have the parts yet. It has been over 60 days since I first contacted them and the recalled parts still have not been replaced.", "fail date": "  07/11/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2008 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags); however, the part to do the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The contact had not experienced a failure. The manufacturer was not made aware of the issue. Parts distribution disconnect.", "fail date": "  07/08/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2008 Honda Pilot. The contact stated that the recall notice for NHTSA campaign number: 16b344000 (air bags) were received in July of 2016. After contacting the dealer and the manufacturer on multiple occasions, the contact was informed that the parts needed for the recall remedy were still not available and no estimated time for receiving the parts could be provided. The contact had not experienced a failure. Parts distribution disconnect.", "fail date": "  07/01/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2008 Honda Pilot. The contact received notification of NHTSA campaign numbers: 16v344000 (air bags) and 16v061000 (air bags); however, the parts to do the repair were unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was notified of the issue. The contact had not experienced a failure. Parts distribution disconnect.", "fail date": "  06/10/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2008 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags); however, the part to do the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure. Parts distribution disconnect.", "fail date": "  06/03/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "On June 2015 I bought my vehicle from brandon Honda dealer. In December 2015 my vehicle started to give me some problems, alignment, tires, engine, instability when you are driving in the highway. The dealer expected me to pay over 1,000 dollars for the repairs, however they did fixed them at no cost. Now June 2016, one year after purchase my car still having major problems, tires, instability when driving and alignment issues. When I took my vehicle for oil service on June 2016 I expressed that my vehicle was pulling to left so they recommended an alignment I agreed, after 5 hours waiting and me driving away the pulling to the left was not fixed at all I went back to the dealer and demanded them to fixed it, they stated that because my tires needed to be changed that's why it was not fixed, mind you that I already paid over $100 dollars and they told me this after the fact. Now I received a recall and they have not contacted me back to even make an appointment to address this issue. How can a known dealership promised you that the car is reliable and inspected by a certify mechanic and that it will last for at least 5 years and here I am only 1 year from the time I bought my vehicle and I am having car issues that can caused me and my kids life because this vehicle is not safe to drive. I have express this to brandon Honda and they have not do anything. Can someone please help?.", "fail date": "  06/01/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2008 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags); however, the part to do the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure. Parts distribution disconnect.", "fail date": "  05/24/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2008 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags) in may of 2016. After contacting the dealer and the manufacturer on multiple occasions, the contact was informed that the parts needed for the recall remedy were still not available and no estimated time for receiving the parts could be provided. The contact had not experienced a failure. VIN tool confirms parts not available.", "fail date": "  05/01/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Your recall is a total fraud. Called Honda. Gave info and had appointment to repair (4 weeks after call. . They said it would take 7 days to get part). Get to the dealer (manhattan Honda). . . They take car, tell me that they do not have part but I need over $2000 in other repairs. . . They will have part in 7 days and will call. . . Now it is 5 weeks later no call. . This is total bullshit and the Honda dealer is a crook. This is a total con game!!!!!.", "fail date": "  08/20/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2008 Honda Pilot. The contact received notification of NHTSA campaign number: 15v320000 (air bags); however, the part needed to repair the vehicle was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was not notified of the issue. The contact had not experienced a failure.", "fail date": "  08/04/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall: I am writing to you, in order to ask your assistance. I have Honda Pilot, with takata recall, but already for a year I am not driving this car, as Honda does not give me any answer when the recall would be made. I have registered a claim a year ago, wrote to Honda recalls several times (attached file below), also as I made dozen of calls to them. Additionally I have enquired to local dealership in order to seek assistance there, but I did not get any answer and from them. Can you help me with following: 1. Find out the date, when it is possible to make a recall for takata airbags. 2. Can you, please, explain me, who will cover the costs, of Honda inactivity for a year, as I cannot drive the car, with faulty airbags. Rytis markevicius mob. +370 682 55 636 el. P. Rytis@protingesnis. Lt.", "fail date": "  06/17/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Tl-the contact owns a 2008 Honda Pilot. The contact received notification of NHTSA campaign number: 15v320000 (air bags) however, the part needed to do the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was notified of the issue. The contact had not experienced a failure. Pam.", "fail date": "  05/22/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Tl-the contact owns a 2008 Honda Pilot. The contact received notification of NHTSA campaign number: 15v153000 ( air bags) however, the part needed to repair the vehicle was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was not made aware of the issue. The contact had not experienced a failure. Oo.", "fail date": "  04/30/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "I received a recall notice from Honda\" important safety recall\" in the mail on my faulty air bag. Letter said call my local Honda dealer and they would repair it for free. Called oxnard dch dealer on 4/27/15 about my Honda Pilot 2008 requesting it to be repaired,they said we do not have the replacement part but will me back when it comes in, that was a month ago they have yet to call back. When will theycall back, when will replacement parts come in,and how soon will they repair this problem?.", "fail date": "  04/27/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Honda Pilot was struck (tbone) at 65 mph side curtain airbags deployed and driver was knocked unconscious and leaned on the gas. Car went into full rev and crashed into a wall where the front airbag deployed. Homeless man was sleeping behind the wall and was struck by the runaway Honda Pilot. Shouldn't the vehicle of shut down after airbag deployment? fuel inertia or cut off did not engage.", "fail date": "  09/12/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2008 Honda Pilot. While driving approximately 60 mph, the contact rear ended the preceding vehicle and was rear ended by the vehicle in his rear. The vehicle behind him was traveling 60 mph as well. Four occupants were injured. The vehicle was towed and a police report was filed. The vehicle sustained major damage. None of the eight air bags deployed. The current and failure mileages were 12,300.", "fail date": "  08/16/2008"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "State inspection faild, check engine light, bank 1 catalytic converter internal failure and bank 2 catalytic converter internal failure, passenger side axle to be leaking, power steering pump to be leaking, power steering reservoir tank to be leaking, front and rear brake pad.", "fail date": "  05/06/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The contact owns a 2008 Honda Pilot. The contact stated while approaching a stop sign and depressing the brake pedal, the vehicle inadvertently accelerated. The contact stated no warning light was illuminated. The contact stated he shifted gears to neutral and continued to depress on the brake pedal and the vehicle began to shake forceful until the vehicle stopped. The contact stated he was able to drive to his residence. The vehicle was taken to an independent mechanic however, the mechanic was unable to duplicate the failure. The contact called bianchi Honda (8430 peach st, erie, PA 16509, (814) 868-9678) and the dealer was made aware of the failure. The vehicle was not diagnosed nor repaired. The manufacturer had not been informed of the failure. The failure mileage was approximately 179,942.", "fail date": "  04/10/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "New car, problems just uncovered.", "fail date": "  07/29/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "My was driving the unit for about two minutes from the starting point. Then, all the lights of the dashboard turn on. When she tried to move the vehicle to the emergency lane, a black smoke start to go inside of the vehicle and a engine fire started. Rapidly, she left the car to a safe place and the fire consumed the entire vehicle. The car was declared total loss by the insurance.", "fail date": "  01/05/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Catalytic converter banks 2-4 failed.", "fail date": "  08/08/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "2008 Honda Pilot rear subframe on both sides rotted out! horrible design! lots of Honda Pilots with this issue!! you could've killed my family due to this!! this is a known issue now take care of your buyers!!!.", "fail date": "  03/31/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "While driving at highway speed, the rear of the car started swaying slightly. Several passing motorists motioned me to pull over. Upon inspection, we noticed the rear chassis on both sides had pulled away from the body of the vehicle, causing the rear wheels to tilt in from the top and out from the bottom.", "fail date": "  08/16/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "This complaint is in regards to the welded nuts that hold the license plate on the rear cargo door on my 2008 Honda Pilot. Both of the nuts were welded on a very thin metal frame inside the rear cargo door and from the weight of my license plate frame and from the vibration while driving over the years, the nuts completely broke off where they were welded. There is no other way to attach the rear license plate to the rear cargo door and in most states that's a traffic violation. I contacted Honda corporate with this issue and was told that my vehicle was out of factory warranty so Honda was not responsible for this issue. My 2008 Honda Pilot has 80,000 miles and is 11 years old, this problem was caused by wear and tear over the years and Honda should be responsible for all repairs! is there anyone else that this has happened to with the same body style as my 2008 Honda Pilot, if so we all need to stand up and demand a recall campaign. So let's all together do something about this!.", "fail date": "  08/14/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Rear driver side window dropped. It should not fail in this way the vehicle was stationary but it could easily have been in motion. I believe this is a defective design or part. I had the dealer replace and install part at my cost. Quick web search showed this happening to multiple people.", "fail date": "  08/18/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "The paint on the trim panel above the back window is faded and the clear coat is peeling.", "fail date": "  07/01/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "My was driving the unit for about two minutes from the starting point. Then, all the lights of the dashboard turn on. When she tried to move the vehicle to the emergency lane, a black smoke start to go inside of the vehicle and a engine fire started. Rapidly, she left the car to a safe place and the fire consumed the entire vehicle. The car was declared total loss by the insurance.", "fail date": "  01/05/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "The door stop check which should keep the door from closing on the driver's legs as one enters or exits the vehicle failed and had to be replaced. It actually was not working when I purchased the car in January of 2014 with 59,900 miles. The door would not stay open when parked on the slightest of inclines, and a stiff breeze would blow it shut. The door closed on my left leg several times; I was not injured, other than a nice ouch. If the door closes on an elderly person, the injury could be more serious. I replaced the part, # 72380-s84-a01 on 29 may, 2014 at the Honda store in boardman, ohio. Cost was 46. 00 service and 21. 10 for the part. I can send the failed part to your offices if so desired. This would seem to be a safety failure as the door should remain open when one is attempting to enter and exit the car. A failure at 60,000 miles also seems premature. Thanks, john m. Dawson, d. O.", "fail date": "  04/24/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "This occurred three times. We have found the hood to be in open position (ajar). Its like someone pulled the level and the hood opens, but the secondarly latch keeps it from flying open while underway. I will just reach in and pull the secondary latch to open the hood and close it. I am just afriad that the hood will fly open one day while we are driving, but the secondary latch is doing it's job.", "fail date": "  04/15/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "The contact owns a 2008 Honda Pilot. The contact stated that while driving approximately 75 mph, a rattling noise was heard from the rear of the vehicle. The rear brake light panel then became detached from the vehicle and flew across the highway. The contact was ale to retrieve the panel and upon further inspection, discovered that the rear brake light was ripped from the panel by the rear bumper. The vehicle was not inspected or diagnosed for repair. The VIN was not available. The manufacturer was not notified of the failure. The approximate failure mileage was 111,000.", "fail date": "  03/18/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Honda corporation is aware of a non-conformance issue with the Honda Pilots transmission but has not provided a recall or solution to consumers. The \"transmission\" can fail between 35k to 157k miles when the vehicle is no longer under warranty. The mechanical defect was known in 2000-2004 second gear failure and again in 2008 production to be later redesign in 2009 without consumer notification of such defect. Consumers have filed multiple complaints and Honda has done nothing to compensate buyers.   we the undesigned expect Honda to adhere to the \"total repair cost\" are \"reimburse\" the consumer for their trade-in lost due to transmission defect which ever transpired as a result of the product non-conformance issue.", "fail date": "  12/09/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The vehicle was stopped at a stoplight, waiting to make a left turn. When the light turned green, the driver accelerated into the turn, then let off the gas to coast thru the turn. After completing the turn and re-applying the gas pedal, it was realized that there was no acceleration. The engine was running normally and there were no other symptoms other than that there was no power being sent to the wheels. There was no advanced warning of any kind. The incident occurred on a high-speed shoulder less road during rush hour. The driver and her father were stuck in the right-hand lane with cars driving by at 55 mph in the left-hand lane and many cars in the right-hand lane swerving into the left lane just in time to miss the stopped car. It took 20 minutes before police arrived to slow down traffic so this incident could potentially have ended with traffic injuries or deaths.", "fail date": "  05/08/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "My 2008 Pilot shudders in the speed range of about 35-40 mph, with light pressure on the gas pedal.", "fail date": "  03/11/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "01) vehicle skidding under slightest water and/or incline on road even though has only 20,500 miles 02) sound from that rear of vehicle (dealer describes that as slashing gas in tank or braking sound).", "fail date": "  09/02/2007"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "Driver seat, front bottom left corner metal bracket holding seat in place broke. Seat acts like a \"rocking\" chair constantly. Very difficult to drive as you are always shifting in your seat.", "fail date": "  02/27/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "Bracket that holds drivers seat to base made a popping sound today when approaching a stop sign, and after accelerateting from the stop sign the drivers seat began to recline. Upon further inspection I discovered that the I bracket that holds the seat to the base had sheared off. This bracket is riveted to the seat itself but sheared off adjecent to where it is riveted. This is a huge safety concern, the sear should not break from daily use! this is an issue that needs to be addressed as it could become potentially fatal.", "fail date": "  11/23/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The contact owns a 2008 Honda Pilot. The contact stated that when entering the vehicle and attempting to sit on the front driver side seat, the driver seat turned completely around. The vehicle was taken to the dealer where it was diagnosed that the seat needed to be replaced. The vehicle was not repaired. The approximate failure mileage was 135,950.", "fail date": "  07/13/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The contact owns a 2008 Honda Pilot. The contact stated that the driver and passenger heated seat became extremelly hot before both stop working. The manufacturer was not made aware of the problem. The approximate failure mileage was 50,000.", "fail date": "  12/07/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "2008 Honda Pilot. The consumer was informed by Honda that there is a label inside the seats that says do not cut. The door panel was broken and the seats were coming apart. The seats were changed from cloth to leather and the drivers side window would not roll down.", "fail date": "  04/28/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Exterior Lighting problems", "description": "Winchester va 22602 Nov 23 2018 7:38 pm . The low beam head lights went out in the drizzle on very dark road. I had to keep hitting the high beams and run on the driving lights. While hitting the high beams when possible. This same problem was recalled on earlier models of Honda Pilots but it does not cover mine after going to repairpal this is a 9 model year problem. You can read post after post on different sites about this problem. There was a burning smell in the car at the time.", "fail date": "  11/23/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Exterior Lighting problems", "description": "Low beam lights do not work but high beam does. Replaced bulbs, checked fuse, checked relay, and lights still do not work.", "fail date": "  01/16/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Exterior Lighting problems", "description": "The contact owns a 2008 Honda Pilot. The contact stated that the interior courtesy map lights would not illuminate. An independent mechanic replaced a fuse under the dashboard area however, the malfunction continued to occur. The vehicle was then taken to an authorized dealer who advised that there was a short circuit within the map light housing wiring and also informed the contact that the defect was common. The vehicle had not been repaired. The manufacturer was not notified of the problem. The approximate failure mileage was 75,000.", "fail date": "  09/26/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Exterior Lighting problems", "description": "Climate control display lights are out. When driving at night I have to take my eyes off the road to turn my interior lights on, then take my eyes off the road again to find the appropriate button to adjust he heat or air. It's very dangerous constantly taking my eyes of the road, plus have to take my hands off the steering wheel multiple times to turn the interior light on & off to adjust the climate controls.", "fail date": "  01/23/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "State inspection faild, check engine light, bank 1 catalytic converter internal failure and bank 2 catalytic converter internal failure, passenger side axle to be leaking, power steering pump to be leaking, power steering reservoir tank to be leaking, front and rear brake pad.", "fail date": "  05/06/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "I was starting my car and the steering column started smoking and smelling burnt. It was able to start up but started up rough. Car then turned off and when tried to turn on it would no longer start up again or even when key turned to start position was unable to move the car out of park. This happened on 12/03/2021 but has yet to be inspected due to mechanic has not had time. The safety of myself, son, and grandson was at risk due to the potential of it catching fire if smoking and burnt smell along with unable to move car out of park and could have been in an unsafe location and could have caused an accident. There were no warnings of any kind prior to the failure with the car.", "fail date": "  12/03/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "New car, problems just uncovered.", "fail date": "  07/29/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "The steering shake was reported to the dealer directly after sale. The dealer told me they didn't notice anything wrong and I should not be going over 65 as that is the speed limit. They finally force balanced the tires and adjusted the alignment, 50% better. When they said they were through and it might be a flat spot on a tire I reported this to Honda motor cars of America case # [xxx]. I had a separate dealer check it out and they agree it is there but had no solution. They said all the safety equipment is in place and it may be a bent rim, bad tire or just the vehicle itself. I was called by the dealer where I bought it to bring it to an affiliate Honda dealer. They force balanced again and adjusted the alignment. It was a bit better but again still shakes. They then swapped tires and rims with an identical 2007 Pilot with new goodyear integrity tires (recommended as the tire that came on the vehicle)there was not difference. The 2007 when taken for a test ride was worse than my vehicle and someone will by that thinking it is just an alignment and have the same problem. Looking on line this is a problem with Pilots, Acura rdx and mdx vehicles of all years when used for highway driving. How does a company continue to make a faulty vehicle and dismiss hundreds of claims? there was yet another Pilot owner in the shop that day with the same problem. Awfully big coincidence!.", "fail date": "  06/16/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "Driving at slow speed in parking lot, while making a turn to the right with steering wheel close to full right turn lock. Keys on key ring caught within recess in the back of the steering wheel (recess is exposed to keys because of right turn), and lodged against casing that contains the key assembly, with the result of the steering wheel completely locking in the right turned position while moving, causing complete loss of steering control. I was able to stop the car without accident since no car was in the parking spaces at that time. Was only able to remove jammed key/steering wheel condition (after stopping) when Honda key broke, releasing the electronic portion of key from the metal portion, allow the wedging of the other key to release. Combination of keys on key ring and low speed full right turn cause the dangerous condition. Dangerous condition for other motorist with many keys (8) on relatively small key ring, allowing some keys on ring to point towards steering wheel rather than downwards. Honda should either plug the recess in steering wheel, or provide shielding to prevent keys from contacting back of the steering wheel. Note that the is the second time this has occurred since having this vehicle for 1. 5 years.", "fail date": "  02/23/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "Wheel vibrations at 68-70 mph. It's better at 73-76mph and comes back at 80mph and up. This happens from the date I purchased the car (October 6th 2008). Tried to fix it with dealers (balancing, aligning) but did not help.", "fail date": "  10/06/2008"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The key will not turn in the ignition. I was having trouble getting the key to go into the ignition about 2 days ago, now I can get the key in, but it will not turn. I can take the key in and out, but can not get it to turn. There is power to the vehicle when they key is inserted. The vehicle is in park and off when the issue happens.", "fail date": "  07/18/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Rear wiper prob - could not turn off ,last resort pulled fuse for wiper, fuse also controled passenger air bag. , why are they on same fuse? prob. With wiper could eliminate airbag.", "fail date": "  02/03/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Climate control display lights are out. When driving at night I have to take my eyes off the road to turn my interior lights on, then take my eyes off the road again to find the appropriate button to adjust he heat or air. It's very dangerous constantly taking my eyes of the road, plus have to take my hands off the steering wheel multiple times to turn the interior light on & off to adjust the climate controls.", "fail date": "  01/23/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "While driving at low speed on street attempted to roll down and then up rear driver side window. It stuck in the down position with motor making noise but no movement. This coincidentally happened right after expiration of factory warranty. Unable to secure vehicle from elements or theft as this occurred at 6:30 p. M. And dealerships service departments close at 7 pm and technichians for all 3 delaerships within driving distance not on duty that late in the day. . Unable to drive with rear window down on more than side streets 25-35 mph due to loud whooping in vehicle with window down. Violent pressure and sound while driving at 35 mph as if helicopter was in the vehicle.", "fail date": "  05/26/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "2008 Honda Pilot ex fuel emissions light came on without reason.", "fail date": "  02/14/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The electric cords in my car has been bitten by rodents for 5-6 times in the past year. Every time my car could be started or the warning lights are on. My car is parked in open parking lot. But this kind of problems just happened to my car, not my neighbors'. And it also happened to my friends who have the same model. I believe there are designing problems which are very dangerous.", "fail date": "  11/11/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "When you apply brakes above 30 mph steering wheel shakes and brakes pulse. Dtc 84-1 and abs system test says that the vsc/abs loses communication above 30 mph with no number code shown.", "fail date": "  08/16/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "Honda Pilot 2008 brakes automatically, for no reason, while driving. Occurred at 35mph on residential street, again at 50mph on highway. Sunny days, approximately 75 degrees fahrenheit. Driving straight.", "fail date": "  09/18/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "Electronic stability control. While driving home from my family christmas party, I turned a small corner at 15 mph and my breaks locked up. The vehicle will not go over 20mph now. It happened 4 times to me yesterday. 4 times. Each time I was shoved forward, and lost momentary control of the vehicle almost hitting a curb. It happened 3 more times on the road. Each time with cars near me. This is a huge safety issue when there are kids in the vehicle. I do not have a thousand or more to put into my car right now. Nor can I risk my life for a vehicle that I love.", "fail date": "  12/25/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "The electric cords in my car has been bitten by rodents for 5-6 times in the past year. Every time my car could be started or the warning lights are on. My car is parked in open parking lot. But this kind of problems just happened to my car, not my neighbors'. And it also happened to my friends who have the same model. I believe there are designing problems which are very dangerous.", "fail date": "  11/11/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "The contact owns a 2008 Honda Pilot. The contact stated while approaching a stop sign and depressing the brake pedal, the vehicle inadvertently accelerated. The contact stated no warning light was illuminated. The contact stated he shifted gears to neutral and continued to depress on the brake pedal and the vehicle began to shake forceful until the vehicle stopped. The contact stated he was able to drive to his residence. The vehicle was taken to an independent mechanic however, the mechanic was unable to duplicate the failure. The contact called bianchi Honda (8430 peach st, erie, PA 16509, (814) 868-9678) and the dealer was made aware of the failure. The vehicle was not diagnosed nor repaired. The manufacturer had not been informed of the failure. The failure mileage was approximately 179,942.", "fail date": "  04/10/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "I was pulling into a parking spot at work when the Honda Pilot accelerated on its own. I applied the brakes but the vehicle continued to accelerate. I went thru a fence and slammed into another car causing damage.", "fail date": "  01/08/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "While backing out of driveway vehicle sped backwards with tremendous speed rapidly causing driver to loose control - vehicle raced across the city street slamming into tree totaling the vehicle - vehicle sped up as driver took foot off brake.", "fail date": "  10/05/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "The contact owns a 2008 Honda Pilot. The contact stated that after shifting the vehicle into reverse, the vehicle accelerated forward without manual force. The contact then crashed into a parking sign. The contact did not sustain any injuries and a police report was filed. The vehicle was not repaired and the manufacturer was notified. The approximate failure mileage was 91,000.", "fail date": "  09/05/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Visibility", "Sub Problem": "Windshield problems", "description": "The contact owns a 2008 Honda Pilot. She entered the vehicle after a rainy day and noticed the carpet on the drivers and passenger side was wet. The vehicle was taken to an authorized dealer where she was informed there was a leak coming from the windshield and it was repaired. The failure has since recurred twice. After each occurrence the vehicle was taken to an authorized dealer to be repaired. The failure and current mileages were 60,000. Updated 01/13/lj\nupdated 02/07/11.", "fail date": "  10/06/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2008 Pilot", "Problem": "Visibility", "Sub Problem": "Windshield problems", "description": "The contact owns a 2008 Honda Pilot. While driving approximately 35 mph, the contact noticed that the projector style headlamps caused poor visibility in rural areas. The dealer stated that the headlights met fmvss and were designed in that fashion. The contact filed a formal complaint with the manufacturer and has copies of all written correspondence that was sent. The failure mileage was 500 and current mileage was 3,000. Updated 03/10/08. The consumer stated there was an artificial line on the windshield that constantly moved with the vehicle.", "fail date": "  11/06/2007"}]