[{"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "My 2021 Honda Pilot's idle-stop system has been failing at random and dangerous times. The engine shuts off when idle-stop is engaged and as expected. However and until recently; when I release my foot from the break, nothing happens. The engine does not start. Restarting the engine has taken me to shift to park, turn the car off, wait a few minutes, and then it starts without any hesitation. Today this happened during a busy stop where I did not feel safe for myself or my passengers. The problem does not reproduce at my will or by performing any specific set of steps. After today, I'm nervous to drive with this system enabled. The problem never happens if I remember to manually disable the idle-stop system every time I start my car. Nevertheless, it's not a normal practice for me to have to disengage a feature that should work. This problem has not been reproduced or confirmed by a dealer or independent service center. The component has not been inspected by the manufacturer, police, insurance representatives, or any others. There were no warning lamps, sounds, messages, or other symptoms prior that would indicate an imminent failure.", "fail date": "  11/02/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "When stopped and idling at an intersection (just south of north avenue on milwaukee avenue in the city of chicago) the vehicle engine turned off and would not restart, as it normally does when the car is idling. A message appeared saying, to “push the brake and push the start button” to restart the car. The battery light came on. I tried twice to start it, with no result. I turned on the hazard lights so traffic could attempt to move around me. I tried twice more. Nothing. I couldn’t get the Pilot to either start or completely turn off. Finally, while I was thinking about what to do next, the Pilot completely shut down on its own. I was able to restart the car normally. Prior to this there were no warning lights, and no signs of failure. The idle-stop usually works fine. No one has inspected the vehicle yet. This incident put me and my family at risk as I was in the middle lane of milwaukee avenue in heavy traffic, with no way to start the car or turn it off. I turned off the idle-stop feature to drive the 100+ miles home. I’ll call the dealer Monday morning.", "fail date": "  08/12/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "New car battery and car died while waiting at a light. The vehicle idle/stop system kicked in but car was not able to restart. While lights were still available on dashboard, the emergency hazards would not show nor could I put the car in neutral. The dealer looked at this problem twice, first time stating this can just happen and this time they said the new battery was perhaps faulty and replaced the battery. Very dangerous situation as the car just died at the light and cars had no way of knowing the car was disabled as the hazards would not work. Had an emergency jumper pack and was able to move the car to get out of road before it died again- no option to push car as I could not put car in neutral. This is the 3rd time this issue with the battery dying has happened and dealer cannot supply an answer except to swap out the battery. Less than 1. 5 years old and <26k miles.", "fail date": "  06/23/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The cars automatic emergency breaking system malfunctions and randomly activates and applies the brakes while driving. This specific incident has occurred three times when entering the highway on ramp the \"brake\" message is displayed in the car and the brakes have been applied as I've attempted to get up to speed entering the highway. There were no cars in front of the vehicle at the time the emergency breaking system applied the breaks. In addition, the braking system has applied when changing lanes on the highway with no vehicles or objects in front of the car and several times on curvy roads. I've taken it back to the Honda dealer and they have stated that no codes were stored and were not able to recreate the problem. However, the service advisor also informed me that they could not reset or make any changes as \"there is pending litigation and investigations with the ntsb\" I was charged $109 for a 'diagnosic fee' for a car that is still under the manufacturers waranty and told to watch for a recall at some point because their is nothing they are able to do to fix the problem because of the pending litigation/investigation. The incident happened two more times on my drive home from the dealership. There is no warning lamps that have come on or other symptoms that can be isolated, other than the \"brake\" message appearing and the automatic breaking being applied. This is incredibly dangerous when the car drastically is slowed down for no reason on roads that have 45 + mph speed limits.", "fail date": "  04/23/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The car's automatic engine shut-off feature when stopped at a red light failed to reengaged after removing foot from break the car shut down and the transmission button shifted into neutral and displayed a message that you must put your foot on the brake and shift the car to park. The battery indicator light was flashing and everything turned off in the car. After doing this the car told me I must put my foot on the break and restart the car. It then allowed me to shift back into drive. The dealer was not able to recreate the issue, and no other things showed the issue other than the battery indicator lamp flashing on and off until the car was back in drive. The light I lost all power at was on a road with a 55 mph speed limit. When the light turned green and the car lost all power there was another vehicle approaching, but I was not able to get the car moving fast enough to get out of the way.", "fail date": "  04/16/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Our Pilot is brand new - we started noticing popping and cracking sounds from the dashboard. It is pretty loud. We thought it was possibly the radio but it continues with the radio off. We thought it was the dashboard contracting/expanding but it happens in all weather. It has become increasing loud and consistent and now any sounds from the stereo, regardless of input, skip and glitch and we turn it off and the popping and cracking sound continues seemingly from the speakers. We took it to the dealership for repair but they said they can't repair it. This is not acceptable for a new car.", "fail date": "  12/14/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The information board goes out frequently and does not stay connected with phone. It started with the appleplay and the bluetooth dropping my phone and saying there was nothing connected. Then it would not connect at all. My infoboard behind the steering wheel then started to go on and off. There was one time that I was driving and the entire system went out and I had no idea where to turn and how fast I was going. The heating on the steering wheel does not work and does not warm up or just warms to the 1 I have called and taken my car in 2 times. They said this last time that it was fixed. It does not recognize my phone again and starting to drop calls. There is also loud static when you do get access to bluetooth or the sound goes muffled.", "fail date": "  11/03/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Driving down interstate. Sunny day 75 degrees. Moonroof exploded.", "fail date": "  10/16/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Driving down the road and the sunroof glass spontaneously shattered. Loud band and it just imploded raining glass pieces into the car. Local Honda dealer said they had seen several of these including one the day before. However, Honda would not cover it even though the car is only five months old and purchased brand new, top trim level.", "fail date": "  08/24/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "At about 8600 miles between speeds of 38 -60 miles per hour, I began to notice and experience a tremendous wind noise coming from both driver and passenger windows. The vehicle has been to (2) two separate Honda dealerships on (4) four different times to address this issue, but the problem remains and or has not been fixed in spite of all the repairs made by the dealerships. I was advised by the dealerships that this is how Honda manufactured the vehicle and that there was nothing else the dealerships could do to fix the problem. Driving the vehicle is now problematic because of the wind noise, as it appears my windows are down, even though they are not. There is a safety concern because I do not know whether a panel, garnish or windshield might come apart, tear away and potentially create a hazardous condition for myself, passengers or even the other motorists.", "fail date": "  08/15/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Driver side vehicle outside rear view mirror has separated from its' underlying mounting plate, while still being attached by a heating wire connected to the back surface of the mirror. Therefore it has been vibrating such that rearward visibility has been severely compromised and places both us and others at risk. It has now separated to the point that it is pulling out the wire and without tape will hang off it's housing. We have brought this issue to the attention of hertrich Honda of easton MD. As well as Honda. We are told by the dealer that this is a common issue on the Pilot and other models and that Honda has not provided a fix for the problem. In fact we are told by the dealer that there are no replacement components or mirrors available to fix the problem. Honda indicates that they are not aware of the problem. We have been addressing this problem with the dealer for over five months with no resolution. At this time the passenger side mirror is also vibrating severely but to our knowledge has not separated completely from the housing. We believe that this situation is very dangerous and seem not to be making progress in finding an acceptable resolution.", "fail date": "  08/03/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Loud popping and crackling noise emitting from speakers. Cannot turn them off, and causes major interruptions in navigation, radio, entertainment. Dealer said falkra wiring is faulty, but is back-ordered, and could not even give us an estimate of when it would arrive. Essentially told us to suck it up, but it is more than distracting (my daughter actually said it gives her a headache) and I'm worried about larger (safety) issues if the wiring is indeed faulty. What if my other electrical systems malfunction as well?.", "fail date": "  07/30/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Within one week of purchase, the sideview mirrors were noted as shaking inside the housing. After a week of driving the mirrors are detaching from the housing. This has created a serious issue with visibility because of the movement but it will be worse if the mirror falls out. The service manager douglas burton and sales manager craig schwinn said that Honda \"does not have a fix\" for the issue. Douglas said that the mirrors should be taped down. Honda America has not responded to multiple requests for resolution.", "fail date": "  07/08/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The driver side mirror is loose. This is due to a defective batch of mirrors sold in a large number 2021 Honda odysseys and 2021 Honda Pilots. Honda is aware of this issue. Other drivers are aware of this issue and the dealer has acknowledged this to me. At highway speeds, the driver side mirror vibrates and becomes unusable or distracting (I. E. Unable to focus on objects while changing lanes, etc. ) resulting in an unsafe driving experience. Bringing the car back to dealer results in them taking the mirror off, putting on more glue, and reattaching. This works for 1-2 months until the glue becomes loose again. According to the dealer, Honda has not come up with a permanent fix but does is not willing to install an entirely new mirror assembly. I believe this mirror issue justifies a recall for all defective vehicles and a permanent fix which may include an entire new mirror assembly if a permanent glue on the mirror actuator cannot be used.", "fail date": "  07/01/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Driving on 495 in virginia north toward 66 near annandale at around 55 to 60 miles per hour on the beltway, non-toll portion, we were shocked to hear the sound of exploding glass followed by rushing air, like an open window. We looked all around the windows to see if there had been some sort of impact, but all windows including windshield were intact and free of damage. I realized from the whooshing sound that it was coming from the sunroof. The interior shade was closed at the time, but when I was able to safely stop the car, I realized that the glass had exploded upwards. Some small shards were still inside the shade as in the picture, but most appeared to have shot upward and back onto the highway. Apart from the sunroof, there were no signs of any damage or impact, and at the time that the explosion occurred, we looked all around to try and find any potential source of impact in case something had flown up from the road or fallen from above, but there was none (no debris anywhere nearby on the road, no overpasses nearby, etc. ).", "fail date": "  03/14/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "When using the handsfree bluetooth function, the recipient cannot hear what was spoken as it makes boisterous/ static noise. This is even severe when the heater fan is on. Both ios and android phones observe the same results. My local Honda dealer says it is the characteristic of this model, and this is not acceptable.", "fail date": "  01/19/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I have been harassed and yelled at when driving my black edition car. People are finding it offensive name and if I would have known this I would not have purchased. I have even got threats of harm due to the name in atlanta. I can not even drive my car when I am going to certain parts of my job due to the fear that I have from the name and yells that I get.", "fail date": "  12/01/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "With the auto idle feature engaged (disengaging requires manually turning off the system with each vehicle start) while at a stop light the auto idle feature shut the engine off. Typically, when you release the brake the car start back up and you can begin to accelerate. Over the past few months the issue has stalled the engine, but restarted and give the warning \"collision mitigation braking system malfunction. \" on the past 2 occurrences the engine has shut off completely and I have had to restart the car. This occurs when at an intersection or similar after going into a complete stop, so vehicles around you are ready to move. Once it took me opening the car door and closing it to get the electronics to allow the car to restart.", "fail date": "  08/31/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "The car braked automatically without any obstruction or car in front. I lost control of the brakes causing a severe jerk and car to slip on freeway. I had a 2 month and 5 yr old in the car. We nearly escaped a serious accident as the truck was behind us in full speed. The whole warning/stopping event occurred in a few seconds. There were no obstacles in the road,\" the driver wrote. \"there was a truck following me about 2 car lengths behind who had to stop very quickly in order not to rear-end me. \" I am scared and dont want to drive the car anymore.", "fail date": "  08/24/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "The controls froze while driving and I was unable to safely maneuver the vehicle and it crashed in nearby bushes. I don’t see any recall for the VIN, also we asked the motor repair team run scan though nothing was found. But would like to report this as we still feel it is some mechanical failure.", "fail date": "  05/21/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "The cars automatic emergency breaking system malfunctions and randomly activates and applies the brakes while driving. This specific incident has occurred three times when entering the highway on ramp the \"brake\" message is displayed in the car and the brakes have been applied as I've attempted to get up to speed entering the highway. There were no cars in front of the vehicle at the time the emergency breaking system applied the breaks. In addition, the braking system has applied when changing lanes on the highway with no vehicles or objects in front of the car and several times on curvy roads. I've taken it back to the Honda dealer and they have stated that no codes were stored and were not able to recreate the problem. However, the service advisor also informed me that they could not reset or make any changes as \"there is pending litigation and investigations with the ntsb\" I was charged $109 for a 'diagnosic fee' for a car that is still under the manufacturers waranty and told to watch for a recall at some point because their is nothing they are able to do to fix the problem because of the pending litigation/investigation. The incident happened two more times on my drive home from the dealership. There is no warning lamps that have come on or other symptoms that can be isolated, other than the \"brake\" message appearing and the automatic breaking being applied. This is incredibly dangerous when the car drastically is slowed down for no reason on roads that have 45 + mph speed limits.", "fail date": "  04/23/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "My car has had the automatic emergency braking system kick in randomly at least 6 times since I bought it. No cars in front of me, nothing on the shoulder next to me. Twice when a car was in opposite direction lane but nowhere near the center line.", "fail date": "  02/22/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "Automatic braking system is engaging when there is nothing in front of or near the vehicle. When driving on the highway it will engage, flash brake on the front dash, and engage the brakes and slow way down while doing 60+ mph.", "fail date": "  02/22/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "There have been multiple instances where the automatic braking system has engaged preventing me as the operator from making adjustments. I have almost been in 2 collisions due to this feature. The automatic braking system prevents me from making a correction and will automatically lock up the brakes and steering. Both times I have almost been rear ended due to this feature. There has been an instance where the braking feature engaged where there was no car in from of me but a car coming from the other lane and my Honda Pilot engaged the automatic braking system. Luckily there was no car behind me. This feature while could be useful is not in my opinion a safety feature but a safety hazard due to these multiple instances. This feature should be permanently disabled upon start up. Multiple times when I start the car I don't realize it is engaged until something happens.", "fail date": "  01/20/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "Automatic brakes happened a couple time on highway for no reason. Happened most in carpool lane and curve freeways.", "fail date": "  01/06/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "There have been several times the automatic braking assist has completely stopped the car. This has caused vehicles behind me to break hard almost causing accidents. I now disengage the automatic breaking assist when I use the car. I saw there were incidents with other Honda vehicles that didn't include the 2021 Honda Pilot which I believe should be included. I have witnesses of the car breaking to a complete stop several times. Please investigate before more accidents happen with injuries. Thank you for your hard work involved.", "fail date": "  11/20/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "On 2 different occasions within the last 2 days, the automatic emergency brake engaged for no reason. The first instance, I was driving down the road with a car in front of me about 3 car lengths ahead and a car in a left hand turning lane. For no reason the brake light engaged and the brakes hit hard but not fully. Thankfully the car behind me was far enough to not hit us as I had my child in the car. On the second instance, again with my family in the car, driving down a different road with no cars anywhere around us, going around a bend, the emergency brake engaged again and the brake hit hard but not fully.", "fail date": "  09/18/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "I have a major safety complaint with Honda’s computer system. I understand that Honda works hard to make their vehicles as safe as possible. With that said, on 7/29/21 around 9:40am I was driving on a country style road. Out of no where with nothing around me but trees the auto break safety feature came one. When this occurred I was jerked forward and got whiplashed. The car went from 40mph to 0mph immediately with no reason. As someone who has had concussions in the past this immediately gave me a headache. Thank goodness no one was behind me that would have rear-ended me. This issue with the auto break system occurs a couple times a week. Sometimes the breaks don’t enact but the break warning light comes on and shakes the stirring wheel in which is extremely distracting. With this being said we have brought it up to a Honda service member and the response back we got was: “OH, yeah that happens sometimes. There’s nothing we can do about it”. The car is my leased by my spouse.", "fail date": "  07/29/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "The front end collision camera will register on coming traffic and warn me to brake. On one occasion the vehicle actually braked for me. Luckily I was only driving 25 mph and there were no vehicles behind me. We took the vehicle to the dealer to have them look into the issue but they informed me that Honda did not currently have a fix for the issue and that I would have to turn the camera off every time I started the vehicle to prevent it from potentially braking for me and bringing me to a complete stop while driving. Our main concern is that the camera picks up an on coming vehicle and stops us while driving on the highway causing us to veer off the road or get rear ended potentially injuring us or other drivers. We have tried several times over the course of several months to contact Honda directly about the issue but they will not return our calls.", "fail date": "  05/01/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "Sideview mirror on driver's side shakes/vibrates, thus causing blurry view. Noticed more during higher speeds.", "fail date": "  08/12/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "On June 4, 2022, our 2021 Pilot was parked on the driveway with no one around it. It has been parked there for 2 days and the last time it was driven was on June 2. I was walking on the driveway towards our mailbox when all of a sudden the rear window exploded outward. Almost all of the glass were on the driveway and there were hardly any glass inside the vehicle. I called Honda customer service and I was told that I had to bring it to a dealer to see if it was a manufacturer's defect. However, the dealer would not be able to look at the car in a timely manner. I called my insurance and they covered the replacement glass yesterday. I researched the internet there were several similar incidents involving the rear window of Honda Pilots bursting/exploding. I am reporting this since this could be a potential driving hazard and a safety issue.", "fail date": "  06/04/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "The entire rear windshield compeltely failed on us. Last night (02/06/21) when we we turned on our new 2021 Pilot and started exiting the garage, the rear windshield forcefully exploded! the entire windshield shattered to pieces. It seemed like someone shot at our windshield but no one was outside. The windshield was never cracked before either, it was a new car! there were kids in the back and it was a huge saftey hazard. The glass pieces were everywhere. This couldve happened on the road as well but thankfully we were in the garage. This is totally unacceptable for a new car and surely there was a defect in the tampered glass developed hy Honda in the first place. We have done a previous service with Honda and Honda told us all is good. Honda must answer for this since this was a very dangerous situation and traumatizing for my kids.", "fail date": "  02/05/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "Driver side mirror glass distorted and is available for inspection upon request. The driver side mirror distortion is difficult to see traffic causing a safety issue. Dealer has tried twice to repair with no final resolution. Service manager states Honda has inspected the review mirror issue.", "fail date": "  09/15/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "Driver side vehicle outside rear view mirror has separated from its' underlying mounting plate, while still being attached by a heating wire connected to the back surface of the mirror. Therefore it has been vibrating such that rearward visibility has been severely compromised and places both us and others at risk. It has now separated to the point that it is pulling out the wire and without tape will hang off it's housing. We have brought this issue to the attention of hertrich Honda of easton MD. As well as Honda. We are told by the dealer that this is a common issue on the Pilot and other models and that Honda has not provided a fix for the problem. In fact we are told by the dealer that there are no replacement components or mirrors available to fix the problem. Honda indicates that they are not aware of the problem. We have been addressing this problem with the dealer for over five months with no resolution. At this time the passenger side mirror is also vibrating severely but to our knowledge has not separated completely from the housing. We believe that this situation is very dangerous and seem not to be making progress in finding an acceptable resolution.", "fail date": "  08/03/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "Driver side mirror (side) shakes at highway speed. This makes it hard to see incoming traffic on driver’s side. Passenger side mirror okay.", "fail date": "  07/16/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "Both side mirrors on the outside of the car shake and vibrate causing images in them to be blurry and hard to see. This is a safety issue, especially at night, because you cannot see truly where the vehicle beside you is. Only until the bsm comes on can you sometimes tell a car is beside you while driving at night. Notified dealer who said there was no permanent fix as of right now. On 7/3/2021 a service advisor did a band-aid fix of double sided tape on the passenger side mirror, but it is now shaking the exact same as before that was done.", "fail date": "  07/03/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "The problem is the driver's outside rearview mirror. The mirror shakes so much that it is useless at highway speed, you cannot focus on vehicles coming up on your left hand side. The dealer and Honda are aware of the problem since the beginning of 2021. That being said both allowed me to purchase the 2021 Honda Pilot in June 2021. I have been in contact with the dealer over 6 times to see if a fix has been made available? I also filed a complaint with Honda in July 2021 and got no date for a fix. I have avoided an accident on three occasions, my daughter once and my wife has had close calls. How can a dealer and Honda sell me a vehicle with a known defect and not be able to fix it?.", "fail date": "  07/01/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "The side-view mirror on the driver's side of the vehicle vibrates to the point of the images not being clear. The vibration gets worse with increased speed. In addition, once the mirror is set and starts vibrating it does not remain in place. This is a safety hazard as driver sets mirror and when they look to see if a car is visible in the mirror is not showing proper location. Furthermore, the vibration of the mirror makes it difficult to see the image in the mirror. This incident occurred on a test drive vehicle while looking for a car and I was told this would be fixed. I indicated I wanted a different car and the car I ended up purchasing had the same issue. When I called the service department they told me this was a known issue and Honda was working on it. The service department did replace my side-mirror with a new one but that did not fix the issue.", "fail date": "  06/28/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "The contact owns a 2021 Honda Pilot. The contact stated that after driving approximately 3 hours, the wind shield wiper fluid spray nozzle remained obstructed with ice and the front windshield could not be cleaned. After clearing ice from the nozzle, the failure continued to occur. The cause of the failure was not determined. The local dealer plaza Honda located at 2722 nostrand Ave, brooklyn, NY 11210 was notified of the failure. The manufacturer was not contacted. The failure mileage was 4,800.", "fail date": "  01/29/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The car braked automatically without any obstruction or car in front. I lost control of the brakes causing a severe jerk and car to slip on freeway. I had a 2 month and 5 yr old in the car. We nearly escaped a serious accident as the truck was behind us in full speed. The whole warning/stopping event occurred in a few seconds. There were no obstacles in the road,\" the driver wrote. \"there was a truck following me about 2 car lengths behind who had to stop very quickly in order not to rear-end me. \" I am scared and dont want to drive the car anymore.", "fail date": "  08/24/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Auto braking applies randomly cause brakes to lock up happens when driving in any conditions. This problem has already caused a minor accident with my vehicle due to brakes locking up and no throttle.", "fail date": "  07/08/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The cars automatic emergency breaking system malfunctions and randomly activates and applies the brakes while driving. This specific incident has occurred three times when entering the highway on ramp the \"brake\" message is displayed in the car and the brakes have been applied as I've attempted to get up to speed entering the highway. There were no cars in front of the vehicle at the time the emergency breaking system applied the breaks. In addition, the braking system has applied when changing lanes on the highway with no vehicles or objects in front of the car and several times on curvy roads. I've taken it back to the Honda dealer and they have stated that no codes were stored and were not able to recreate the problem. However, the service advisor also informed me that they could not reset or make any changes as \"there is pending litigation and investigations with the ntsb\" I was charged $109 for a 'diagnosic fee' for a car that is still under the manufacturers waranty and told to watch for a recall at some point because their is nothing they are able to do to fix the problem because of the pending litigation/investigation. The incident happened two more times on my drive home from the dealership. There is no warning lamps that have come on or other symptoms that can be isolated, other than the \"brake\" message appearing and the automatic breaking being applied. This is incredibly dangerous when the car drastically is slowed down for no reason on roads that have 45 + mph speed limits.", "fail date": "  04/23/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "My car has had the automatic emergency braking system kick in randomly at least 6 times since I bought it. No cars in front of me, nothing on the shoulder next to me. Twice when a car was in opposite direction lane but nowhere near the center line.", "fail date": "  02/22/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Automatic braking system is engaging when there is nothing in front of or near the vehicle. When driving on the highway it will engage, flash brake on the front dash, and engage the brakes and slow way down while doing 60+ mph.", "fail date": "  02/22/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "There have been multiple instances where the automatic braking system has engaged preventing me as the operator from making adjustments. I have almost been in 2 collisions due to this feature. The automatic braking system prevents me from making a correction and will automatically lock up the brakes and steering. Both times I have almost been rear ended due to this feature. There has been an instance where the braking feature engaged where there was no car in from of me but a car coming from the other lane and my Honda Pilot engaged the automatic braking system. Luckily there was no car behind me. This feature while could be useful is not in my opinion a safety feature but a safety hazard due to these multiple instances. This feature should be permanently disabled upon start up. Multiple times when I start the car I don't realize it is engaged until something happens.", "fail date": "  01/20/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "There have been several times the automatic braking assist has completely stopped the car. This has caused vehicles behind me to break hard almost causing accidents. I now disengage the automatic breaking assist when I use the car. I saw there were incidents with other Honda vehicles that didn't include the 2021 Honda Pilot which I believe should be included. I have witnesses of the car breaking to a complete stop several times. Please investigate before more accidents happen with injuries. Thank you for your hard work involved.", "fail date": "  11/20/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Brake grinding noise when rotors get hot.", "fail date": "  08/04/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Tire", "Sub Problem": "Tire problems", "description": "Purchased vehicle in August 2021. Discovered that driver side rear tire was completely flat while parked in my driveway. Noticeable gash in sidewall of tire continental crosscontact lx a376 d3k9 2321; 245/50r20 102h. Dealership had no explanation for the gash and since no recalls, had to pay nearly $300 for a new tire on a vehicle that was driven 2 months since purchased. My other tires are 2321, 2421, 2421, and the new tire is 4720. I saw there were two recalls for Pilot tires in the recent past and these tires should be reviewed as well.", "fail date": "  10/17/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Tire", "Sub Problem": "Tire problems", "description": "I purchased a new 2021 Honda Pilot in April. The incident occurred on 9/25/2021 at approximately 1:52pm cst. I was driving in illinois (on I-88 near exit 132). I was driving at approximately 65 mph. The road had no debris. The vehicle (tires) was operating smoothly. Then, suddenly, the rear passenger tire ruptured/blewout, making the vehicle dangerous to drive (dangerous for passengers and other vehicles and pedestrians/workers). There was no warning light. I pulled over and the illinois state toll highway authority helped in replacing the ruptured/blownout tire (see pictures of tire to assess damage). Tire: 245/50r20 102h - contenental crosscontact lx sport - dot a376 d3k9 0621. There was a recall on 2021 Honda Pilot tires. These tires may need to be recalled as well. I'm submitting my complaint to NHTSA. I have not yet contacted the dealership where I purchased the vehicle. Nor have I I discussed it with my insurance.", "fail date": "  09/25/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2021 Pilot", "Problem": "Tire", "Sub Problem": "Tire problems", "description": "We were driving on a 8 lane highway at night 8:45 pm in our brand new 2021 Honda Pilot elite with less than 2200 miles on it. Our car's tire pressure light cam on. 2 miles later our front passenger tire blown out traveling at speed greater than 55 mph. My pregnant wife, dogs and myself could have been killed. Currently these tire models are being recalled (2920), however, our tire was made (3920) did not quailfy for the recall. Clearly that was a mistake. Our local Honda dealership did a quick inspection of the tire and stated that the warranty would not cover and since continental tires does not have a recall on the tire, there was nothing they could do.", "fail date": "  05/14/2021"}]