[{"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2011 Honda Pilot. The contact stated that upon starting the vehicle, the driver’s side air bag warning light illuminated on the instrument panel. Neither the dealer nor the manufacturer had been notified of the failure. The vehicle was not repaired. The failure mileage was approximately 135,000.", "fail date": "  02/11/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall - front driver and passenger and front dash airbags, the sendor does not work. They will not deploy if we were to be in an accident. Also, I have been experiencing transmission shudder in my 2011 Pilot exl. When on light throttle between 25-40 mph, then it disappears. This is while driving on the highway and city streets.", "fail date": "  06/17/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Tl the contact owns a 2011 Honda Pilot. The contact received notification of NHTSA campaign number: 18v661000 (air bags) and stated that the manufacturer exceeded a reasonable amount of time for the recall repair. Subaru of ontario (1195 auto center dr, ontario, CA 91761, (888) 905-4875) was contacted and confirmed that the parts were not available for the recall remedy. The manufacturer was not made aware of the issue. The contact had not experienced a failure. Parts distribution disconnect.", "fail date": "  01/01/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall - I received a letter in the mail regarding this recall and called the local Honda dealership to make an appointment. They were able to get me in the following week , which was today Nov 20, 2018. I arrived which is 30 mins from my house and they informed me that they did not have any air bags available / they were out of inventory. This is very concerning to be because now I have to wait and I will out of town (traveling with children in the car) to another state for thanksgiving. The dealership is west broad Honda - richmond, va (804-672-9200).", "fail date": "  11/20/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Got in a two car collision. Totaled out the Honda Pilot 2011. Hit head on. No airbags were deployed in the Pilot. Accident took place on highway 51 in ridgeland, ms. Vehicle was not in motion, other vehicle going approximately 45 mph.", "fail date": "  10/10/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Accident took place on highway 51. My car, the 2011 Honda Pilot, was deamed totaled by insurance. No airbags were deployed during or after the accident occurred. I was pulling out of a parking lot and truck with a steal bumper hit me going approximately 45mph. The front end of the Honda Pilot was demolished.", "fail date": "  10/10/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Tl takata recall. The contact owns a 2011 Honda Pilot. The contact received notification of NHTSA campaign number: 18v661000 (air bags). The contact called hamilton Honda at 609-528-2600 (located at 655 us-130, hamilton township, NJ 08691) and was informed that the parts were not available. The manufacturer was not made aware of the issue. The contact had not experienced a failure. Parts distribution disconnect.", "fail date": "  09/27/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. While VIN check does not indicate my 2011 Honda Pilot is part of an active recall, I'm concerned about the loss in resale value based on all of the negative media coverage/internet coverage and active recall and class action lawsuit against takata.", "fail date": "  01/11/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "No response to VIN #.", "fail date": "  12/04/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "I purchase this Honda Pilot touring 2011 and would like to know if there is a recall for airbags or any other matter. Safety is my concern and my family.", "fail date": "  12/03/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata airbag recall November 2017.", "fail date": "  11/10/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "My wife was driving and and car went to pass her a hit a tractor coming other direction. Car hit her on drivers passenger side spun her around and she hit a mailbox on front of car than slid and hit a tree on passenger side . No air bags deployed. Can't understand it.", "fail date": "  06/14/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "I received a letter from Honda early last summer notifying me of the recall of my airbags saying parts would be ready in the fall and I would get another letter. So far I have heard nothing else from them.", "fail date": "  12/12/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. - it has been more than 60 days (since I received the letter from Honda and since I notified Honda of fort worth, 3400 w loop 820 s, fort worth, TX 76116 . I have called them several times and they told me to avoid having a passenger on the front seat. This is not acceptable; I have children and that's why I got an SUV, children ride in the back and adults in the front. If I am not able to drive our Pilot the way it was designed, I would like to request an equal loaner vehicle until the air bag is fixed. Waiting longer is not acceptable. Respectfully, juan romero.", "fail date": "  09/30/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2011 Honda Pilot. The contact received notification of NHTSA campaign number: 16v346000 (air bags) and stated that the part was not available within a reasonable time frame to schedule the recall repair. The interim notice did not give a specific date for when the part would become available. The manufacturer could not provide an estimated date for when the vehicle would receive the recall repair. The contact was not experiencing a failure. VIN tool confirms parts not available.", "fail date": "  08/29/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2011 Honda Pilot. The contact received notification of NHTSA campaign number: 16v346000 (air bags); however, the part to do the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the repair. The manufacturer was made aware of the issue. The contact had not experienced a failure.", "fail date": "  08/12/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. Honda automobile division sent me the recall but now says contact dealer. Dealer ordered part 3 Aug. To date no part. Dealer takes trade ins cars requiring recall and sells them. I was told swapping recall parts by the dealer is authorized. Are my parts being swapped by the dealer to sell trade ins instead of fixing customers. Dealer is university Honda, florence al, 35630. Honda automotive division is recordings only, dealer has no answers and makes no contact regarding status of ordered part while I continue to drive an unsafe vehicle. Honda has not stepped up to the plate on this issue and only put you on to the dealer who appears more interested in selling trade ins that fixing customers' cars. Honda should track recall parts by VIN and inform the customer when their part has been shipped with expected delivery date. As currently managed the customer has no way of knowing anything about the status of the part ordered for their car by VIN. Trust in the dealer is not a viable solution as their objective is to sell cars, Honda has the responsibility to the customer for safe cars and they are failing. I also have a 2009 Honda ridgeline VIN# [xxx] that is subject to the recall with the same issue. Information redacted pursuant to the freedom of information act (foia), 5 u. S. C. 552(b)(6).", "fail date": "  08/03/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2011 Honda Pilot. The contact received notification of NHTSA campaign number: 16v346000 (air bags) and stated that the part was not available within a reasonable time frame to schedule the recall repair. The dealer did not give a specific date for when the part would become available. The manufacturer could not provide an estimated date for when the vehicle would receive the recall repair. The contact had not experienced a failure. VIN tool confirms parts not available.", "fail date": "  08/01/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2011 Honda Pilot. The contact received notification of NHTSA campaign number: 16v346000 (air bags); however, the part needed to repair the vehicle was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was notified of the issue. The contact had not experienced a failure. VIN tool confirms parts not available.", "fail date": "  07/27/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "I received a recall notice in July 2016 on the airbag defect. I have tried having the vehicle serviced but have not had any luck. Several calls have been made to the local dealer and they are still unable to repair my vehicle. It has been over 2 months (60 days) since I contacted the dealer for a repair appointment. All of this time I must avoid having any passengers ride in the front passenger seat until the recall is performed. I am unable to use my vehicle to transport my family on trips and therefore unable to use it for its intended purpose.", "fail date": "  07/25/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2011 Honda Pilot. The contact received notification of NHTSA campaign number: 16v346000 (air bags) and stated that the part needed for the repair was not available. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure. VIN tool confirms parts not available.", "fail date": "  07/22/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2011 Honda Pilot. The contact received notification of NHTSA campaign number: 16v346000 (air bags); however, the part to do the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure. VIN tool confirms parts not available.", "fail date": "  07/22/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2011 Honda Pilot. The contact received notification of NHTSA campaign number: 16v346000 (air bags); however, the parts to do the repair were unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was not notified. The contact had not experienced a failure. VIN tool confirms parts not available.", "fail date": "  07/22/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Taketa recall is affecting my only vehicle. I take my elderly family to doctor appointments in this vehicle. Nothing got resolved for me in weeks as I can't take my family in the vehicle as no one can ride in passenger seat. Honda isn't replying. Feel like I'm left with a unusable car which I'm still paying off. I'm very upset!.", "fail date": "  07/22/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall: received letter from Honda 7/20/16 w/recall notice. Called that day to apply for loaner car. Told I'd hear back in 1 week. No call. Called 8/8 told would hear that day. No call. Called 8/24 & was told air bags were available (didn't receive letter telling me that as indicated in original letter). Called dealer. Told it would be 1 - 2 months. Called Honda 8/31 asking about loaner car. Got call back that day saying loaner denied. Paid a lot of money for car & not able to use it as intended for last 6 weeks and probably another 2 months. Honda's not taking care of customers (Honda owners since 1978) as they should. The mistake was theirs and they are passing the problem on to customers. And not doing everything they can to make it up to them.", "fail date": "  07/20/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall Honda is refusing to call me in regard to this recall, and specifically to discuss options for alternative transportation. O I received a recall letter from Honda in July 2016, instructing me to not use the front passenger seat. O I contacted them on 7/19/2016, and they said that a case manager would call me back, but no such call came. O I called them back on 8/5/2016. They told me a case manager would call me back, but again, no such call came. They told me my case number is 04888305. They also told me to call my dealer, which I did, (they said that parts are back ordered, with no delivery estimate, and meanwhile, I'm still using the front seat. O I called them back on 8/22. This time, they sent an internal message to the case worker, marking this case as urgent, but again, no call back has taken place. So, in summary, it has been 45 days since my first phone call to Honda, and I still have received zero response. At this point, it appears that Honda is refusing to call me regarding this airbag recall. Due to my large family, I am forced to use the front seat, and this puts my family at risk. I want to discuss with them the availability of alternative transportation while we are waiting for the parts to arrive.", "fail date": "  07/19/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall: I received notice July 2016 of this recall and immediately contacted my dealership who ordered the necessary parts on July 19, 2016. I have been calling the dealer weekly to check on the parts arriving. As of this week, the parts have still not come in and not being able to use the passenger seat has caused a significant inconvenience with my job and my family.", "fail date": "  07/19/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2011 Honda Pilot. The contact received notification of NHTSA campaign number: 16v346000 (air bags); however, the part to do the recall repair was not yet available. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure. VIN tool confirms parts not available.", "fail date": "  07/10/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2011 Honda Pilot. The contact received notification of NHTSA campaign number: 16v346000 (air bags); however, the part to do the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was notified of the issue. The contact had not experienced a failure. VIN tool confirms parts not available.", "fail date": "  07/08/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall taking too long to repair.", "fail date": "  07/01/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2011 Honda Pilot. The contact stated that the recall notice for NHTSA campaign number: 16v346000 (air bags) was received in July of 2016. After contacting the dealer and the manufacturer on multiple occasions, the contact was informed that the parts needed to repair the vehicle were still not available and no estimated time for receiving the parts could be given. The contact had not experienced a failure.", "fail date": "  07/01/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "I received a notice from Honda automobile division, saying I have a recall on my car. The air bags are defective, and a dangerous hazard to my family! and should repaired by Honda. I have taken my car to the the dealer and they said they will contact me as soon as the parts a in. This was back in July of 2016! I have not received a call! I have made several trips to the dealer and each time they said the same thing it should be just a couple of days. I tried to contact them on 9/15/2016 and I still get the same answer. I called Honda America and they said the parts are on back order. I then listen to a message from bruce smith s. V. P. Saying this is something I should not take lightly. ! needless to say, I am very frustrated and anxious, as this is a very serious life or death situation! I am very concerned for the safety of my family . . . .", "fail date": "  07/01/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2011 Honda Pilot. The contact received notification of NHTSA campaign number: 16v346000 (air bags); however, the parts to do the recall repair were not available. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was not made aware of the issue. The contact had not experienced a failure. VIN tool confirms parts not available.", "fail date": "  07/01/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall - after multiple attempts to have the dealer from whom the vehicle was purchased replace the airbag, we've been repeatedly told \"they'll let us know when they are available\". Given the time which has passed since the recall was announced, this is no longer an acceptable response. We need your assistance with Honda to have the safety repairs related to the air bag performed.", "fail date": "  07/01/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Tl-the contact owns a 2011 Honda Pilot. The contact received notification of NHTSA campaign number: 16v346000 (air bags) however, the part to do the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure. VIN tool confirms parts not available. Ad.", "fail date": "  07/01/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Warping of rotors causes extreme shaking when breaking also wrenching of steering wheel when sudden stopping or fast descents of stopping/breaking. Clicking in steering column while driving turning,in reverse and straight forward driving, shudder in shifting 5-30 mph , eco light coming on and causes delay in speed pickup or continuing in same speed during driving 01/15/2019. Door locks failure 06/05/2019 gas purge valve gas smell in ac vent replaced 06/05/2019. Ac/heat blower motor front replaced not working 02/14/2019. Rear blower ac/heat motor broken smelled of smoke replaced 08/05/2019.", "fail date": "  02/11/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Changed brakes at 30,000 and again at 50,000, rotors also. Vehicle continues to have a rubbing sound on left front. Three sets of brakes and rotors in 50,000 miles.", "fail date": "  05/18/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Experiencing the same issue many 2011 Pilots are reporting- excessive vibration on the steering column when breaking over 60mph. We were rather fortunate in that our reliable auto repair service man told us that a car with this low mileage should not have rotors issues- that this is definitely a manufacturers defect and to check with a Honda dealer. So we called the dealer we purchased the car from and he said they called Honda and there are no problems. So I found this web site- I copied and pasted over 7 full pages of complaints regarding this issue. So Honda is blind siding us and I will shout rather loudly because this is ridiculous. Do they need to have hundreds of reported fatalities like the airbags before they fix it. I will not drive this car on the highway until they fix it.", "fail date": "  02/03/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "I began to accelerate from a stop sign and my steering wheel started to shake. In an effort to gain control of the vehicle, I pushed the brakes. The problem was, my brakes were not responding to any inputs. I had to drive my vehicle in a ditch in order to come to a complete stop. Luckily, I was only going 30mph when this occurred. This is a very dangerous and life threatening situation.", "fail date": "  11/21/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The brakes didn't function properly which caused me to strike a tree with my family in the car. I was traveling at approximately 45 miles per hour when another vehicle hit the front passenger side quarter panel and it sent us on part of a gravel road and then off the road. I engaged the brakes upon impact and had plenty of time to stop before heading into trees. The vehicle did slow, but not enough to avoid hitting a tree at approximately 25-35 mph, which totaled the vehicle.", "fail date": "  11/01/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The rear brake wear indicator began emitting a chirp upon braking at about 46000 miles. Recently the brakes began \"growling\" when applied at various speeds. The mpg approximately 3 mpg over that time period. The dealer reported that the rear brakes were metal on metal and that the front brakes had 20% remaining on some part and 40% on others. He attributed the premature and uneven wear to rust. He did not mention any rotor problems but my research indicates there is a rotor problem that Honda is not addressing.", "fail date": "  08/20/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Purchased brand new Pilot in June 2011. I was driving on a freeway at 60 mph and wheel started shaking when I hit brakes. Driving became very dangerous because of shaking. Talked to Honda service dealer about it and issue is rotors/brakes which is not covered under warranty. This should not happen in a care that's under 3 years 36000 mile warranty.", "fail date": "  03/27/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "When driving on the freeway at speeds of 60 to 65 when I need to brake the front end of my Pilot shimmies while I apply the brake causing me to not be sure if I'm going to be able to stop. I thought maybe it was rough road surface and my son thought it was out if balance tires. I don't drive the freeway that often and there were no issues while driving on city streets. Lately I've been on the freeway more than usual and I noticed the problem was getting worse. On may 1st I went to costco where I purchased my radial tires January 2013 and had them check the balance of my tires. They said they were balanced and pressure was good. Later that day I called Honda san leandro while driving hands free stating I had a serious problem. The Pilot was shimming/vibrating very hard. I felt the problem was so dangerous that I took my Pilot to an automotive shop very close to my location leaving it for repairs. The owner of the shop called me the next morning may 2, 2014 telling me what he found. The bushings were cracked and broken. I asked to be shown where they came from and was shown the approximate area under a different car and was told that these two bushings had the job of providing a smooth drive. The owner told me that Honda changed the design of the replacement bushings which leads me to believe they knew the original design was defective. Why didn't Honda issue a recall? my Pilot now has only 38,000 miles. My bill is $513. 82 with the 2 bushings being $306. 26. I have the original bushings that were removed from my Pilot.", "fail date": "  01/13/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "I have a 2009 Honda Pilot touring. I bought this vehicle as a Honda certified pre-owned on 03/17/2011. The vehicle mileage was 33194 miles and current mileage is 92000. We live in madison, WI. During 2013-14 winter sessions there were many days the weather was very cold here. One day when the weather was very cold (probably -10 f), I took the car from my office parking lot. The car was parked for little over 8hours. As soon as, I came out of the parking lot, I need to take left. When I tried to apply brake to stop, the brake was not engaging. I was not able to press the brake. After couple of blocks, I will come to a t junction and I need to take left on that. The cross traffic does not stop at the junction. The car wasn't stopping and I took a hard right turn. Again I took a hard right turn in 100-200 feet. The brakes were not engaging at all. After so many times of pressing hard, finally I was able to apply brake and stop the car. It was a scary moment thinking that the car is going to crash somewhere. I called my Honda technician and he mentioned that it could be because of cold weather and I should call him again if the problem returns. There were a few times, I faced the same problem. I was able to engage the brakes after a few minutes each time. I took to the Honda service center in Feb 2014 (or around that time). The technician checked and told me that they will call Honda to find out about this since another Honda vehicle (not Pilot) reported similar issue. When I went to take back the car, I was told that there is no fix to this issue. The workaround is to run the car for a while before I drive. Sometimes we forget and the problem is coming repeatedly even when the temperature is in single digit. I faced the problem just a few days back too. I am not sure whether anyone else using Honda vehicle reported about this problem. Please contact me for more info.", "fail date": "  01/10/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "While driving at approximately 55 miles per hour and attempting to press on the brakes, I noticed a jarring pulsating action from the steering wheel. I took my 2011 Honda Pilot to the shop to have my mechanic inspect the vehicle. The mechanic stated that the rotors were warped, and called the Honda dealer to inquire of a recall. The Honda dealer said there was no recall, and advised me to replace the rotors. The vehicle now has 75000 miles on it, and the same pulsating action when applying the brakes is felt on the steering wheel.", "fail date": "  10/01/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Same issue as others have posted here. For the last six months the cars steering wheel and seat shake violently when you apply the brakes going over 50 mph. When the weather is warmer and the car has been driven for over 1/2 hour, the shaking gets even worse. You have to reapply the brakes and hope that the car slows down. We had the roters turned and it got better for a week and then right back to before (out $100) Honda dealership is saying it isa \"normal\" wear and tear issue and there is no reason to be concerned and no safety issue. Sounds like they just don't want to address this dangerous problem. I, also, have never experienced this problem in a car before. I am afraid to drive it, but don't know how to fix it. I wish a recall would force Honda to fix this dangerous problem before someone gets seriously injured.", "fail date": "  07/02/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "When slowing down in the vehicle the steering wheel vibrate and driver can lose control of vehicle. The brakes when applied to slow down or stop also has pulsating or feels like they may not be stopping the car at all and more pressure has to be applied to the pedal to stop. I have found same complaints from other consumers on different complaint websites. The only recommendations from Honda are to have rotors resurfaced. When applying the brakes at any speed over 50 mpg, the steering wheel shakes like an earthquake. Dealer said brakes were fine and that there was no issue. Next trip the dealer said the brakes might need to be redone . And that the rotors were warped. Repairs would not be covered under warranty or extended warranty. This is obviously a defect and needs to be handled by Honda. Now approaching 40k miles and the problem is making me nuts. I'm going to wind up paying out of pocket for their poor design.", "fail date": "  05/15/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Passenger side back wheel rotors makes a noise when ever I step on my brakes. I have called Honda customer service today and waiting for their call. I took it to fairfax Honda and they told me that they will need to resurface back rotors and it is not covered under manufacturer warranty even though the vehicle has less than 13000 miles and is well under 3 years. When I bought the car they told me that everything is covered bumper to bumper for three years and now they say rotors are not covered. So a defective rotor is not covered? I am confused why Honda is destroying its name brand.", "fail date": "  04/22/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "On April 16th 2013, I was driving my 2011 Honda Pilot on my street preparing to drive into my driveway, I slowed the vehicle down when I saw another vehicle behind me. I put my blinkers on informing other vehicle I was going to pull into my driveway. I waited for the other vehicle passed then proceeded to gently pressed on the gas, that'¿¿s when the vehicle accelerated violently speeding onto my driveway. I immediately slammed down on the brakes but it instead of stopping the car accelerated even faster. The vehicle crashed into my house damaging the pillar wall structure next to my garage door. I tried putting the vehicle in park but it was jammed. When it finally allowed me to put it in park I put it in reverse and again it accelerated uncontrollably. I slammed down on the brakes but it wouldn'¿¿t stop. The only way it stopped is when it crashed into the vehicle parked across the street. I had nightmares ever since. I had sent it to the Honda dealership and expressed my concern with the car and informed them that I no longer feel safe in this Honda Pilot and no longer want to drive my car. Honda had told me they didn'¿¿t find anything wrong with the car. I couldn'¿t believe what I was hearing. In the 20+ years of driving I've never experienced having a car accelerate. I truly believe Honda is covering up and trying to protect themselves from a law suit. They are capable of easily fixing the problem without reporting it. Who'¿¿s to question them or checked if they did their job correctly or if there was a problem with the throttle, brakes or engine? now no one will ever know the truth. I believe that the Honda Pilot 2011 is not a save car to drive and needs to be recalled and have an independent company examine it.", "fail date": "  04/16/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "I feel that NHTSA should look into 2011 Honda Pilot brakes and steering because when slowing down in the vehicle the steering wheel can vibrate and driver can lose control of vehicle. The brakes when applied to slow down or stop also has pulsating or feels like they may not be stopping the car at all and more pressure has to be applied to the pedal to stop. I have found same complaints from other consumers on different complaint websites. The only recommendations from Honda are to have rotors resurfaced at this time but I believe there is defect in the brakes and steering rack and should be covered by manufacturer.", "fail date": "  04/15/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Today Tuesday March 26th 2013 I was in brooklyn, NY off mrtle Ave. On a residential one way street. Pulled up to a large open parking spot with cars in front and back of the spot. The spot was large enough for 2 cars. As I pulled into the spot and progressed slowly forward with my foot on the brake, the car rengine began to rev quickly and jolted forward hitting the parked car in front of me. This is the second time I have felt the car engine rev on it's own with my foot off the gas and jumping forward. First time was while slowing down to a stop sign and the car jumped forward and accelerated on it's own but with no accident. I dismissed it not sure why it happened. This time of course I felt the same symptom with foot on brake the car jolted forward and engine revved on it's own but hitting the car in front of me. I hope Honda fixes this issue. I am very afraid this could happen around other people and accidentally hits someone when the car does this on it's own.", "fail date": "  03/26/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The contact owns a 2011 Honda Pilot. The contact stated that while driving 50 mph, he depressed the brake pedal and the vehicle shook. The vehicle was taken to a certified mechanic for inspection and they stated that the rotors had warped and the brake hardware needed to be replaced. The vehicle was repaired. The manufacturer was notified. The failure mileage was 24,000.", "fail date": "  01/10/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "I had the front arm bushing replaced and I understood there was a bulletin. I now have to have the bushing replaced again. I feel the issue has not been addressed.", "fail date": "  11/15/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Driver was pulling into a parking space when the 2011 Honda Pilot suddenly accelerated out of control. At the time of the sudden acceleration, the driver did not have a foot on either the gas pedal or brake. Rather, the driver had just taken the foot off the gas pedal in the process of slowing to a stop and turning into the parking space, and was about to place a foot on the brake. After straightening into the parking space, the car accelerated violently on its own volition. At that time, the driver quickly pressed a foot on the brake. The brake did not work. The car continued to accelerate through the brake, and lunged over a concrete barrier at the end of the parking space and began to travel down a hill on the other side. The car only stopped when it hit a tree near the top of the hill. The vehicle was towed to the dealer. The dealer informed the driver that it was unable to recreate the incident or determine the cause. The driver contacted and complained to the manufacturer, Honda of America, which sent a regional representative to the dealer to look at the vehicle in further detail. Currently, Honda of America is in the process of finalizing its review of the incident. The driver's insurance company was notified. The mileage of the vehicle at the time of the incident is unknown (as the car is currently with the dealer), but the driver estimates it to be around 18,000 miles. The speed at the time of the incident is difficult to determine as the car was nearing a stop and then forcefully accelerated through the length of a parking spot with enough force to jump the concrete barrier on the other side and hit a tree causing significant damage. The driver estimates the speed to have reached 15-25 mph +/-. While the driver suffered only minor injuries, the driver is pregnant. The full extent of any potential injuries to the baby are yet to be determined.", "fail date": "  09/05/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Noticed a vibration in the gas pedal while driving at any speed. Feel every like bump in the roads. Also when slowing to a stop and turning or backing out of a parking spot, I feel/hear a hard vibration on brake. Took to dealer, they stated warped rotors. . . To new to happen. Got full brake job at $340. Drove off, issue still present. At this visit tires were rotated and balance too. Next day also noticed all 4 rims were damaged from the tool that removed my tires. Told supervisor everything I learned about other Pilot owners and this possible defeat of rotors. They still have my truck (4 days so far) trying to identify issue. They do agree there is an issue. They are going to do road force balancing next. I will fight for a refund of this brake job and will continue to pursue until I am satisfied.", "fail date": "  08/06/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Having had the front brake rotors replaced twice (April 2012 & June 2012) and replaced front tires after first rotors, vehicle continues to shake on downhill, supposedly causing front wheels to heat up. Local vail service technician thinks underlying Honda issue however after taking to Honda dealership, they did not see any problems and suggested that we didn't know how to drive on mountainous roads. Seriously?! this is a major issue with the model & year of vehicle.", "fail date": "  07/16/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Noticed the cars steering wheel shakes when brake is applied at approximately 65-70 miles per hour which is very scary. Brought the car to the dealership and was told the rotors need to be re-surface. I ask why because it's a brand new car with very low mileage and response was it could be the problem. Brought the car home 6/9/12 afternoon. Drove it the next day and steering wheel shaking still present. I research the web and found out, lots of Honda Pilot owner are having the same problems and that the remedy for it was replacing 1. Power steering pump 2. Power steering rack. Finding were presence of metal fillings from the power steering pump that's coming from the power steering rack itself and result was no more vibrations in the steering column. . . Honda need to recall this existing problem for safety purposes before someone gets hurt. . .", "fail date": "  06/09/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "My Honda Pilot along with numerous other Honda Pilot owners are experiencing a severe vibration issues when applying the brakes to just slow down when traveling at high-way speeds. The vibration can be so severe that if you are not holding the steering wheel firmly it could cause you to lose control of the vehicle. When addressed at Honda dealerships you are told it is warped rotors and that even with a brake job (which is not necessary based upon inspection) that the problem may return. There is basically nothing they can do, so live with it. This is a severe safety issue that has been previously reported on your site and needs to be addressed through proper inspection and a recall.", "fail date": "  03/06/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Rotors began to prematurely warp at about 20k miles. Dealer resurfaced the rotors as a courtesy service. Warping problem re-appeared at approximately 30k. Warped rotors caused severe vibrations through steering column at highway speeds making for unsafe driving conditions. Honda tech mentioned that Honda used rotors with a softer material in an effort to reduce squealing problem on previous year models. However, this resulted in warping problems on newer models as car is heavier and these rotors are not sufficient in stopping the vehicles without causing significant wear. At 55k miles, I decided to replace rotors with a third party since Honda refused to stand behind their defective product and replace my rotors even though I had reported the problem well before the standard factory warranty period of 3 years / 36k miles. Technician also discovered cracked compliance bushings on front end.", "fail date": "  01/01/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Car has had issues with shaking steering wheel when braking from 60+ miles per hour. I think it may be warped brake rotors. However, this problem should not occur on a car so new nor with such low mileage. I have a safety concern regarding this issue. In review of complaints there were at least a couple more complaints that said the power steering pump and rack replacement fixed the issue. Seems like there is a design flaw and Honda should do a recall. . . Note: I have not taken this car to the dealer yet for resolution. . .", "fail date": "  10/03/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Steering wheel vibrates when braking at or near 65 mph, loss of control.", "fail date": "  09/01/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Brand new vehicle when it reaches aprox that speed or brake the steering wheel vibrates and shake violent at braking, also pulls to the left. Bring back to the dealership but not problem solve, they got a service bulletin 06-068 but it doesn't correct the problem, I got up to 23,000 miles and the tires became close to the carcase (all four), the vibration and pulling still.", "fail date": "  04/29/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "When turning the steering wheel to the far right or to the far left (or on a sharp turn) as in making a u-turn, there is a clicking sound and vibration in the steering wheel and feels like it is tied to the axles or tires. This has been happening since the vehicle was purchased brand new in 2010. As you are driving, there is a sensation that the wheels are momentarily locking up for about 2 seconds. This is not related to the eco system. The car feels as if it is skidding or skipping and then it resumes to normal driving. This happens about every 5 miles. This happens when the vehicle is traveling at a speed of 40 miles or higher on the freeway not in stop and go traffic. This has been happening within the last six months, had vehicle inspected and all was reported normal.", "fail date": "  05/18/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "My 2011 Honda Pilot shakes going 80 or more miles per hour. The dashboard shakes so bad that it looks like its about to pop out.", "fail date": "  01/25/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "I had noticed while driving my vehicle it felt as if the front brake rotors where warped due to the vibration in the steering wheel while under braking. I brought the vehicle to the Honda dealership and after inspection was told that in fact rotors where warped and break pads worn all parts replaced and problem seemed to be corrected this was done at 85,000 miles. Now at 98,000 same problem has returned brought back to dealer and they informed me now that both the front compliance bushings need replacement. I have checked to see if this is a recall issue and cannot imagine it is not seeing it could have catastrophic failure issues. Please hold american Honda to standards set by the NHTSA for customer safety.", "fail date": "  03/28/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "When vehicle crossing through a few inches depth of water puddle, the steering wheel was suddenly locked with odd noise and flashing battery warning. This happened several times and could cause fatal accident. The steering wheel resumed operation after turning off engine and re-start.", "fail date": "  05/27/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "The contact owns a 2011 Honda Pilot. The contact noticed that the vehicle was leaking black oil from the front driver side bushing. In addition, the steering wheel hesitated to turn left or right. The vehicle was not diagnosed nor repaired. The manufacturer was notified of the failure. The approximate failure mileage was 46,000. The VIN was not provided.", "fail date": "  03/14/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "My 2011 Honda Pilot touring had to have all 3 engine mounts and the transmission mount replaced. The whole front end of the vehicle would shake uncontrollably on acceleration and especially at high speeds. I bought the vehicle brand new. I do a lot of highway driving and put a lot of miles on my vehicle. Currently I have 128,000 miles on my vehicle. I realize that a vehicle with a high number of miles will experience some wear tear, I never thought I'd have to replace mounts that hold my engine in place. Also, I had to replace both bushings as they were both ripped. Needless to say this SUV has cost me a lot money in the last few weeks. Everything seems to be failing at the same time. I will have to reconsider my next Honda purchase.", "fail date": "  07/10/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "We need a recall. Some one pay attention and care about this before lives are lost. Steering vibrates violently and shakes when coming to a stop. Also turning left or right results in a pop/click sound and you can feel in in the steering wheel.", "fail date": "  01/15/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "I began to accelerate from a stop sign and my steering wheel started to shake. In an effort to gain control of the vehicle, I pushed the brakes. The problem was, my brakes were not responding to any inputs. I had to drive my vehicle in a ditch in order to come to a complete stop. Luckily, I was only going 30mph when this occurred. This is a very dangerous and life threatening situation.", "fail date": "  11/21/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "Took the car to the dealer for clicking noise when making slow turns, such as pulling into a parking space. Found 2 compliance bushings are broken and leaking. Approx 650 dollar repair. Dealer knew it was an issue and considers it normal wear and tear for a 3 year old car. Not covered under warranty.", "fail date": "  08/18/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "When driving on the freeway at speeds of 60 to 65 when I need to brake the front end of my Pilot shimmies while I apply the brake causing me to not be sure if I'm going to be able to stop. I thought maybe it was rough road surface and my son thought it was out if balance tires. I don't drive the freeway that often and there were no issues while driving on city streets. Lately I've been on the freeway more than usual and I noticed the problem was getting worse. On may 1st I went to costco where I purchased my radial tires January 2013 and had them check the balance of my tires. They said they were balanced and pressure was good. Later that day I called Honda san leandro while driving hands free stating I had a serious problem. The Pilot was shimming/vibrating very hard. I felt the problem was so dangerous that I took my Pilot to an automotive shop very close to my location leaving it for repairs. The owner of the shop called me the next morning may 2, 2014 telling me what he found. The bushings were cracked and broken. I asked to be shown where they came from and was shown the approximate area under a different car and was told that these two bushings had the job of providing a smooth drive. The owner told me that Honda changed the design of the replacement bushings which leads me to believe they knew the original design was defective. Why didn't Honda issue a recall? my Pilot now has only 38,000 miles. My bill is $513. 82 with the 2 bushings being $306. 26. I have the original bushings that were removed from my Pilot.", "fail date": "  01/13/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "Back to the Honda dealership for repairs. There is a pop or clicking sound from the steering well with left turns. Technician verified noise and felt a clunking noise with turns left - cost to run further diagnostic testing was upwards of $500. Decided to wait on repair since dealer said safety was not an issue.", "fail date": "  11/23/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "I was towing a trailer with a motorcycle in it. I was driving about 60 mph and the front end started to vibrate really bad. I drove to a friends house and left my trailer there because I was on my way out of town. I didn't notice the vibration once the trailer was removed. I now have about 54,000 miles on the car and the vibration can be pretty bad when I'm stopping and also sometimes when I'm driving. I've had the tires changed and rotated so I know it's not the tires.", "fail date": "  06/23/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "2011 Honda Pilot experiencing a severe vibration issues when applying the brakes when traveling at highway speeds (45mph+). The vehicle stability, steering and control do not feel safe under these conditions. We first identified the problem with Honda at 39000 miles in 2012 and they balanced the tires. Brought to Honda's attention again at 69000 miles in augst 2013. They replaced the front and rear brake pads and resurfaced front and rear the rotors for a charge of $478. Still experiencing at 80000 miles and they said we need new front rotors ($440) and need to replace compliance arm bushings (found compliance bushings split and torn) for $736. 95. Please investigate as a serious defective issue that perhaps warrants a recall.", "fail date": "  05/23/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "The contact owns a 2011 Honda Pilot. The contact stated that while driving the vehicle would veer to one side without explanation. In addition, when depressing the accelerator and steering to the left he would momentarily lose control of the vehicle. The vehicle was taken to the dealer who performed an alignment but it failed to remedy the failure. The vehicle was not further repaired and the manufacturer was not contacted. The VIN was not available. The failure mileage was 1,000 and the current mileage was 4,000. Updated 5/2/11\nupdated 06/06/11.", "fail date": "  01/27/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "2011 Honda Pilot ex-l, engine is humming whenever the speed is up to 50 miles/hour.", "fail date": "  09/13/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "I have a 2011 Honda Pilot with only 45,243 miles. I took it to the dealership where I originally purchased for routine maintenace sevice on 10/05/20, and was told that the compliance bushings are leaking and needs to be replaced. This is a well maintained and driven vehicle, so it is surprising to learn about this problem with such low mileage. May I know if there is a recall for similar issues?.", "fail date": "  10/05/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "The contact owned a 2011 Honda Pilot. The contact stated that while approaching at a stop light she came to a complete stop behind another vehicle as the vehicle jerked without warning. As a result, the contact crashed into the vehicle in front. The air bags did not deploy. The driver sustained injuries to the right arm. The other vehicle passenger spare tire on the Jeep detached from the other vehicle and damaged the engine. A police report was made. The contact drove to the hospital the next day and was treated for injuries. The vehicle was towed by the police to an independent shop where it was deemed a total loss by insurance company. The dealer was not contacted or the manufacturer was made aware of the failure. The failure mileage was approximately 124,000.", "fail date": "  09/21/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "I have replaced coils and plugs due to misfire code po302 two or more times. I have had cv joints replaced 2 or more times. I purchased this vehicle used approximately 4 years ago. I have contacted Honda USA on several occasions only to be told their are no recalls except takata airbag. Only to find out their is a (known) problem with cylinder misfires for my vehicle. I brought this up to Honda's attention. Not the other way around.", "fail date": "  07/14/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "I own a 2011 Honda Pilot and was told my compliance bushings are broken and it is critical to replace them. I was told this after taking it in for air bag recall. Vehicle 8 years old with normal usage and to be told would cost $1200 is beyond crazy. What else is wrong with these vehicles. Really scared to drive and how many peoples vehicles have these problems and they are driving without knowlege.", "fail date": "  03/08/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "We were just informed that our compression bushings are shot on our 2011 Honda Pilot and that they are not covered. Why would this happen so frequently on Pilots? why would this not be recalled. I could understand if one of them went, but both at the same time and both with the very same issue seems more of a recall and defect than anything else or normal wear and tear. Now I am told it will cost close to $900.", "fail date": "  10/01/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "When turning the steering wheel to the far right or to the far left (or on a sharp turn) as in making a u-turn, there is a clicking sound and vibration in the steering wheel and feels like it is tied to the axles or tires. This has been happening since the vehicle was purchased brand new in 2010. As you are driving, there is a sensation that the wheels are momentarily locking up for about 2 seconds. This is not related to the eco system. The car feels as if it is skidding or skipping and then it resumes to normal driving. This happens about every 5 miles. This happens when the vehicle is traveling at a speed of 40 miles or higher on the freeway not in stop and go traffic. This has been happening within the last six months, had vehicle inspected and all was reported normal.", "fail date": "  05/18/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "During highway driving and braking from highway speeds a significant vibration is felt in the steering column. It does not lead to a loss of control, however it renders the vehicle less stable under braking. The vehicle has 75,000 miles on it. We brought it in for service and the lower arm compliance bushings required replacement. Honda had issued an extended warranty for this item - a clear indication that the part is not up to standard - and presumably a significant number of these vehicles will face a similar problem - which if unadressed could lead to further accidents.", "fail date": "  11/01/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "I had noticed while driving my vehicle it felt as if the front brake rotors where warped due to the vibration in the steering wheel while under braking. I brought the vehicle to the Honda dealership and after inspection was told that in fact rotors where warped and break pads worn all parts replaced and problem seemed to be corrected this was done at 85,000 miles. Now at 98,000 same problem has returned brought back to dealer and they informed me now that both the front compliance bushings need replacement. I have checked to see if this is a recall issue and cannot imagine it is not seeing it could have catastrophic failure issues. Please hold american Honda to standards set by the NHTSA for customer safety.", "fail date": "  03/28/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Unusual noise (grinding/friction) that persists while the vehicle is in motion. Took it to be looked at 3 times then they said it was the compliance bushings. They said previous models have been recalled but not the 2011 yet.", "fail date": "  12/05/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "The contact owns a 2011 Honda Pilot. The contact noticed that the vehicle was leaking black oil from the front driver side bushing. In addition, the steering wheel hesitated to turn left or right. The vehicle was not diagnosed nor repaired. The manufacturer was notified of the failure. The approximate failure mileage was 46,000. The VIN was not provided.", "fail date": "  03/14/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "2011 Pilot touring with 75k miles one it started shaking when breaking at highway speeds a few months ago. Took in for service and asked them to check on the cause of the shaking, and they replaced bushings as part of the extended warranty, claiming that would fix the problem. It did not affect the shaking at all. I then took to firestone for tires and breaks, who identified a busted lower left tie rod and gave me an estimate of $1100 to fix. It only has 75k miles on it, why these suspension/breaks/wheel issues already?? my vehicle shakes violently when I break and I feel it is unsafe for me and my children. This should be a recall, but the labor is extremely expensive because the entire assembly has to be disassembled. I have been a lifelong Honda is very wrong here.", "fail date": "  01/20/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "I just purchased my 2011 less than 30 days ago. I have only driven it about 5 times the problem is with a knocking noise when you drive over bumps. When I purchased the car it was a rainy night and you could not hear anything like that because the car and the road was wet. Not that it is dry you hear it at every small bump in the road. Took to service to find that the compliance bushings are cracked and it will also need struts. This is crazy a car less than 5 years old need this already. Honda has to know about this problem why wont they fix this. They have a service bulletin about it. You are looking at almost $1500 to have these 2 problems fixed. I haven't send in my 1st car payment. This is just crazy. I am not happy about this at all. This is something you would never see or know until you take the car to a service center. This is a known problem Honda fix this. You are losing your loyal customers behind things like this.", "fail date": "  01/15/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Steering wheel making knocking noises when turning at slow speed, especially left. Also had really bad vibration noises when braking from high speeds. Had to change pads at own cost. Compliance bushings were change as part of a service warranty bulletin.", "fail date": "  08/18/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Leaking front compliance bushing.", "fail date": "  05/13/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "2011 Honda Pilot has cracked, leaking compliance bushings. Now whenever I press on the break pedal at any speed above 30mph the whole large vehicle shakes and shakes until I take my foot off it, and on a downslope it feels as if the Pilot dives forward with no intent of stopping. . Honda is aware of the many complaints about the exactly same problem. Honda has redesigned the part to be replaced in when Pilots come in for repair/replacement. Why is Honda allowed to go on charging customers who paid almost $40,000 for a defective vehicle with no recall on this issue? I am requesting the NHTSA would investigate and put pressure on Honda to maintain quality standards on its vehicles. My Honda Pilot is not even 3 years old with 45k miles!.", "fail date": "  06/11/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "In the last six weeks the \"struts\" have failed. The first time we were charged to replace them. Then within two weeks approximately, they broke again. Now the car is back in the shop again for the same reason. We don't know much about cars, but this doesn't make sense. We have used the car (e. G. : 6500 miles) but certainly not driven it in any unusual way.", "fail date": "  03/19/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "When driving on the freeway at speeds of 60 to 65 when I need to brake the front end of my Pilot shimmies while I apply the brake causing me to not be sure if I'm going to be able to stop. I thought maybe it was rough road surface and my son thought it was out if balance tires. I don't drive the freeway that often and there were no issues while driving on city streets. Lately I've been on the freeway more than usual and I noticed the problem was getting worse. On may 1st I went to costco where I purchased my radial tires January 2013 and had them check the balance of my tires. They said they were balanced and pressure was good. Later that day I called Honda san leandro while driving hands free stating I had a serious problem. The Pilot was shimming/vibrating very hard. I felt the problem was so dangerous that I took my Pilot to an automotive shop very close to my location leaving it for repairs. The owner of the shop called me the next morning may 2, 2014 telling me what he found. The bushings were cracked and broken. I asked to be shown where they came from and was shown the approximate area under a different car and was told that these two bushings had the job of providing a smooth drive. The owner told me that Honda changed the design of the replacement bushings which leads me to believe they knew the original design was defective. Why didn't Honda issue a recall? my Pilot now has only 38,000 miles. My bill is $513. 82 with the 2 bushings being $306. 26. I have the original bushings that were removed from my Pilot.", "fail date": "  01/13/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Rear suspension is leaking. My SUV is less than 3 yrs old and only has 21351 miles.", "fail date": "  10/14/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "The vehicle shuddered and vibrated when breaks were compressed at high speed. Steering wheel also vibrated when the vehicle was driven at speeds over 50 mph. Took the car in for service and was told that the rotors would need to be fixed, but was also told that there was a problem with the compliance bushings leaking and that they would have to be replaced at a cost of $750. I stated that the car was not that old, was never driven 'off road,' and was just over 50,000 miles. Dealer stated that this was a must fix problem and that they have seen this issue with other Pilots. The dealer checked with Honda about getting a break on the cost to fix the problem, and Honda agreed to subsidize part of the cost. Many concerns moving forward about the reliability of this part. This is not a reasonable repair for a relatively new vehicle marketed as a sport utility vehicle with 4-wheel drive.", "fail date": "  09/02/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "2011 Honda Pilot ex-l with 46750 miles has cracked compliance bushings. Per discussions with service writer at local Honda dealership, this has become a very common problem on 2010 to 2012 Pilots. They strongly recommend replacing them. Upon looking up the item on the internet, there is quite a bit of noise by Honda owners about having to replace this bushing on various models and years. Apparently, Honda has or is in the process of redesigning this bushing. If vehicle is out of warranty, one has to pay for the repairs but in a few cases it appears that Honda reduced the cost or may of fixed it for free after the owners pressed their case. The only tip off that I had about a problem was a slight thumping noise when I turned the steering wheel. Others per the internet had pulling to one side or the other or juddering when applying the brakes or premature tire wear. I am not sure how great of a safety issue this is or could be if these bushings were to break but it is apparent the Honda is aware of the problem but not letting anybody know about other than when you take it in for service and you are told about the problem and how much it will cost.", "fail date": "  05/02/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Noticed a vibration in the gas pedal while driving at any speed. Feel every like bump in the roads. Also when slowing to a stop and turning or backing out of a parking spot, I feel/hear a hard vibration on brake. Took to dealer, they stated warped rotors. . . To new to happen. Got full brake job at $340. Drove off, issue still present. At this visit tires were rotated and balance too. Next day also noticed all 4 rims were damaged from the tool that removed my tires. Told supervisor everything I learned about other Pilot owners and this possible defeat of rotors. They still have my truck (4 days so far) trying to identify issue. They do agree there is an issue. They are going to do road force balancing next. I will fight for a refund of this brake job and will continue to pursue until I am satisfied.", "fail date": "  08/06/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Uneven worn out rear right tire caused by suspension rod bending due to an accident related as claimed by Honda automobile. The video of the bend I have do showed otherwise, suspension rod do not appear as any impact related, it appeared as manufacturer's defect which Honda is avoiding to take the responsibility. I told them that I have not had any accident with the car. And which type of impact will cause such a suspension rod to bend without affecting other surrounding fragile components. Also why is the impact very isolative, neat and appeared corroded.", "fail date": "  08/04/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "I was towing a trailer with a motorcycle in it. I was driving about 60 mph and the front end started to vibrate really bad. I drove to a friends house and left my trailer there because I was on my way out of town. I didn't notice the vibration once the trailer was removed. I now have about 54,000 miles on the car and the vibration can be pretty bad when I'm stopping hard and also sometimes when I'm driving. I've had the tires changed and rotated so I know it's not the tires. I also have a rear left tail light that keeps going out. I've changed it twice but it's not burned out. I think it must be a short. Now the radio lights have started to go dim. I first noticed th is about 2 weeks ago. We got a hard rain this weekend and when I got into my car the next morning the headliner was wet around the sunroof on the passenger side.", "fail date": "  06/23/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Noticed the cars steering wheel shakes when brake is applied at approximately 65-70 miles per hour which is very scary. Brought the car to the dealership and was told the rotors need to be re-surface. I ask why because it's a brand new car with very low mileage and response was it could be the problem. Brought the car home 6/9/12 afternoon. Drove it the next day and steering wheel shaking still present. I research the web and found out, lots of Honda Pilot owner are having the same problems and that the remedy for it was replacing 1. Power steering pump 2. Power steering rack. Finding were presence of metal fillings from the power steering pump that's coming from the power steering rack itself and result was no more vibrations in the steering column. . . Honda need to recall this existing problem for safety purposes before someone gets hurt. . .", "fail date": "  06/09/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "2011 Honda Pilot experiencing a severe vibration issues when applying the brakes when traveling at highway speeds (45mph+). The vehicle stability, steering and control do not feel safe under these conditions. We first identified the problem with Honda at 39000 miles in 2012 and they balanced the tires. Brought to Honda's attention again at 69000 miles in augst 2013. They replaced the front and rear brake pads and resurfaced front and rear the rotors for a charge of $478. Still experiencing at 80000 miles and they said we need new front rotors ($440) and need to replace compliance arm bushings (found compliance bushings split and torn) for $736. 95. Please investigate as a serious defective issue that perhaps warrants a recall.", "fail date": "  05/23/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Rotors began to prematurely warp at about 20k miles. Dealer resurfaced the rotors as a courtesy service. Warping problem re-appeared at approximately 30k. Warped rotors caused severe vibrations through steering column at highway speeds making for unsafe driving conditions. Honda tech mentioned that Honda used rotors with a softer material in an effort to reduce squealing problem on previous year models. However, this resulted in warping problems on newer models as car is heavier and these rotors are not sufficient in stopping the vehicles without causing significant wear. At 55k miles, I decided to replace rotors with a third party since Honda refused to stand behind their defective product and replace my rotors even though I had reported the problem well before the standard factory warranty period of 3 years / 36k miles. Technician also discovered cracked compliance bushings on front end.", "fail date": "  01/01/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "I make reference to 2011 Honda Pilot recall from NHTSA: 10v640000 of 12/16/2010. Since I bought a similar vehicle on 12/11/2010, I would like to find out if my car is included in this recall. , I wrote to the manufacturer address in California several weeks ago requesting information about this matter, and as of this date, I have not received an answer.", "fail date": "  12/06/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "The car at 50 mph would loose control when you go over a bump on the road and if the surface of the highway is irregular it slide sideway and bounces up and down we took it in a few times to the Honda service and was told that everything was ok one time they told me it was the pressure of the tires and another time I needed new brakes so here I am with a car that is very scary to drive I am going to try again tomorrow to bring it in to the Honda service and hopefully they will fix it.", "fail date": "  12/10/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The front cylinder head valve cover developed an erosion hole adjacent to the middle spark plug (#5) tube cutout. The valve cover is available for inspection. This portion of the valve cover is directly above the oxygen sensor on the exhaust manifold. Engine oil could leak onto the hot manifold and ignite, causing an engine fire. I have not taken this cover to a Honda dealer or independent service center as I do my own maintenance work on my vehicles. This failure occurred after 153,235 miles and there were no indications, messages, or symptoms. The hole was not leaking oil as it was filled with valve cover material that had degraded and turned into powder. The powder was easily dislodged after probing with a metal pick, leaving a hole in its place. The #5 ignition coil was inspected and was visually unremarkable. The engine was not misfiring. The mil lamp was off and there were no dtc codes present. A web search found several other complaints about this issue (with pictures of incidents of greater severity) and it is not confined to Honda vehicles.", "fail date": "  03/05/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "My Honda Pilot 2011 exl w/ awd displayed a flashing engine light while driving, which is a sign of a serious engine problem. When it was towed to the Honda dealership, the service representative told me that a diagnostic trouble code (dtc) of p0302 was recovered, which occurs when the spark plugs misfire, and is fully described in Honda's service bulletin 13-082: https://static. Nhtsa. Gov/odi/tsbs/2018/mc-10152434-0001. Pdf. I was told by the Honda service rep that one spark plug was fouled and covered with engine oil, and that I needed to clean the pistons and replace three piston rings along with the spark plug, a $3500+ repair. This costly problem with some Hondas was the subject of a class action lawsuit (soto v. American Honda motors), and is known to cause a sudden loss of power while driving, putting the driver, passengers, and other nearby vehicles at significant risk. By way of background, I began experiencing intermittent and temporary electrical system failure and increased oil consumption as early as January, 2021, which was never fully diagnosed until it progressed to a state of engine failure in September. Honda was clearly aware of this problem, yet it failed to take preemptive action to protect Honda owners and others. Rather than recalling vehicles with defective program control module (pcm) software/firmware and updating it on affected vehicles (a relatively inexpensive fix), they allowed drivers to continue to operate their Hondas, effectively playing vehicular russian roulette, until their engines failed catastrophically, like mine did.", "fail date": "  09/27/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The owns a 2011 Honda Pilot. The contact stated while driving approximately 65 mph, the vehicle started shaking abnormally and almost stalled. The contact pulled over to the side of the road and waited for several minutes before the vehicle regained stability functionality and the vehicle stopped shaking. The vsa (vehicle stability assist) warning light illuminated. The failure had occurred five times. The contact took the vehicle to the dealer who diagnosed that the engine block was causing oil leaking from piston rings unto the spark plugs. The spark plug was replaced and the contact was advised to drive at speeds of 40 mph or slower. The repair was provided as a temporary fix. The manufacturer was made aware of the failure and opened a case. The approximate failure mileage was 80,000.", "fail date": "  09/19/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I have replaced coils and plugs due to misfire code po302 two or more times. I have had cv joints replaced 2 or more times. I purchased this vehicle used approximately 4 years ago. I have contacted Honda USA on several occasions only to be told their are no recalls except takata airbag. Only to find out their is a (known) problem with cylinder misfires for my vehicle. I brought this up to Honda's attention. Not the other way around.", "fail date": "  07/14/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "My 18 year old daughter was driving home 6/28/19 at midnight. Car died while driving. Coasted to side of road. Restarted and drove some. Same thing. Many lights came on. Coasted to side of highway. Tried one more time and made it home. Miles on odo: 118,279. The next morning I started the CA and tried to drive to dealership. After 3 miles, the same happened to me. I was able to pull over and had aaa tow it 5 miles to dealership. At dealership, the said many error codes came up but they recommended replacing the powertrain control module (pcm). I pd $1,410. 16 to do this on July 2. I picked the car up and drove less than a mile and the same thing happened. I was able to start it again and then it happened as I coasted back to the dealership. They analyzed the car, talked with hq Honda reps and they recommended checking the spark plugs. They did and all 6 were bad. However, they were just replaced at 102,42 miles about 1 year earlier. July 9. I decided to replace the spark plugs and the dealership to their credit only charged me $200 (cost of labor). I was hesitant to replace them as I was not certain they had identified the true problem. I was shocked after spending the $1,400 that it happened again. Ever since then I am wondering if this will happen again. I am also concerned because this problem of the car just shutting down is extremely dangerous, especially if you find yourself on the highway. So I would like someone to look into this and to see if this has happened to anyone else. Thanks.", "fail date": "  06/28/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "My 2011 Honda Pilot shakes going 80 or more miles per hour. The dashboard shakes so bad that it looks like its about to pop out.", "fail date": "  01/25/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Got a new battery 36 mins later the car was on fire.", "fail date": "  11/24/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "P0301 through p0304 Honda engine misfire settlement Honda manipulate the dealer to make false allegations and the vehicle they refuse to repair it. I wish to have the truth come to light how they refuse to service and take accountability to repair the vehicle. They rather not repair it even though it is there. I was driving and the engine misfired. I was forced to drive into autozone to have them test it out and the diagnosis came back that I had to change the spark plugs. In which I did but now Honda does not wish to repair it.", "fail date": "  05/28/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The contact owns a 2011 Honda Pilot. Half an hour after the contact parked the vehicle in the garage, it caught on fire. The fire department extinguished the fire and filed a report. There were no injuries. The vehicle was towed to an independent mechanic where it was awaiting inspection. The manufacturer was notified of the failure. The approximate failure mileage was 66,000.", "fail date": "  07/25/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The car stutters when you hit the gas. They told me it is the spark plugs and that there is a recall but not for my VIN# ????? same car and year as the recall states. It is the same issues as the cars that have the recall VIN#.", "fail date": "  01/01/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "While slowing to yield onto a highway I was behind another vehicle which was stopped to the oncoming traffic. As I slowed to a stop, the Pilot quickly accelerated to 5000 rpm while I'm pushing the brake to the floor and came within inches on crashing into the rear of the vehicle in front of me. I was able to get the vehicle in to park. It then dropped down on its own to normal idle. This is a 2011 Honda Pilot touring with 29,800 miles.", "fail date": "  09/04/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "My 2011 Honda Pilot touring had to have all 3 engine mounts and the transmission mount replaced. The whole front end of the vehicle would shake uncontrollably on acceleration and especially at high speeds. I bought the vehicle brand new. I do a lot of highway driving and put a lot of miles on my vehicle. Currently I have 128,000 miles on my vehicle. I realize that a vehicle with a high number of miles will experience some wear tear, I never thought I'd have to replace mounts that hold my engine in place. Also, I had to replace both bushings as they were both ripped. Needless to say this SUV has cost me a lot money in the last few weeks. Everything seems to be failing at the same time. I will have to reconsider my next Honda purchase.", "fail date": "  07/10/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I purchased a 2011 Honda Pilot in October 2014. From the first day of driving it, I noticed a vibration coming from the drive train/engine/transmission when the engine was switching into \"eco\" mode. The vibration can be felt through the steering wheel, gas pedal, and floor board. It becomes worse when cruising at a low rpm, or when climbing a hill (no matter how steep the hill is) when the eco mode is engaged. The vibration only stops when the car is required to increase the rpm, either from manually depressing the gas pedal, or the computer deciding it needs more power. The vehicle does not experience this vibration until the engine warms up and the eco mode engages. When the engine is cold, the eco mode does not kick in, and there is no vibration. The problem seems to be getting worse. Vehicle constantly vibrates/shudders as engine run in eco mode and as vcm kicks in/out or is in use. I see hundreds of same complaint on Honda message boards and all have gotten the same response from Honda. They indicate it is normal operation and nothing they can do. Anyone that's driven a vehicle for more than a few hours can tell you it's not normal for a vehicle to vibrate like that. In my driving, I find it to be not only annoying, but very distracting as I'm constantly trying to change speeds/rpm, etc. To make the vibrations go away. This constant distraction is a safety concern. I implore you to get Honda to own the situation and find a fix.", "fail date": "  11/23/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I was stopped in a drive thru with my foot on the brake and 2 vehicles in front of me. Suddenly ,while my foot was still on the brake, my truck lunged forward hitting the truck in front on me and forcing that truck to hit the truck in front of them. But it didn't end there. When my truck originally lunged, the engine revved and after hitting the truck in front of me, my truck engine continued to rev up and down and my truck continued to bounce off and on the truck in front of me. After the initial impact I placed both feet on the brake and was pushing as hard as I could trying to make my truck stop. I was practically standing on the brakes, but I had no control. The revving and bouncing off and on the truck in front of me went on for several seconds. Finally, my legs got tired from pushing so hard on the brakes I just took them off and the truck just stopped moving and engine stopped revving. When all of this was happening, my sensors never went off. Although when my truck came to a stop , I put it in park and got out to see if the person in front of me was ok. I noticed that I was within 2 inches of her bumper and when I got back in my truck, the sensor was only beeping. I contacted american Honda who advised me to take it to Honda of bowie, where I purchased the vehicle. I was told that an inspector from american Honda and the service manager from Honda of bowie would inspect the truck thoroughly. After doing so, they informed my husband that there was nothing wrong with the vehicle and there was nothing they could do. I feel there is a safety issue with this truck and I am very nervous and anxious when driving it. I feel Honda has let me down and is refusing to take responsibility for a very serious issue.", "fail date": "  06/05/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The transmission in the vehicle is shuddering or shifting abnormally when driving.", "fail date": "  10/01/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Vehicle purchased new in 2011. No issues until mid 2012. When attempting to start car, the starting sequence works but engine does not turnover. The starter clicks, but nothing else happens. The first time this happened, car had to be jumpstarted to get started. Battery test was conducted with no issues. The second, third and fourth times it happened, the car eventually stated with no issue. The vehicle is located in southern CA, so cold weather is not a factor. Battery checks each time indicate no issue with the battery. Most recent time, on 2/23/14, same exact problem.", "fail date": "  05/16/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "2011 Honda Pilot ex-l, engine is humming whenever the speed is up to 50 miles/hour.", "fail date": "  09/13/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "We have a 2011 Pilot exl-(bought it used) -with haze on the mirror. From all the comments out on the internet, it is obvious that it gets progressively worse and becomes a safety issue -our vision is obstructed by the haze and could result in an accident.", "fail date": "  09/13/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Rear view mirror is hazy. This is a problem with most Honda Pilots 2011. The problem is most likely with adhesion or the chemicals tat make up the camera screen and electronics inside the mirror. It is too dangerous to drive with a hazy rear view mirror. Also, headlights get hazy on the Honda Pilot 2011. I think problem is adhesion. In other words, Honda is either did not apply adhesion properly on their lights and mirrors or they used poor material. Please issue a recall and fix these issues.", "fail date": "  05/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Nudged bottom of keychain when driving on highway. Heard click and key moved from on position to lock position while in motion. Lost power and came to full stop. Turned on hazard lights. Was able to turn on ignition on first attempt. Later, was not able to reproduce symptom at full stop. Needed to press key into steering column in order to switch from on to lock.", "fail date": "  02/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Roof and hood of SUV paint peelilng badly. I notice many Honda Pilots with the same defect. I get my Pilot serviced at the dealer and never have they offered to repaint/repair or offer suggestions. Obviously this is a vehicle defect from the factory. The rest of the body is in great shape.", "fail date": "  12/13/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Purchased as used and the interior rear view mirror looks blurred and cannot see. It looks like it is scratched but it is inside of the mirror. This has almost caused an accident as I could not see the car coming up behind me and did not brake. Luckily then veered away at the last moment. If I could have seen them, I could have moved and gotten out of danger.", "fail date": "  10/12/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Paint chipping and getting worse. Internet search shows a lot with same issue Honda white paint.", "fail date": "  08/04/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The truck door will unlock itself while driving.", "fail date": "  06/17/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "My 2011 Pilot was purchased new in Aug 2011, has less than 68000 miles and I live in southern CA, yet: my battery died and had to be replaced Apr 2018 (car was parked < 1hr and would not start, but started fine the hour before). My engine check transmission system light/warning came on and we had to add a quart of oil on July 18, 2019, even though I had an oil change done in may 2019 less than 500 miles before. On 7/24/19, my front windshield wipers stopped and today I had to have the motor replaced not just a fuse. I'm concerned why a Honda < 9 yrs old is having these issues - burning oil & motors dying. Is my car a lemon? can you please help to allow me to have a dealership service do a full inspection/fix on the oil issue at no cost and possibly a reimbursement on the cost of the new windshield wiper motor (part & labor approx. $411 - I can provide a copy of the invoice later as the work is being done today)? thank you for your consideration. I would appreciate any assistance in ensuring that my car does not progress as a lemon. I have been a dedicated Honda owner since 1981 and this is the first one I've owned that has problems. Thank you.", "fail date": "  07/24/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Driving on the highway the steering wheel was shaking but nothing else seemed to have an issue, then the check engine/emissions light came on, followed by the vt4 and then shortly after the vbs light. From what I read this has been an issue with the model year I own, however it also states it can cause the car to not accelerate properly which when driving on highways as much as I do, can be a safety concern. I feel this issue should have been resolved with a recall versus an extended warranty, due to this took place right after the 8 year mark of it being purchased. Losing acceleration on a major highway, with cars and semi trucks driving well at 80 mph or more, can be a scary thing if the car will not accelerate properly due to an issue that has been reported, taken to court and in the end should have been corrected versus extending the powertrain warranty. The cost per our local Honda dealership will be $4,000 which is about what I have left to have the vehicle paid off. Now I have to consider if it is an item I spend a fortune on to fix the SUV I love or trade for another vehicle.", "fail date": "  05/31/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Paint is peeling off from the hood and the doors. This car is kept in great condition and well taken care of to have paint issues. It's kept indoors away from bad weather so this has to be a pint defect problem. Not happy with Honda if this is what you sell your costumers that buy your product.", "fail date": "  12/15/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Driving onto on ramp of highway from prior highway at approximate speed of 30 mph. Driver noticed a lurch from front of vehicle. Unknown part that was involved. Possibly transmission or fuel line but only suspicion with no evidence left to investigate (see pictures included). Acceleration no longer engaging. Driver pulled vehicle over to side of highway. Driver and passenger exited the vehicle. After a few minutes, noticed a stream of smoke emitting from under hood of vehicle. Small fire noticed at bottom of car. Within minutes the car went up in flames. Ems extinguished fire eventually. Total time of incident 10-15 minutes.", "fail date": "  03/08/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I notice my 2011 Pilot's brakes don't function normally. Instead of smooth brake application the brake pedal �clicks� while being pressed and released. Brakes don't feel weak, they still stop well but just the pedal makes me worry. This issue has been ongoing for a few weeks now. The problem doesn't go away either, no matter if you're stationary or have been driving for 2 hours the brake feel is the same.", "fail date": "  12/08/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I purchase this Honda Pilot touring 2011 and would like to know if there is a recall for airbags or any other matter. Safety is my concern and my family.", "fail date": "  12/03/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Takata airbag recall November 2017.", "fail date": "  11/10/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Lately I've noticed my 2011 Honda Pilot has been accelerating slower than normal. I've done all scheduled maintenance but the problem remains. My car has 100k miles and is also burning oil. I think the two issues might be connected.", "fail date": "  09/20/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "My hatch door window has exploded for no reason what so ever while I and 2 other persons were standing and conversing. We all got cuts and were shaken from window explosion. Car was parked and not on or moving. It was very scary experience!.", "fail date": "  09/06/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "2011 main rear view interior mirror. The original mirror began to degenerate over time, within 3 years of owning can, causing mirror to loose ability to visibly see what was behind you. Mirror was replaced by Honda, now 2nd mirror is doing the same thing. Honda refuses to replace it and ignores the situation, indicating that we must have put something on it to cause that. I have found online, under Piloteers. Org, that shows many other vehicles were effected by the same defects where Honda did not little to help. I feel you should look into this issue, as I am sure accidents have happened in the past due to this condition and Honda ignores the issue and passes it off on the consumer. Every other car we have ever owned has never had any issues with rear view mirror, and therefore must be caused by the manufacturer of the mirror that Honda selected.", "fail date": "  08/21/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "My wifes Honda Pilot 2011 has a severe shutter when excelarating from a dead stop up to 50 mph. It now has approximately 119000 on it but has been doing this for about a year and this shutter or missing condition is getting worse. I have read reviews and seems to be a problem Honda has had for some time. What can Honda do to correct this problem for all of us?.", "fail date": "  06/01/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Some times when turn on my Pilot the srs ligt stay on in the dash bord for my whole ratite and another times does not stay on just for around 5 seconds I don't know what is that but the ligth is red and thats mean danger and someone told me thats something about the airbag. I bought this car in November 2016.", "fail date": "  01/06/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I am complaining of the horrible head restraints that push my head and neck forward. I have very good posture and am only comfortable seating up straight. I just purchased this car used to replace my beloved Jeep grand cherokee. I have owned two cherokees but did not buy a new one because of , the reduced windows, poor visibility and horrible forward tilting head restraints, the cherokee is like being in a coffin so I had to look at another manufacturer. Over all the Pilot is a good option with much bigger windows and visibility but the head restraints are also terrible. I can not rest my back on the back of the seat in a fairly upright position without my head pushed forward by the head restraint. I tried but ended up with a head ache every time I drove the car. What is the car industry thinking? do people sit in these cars/SUV's? I know many that say just recline your seat. What the hell help is that? I don't like to be reclined or am I comfortable reclined plus does that not defeat the point of a head restraint? a person should be able to sit in their car and have their seat support their body while also aligning the head restraint to support their head from injury on impact. The car manufacturers need to get their heads in the game and make the cars safe but comfortable without having to recline your seat as if you are in a lazyboy chair. This is infuriating.", "fail date": "  09/02/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Our 2011 Honda Pilot stalled in traffic and had to be towed to the closest Honda dealership. After several days of sensors and a starter being replaced it was determined that engine failure came from a shredded timing belt. Service department put on new belt and could not find root cause of belt failing at 26,000 miles.", "fail date": "  07/17/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Im not sure where water is coming in from not sure if its from rain or the ac but my rugs are drenched wet.", "fail date": "  07/15/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "It chatters all gears.", "fail date": "  11/12/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "P0301 through p0304 Honda engine misfire settlement Honda manipulate the dealer to make false allegations and the vehicle they refuse to repair it. I wish to have the truth come to light how they refuse to service and take accountability to repair the vehicle. They rather not repair it even though it is there. I was driving and the engine misfired. I was forced to drive into autozone to have them test it out and the diagnosis came back that I had to change the spark plugs. In which I did but now Honda does not wish to repair it.", "fail date": "  05/28/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "My '11 Pilot only has 65,000 miles on it and the tranny persists to jerk/hesitate/vibrate/stutter when shifting from one gear to another, either up and down, however, it is most noticeable at lower gear shift and at low acceleration. Aside from the annoyance it generate, the sudden pull or jolt in shifting at low gears renders an involuntary reaction from the driver which can lead to safety concerns.", "fail date": "  10/08/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "On July 19, 2014 I had an oil appoinmentat 1:30 to have my free oil change. Of course the dealership has to make money some how, so my service advisor offered that I have the transmission serviced. Since I was getting the free oil I felt as though I needed to buy for some service. So the did both oil and transmission service. Left the dealship no more than ten minutes later on my way home,my Pilot started smoking on the right side as I stopped and was praying the light turn gree n so I could go I turned and more smoke come up. I jumped out of the car and ran to my house which was not far away and got my husbanc to come back with me only to find my car completly engulfed in flames. My car was a total loss. I believe that this was something that occured from the dealership. I never had problems with my car. Now the fire inspector that was hired by my insurnce company stated that on the first inspection there was no transmission oil in the car it had all leaked out. Transmission is very flamable. I would could have died in that car. Nothing was salvagable. I would like very much for someome to check about this. I filed a claim with myt insurance comapny. I have also filed a claim against Honda directly and of course I have not been in contact with. This was a devastating accident/fire what ever that I have had to deal with. I know in my heart that this was something done at the dealership level and this has really put a scary situation for me. I am very hesitate about a lot of things now. I have lots of pictures that I took that you can see that my car was a total loss. Fire totally burnt my car. Please contact me 772-370-7416.", "fail date": "  07/19/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "While making a 3 point turn in a driveway in order to parallel park on the street my 2011 Honda Pilot accelerated at a high rate of speed and hit a parked car. My 2011 Honda Pilot continued out of control hit a curb and almost hit a chain link fence which would have caused me to travel into a busy four lane road. My 2011 Honda Pilot stopped by pressing both feet on the brake. Five hours later my battery was dead. I had aaa roadside service replace it. I took my 2011 Honda Pilot to the dealership today where the service rep agreed that there have been acceleration problems with the Honda Pilot. He had me go to a body shop next door where the rep told me he would only work on the body problems. He advised me to go back to Honda because I wanted to know what may have happened and to be sure my car was safe to drive. When I went back to Honda the same rep told me he did not tell me that Honda had any acceleration problems.", "fail date": "  06/20/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "I was stopped in a drive thru with my foot on the brake and 2 vehicles in front of me. Suddenly ,while my foot was still on the brake, my truck lunged forward hitting the truck in front on me and forcing that truck to hit the truck in front of them. But it didn't end there. When my truck originally lunged, the engine revved and after hitting the truck in front of me, my truck engine continued to rev up and down and my truck continued to bounce off and on the truck in front of me. After the initial impact I placed both feet on the brake and was pushing as hard as I could trying to make my truck stop. I was practically standing on the brakes, but I had no control. The revving and bouncing off and on the truck in front of me went on for several seconds. Finally, my legs got tired from pushing so hard on the brakes I just took them off and the truck just stopped moving and engine stopped revving. When all of this was happening, my sensors never went off. Although when my truck came to a stop , I put it in park and got out to see if the person in front of me was ok. I noticed that I was within 2 inches of her bumper and when I got back in my truck, the sensor was only beeping. I contacted american Honda who advised me to take it to Honda of bowie, where I purchased the vehicle. I was told that an inspector from american Honda and the service manager from Honda of bowie would inspect the truck thoroughly. After doing so, they informed my husband that there was nothing wrong with the vehicle and there was nothing they could do. I feel there is a safety issue with this truck and I am very nervous and anxious when driving it. I feel Honda has let me down and is refusing to take responsibility for a very serious issue.", "fail date": "  06/05/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "I bought this used certified vehicle on 4/20/2013 and was driving home from the dealer. The gas pedal started to vibrate a little at speed between 40 and 50. And I also could hear a grinding noise from front right. Next day my wife was driving and I was sitting in the passenger seat and I could feel this vibration humming sound and could feel the vibration on the floor. I contacted the dealer I bought they did not have anybody to check it that time. Then I took to the dealer close by. They checked and told me I need a wheel alignment and new tires because they are warn unevenly. I did all that and after spending closer to 1000 dollars it is still doing the same thing. . Read more...\n", "fail date": "  04/20/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Two incidents of sudden unintended acceleration. The first on January 31, 2014. The second on March 25, 2014. Both incidents occurred at a very low rate of speed of approximately 5 mph. In both situations the car was coming to a stop with the brake being applied. Suddenly, the rpms increased and the car moved forward with the break unable to stop the car even though both feet were applied to the brake peddle. In the first incident, the car was stopped by putting the gear shit into neutral and turning off the engine. In the second instance, the car was pulling into a parking space when the engine revved up, jumped a curb and hit a small tree, as soon as the tree was struck, the engine returned to normal speed. This has been reported to Honda of America as well as to the local Honda dealer. The car was brought to the dealer two times but the dealer was unable to diagnose the problem. Honda of America has opened a case but thus far has taken no action. This is a potentially very dangerous situation.", "fail date": "  03/25/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Traveling at approximately 70 mph with the vsa (vehicle stability assist) off, the automatic transmission suddenly shifted into neutral. I lost power and forward momentum. I was startled and when I looked at the gear selector, the indicator showed the selector in the neutral position. I moved the selector to the drive position and immediately had forward momentum once again. I'm terrified to imagine what could have happened had I been passing another vehicle with oncoming traffic. The service technician said, \" that couldn't happen. It is impossible for the transmission to move from drive to neutral without someone moving the transmission selector. \" I assure you it is possible, because it happened to me!.", "fail date": "  12/13/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Driving the car at a speed of 35-40mph and 45-50mph there is a shuddering and vibration feeling coming from the drivetrain. I took it to the dealer where I bought it and I asked for a tech to take a test ride with me and they said no one was available. I left the car with them. The tech called me later and said they did not notice the vibration and there is nothing wrong. Upon researching this issue, it appears it is a fairly common problem and Honda is doing nothing to address this. The vibration is very noticeable and it is getting worse. I bought the car new on 4/30/11.", "fail date": "  09/01/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The contact owns a 2011 Honda Pilot. The contact stated while driving 20 mph, the vehicle stalled in the middle of the road. Due to failure, the vehicle was towed to an independent mechanic since the vehicle failed to restart. The independent mechanic diagnosed the vehicle with a defective ignition switch cylinder. The contact called the dealer and the manufacturer and was informed that there was no recall on her vehicle. The vehicle was not repaired. The failure mileage was unknown.", "fail date": "  02/28/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "My 18 year old daughter was driving home 6/28/19 at midnight. Car died while driving. Coasted to side of road. Restarted and drove some. Same thing. Many lights came on. Coasted to side of highway. Tried one more time and made it home. Miles on odo: 118,279. The next morning I started the CA and tried to drive to dealership. After 3 miles, the same happened to me. I was able to pull over and had aaa tow it 5 miles to dealership. At dealership, the said many error codes came up but they recommended replacing the powertrain control module (pcm). I pd $1,410. 16 to do this on July 2. I picked the car up and drove less than a mile and the same thing happened. I was able to start it again and then it happened as I coasted back to the dealership. They analyzed the car, talked with hq Honda reps and they recommended checking the spark plugs. They did and all 6 were bad. However, they were just replaced at 102,42 miles about 1 year earlier. July 9. I decided to replace the spark plugs and the dealership to their credit only charged me $200 (cost of labor). I was hesitant to replace them as I was not certain they had identified the true problem. I was shocked after spending the $1,400 that it happened again. Ever since then I am wondering if this will happen again. I am also concerned because this problem of the car just shutting down is extremely dangerous, especially if you find yourself on the highway. So I would like someone to look into this and to see if this has happened to anyone else. Thanks.", "fail date": "  06/28/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Moving key back and forth in driver's door lock will result in engine repeatedly turning over, even with no key in ignition. Engine doesn't actually start but will crank by itself. Car does not have any type of remote start installed. . Read more...\n", "fail date": "  05/01/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Got a new battery 36 mins later the car was on fire.", "fail date": "  11/24/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The contact owns a 2011 Honda Pilot. Half an hour after the contact parked the vehicle in the garage, it caught on fire. The fire department extinguished the fire and filed a report. There were no injuries. The vehicle was towed to an independent mechanic where it was awaiting inspection. The manufacturer was notified of the failure. The approximate failure mileage was 66,000.", "fail date": "  07/25/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "I had recently discovered that all of my windows would roll down to a third open equally if the key fob alarm was continuously pushed (by something is a purse or backpack) and I might already be away from the car. So I was now more aware of locking my car and setting the alarm and keeping the keys in sight till I was far enough away. This has nothing to do with the car being robbed it just made me more aware to lock the car. I parked and locked the car on the night of 8/31/14 and went to bed. The next day my car was unlocked and had been ransacked. Many things were stolen from the car but nothing was damaged. Weeks later I found a Honda manual in the bushes. I thought it was from my car from the robbery. It turned out it belonged to my neighbor who drove a Honda civic. He had also been robbed on the same day and thought it was odd his car was unlocked when he found it. Both of us are pretty sure somebody had the technology to remotely open our cars and bypass the security systems. Neither one of us reported it to the police. Having been robbed (garage) before in los angeles I found they can do nothing for you so I did not even tell my insurance company thinking my rates might go up if it is known my care is easily robbed, alarm system or not. I now wake at every noise thinking it might be happening again. I can no longer leave anything in the car as I don't consider it secure. It has changed my sleeping habits and my work life is harder as I cannot leave anything in the car for any length of time. I am angry that Honda has done nothing about this.", "fail date": "  08/31/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Rather than take vehicle back to dealership, decided to try local shop instead. Clicking & popping noise continue in steering when turning left. Sound getting worse and can now hear in a parking lot whereas before, was just turning on roads. Was told by local technician that sound coming from inside the steering shaft and would cost upwards of $500 to repair. Blower motor needs replacing, purchased new battery, and also told right front cv axle leaking oil, another $400 to replace. Surprise surprise, was told again (third time now having owned this vehicle for just 4 years) that the front rotors are warped and the front brake pads down to 50%. Total cost to replace again is upwards of $600 plus labor. Seriously?!.", "fail date": "  07/30/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "On July 19, 2014 I had an oil appoinmentat 1:30 to have my free oil change. Of course the dealership has to make money some how, so my service advisor offered that I have the transmission serviced. Since I was getting the free oil I felt as though I needed to buy for some service. So the did both oil and transmission service. Left the dealship no more than ten minutes later on my way home,my Pilot started smoking on the right side as I stopped and was praying the light turn gree n so I could go I turned and more smoke come up. I jumped out of the car and ran to my house which was not far away and got my husbanc to come back with me only to find my car completly engulfed in flames. My car was a total loss. I believe that this was something that occured from the dealership. I never had problems with my car. Now the fire inspector that was hired by my insurnce company stated that on the first inspection there was no transmission oil in the car it had all leaked out. Transmission is very flamable. I would could have died in that car. Nothing was salvagable. I would like very much for someome to check about this. I filed a claim with myt insurance comapny. I have also filed a claim against Honda directly and of course I have not been in contact with. This was a devastating accident/fire what ever that I have had to deal with. I know in my heart that this was something done at the dealership level and this has really put a scary situation for me. I am very hesitate about a lot of things now. I have lots of pictures that I took that you can see that my car was a total loss. Fire totally burnt my car. Please contact me 772-370-7416.", "fail date": "  07/19/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Driver door lock actuator failed causing multiple doors to stay locked or unlocked including the rear door and could potentially cause persons to be trapped inside.", "fail date": "  05/14/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The tail lights only work intermidently. We stopped by the highway patrol on the night of April 7. The next day we took it to the Honda dealer, Honda of bowie and they refused to check anything becasue at that time the lights were working. Yesterday April 13 again the tail lights were not working and again today they were and again Honda of bowie refused to make any checks. The Pilot is unsafe to drive at night. What can I do?.", "fail date": "  04/06/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "While driving at around 20 mph on local road, malfunction indicator came up and engine stopped working. Towed to Honda dealer and after through checkup, throttle body & throttle gasket were replaced.", "fail date": "  04/10/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The contact owns a 2011 Honda Pilot. The contact stated that while attempting to accelerate over 50 mph, the vehicle released a burning odor through the vents. The vehicle was taken to the dealer several times for the failure and the dealer stated that the burning odor was due to engaging the on and off switch for the air conditioning compressor. The contact also stated that the vehicle rear air conditioning unit would activate independently. The manufacturer was made aware of the failure but the vehicle was not repaired. The failure mileage was 800 and the current mileage was 20,000.", "fail date": "  10/01/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The contact owns a 2011 Honda Pilot. While driving 20 mph, the contact stated that the vehicle stalled without warning and she was unable to restart it. The dealer made five attempts to duplicate failure. The manufacturer was aware of the failure. The current miles were 9,615. The approximate failure mileage was 2,600. Updated 07/26/lj.", "fail date": "  09/01/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "The exterior paint is chipping in multiple places.", "fail date": "  12/20/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Paint peeling around windows and top surfaces of 2011 Honda Pilot - white pearl paint paint chips coming off around windows and landing in car when eating. Child almost ate paint chips. Took car to pueblo Honda several years ago and told that there was nothing they could do as car was to old. Out of warranty. They did not check or notify me that the warranty was extended for 7 years. I just found this on google. Car had hail damage 2018 and insurance and auto body shop said paint defective. Filed online at Honda about this no one contacted me. This first appeared and started to peel about 5 years ago in 2016. Is only getting worse. 102,429 8. 6. 2018 mialage.", "fail date": "  08/28/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Upon pulling into a parking spot the vehicle suddenly accelerated, even though brake fully depressed. Driver was unable to stop forward motion, and the vehicle hit the flower bed and a small tree. Considerable damage to center bumper and frame underneath. A search of the internet shows numerous similar occurrences.", "fail date": "  07/01/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Driver door slightly lifts at top left corner during windy conditions while driving on highway. Seems like door alignment is improper.", "fail date": "  11/25/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Driving onto on ramp of highway from prior highway at approximate speed of 30 mph. Driver noticed a lurch from front of vehicle. Unknown part that was involved. Possibly transmission or fuel line but only suspicion with no evidence left to investigate (see pictures included). Acceleration no longer engaging. Driver pulled vehicle over to side of highway. Driver and passenger exited the vehicle. After a few minutes, noticed a stream of smoke emitting from under hood of vehicle. Small fire noticed at bottom of car. Within minutes the car went up in flames. Ems extinguished fire eventually. Total time of incident 10-15 minutes.", "fail date": "  03/08/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "The contact owns a 2011 Honda Pilot. The contact stated that the paint was peeling throughout the vehicle. The contact spoke with an independent mechanic regarding the paint. The local dealer was not contacted. The vehicle was not diagnosed or repaired. The manufacturer was not notified. The failure mileage was approximately 118,000. The contact mentioned she was concerned about the long term effects of the paint peeling.", "fail date": "  01/01/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "I notice my 2011 Pilot's brakes don't function normally. Instead of smooth brake application the brake pedal �clicks� while being pressed and released. Brakes don't feel weak, they still stop well but just the pedal makes me worry. This issue has been ongoing for a few weeks now. The problem doesn't go away either, no matter if you're stationary or have been driving for 2 hours the brake feel is the same.", "fail date": "  12/08/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Got a new battery 36 mins later the car was on fire.", "fail date": "  11/24/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "The contact owns a 2011 Honda Pilot. The contact stated that the vehicle's dashboard was leaking water into the cabin of the vehicle while raining. The failure caused mold to form on the floor of the vehicle. The contact took the vehicle to the Honda of cleveland dealer (2701 s lee hwy, cleveland, TN 37311; 423-478-5301) where it was diagnosed that the seam where the vehicle's firewall was located had fractured. The dashboard needed to be removed so that the seal could be repaired. The vehicle was not repaired. The manufacturer was made aware of the failure and opened case number: 063774946. The manufacturer referred the contact to NHTSA to file a complaint. The approximate failure mileage was 131,000.", "fail date": "  06/01/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Bought a 2011 Honda Pilot approximately a year ago. Right off noticed it had a weird smell to it. Could not track it down. Well about a month ago it rained for about five days straight. That is when we noticed the floorboards were soaking wet. Tried to locate the leak and first found the windshield was cracked so we had it replaced. No luck there. Pulled up the carpet in the front driver side and it was full of water and mildew/mold. This was an issue when we bought the car and we were not informed of it. You can tell from how much mold and mildew that this is no new problem. Tried to research it online and this is no isolated issue. Many people are having this issue with the 2011 Pilot. This is a safety issue because wet shoes can slip on slick worn out pedals, and then you have an accident. Still to date haven't found leak and Honda just wants to charge to \"fix\" the issue and the next time it rains the floorboard is full of water again.", "fail date": "  01/22/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Headlighhts look like someone has taken sandpaper to them. This started about 3 years ago. I have noticed other Honda Pilots with same issue.", "fail date": "  01/05/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Vibration under braking. Have both lower arm bushings replaced. Total invoice $733. 38 before tax.", "fail date": "  04/22/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "While driving on a highway at approximately 65 mph the hood became ajar after hitting a small dip in the road at the end of a bridge. The hook prevented the hood from opening the entire way and I was able to pull over safely and close the hood. Tried pulling it open afterwards and was not able to.", "fail date": "  07/13/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "My 2011 Honda Pilot shakes going 80 or more miles per hour. The dashboard shakes so bad that it looks like its about to pop out.", "fail date": "  01/25/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "The contact owns a 2011 Honda Pilot. The contact stated that the vehicle independently accelerated without the accelerator pedal being depressed. There were no warning indicators illuminated. The vehicle was not diagnosed or repaired. The failure mileage was 100,000.", "fail date": "  09/16/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "The contact owned a 2011 Honda Pilot. While parking, the vehicle accelerated independently and crashed into a wall. The air bags deployed. There were no injuries and a police report was not filed. The vehicle was destroyed. The manufacturer was notified of the failure. The failure mileage was 28,518.", "fail date": "  05/15/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "While making a 3 point turn in a driveway in order to parallel park on the street my 2011 Honda Pilot accelerated at a high rate of speed and hit a parked car. My 2011 Honda Pilot continued out of control hit a curb and almost hit a chain link fence which would have caused me to travel into a busy four lane road. My 2011 Honda Pilot stopped by pressing both feet on the brake. Five hours later my battery was dead. I had aaa roadside service replace it. I took my 2011 Honda Pilot to the dealership today where the service rep agreed that there have been acceleration problems with the Honda Pilot. He had me go to a body shop next door where the rep told me he would only work on the body problems. He advised me to go back to Honda because I wanted to know what may have happened and to be sure my car was safe to drive. When I went back to Honda the same rep told me he did not tell me that Honda had any acceleration problems.", "fail date": "  06/20/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "On April 16th 2013, I was driving my 2011 Honda Pilot on my street preparing to drive into my driveway, I slowed the vehicle down when I saw another vehicle behind me. I put my blinkers on informing other vehicle I was going to pull into my driveway. I waited for the other vehicle passed then proceeded to gently pressed on the gas, that'¿¿s when the vehicle accelerated violently speeding onto my driveway. I immediately slammed down on the brakes but it instead of stopping the car accelerated even faster. The vehicle crashed into my house damaging the pillar wall structure next to my garage door. I tried putting the vehicle in park but it was jammed. When it finally allowed me to put it in park I put it in reverse and again it accelerated uncontrollably. I slammed down on the brakes but it wouldn'¿¿t stop. The only way it stopped is when it crashed into the vehicle parked across the street. I had nightmares ever since. I had sent it to the Honda dealership and expressed my concern with the car and informed them that I no longer feel safe in this Honda Pilot and no longer want to drive my car. Honda had told me they didn'¿¿t find anything wrong with the car. I couldn'¿t believe what I was hearing. In the 20+ years of driving I've never experienced having a car accelerate. I truly believe Honda is covering up and trying to protect themselves from a law suit. They are capable of easily fixing the problem without reporting it. Who'¿¿s to question them or checked if they did their job correctly or if there was a problem with the throttle, brakes or engine? now no one will ever know the truth. I believe that the Honda Pilot 2011 is not a save car to drive and needs to be recalled and have an independent company examine it.", "fail date": "  04/16/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Today Tuesday March 26th 2013 I was in brooklyn, NY off mrtle Ave. On a residential one way street. Pulled up to a large open parking spot with cars in front and back of the spot. The spot was large enough for 2 cars. As I pulled into the spot and progressed slowly forward with my foot on the brake, the car rengine began to rev quickly and jolted forward hitting the parked car in front of me. This is the second time I have felt the car engine rev on it's own with my foot off the gas and jumping forward. First time was while slowing down to a stop sign and the car jumped forward and accelerated on it's own but with no accident. I dismissed it not sure why it happened. This time of course I felt the same symptom with foot on brake the car jolted forward and engine revved on it's own but hitting the car in front of me. I hope Honda fixes this issue. I am very afraid this could happen around other people and accidentally hits someone when the car does this on it's own.", "fail date": "  03/26/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Vehicle in question is a 2011 Honda Pilot which was purchased brand new in September 2011. Problem occurred when I was heading south on wellwood Ave. I came to a red light at the intersection of wellwood Ave and straight path road in lindenhurst. When I attempted to come to a stop the vehicle began to accelerate. I kept my foot on break but the car kept on accelerating and engine kept on revving as though I was pressing down on gas pedal. This created a loud revving noise and a cloud of car exhaust . If I had removed my foot from the break at this time I would have crashed into back of vehicle in front of me. I kept my foot on the break and put the vehicle into park. When the light changed and the car in front of me moved I put the car back into drive and the car seemed to function normally again. Incident occurred on Saturday evening December 29, 2012.", "fail date": "  12/29/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "The contact owns a 2011 Honda Pilot. While stopped at a traffic stop, the contact noticed that the vehicle would hesitate when accelerating. The vehicle was taken to the dealer three times for diagnostics but the technicians were unable to diagnose the failure. The approximate failure mileage was 2,000.", "fail date": "  06/02/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "My 2011 Pilot was purchased new in Aug 2011, has less than 68000 miles and I live in southern CA, yet: my battery died and had to be replaced Apr 2018 (car was parked < 1hr and would not start, but started fine the hour before). My engine check transmission system light/warning came on and we had to add a quart of oil on July 18, 2019, even though I had an oil change done in may 2019 less than 500 miles before. On 7/24/19, my front windshield wipers stopped and today I had to have the motor replaced not just a fuse. I'm concerned why a Honda < 9 yrs old is having these issues - burning oil & motors dying. Is my car a lemon? can you please help to allow me to have a dealership service do a full inspection/fix on the oil issue at no cost and possibly a reimbursement on the cost of the new windshield wiper motor (part & labor approx. $411 - I can provide a copy of the invoice later as the work is being done today)? thank you for your consideration. I would appreciate any assistance in ensuring that my car does not progress as a lemon. I have been a dedicated Honda owner since 1981 and this is the first one I've owned that has problems. Thank you.", "fail date": "  07/24/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "The inside rear view mirror has degraded to the point where the mirror is cloudy with black spots that appear like dirt, but are actually just the degradation of the mirror itself. I've searched online and see that this is a common problem with the 2011 Honda Pilot.", "fail date": "  11/01/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "Rear view mirror became hazy after only approx 2 years and is now becoming progressively worse. It is now hindering visibility through mirror.", "fail date": "  10/04/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "Interior rear view mirror of my Honda Pilot ex-l 2011 lost most of the reflective coating/ material. The mirror is clean but looks dirty as it lost most of the reflective material. It has become dangerous to drive with no proper rear view mirror and the replacement cost for the mirror is little over $850. I browsed online and found out many people complained of the same issue with Honda Pilot interior rear view mirror. Please have a check and help all the Honda Pilot owners and other vehicles which use the same part.", "fail date": "  01/01/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "The sunroof spontaneously cracked while driving on a city street. When I took the car to the dealership, one of the mechanics mentioned that this was a common problem. Nevertheless, I had to pay for the entire replacement. The sunroof is regularly exposed to the sun because the 2011 Pilot does not have a retractable outer cover like most other cars have.", "fail date": "  06/07/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "The contact owns a 2011 Honda Pilot. The contact stated that while driving 35 mph, the sun roof window shattered without warning. The vehicle was taken to a dealer. The vehicle was not diagnosed or repaired. The manufacturer was not notified of the failure. The failure mileage was 48,000.", "fail date": "  02/03/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "The car was parked on the drive way. The glass hatch was exploded as we closed the tailgate. It caused cuts on hand and leg on little boy standing by. Take the vehicle to the Honda dealer and dealer said it was not under warranty. Call american Honda and the answer was the same because the glass hatch was exploded, no warranty. This vehicle is less then 2 years old even with 3 year warranty. It costs $550. To fix it ,plus more on personal injuries.", "fail date": "  05/18/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "The maximum speed setting on the windshield wipers is completely insufficient when driving on the highway / interstate during periods of rain and at speeds in excess of 45 mph. It is impossible to maintain a reasonably unobstructed view of the roadway. While traveling at higher speeds, the high-speed setting of the wipers can keep up with a mere drizzle only. A steady rain creates nearly zero visibility, while a thunderstorm or torrential rain renders the vehicle inoperable. The high-speed wiper setting on the 2011 Honda Pilot is comparable to the low speed wiper setting on the majority of other vehicles currently on the market. The service department at j. L. Freed Honda in montgomeryville, pennsylvania indicates that the wipers operate as designed.", "fail date": "  07/04/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "Bought 2011 Pilot in may 2010, brand new. The brochure stated the vehicle has leather interior trim. To my dismay two years later, the center seat developed a crack and was taken to the dealer, and was told the seat was vinyl. Not leather! the hand rest on all doors and center console are all torn and stretched to reveal the trim was thin strips of some sort of rubber. Now all seats are also cracked and torn after the vinyl hardened. I feel as if I was fleeced by Honda. Had I known the interior was rubber and vinyl I would have stuck with the fabric seats. Additionally the vehicle kept shutting down only to find out the throttle body was defective. The vehicle 'eats' brake pads and the emergency does not work properly. I learnt the hard way few months after purchasing my vehicle. I parked it in my driveway which has a very slight incline, placed it in neutral and applied the brakes and stepped out, only to hear horns blowing. On checking, the vehicle had rolled into the street. To this day the dealer cannot figure why the emergency brake does not work if the vehicle is on an incline with the back towards the bottom of the incline. .", "fail date": "  07/04/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "After purchasing my 2011 Honda Pilot touring I quickly came to realize how uncomfortable the seats are. My boyfriend first noticed this on an hour trip and then that is when I put two and two together and realized that is what has been causing my hip, leg and back pain. I'm not sure what it is about the seats, but they are miserable. Our feet go numb, legs ache and hips practically kill us. After a weekend trip 5 hours away we are both dealing with pain. It is enough that I am considering selling the SUV. I love the Pilot other than the seats. I'm telling you, they are miserable. It's awful because I want to keep the vehicle. Would love if Honda would address this issue, but I've seen that this is a common problem with several models and they haven't done anything. With as much as we spend on a Honda, and as much as they make, you would think they would help us out. It's misery.", "fail date": "  10/01/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The material inside on door cranking plus the arm rest crank a default in the material nothing has been did about it. Paid to much money for that to happen . I took it to the deal were I got it from they say the sun did but it on the front part of the truck know we're else.", "fail date": "  09/21/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "Honda Pilot ex-l. Driver side and front passenger seats are extremely uncomfortable after more than a 5 minute ride. Suspect this is due to faulty lumbar-support design, placement and extreme firmness. Unsafe and unhealthy. Pain is so intense that it remains after driver and passenger are no longer in the car/seat. Could pose long-term health problem.", "fail date": "  08/21/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "Drivers seat height adjustment lowers on it's own while driving. This happens every time it is driven, creating a safety issue since driver sinks to lowest position while vehicle is in motion. Occurred while driving new car off the dealers lot. Dealer was unsure how to fix.", "fail date": "  10/13/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Tire", "Sub Problem": "Tire Sidewall problems", "description": "I drive a 2011 Honda Pilot. It was purchased new. On the morning of June 7, 2011, a family member discovered that the vehicle, which was in the driveway of the house, had a flat in the front, driver-side tire. The vehicle was placed on a flat bed and taken to a local mechanic. Upon inspection, the mechanic noted that there was a puncture to the sidewall of the tire which should not be repaired. A replacement tire was purchased and the old one was discarded. I speculated that road hazard may have caused the puncture, so did not think much about filing a complaint. The tire had about 6,183 miles on it the time of the incident. On the evening of June 17, 2011, as I was driving along the tappan zee bridge (connecting rockland and westchester counties) in new york, the tire warning indicator went on. Upon my arrival at home (about an 8-minute drive from the bridge), I noticed a hissing sound coming from the rear, driver-side tire and immediately concluded that the tire was deflating. The following morning the tire was flat. After installing the spare, I took the tire to a goodyear dealer. Upon inspection, the mechanic noted that there was a puncture to the sidewall of the tire which should not be repaired, which was the same issue discovered with the front, driver-side tire. I replaced it with a new tire. The tire had approximately 6,500 miles on it the time of the incident. This time I filed a complaint since it was highly coincidental that two tires would fail within a 10-day period with the same fact pattern. I suspect that the vehicle came installed with at least two tires that had weak sidewalls.", "fail date": "  06/17/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2011 Pilot", "Problem": "Tire", "Sub Problem": "Tire Sidewall problems", "description": "I drive a 2011 Honda Pilot. It was purchased new. On the morning of June 7, 2011, a family member discovered that the vehicle, which was in the driveway of the house, had a flat in the front, driver-side tire. The vehicle was placed on a flat bed and taken to a local mechanic. Upon inspection, the mechanic noted that there was a puncture to the sidewall of the tire which should not be repaired. A replacement tire was purchased and the old one was discarded. I speculated that road hazard may have caused the puncture, so did not think much about filing a complaint. The tire had about 6,183 miles on it the time of the incident. On the evening of June 17, 2011, as I was driving along the tappan zee bridge (connecting rockland and westchester counties) in new york, the tire warning indicator went on. Upon my arrival at home (about an 8-minute drive from the bridge), I noticed a hissing sound coming from the rear, driver-side tire and immediately concluded that the tire was deflating. The following morning the tire was flat. After installing the spare, I took the tire to a goodyear dealer. Upon inspection, the mechanic noted that there was a puncture to the sidewall of the tire which should not be repaired, which was the same issue discovered with the front, driver-side tire. I replaced it with a new tire. The tire had approximately 6,500 miles on it the time of the incident. This time I filed a complaint since it was highly coincidental that two tires would fail within a 10-day period with the same fact pattern. I suspect that the vehicle came installed with at least two tires that had weak sidewalls.", "fail date": "  06/07/2011"}]