[{"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Keep getting misfires had mechanic replace coils & plugs but still getting obd codes for misfires of cylinders why ?? also keeps jerking & I nor a mechanic do not know why.", "fail date": "  01/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Saturday, October 23, 2021 we traveled down old dallas hwy toward gastonia, north carolina. Transmission slipped and motor revved very high without forward speed. Attempting to put transmission into reverse caused similar slippage. Returning on hwy 321 toward dallas, north carolina, the transmission slipped and the car would not reach highway speed. Turning onto hwy 279 to go home, the Honda would not go into gear at first, then slippage so that other cars almost struck our car which was unreliably stumbling. We have found there is a recall number 04v176000.", "fail date": "  10/23/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The gear shifter will not gauge is stuck in one position.", "fail date": "  11/04/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "While driving on the interstate the d indicator starts blinking. The next exit is still 10 miles away. . I stop the car at a gas station for about 5 minutes. I then get back on the interstate to get home without getting in an accident or fatally injuring myself or others ! this has happened a few times whenever I go over 55-60 mph. So it seems to be when the transmission is changing from 3rd to 4th gear. ?? why haven't I received a recall for this transmission/powertrain problem ?? possibly campaign # 04v176000 and recall # p30. I only have 147,000 miles on my Pilot !! how many people have to get injured or even killed for this matter to be taken care of by someone or Honda ???.", "fail date": "  07/17/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Takata recall I was merging onto the highway and experienced total engine power loss. Rpms revved high and car lurched forward. I had already merged into 60mph traffic when my car stalled. Forced the cars behind me to slam on their brakes. Thankfully I was able to pull off to the side of the road and avoid having a major accident. There was no check engine light on or any other indication of failure.", "fail date": "  04/14/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Tl the contact owns a 2003 Honda Pilot. Upon starting the vehicle and shifting into drive, it failed to move. In addition, while the vehicle was at a stop light or while making turns, the vehicle continued idling. The check engine indicator was illuminated. The vehicle was taken to jeff wyler Honda of colerain (8950 colerain Ave, cincinnati, OH 45251, 513-741-3700) where it was diagnosed that the vehicle misfired and the transmission and gasket needed to be cleaned and replaced. The vehicle was not repaired. The manufacturer was not contacted. The failure mileage was 284,469.", "fail date": "  02/01/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "I just bought a 2003 Honda Pilot with 164,000 miles on it a few days ago and noticed the transmission wasn't shifting correctly. It seemed like it would sometimes over rev before shifting but thought nothing of it. Last night I picked my grandchildren up from town and was heading back up the highway going about 55mph, all of a sudden it jerked back and downshifted to 2nd gear, luckily no one was behind or they would've hit us. I noticed the engine light came on at that time also.", "fail date": "  10/03/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "In a trip to the park (20 minutes highway trip) the d indicator start blinking, park the car and turn off, turn it back on, and the light keep blinking all the way back home. It never happened before.", "fail date": "  06/16/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "I was driving on the interstate and all the sudden it seem as if the transmission locked up, the tires squeeled and dropped 20 mph almost immediately. This happened twice in a 40 mile stretch, I'm scared to drive it.", "fail date": "  02/19/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "I drive between 20-40mph and my Honda shakes and shudders for 8 seconds then goes away. Any idea what can that be.", "fail date": "  10/20/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The contact owns a 2003 Honda Pilot. While driving various speeds, the vehicle lost power. In addition, the accelerator pedal was depressed, but the vehicle failed to accelerate. The contact was unsure about what warning lights were illuminated. The failure recurred on numerous occasions. The vehicle was towed to a dealer where it was diagnosed that the transmission needed to be replaced. The vehicle was not repaired. The manufacturer was notified of the failure. The vehicle was previously repaired per NHTSA campaign number: 04v176000 (power train). The failure mileage was 150,000.", "fail date": "  09/16/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "While driving on city streets in traffic and slow to 29 or 39 mph I feel a shudder or vibration. Also intermittently my \"d\" light flashes when turn on my Pilot but the maintenance light never comes on. This has been happening last 6 months. I have 160,000 miles.", "fail date": "  06/23/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "This goes with the complaint # 10876282, I just entered. I needed to correct my VIN # by adding the number 2 in the front of the number. On the previous complaint I started the VIN# with h, not 2.", "fail date": "  06/23/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "When the vehicle is in motion and I have to press down on the gas to accelerate/ speed up the vehicle quickly the driver seat bounces backwards/moves and it feels like its going to come off the frame its mounted to like some bolts may be broke or something. The car locks are messed up. The both front door locks have to be unlocked with a key. The inside unlock mechanism only unlocks the driver side passenger door and the trunk. In order to unlock the passenger front and the passenger rear locks a window has to be rolled down and you have to reach in and manually unlock it and those also have to be manually locked back when you exit the vehicle. Also, the passenger air unit does work. It does not blow out air even with the rear control on. The inside car lights have to be manually cut on and off and not set to come on when the door opens and closes because it runs the battery down. Sometimes while driving the headlights flicker. And the power port to charge phones, etc. Works but anything plugged into it gets hot real fast. All that points to electrical issues. The air bag lights kept coming on and going off. The transmission light has been flashing d and did not stop until fluid and filter was changed. So far that seems to have helped. And last but not least, the contacts in the ignition switch act defected. The key has to remain in the ignition switch and the spare key has to be used to unlock the car because if the key is removed, it does not want to go back into the switch to crank the car. The switch does not want to accept the key and turn to crank the engine once it has been removed from the switch. Even trying to turn the steering wheel and pressing the brake to release the switch doesn't work. And the gear shift stick/shaft acts almost like it's not park, but it was put in park.", "fail date": "  06/20/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Had to replace water pump and belt payed for it at homda dealer then noticed it had a recall on it dealership didnt notify me of the recall. Now I'm having problems with the transmition dealership said they couldn't find the problem but it also has a recall. But when I searched my VIN it said no recalls were found. The transmition periodically comes out of gear if I stop quickly or 1st thing in the morning or if I go over a speed bump slowly or sometimes randomly in the middle of driving in traffic. I can switch it into 1st 2nd or 3rd and get it moving again. It hasn't happend at high speeds yet. And the the metal under the seats is all rusted. At this rate the transmition will cause me to have an accident and the seats will come off and the airbags that have also been recalled will kill us im highly dissapointed in this vehicle.", "fail date": "  06/08/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Tl- the contact owns a 2003 Honda Pilot. The contact stated that the vehicle independently decelerated while driving the vehicle. The contact stated that the abs warning indicator illuminated. The vehicle was taken to the independent mechanic where it was diagnosed the failure was two front wheel speed sensor replaced. The vehicle was towed to the dealer where it was confirmed that the vehicles two front wheel speed sensors and the automatic transmission needed to be replaced. The vehicle was not repaired. The contact referenced NHTSA campaign: 04v176000(power train) however the vehicle's VIN was not included. The manufacturer was notified of the failure. The vehicle failure mileage was approximately 195,000. Kh.", "fail date": "  03/22/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Tl-the contact owns a 2003 Honda Pilot. The contact stated that while attempting to accelerate from a stop, the accelerator pedal was depressed but the vehicle failed to accelerate. The failure recurred on numerous occasions. The vehicle was taken to a dealer who diagnosed that the transmission needed to be replaced. The vehicle was not repaired. The manufacturer was notified of the failure. The vehicle was previously repaired under NHTSA campaign number: 04v176000 (power train). The failure mileage was 185,000. Oo.", "fail date": "  03/05/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Transmission was included in recall but we were never notified. Experienced catastrophic failure at 168,000 miles. Lost power on the freeway going 65 mph with no warning. Honda refusing to replace transmission because of the age and mileage of my car, despite the known defect in the transmission.", "fail date": "  11/24/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Tl-the contact owns a 2003 Chevrolet Pilot. The contact stated that while driving at approximately 30 mph, the gas pedal was depressed and the engine stalled. The check engine warning indicator was illuminated several times. The vehicle was able to restart. The vehicle was taken to a dealer where it was diagnosed that the transmission needed to be replaced. The manufacturer was made aware of the failure. The failure mileage was 128,000. Jw.", "fail date": "  06/08/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "On may 26, 2015, I was traveling north on I-5 at 60 mph when the wheels of my car seized. At which point the car began a rigorous slide, black smoke billowed as the tread of my tires peeled off. The force of the slide eventually jammed the tires sideways causing the car to hop as it propelled forward, finally coming to a stop about a mile from the starting point. Needless to say it was a horrific ride, which still causes me some stress. The car was towed to bill's tech trans where they informed me that the transmission was faulty. Bill's sent the faulty transmission to the maker. At that time I was unaware of the recall on Honda Pilot 2003 transmissions. After hearing of the recall a couple of months later, I informed american Honda of my incident. They requested receipts pertaining to the incident which I provided in full 3 times. One of the four customer service representatives had lost some or all of the paperwork that I had sent. It has been a year and a half of dealing with american Honda and they continue to put me off, even closing the claim at one point; they sent a letter which stated, \"we have attempted to contact you in regards to your request, but have not been successful in reaching you. \" I called immediately and they informed me they had closed the claim due to my lack of responding to their phone calls. I told them that both my home phone and cell phone keep logs of who calls and that they are not on either one. American Honda reopened the case. Since then I have been rebuffed repeatedly. About a month ago I was told someone was reviewing the case for possible reimbursement and have heard nothing since. It seems as if they do not want to honor the recall on the 2003 Honda Pilot transmission. Is there anything you can do to help? american Honda recall case no. 04263486.", "fail date": "  05/26/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "My Honda Pilot shutters at 25-50 mph I had it check with my local dealer Honda and it seems like its coming from transmission issue's.", "fail date": "  09/01/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The contact owns a 2003 Honda Pilot. While driving approximately 60 mph, the contact downshifted and the vehicle automatically shifted back into gear. The failure occurred twice. The dealer stated that the transmission needed to be replaced. The vehicle was not repaired and the manufacturer was notified. The approximate failure mileage was 142,000.", "fail date": "  07/20/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "My Honda Pilot starts slipping when it changes from 3rd gear to 4 gear. Now it starts shaking/jugging. With speed 60mph or 65 mph, it is very dangerous if it starts jugging because you never know how the car behind you reacts and your car will do.", "fail date": "  10/05/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "We purchased our 2003 Honda Pilot ex-l new at danbury Honda on February 20, 2003. We have had ongoing issues with the \"d\" or drive light flashing intermittently since the car was new and had it checked at the dealer each time, with a report back that there was nothing wrong and it would go away. The dealer has done almost all of the preventative maintenance to our vehicle and we also do proactive care to our vehicle. Most recently we spent a good amount of money on repairs to the transmission through Honda dealerships in delray beach, florida (disaster there) and danbury, CT. We are now being told we need a new transmission, only months after putting a lot of money into the car. Had we known we would be spending this kind of money (about $5k), we would have traded the car in. However, we are now caught in a financial burden with having to put a new transmission in the 2003 Pilot, which we think should be part of a recall based upon all the on-line research we've done. Can anyone please assist?.", "fail date": "  07/22/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Tl - the contact owns a 2003 Honda Pilot. The contact stated that the check engine warning light was illuminated. The vehicle was taken to the dealer where it was diagnosed that the transmission needed to be replaced. The contact stated that the vehicle was repaired under NHTSA campaign number: 04v176000 (power train) but the failure recurred. The manufacturer was made aware of the failure. The approximate failure and current mileage was 113,805. Kmj.", "fail date": "  04/24/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "We bought a 2003 Honda Pilot in 2006. 3 months ago we found out it had been recalled in 2004 for the powertrain. That apparently was fixed at that time. In April, we had an issue with the rpms showing 3000 while we were driving only 35 mph. We took it to the dealer who informed us that the powertrain needed to be replaced. This cost us over $6,000 to replace including over $700 to lease a car. American Honda said that the warranty had run out and that it was a high mileage vehicle and they would not cover the cost of the repair. Our question is why would the powertrain have to be replaced a second time within a 9 year period. The 109,000 miles on the vehicle is within if not lower than the national average. Granted, a 10 year old vehicle will probably not still be under warranty. However, if the powertrain was fixed under the recall in 2004, should it need to be replaced again?.", "fail date": "  04/12/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "While driving at 40-45 mph with shift lever in \"d\" the vehicle began to shift down a gear very hard and then back into the previous gear. It does this repeatedly. Was told by a Honda dealer repair shop that the transmission needs to be replaced. The car has been well maintained. The transmission on a vehicle like this with 160k miles should not be failing.", "fail date": "  03/30/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "I parked my car outside a local store with a nearly zero decline. After entering the store and beginning to shop - a fellow shopper came in to tell me that my car had rolled backwards and hit another vehicle. Luckily there was no major damage to either vehicle. When I entered my vehicle the gear shift was in fact in park but the car had rolled back anyways and stopped only because it hit another vehicle in the parking lot.", "fail date": "  01/17/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Sudden downshifting and shuddering, check engine light came on and difficulty in shifting. Engine light remained on and occasional shifting problems for a few weeks until checked by dealer - po740 and po730 needs transmission replacement and engine mount. Same problem as a 100 of others. Original owner fully dealer maintained for 10+ years, even with fairly high miles well maintained transmission should not fail. Honda dealer quoted $5500 for Honda rebuilt transmission with no mention of any assistance or of the well known and frequent occurence of this issue. A definite safety issue as simple luck this didn't occur on the highway at greater speed in high traffic I frequently drive.", "fail date": "  01/15/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Owner driver was stopped on red light along with 20 other cars , the driver was last in the lane and other driver di not applied brakes, this vehicle was banged from the back. Body damage was repaired by westminster Honda in costa mesa . California, body repair cost of $ 3,500 was paid by insurance company of the person who was at fault, the auto transmission replacement cost of $ 6,500 was recovered from the me who was not at fault. The question is at that time the air bag was not deployed because of fault? after that I got recall notice from american Honda for two air bags driver side and passenger side, the notice came in the month of January 2015, first they delayed the repair task by making an excuse that they are very busy and first appointment is available on February 28 th at auto nation Honda in gilbert az then I got an e mail and a call from dealer that the parts are on back order, and they would not know when part will be available. After that I called american Honda, they have intervened and assured me that auto nation Honda will call me to schedule appointment again. Then I gave 4 - 5 calls to auto nation Honda, till today as of April 19th this repair is not fixed even though all parties know that this is critical to the life of drivers and passengers in this vehicle. Now I am in round rock texas, so I will need to see new dealer will somebody control these auto companies and dealer for compliance? thanks.", "fail date": "  12/18/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The contact owns a 2003 Honda Pilot. While parked, the contact noticed that the vehicle began to roll backward. The contact was able to enter the vehicle, place her foot on the brake pedal and shift the vehicle into park. The contact noticed that she had removed the key from the ignition prior to shifting into park. The vehicle was not repaired. The approximate failure mileage was 150,000.", "fail date": "  10/26/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "I recently bought a used 2003 Honda Pilot from [xxx] of colerain in ohio. The car has 137,000 approximate miles on it. They wanted me to pay over 15,000 for the car and finally after debating for hours over 4. They sold me the car out the door with no warranty offered for 10,500. I was very happy and I have 2 children and one on the way. I bought the car on August 5, 2012 less than two week go by and I am driving home going 65mph on 71 and the car jerks down gears to 30 miles an hour in a split second. My neck and my back are both hurting and I do not want to sue nor try to get rich off of this. My complaint is, I took the car to[xxx] of colerain the next morning they said the transmission was bad and they could do nothing for me. So basically they said I will have to pay for a $7,000 dollar repair. I left the car there and came home did all kinds of research found that car is up for recall on the transmission and thousands of people have the same issue. They even have a facebook page dedicated to fixing this problem! how can Honda keep these vehicle's on the road? if my 17 month old would have been in the car with me she would have maybe broke her neck. Go drive 65mph and throw the car in reverse that is what happened to me! and they said I bought a certified used Honda? so what do I do ? who do I call? and why can they sell me a car in such a state? with over 4 recalls on parts and one being potentially fatal. Information redacted pursuant to the freedom of information act (foia), 5 u. S. C. 552(b)(6).", "fail date": "  08/17/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Have had this vehicle since new. Had the 2nd gear recall done as required at about 30,000. At 96,000 that tranny went out and had a \"rebuilt\" installed by sunset Honda slo, CA. Under warranty. At about 150000, d indicator flashed meaning sensors on tranny needed replacement. Now experiencing loss of drive, sometimes when coming out of stop, engine just revving but no drive, also, as happened to my wife yesterday, when going at about 35, loss of power/drive occurred. This could show that I need an actual decent new tranny put in! I have yet to visit my well qualified and non Honda dealer mechanic! I have been a Honda owner since 1992 and this will be my last Honda ever! the reliability is over with and they are way overpriced.", "fail date": "  07/17/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The contact owns a 2003 Honda Pilot. The contact stated that while driving 55 mph, the transmission would not shift into any gear. The vehicle was taken previously to the dealer in 2004 for a recall repair under the NHTSA campaign id number: 04v176000 (power train: automatic transmission). The vehicle was not taken to the dealer for this most recent failure. The manufacturer was not notified. The failure mileage was 220,000.", "fail date": "  06/18/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Shuddering and jerking while shifting from 2nd to 3rd gear. Also does the same in reverse. Car would not accelerate on highway on-ramp. While at high highway speeds, car felt like it fell out of gear and lost power, until the gear engaged again.", "fail date": "  06/04/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Recall notice from Honda.", "fail date": "  03/26/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "My 2003 Honda Pilot has \"srs light on\" at the vehicle dashboard. I was driving in our residential subdivision area and about to park in my driveway, the srs went on. I am not driving this vehicle now until this fault has to be fixed immediately. If there is a fault with the installed air bag, please help me to cover the repair/replacement costs of this faulty airbag. Thank you.", "fail date": "  09/09/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Aviso urgente DE seguridad por inflador defectuoso DE bolsas DE aire.", "fail date": "  03/05/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The gear shifter will not gauge is stuck in one position.", "fail date": "  11/04/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2003 Honda Pilot. The contact received notification of NHTSA campaign number: 19v501000 (air bags) however, the part to do the recall repair was unavailable. The local dealer was contacted, and it was confirmed that the part was not yet available. The contact stated that the manufacturer had exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure. Parts distribution disconnect.", "fail date": "  06/01/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Transmission slips engine light does not come on was told transmission is separate so itdoes not show up because the light does not come it does not show up on the computer does not happen all the time so it can and does when driving it goes into neutrol.", "fail date": "  02/09/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "2003 Honda Pilot. Consumer writes in regards to airbag safety recall. The consumer stated the vehicle was traded in, in 2011.", "fail date": "  09/19/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "I wants to know if my because is on the recall list.", "fail date": "  02/20/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "03 Honda Pilot transmission is slipping in between gears talked to Honda dont want to take care of problem even wen they hav recall on it ive seen hundreds of same exact issue all over internet with exact same problem and Honda is still trying to charge fior there own recall.", "fail date": "  02/06/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "This is a follow up of a complaint file last year- NHTSA id number: 11045405. I took my vehicle to a Honda dealer as required by american Honda. They confirmed that the opds module was faulty. I continued to contact american Honda by mail. They advised that me that I would have to pay $775. 00 deductible for the replacement of the defective opds module verbally as they would not correspond to me in any written form.", "fail date": "  10/16/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Tl the contact owns a 2003 Honda Pilot. The contact received a recall notice for NHTSA campaign number: 19v501000 (air bags). The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The contact called landmark Honda (5125 duke st, alexandria, va 22304, (703) 823-8000) and was informed about diagnostic testing. The vehicle was not diagnosed or repaired. The contact declined the repairs due to the fee. The manufacturer was not contacted. The failure mileage was 107,000. Parts distribution disconnect.", "fail date": "  08/01/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "When I driving 95 n going to connecticut there's a huge smoke on the hood and the other motorist behind me, he saw a lot of oil dripping on the street and he gave me a honk. I parked the car beside the highway and I opened the hood remove the negative battery to avoid the fire.", "fail date": "  05/26/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Vehicle driver side hit side of mountain causing it to go down hill on passenger side. Rolled over three times. No air bags deployed. Person sitting in passenger seat received a scalp injury, but no loss of consciousness. Vehicle was on a dirt road and was traveling between 20 and 25 mph.", "fail date": "  07/04/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall.", "fail date": "  04/08/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "I never got recalls fixed and dealer service marked as checked but not replaced and srs light has been on since service and I had to pay to get recalled due to emergency interlock was damaged.", "fail date": "  11/25/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Tl-the contact owns a 2003 Honda Pilot. The contact stated that the vehicle battery died and it caused the air bags to cut off. The vehicle was not repaired. The manufacturer was not made aware of the issue. The failure mileage was 149,000. Ad.", "fail date": "  10/25/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2003 Honda Pilot. The contact received a notice for NHTSA campaign numbers: 15v370000 and 15v320000 (air bags); however, the parts needed were not available. The contact believed that the manufacturer exceeded a reasonable amount of time to provide the recall repairs. The dealer and manufacturer were made aware of the delay. The contact had not experienced a failure. VIN tool confirms parts not available.", "fail date": "  07/08/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Tl-the contact owns a 2003 Honda Pilot. The contact received a recall notification for NHTSA campaign id number: 15v320000 (air bags) and stated that the part needed was unavailable to perform the recall repair. The manufacturer was notified of the issue. The contact had not experience a failure. Bp.", "fail date": "  07/06/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Tl- the contact owns a a 2003 Honda Pilot. The contact received notification of NHTSA campaign id numbers: 15v320000 (air bags), 14v700000 (air bags), 12v573000 (electrical sysytem) and 12v136000 (exterior lighting) however, the part to do the repairs were unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure. Fe.", "fail date": "  05/28/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "I was involved in an auto accident. When I came to the inside of the car was smoking. The air bags were deployed and I had a three inch burned hole in my left arm. Now I have a permanent scar because of the airbag. I have pictures, police report and hospital reports.", "fail date": "  05/05/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Tl-the contact owns a 2003 Honda Pilot. The contact received notification of NHTSA campaign numbers: 14v349000 ( air bags) and 14v351000 (air bags) however, the parts needed to repair the vehicle were unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was not made aware of the issue. The contact had not experienced a failure. Oo.", "fail date": "  04/30/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Tl-the contact owns a 2003 Honda Pilot. The contact received notification of NHTSA campaign number: 14v351000 (air bags ) however, the part needed to repair the vehicle was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was not notified of the issue. The contact had not experienced a failure. Oo.", "fail date": "  04/24/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Tl-the contact owns a 2003 Honda Pilot. The contact received notification of NHTSA campaign numbers: 14v700000 (air bags) and 14v351000 (air bags) however, the parts needed to do the repairs were unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repairs. The manufacturer was not made aware of the issue. The contact had not experienced a failure. Pam.", "fail date": "  04/16/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2003 Honda Pilot. The contact received notification of NHTSA campaign numbers: 14v351000 (air bags) and 14v349000 (air bags); however, the part needed to do the repairs was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repairs. The manufacturer was not made aware of the issue. The contact had not experienced a failure. The VIN was unavailable.", "fail date": "  04/15/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2003 Honda Pilot. The contact received a notice for NHTSA campaign number: 14v700000 (air bags); however, the parts needed to do the repair were not available. The dealer stated that they only had one part to do the repair. The contact believed that the manufacturer exceeded a reasonable amount of time for the repair. The contact had not experienced a failure.", "fail date": "  04/14/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2003 Honda Pilot. The contact received a recall notification of NHTSA campaign number: 14v351000 (air bag, exterior lighting, electrical system) however, the part to do the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure.", "fail date": "  04/06/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "I received two recall notices relating to airbags in January and contacted my dealer immediately. I am still waiting for Honda to provide airbags for the driver & passenger sides. The dealer has been told they are \"on backorder\" - I have verified this information with other dealers. Honda needs to make these replacements a priority it has been 4 months and they won't provide the replacements in the meantime we are at risk!.", "fail date": "  04/03/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Tl-the contact owns a 2003 Honda Pilot. The contact received notification of NHTSA campaign number: 14v351000 (air bags) however, the part needed to repair the vehicle was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was not notified of the failure. The contact had not experienced a failure. Oo.", "fail date": "  03/27/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Received a national recall letter for airbags. Called bill pearce Honda and was told I have to wait four months for the part becaus it is on \" back order. \".", "fail date": "  03/24/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Tl-the contact owns a 2003 Honda Pilot. The contact received notification of NHTSA campaign number: 14v351000 (air bags) however the part to do the repair was unavailable. The contact stated that the manufacturer exceeded a resonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced the failure. Sr.", "fail date": "  03/19/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2003 Honda Pilot. The contact received notification of NHTSA campaign numbers: 14v351000 (air bags) and 14v349000 (air bags); however, the parts needed to do the repairs were unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repairs. The manufacturer was made aware of the issue. The contact had not experienced a failure.", "fail date": "  03/16/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2003 Honda Pilot. The contact received notification of NHTSA campaign numbers: 14v349000 (air bags) and 14v351000 (air bags) and stated that the part for the repair was not available within a reasonable timeframe. The dealer did not give a specific date for when the part would become available. The manufacturer was contacted and could not provide an estimated date for when the contact's vehicle would receive the recall repair. The contact had not experienced a failure.", "fail date": "  03/05/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2003 Honda Pilot. The contact received a notification for NHTSA campaign id numbers: 14v351000 (air bags) and 14v349000 (air bags). The contact stated that the parts needed were unavailable to repair the vehicle. The dealer was unable to inform when the part would become available. The manufacturer was not notified of the issue. The contact had not experienced a failure.", "fail date": "  03/03/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2003 Honda Pilot. The contact received notifications for NHTSA campaign numbers: 14v351000 (air bags) and 14v349000 (air bags) in March of 2015. After contacting the dealer and the manufacturer on multiple occasions, the contact was informed that the parts needed to repair the vehicle were still not available and no estimated time for receiving the parts could be provided. The contact had not experienced a failure.", "fail date": "  03/02/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "I received a recall letter from american Honda motor CO. Back in January of this year. The letter stated that my car was being recalled for faulty air bags. Contacted the closest dealer ship as instructed in the letter; was told at that time it would take 2 weeks to get the parts in. When I contacted the dealership after the 2 week wait, I was informed that the parts where on back order and I would have to wait my turn. Contacted american Honda over this and was told that parts could be re-routed to solve my problem. Was contacted by american Honda and was told parts where on back order, and that they should only take another few weeks. Its now the end of March, the beginning of April, and I'm still waiting for said parts that where only suppose to take 2 weeks to receive. Every time I contact the dealership or american Honda all I'm getting is the same old dance around about parts, and several times the people have been rude telling me to just wait. Honda case # n032015-02-1300761.", "fail date": "  03/01/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Keep getting misfires had mechanic replace coils & plugs but still getting obd codes for misfires of cylinders why ?? also keeps jerking & I nor a mechanic do not know why.", "fail date": "  01/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Honda Pilot 2003 cranked up started driving, after a min or two it shut off and wouldn't crank back up. I've replaced the main relay and a new fuel pump but when you put the key in and try to start it, it doesn't turn over all the way. It wants to but won't. Also more electrical issues along with radio and head lights. Something is terribly wrong and ive put alot of money into trying to find out what it is and have been guaranteed that part will fix it but no luck. New parts help but not with turning over and starting.", "fail date": "  12/15/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Vehicle had a lack of computer function would not start. All dash lights lite ignition non functional when test plug put on obd plug all problems cleared vehicle now operates correctly vehicle had just passed state inspection and operated correctly for 3days.", "fail date": "  12/01/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Lo beam headlights stopped working. Bulbs fuses and relays are good. High beams work ok. Lights stopped working and I discovered it at night when I went to drive the car home.", "fail date": "  05/12/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Tl the contact owns a 2003 Honda Pilot. The contact stated that the vehicle was unable to start upon turning the key. When the vehicle was driven and then turned off, it was unable to restart. The vehicle was not diagnosed by an independent mechanic or dealer. The manufacturer was notified of the failure. The VIN and failure mileage were not available.", "fail date": "  02/01/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The contact owns a 2003 Honda Pilot. While the vehicle was stationary, the key became stuck in the ignition on August 26, 2017. The contact removed the battery to disengage the engine and the ignition key was able to be removed. The vehicle was towed to titans Honda in tysons corner, virginia, but the dealer was unable to reinsert the key into the ignition to start the vehicle. In addition, the dealer stated that there was no recall for the vehicle. On another occasion, while stationary, the contact depressed the brake pedal and the key fell out of the ignition. The manufacturer was made aware of the issue and provided the contact with case number: 06264304. The contact stated that NHTSA campaign number: 12v573000 (electrical system) applied directly to the failure. The failure mileage was 152,000.", "fail date": "  07/30/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Ignition lock problem. Key is difficult to insert into ignition lock cylinder. Once inserted, the key will not turn.", "fail date": "  04/17/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "My Honda Pilot is having difficulty shifting gears in the city and on the highway. I will be moving in a few weeks and traveling about 40 miles on the highway everyday. A few days ago I called Honda after looking up recalls and there was a transmission recall number 04v176000. I was told to take it to the Honda dealer and if it is a problem with the transmission it will be replaced at no charge. I took it to the dealer and told them what Honda told me and they said it is probably the torque converter. (code p0740) the supervisor was going to call Honda and get back to me. I feel very frightened to travel on the highway when my check engine light is still on and having trouble with the transmission. I just can't believe that a 2003 Honda Pilot with only 130,000 miles would have issues with the transmission and/or torque converter !! if it is causing gears to chip or break I don't want to be driving on the highway and possibly be injured or even killed ! or causing injury to others.", "fail date": "  09/21/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Ignition key can pull out while driving.", "fail date": "  08/02/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The ignition key can be removed while the vehicle is still in gear.", "fail date": "  07/14/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "About a month ago I tried to use my spare key and the key wouldn't work in my ignition. So, I located my regular keys and they key worked as it should. Last week my normal key would go into the ignition but, the ignition would not turn. After several attempts the key did finally turn and I was able to get home. Later that day, I went to leave my house for work and again the key would go into the ignition but, not turn the ignition. After 20 minutes of inserting and removing the key it finally worked again. It continued to work for the remainder of the day. I spoke with my mechanic and he suggested I get the ignition replaced before it got to a point where it wouldn't start an in his opinion the ignition was deteriorating quickly. He also stated that this would be a dealer only repair. I did ask two other mechanics in the area & I reached out to a locksmith, they all said due to the structure of the alarm & the lazer cut key style it was a dealer only part. I started to google the issue & saw other people have experienced the same problem & I made an appointment with the dealership. The dealership mentioned that the previous owner had work done on the ignition with a previous recall but, they felt this issue was unrelated and would be an out of pocket expense. The next morning the key became stuck in the ignition. The ignition would now turn but, I was unable to remove the key, leaving my car a prime target for theft. I dropped the car off this morning & I made a call into corporate to file a complaint. . Read more...\n", "fail date": "  01/14/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "I never got recalls fixed and dealer service marked as checked but not replaced and srs light has been on since service and I had to pay to get recalled due to emergency interlock was damaged.", "fail date": "  11/25/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The contact owns a 2003 Honda Pilot. The contact stated that the ignition key could not be removed while the gear was in park. The failure occurred without warning. The contact received a recall notice for NHTSA campaign number: 12v573000 (electrical system) in 2013 and took the vehicle to a local dealer. The vehicle was repaired, but the ignition failure recurred two years later. The manufacturer was not made aware of the failure. The vehicle was not repaired. The failure mileage was 137,000.", "fail date": "  07/20/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The contact owns a 2003 Honda Pilot. The contact stated that the key failed to insert in the ignition. After excessive force was applied, the contact was able to place the key in the ignition and start the engine. The failure recurred, but the contact was unable to get the key in the ignition at all. The contact used the spare key to start the engine. The vehicle was taken to the dealer. The manufacturer was made aware of the failure. The approximate failure mileage was 87,000.", "fail date": "  07/12/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Tl- the contact owns a a 2003 Honda Pilot. The contact received notification of NHTSA campaign id numbers: 15v320000 (air bags), 14v700000 (air bags), 12v573000 (electrical sysytem) and 12v136000 (exterior lighting) however, the part to do the repairs were unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure. Fe.", "fail date": "  05/28/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The contact owns a 2003 Honda Pilot. The contact received a recall notification of NHTSA campaign number: 14v351000 (air bag, exterior lighting, electrical system) however, the part to do the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure.", "fail date": "  04/06/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "I parked my car in the hospital lot. After my late afternoon appointment, I was about to go home. I was able to insert the key into the ignition but failed to turn to start the engine. There was no contact or clicking sound even I tried with a little force to turn the key. I called the towing company and he was able to start the engine. I drove the car about 5 miles to get my prescription medicine and parked again in the parking lot. I was about to go home again. I was able to insert the key into the ignition but failed to turn to start the engine. Again, there was no contact or clicking sound even to try with a little force to turn the key. I called again the towing company and he was able to start the engine. I decided to bring my car to the dealership to stay overnight (early bird). I parked my car in the drive through lane and shut-off the engine. I remove the key and inserted again but was not able to turn the key and not able to start the engine again. The dealership checked my car problem and I was advised that the ignition assembly was worn-out. The new ignition assembly was installed and re-keyed, cut and programmed new key. I saved the old part for future reference. I paid $618. 58 for parts and labor. I am thinking this repair was so expensive. The estimate failure mileage was 128,292.", "fail date": "  02/23/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Tl-the contact owns a 2003 Honda Pilot. The contact stated that the key failed to eject from the ignition and remained in the off position. The vehicle was not diagnosed or repaired. The failure recurred on numerous occasions. The vehicle was previously repaired under NHTSA campaign number: 12v573000 (electrical system). The manufacturer was notified of the failure. The failure mileage was unknown but the current mileage was 141,586. Oo.", "fail date": "  12/27/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Parked the car. Came back about 10 minutes later, heard loud like shots fired, rounded the corner to see it was our airbags popping. . . The car was on fire under the hood, and going to the dashboard. Called 911 and by the time the fire dept. Came ( 1 mile away) the whole car was engulfed. The whole car destroyed, all that was left was the shell no seats no dashboard no license plates nothing left. We complied to all recalls and took it to a Honda dealership each time for repairs. We had a steering column fire about 2-3 years ago driving along and the car filled with smoke, it was a electrical fire, but pulling over turning off the engine put out the fire. Had it repaired immediately. A week before the big fire we felt the column and it was hot. . . But cooled after we parked it. Then days later is when it burned to the ground, even the tires were gone. Honda doesn't care about our loss, and of course it's not their fault. P. S. In 2007 we got hurt in that same car we were stopped on the side of the road ( we were in the car) and a truck crossed the line and hit us head on. Our seat belts didn't hold us in, they loosened and airbags did not deploy. We were hurt and Honda said the truck hit us too high is why the airbags didn't deploy. That sounds ridiculous. The seat belt shoulder straps didn't hold us cause we weren't moving also sounds ridiculous. Honda didn't care then either.", "fail date": "  09/23/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "We started to have trouble inserting the key in the ignition. Today the key wouldn't even go in after many attempts wiggling it. After twenty minutes trying had to leave car behind. Now I'm without a car and searching for recalls noticed that although there is none for this problem it is a huge problem with other Pilot owners.", "fail date": "  06/01/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Left work at night. Low-beams partially failed, but I didn't notice until I was going 55 mph on the highway. Had to use brights, and go to a gas station. Vehicle had to be towed, and checked by dealer. Dealer said using 3rd party headlight bulbs was the cause. Of interest, the car already had the low-beam failure recall fixed. Looks like this is still an issue after the recall, and using Honda oem bulbs is the only safe way to go. 3rd party bulbs were purchased from advance auto parts, and I'm unsure of the brand.", "fail date": "  04/02/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "2003 Honda Pilot. Consumer requests reimbursement for ignition system recall repairs. The consumer stated the dealer completed the repairs outlined in the recall, but charged him for the replacement and installation.", "fail date": "  03/27/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Tl- the contact owns a 2003 Honda Pilot. The contact stated that vehicle stalled without warning. The vehicle was not able to be could not be restarted. The vehicle was towed to a independent mechanic. The mechanic was unable to diagnose the cause of the failure. The manufacturer was not notified. The vehicle was not repaired. The failure mileage was 140,000 . Az.", "fail date": "  02/28/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The contact owns a 2003 Honda Pilot. The contact stated that he was unable to start the vehicle. The vehicle was taken to the dealer but was not diagnosed. The manufacturer was made aware of the failure. The vehicle was not repaired. The failure and current mileage was 105,000.", "fail date": "  12/11/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "There is a recall:. . Read more...\n", "fail date": "  09/02/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The key gets stuck in ignition and does not turn. After numerous attempts it finally turns and then I can start the car. I have noticed a lot other people are having this issue, called up Honda and they said there is no recall for this sympton.", "fail date": "  06/29/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "This problem is extremely common on all Hondas and has never been addressed. The power door lock motors consistently go bad. So far, this has happened to the driver and passenger doors on my Pilot. The Honda dealer is asking for $300 per door!!! this needs to be recalled ASAP.", "fail date": "  04/19/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Tl- the contact owns a 2003 Honda Pilot. The contact stated that the vehicle was previously repaired under NHTSA campaign number: 12v573000 (electrical system) but the contact was able to remove the key from the ignition while the vehicle was not in park. The manufacturer was not contacted about the failure. The failure mileage was 161,000. The contact did not provide an email address. Mh.", "fail date": "  04/18/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Unable to turn key in ignition. Apparently this is an issue that many 2003 Honda Pilot owners are having. This can be a safety issue as it can leave someone stranded in a remote area as happened with me. If the malfunction is caused by a faulty part then Honda should bare some of the responsibility and cost to correct the problem.", "fail date": "  01/15/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The contact owns a 2003 Honda Pilot. The contact stated that after inserting the key in the ignition, the key would not turn, preventing her from starting the vehicle. The vehicle was taken to the dealer who diagnosed that the ignition needed to be replaced. The manufacturer was made aware of the failure who did not offer any assistance. The vehicle was not repaired. The failure and current mileage was 150,000.", "fail date": "  10/20/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Tl-the contact owns a 2003 Honda Pilot. The contact received notification of NHTSA campaign number: 15v320000 (air bags), 14v700000 (air bags), 12v573000 (electrical system) and 12v136000 (exterior lighting) however, the parts to do the repairs was unavailable. The contact stated that the manufacturer exceeded reasonable amount of time for the recall repairs. The manufacturer was not made aware of the issue. The contact stated that when the key was inserted into the ignition, the key failed to turn to the on position. The contact stated that after several attempts the vehicle started. Sg.", "fail date": "  03/29/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Key won't turn in ignition due to misaligned wafers. This is the second time in just over a year we have had to fix this problem. At first had to jiggle key to be able to turn it, then can't even get the key in all the way. Taken to locksmith. First occurred 10/2011, then 1/11/2013.", "fail date": "  11/01/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Vehicle shudder/shake starting at 50 mph. Advised needed new transmission. Called Honda to check if recall or would be reimbursed. Told no and said wanted problem on record. Replaced transmission at own expense $3045. Drive light periodically flashes. Have not repaired as >$300.", "fail date": "  09/01/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Certified letter (7011 0470 003 0649 3438) from attorney representing his client regarding paid repaired work he had done to his 2003 Honda Pilot and later received recall notices about the problem; he is seeking reimbursement. On December 21, 2012, the key became stuck in the ignition, and could not be removed without the assistance from the dealer. The dealer informed the consumer it would cost $624. 41 to fix the problem, despite the fact it was a known defect, which apparently resulted from an improper setting of the cable connecting the shift lever to the transmission at the shift lever bracket, which was a common problem with Honda vehicles. After the consumer paid for the repairs, he received a recall notice from Honda concerning the ignition interlock switch on his vehicle.", "fail date": "  12/21/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The contact owns a 2003 Honda Pilot. The contact stated that the key was removed from the ignition when the vehicle was still in the drive position. The vehicle was taken to the dealer. The dealer stated that the locking mechanism for the ignition needed to be replaced. The mechanic was contacted. The vehicle was not repaired. The failure mileage was 75,000 and the current mileage was 140,000.", "fail date": "  07/25/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The contact owned a 2003 Honda Pilot. The contact stated she was informed by her daughter that the inside passenger side of the vehicle was on fire. The contact extinguished the fire with water. The fire department arrived afterward and informed the electronic software was the cause of the fire. The contact was unsure if a fire report was filed. The vehicle was destroyed. There were no injuries or medical treatments needed. The contact notified a local mechanic regarding the failure and was informed of the same information which the fire department provided. The manufacturer was notified of the failure. The approximate failure mileage was 89,000.", "fail date": "  08/24/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I notice you guys had other 2003 Honda Pilot transmissions recalls. I checked mine with the VIN # and my car happens to not be included on that recall. To be honest everything stated on that recall is what exactly is happening on my car can you please help thanks my car would get high rpms or jerk while driving or just rev and not move it changes all the time seems that also the colder the car is or not ran till the next day seems to drive normal but after car worms up it’s starts to drive then rpm’s jump high I got to let go of the gas in order for it to get its 2 nd shift and randomly it’ll like hard jerk while driving like a hard stop then countinues at speed.", "fail date": "  11/05/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Transmission slips engine light does not come on was told transmission is separate so itdoes not show up because the light does not come it does not show up on the computer does not happen all the time so it can and does when driving it goes into neutrol.", "fail date": "  02/09/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Tl the contact owns a 2003 Honda Pilot. Upon starting the vehicle and shifting into drive, it failed to move. In addition, while the vehicle was at a stop light or while making turns, the vehicle continued idling. The check engine indicator was illuminated. The vehicle was taken to jeff wyler Honda of colerain (8950 colerain Ave, cincinnati, OH 45251, 513-741-3700) where it was diagnosed that the vehicle misfired and the transmission and gasket needed to be cleaned and replaced. The vehicle was not repaired. The manufacturer was not contacted. The failure mileage was 284,469.", "fail date": "  02/01/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Tl-the contact owns a 2003 Honda Pilot. The contact stated that while driving various speeds, the engine emitted a loud unidentifiable sound that startled the driver. Honda capital expressway located at 745 capitol expressway auto mall, san jose, California 95136 was made aware of the failure and was provided with video/recordings of the failure, but could not determine the source. The vehicle was not repaired. The manufacturer was not made aware of the failure. The failure mileage was approximately 149,000. Ad.", "fail date": "  05/01/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The cars transmission is not working adequately the gears won't go while in 2nd and third or reverse.", "fail date": "  02/24/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Failed front and side engine mounts on Honda Pilot 2003. This seems to be very common among other Honda Pilot owners.", "fail date": "  10/30/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I am the original owner of a 2003 Honda Pilot. I am an older, cautious driver and have babied this vehicle, doing all regular service at the dealer's, so it would run in top shape for many years to come. Around six months ago I noticed at lower speeds (20-30 m. P. H. ) the vehicle shudders. To counter the problem I have to accelerate and then it goes away. I have had the dealer check it three times and each time they say they cannot replicate the problem, which is hard to believe. Last week the d light started to flash. I took it into the dealer right away and they said it was a sensor. I asked if that could be making the car shudder and they said probably. I had them change it and the shudder has not gone away. This morning it was particularly heavy so I called the dealer again and they gave me the american Honda number. I called them and they said the dealer should look at it. I've seen so many other people have the same complaint and I'm very concerned this is a safety issue that Honda is choosing to ignore; a little like other auto companies have done over the past few years until a fatality happens. As I carry my family in this vehicle and I am particularly concerned.", "fail date": "  08/07/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The contact owns a 2003 Honda Pilot. The contact stated that the vehicle failed to start. The contact was able to start the vehicle 10 minutes later. The vehicle was taken to the dealer for inspection where they stated that the ignition cylinder lock needed to be replaced. The vehicle was not repaired. The manufacturer was not notified of the failure. The failure mileage was 209,000.", "fail date": "  06/20/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Front motor mounts broke and needed to be replaced. Appears to be a known common problem with Honda Pilots. Never happened on any of my other vehicles.", "fail date": "  06/01/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I also had both my front and side engine mounts go bad and I had to fix the problem I paid $934. 00. I have 3 children that sit in this vehicle at all times so if I know that there is an issue especially with the mounts that hold my engine I have to fix it went to my local Honda dealer dealt with the recalls that came up and had them service the transmission fluid since it was there. I am sure that I got robbed but, what can I do have to keep my kids safe. Husband said, that the mounts should last alot longer he knows a lot about cars have other cars over 180k and mounts are still original what is going on Honda getting junky on us. I hope they can fix what is going on too many tranny problems and engine issues. Shame on you not happy at all been a civic, accord owner also. . . .", "fail date": "  05/20/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Engine revs at 25-30 mph, and rpm's shoot up. It appears it won't change gears.", "fail date": "  05/13/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I have read on this website and on others that there has been a problem with the engine mounts breaking. I brought my car in for service and, sure enough, my engine mount has broken. The car has never been in an accident and is driven on smooth roads daily. This is a danger to the safety of the driver and passengers in the car. This is a common problem and needs to be recalled.", "fail date": "  04/05/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Owner driver was stopped on red light along with 20 other cars , the driver was last in the lane and other driver di not applied brakes, this vehicle was banged from the back. Body damage was repaired by westminster Honda in costa mesa . California, body repair cost of $ 3,500 was paid by insurance company of the person who was at fault, the auto transmission replacement cost of $ 6,500 was recovered from the me who was not at fault. The question is at that time the air bag was not deployed because of fault? after that I got recall notice from american Honda for two air bags driver side and passenger side, the notice came in the month of January 2015, first they delayed the repair task by making an excuse that they are very busy and first appointment is available on February 28 th at auto nation Honda in gilbert az then I got an e mail and a call from dealer that the parts are on back order, and they would not know when part will be available. After that I called american Honda, they have intervened and assured me that auto nation Honda will call me to schedule appointment again. Then I gave 4 - 5 calls to auto nation Honda, till today as of April 19th this repair is not fixed even though all parties know that this is critical to the life of drivers and passengers in this vehicle. Now I am in round rock texas, so I will need to see new dealer will somebody control these auto companies and dealer for compliance? thanks.", "fail date": "  12/18/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I recently bought a used 2003 Honda Pilot from [xxx] of colerain in ohio. The car has 137,000 approximate miles on it. They wanted me to pay over 15,000 for the car and finally after debating for hours over 4. They sold me the car out the door with no warranty offered for 10,500. I was very happy and I have 2 children and one on the way. I bought the car on August 5, 2012 less than two week go by and I am driving home going 65mph on 71 and the car jerks down gears to 30 miles an hour in a split second. My neck and my back are both hurting and I do not want to sue nor try to get rich off of this. My complaint is, I took the car to[xxx] of colerain the next morning they said the transmission was bad and they could do nothing for me. So basically they said I will have to pay for a $7,000 dollar repair. I left the car there and came home did all kinds of research found that car is up for recall on the transmission and thousands of people have the same issue. They even have a facebook page dedicated to fixing this problem! how can Honda keep these vehicle's on the road? if my 17 month old would have been in the car with me she would have maybe broke her neck. Go drive 65mph and throw the car in reverse that is what happened to me! and they said I bought a certified used Honda? so what do I do ? who do I call? and why can they sell me a car in such a state? with over 4 recalls on parts and one being potentially fatal. Information redacted pursuant to the freedom of information act (foia), 5 u. S. C. 552(b)(6).", "fail date": "  08/17/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Took Pilot in for headlight recall wiring replacement. Mine had connector completely melted. Replaced. Was told on pickup that all three engine mounts were broke! that explains the clunk with acceleration . I drive this Pilot like an old lady going to church. How all three are broke at the same time the odds are too high for that! bad design?? poor materials???called Honda mum is the word,no recall on engine mounts,go figure for sure.", "fail date": "  05/15/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Front and right engine mounts need to be replaced per Honda dealership.", "fail date": "  02/18/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Having difficulties puting car into gear from park to drive especially if vehicle is on a hill. Various friends who have the same car have the same issue. One friend had to replace transmission when it failed on the highway.", "fail date": "  10/03/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Front engine mount broke under normal driving conditions; vehicle was never driven off road, only on paved roads.", "fail date": "  09/21/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The key had trouble turning in the ignition. It got worse over time. Eventually the key wont turn at all. Looked up online and saw many complaints of the same problem with the same model and make of our vehicle. Had it fixed in 2011 and it cost over $500. Now in may of 2013 it's happening again. Sometimes it takes over 10 minutes to get the car started with trying to turn the key over and over again which I'm sure it's just making it worse and worse.", "fail date": "  08/12/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Car ran away in reverse as if it had a mind of its own. Full weight on the brakes but the car kept accelerating. Crashed into utility pole encircled with old car tires. Car bounced off and then crashed into the pole over and over again. Hit gear shift into forward. Engine screaming really high revs, car raced forward and I did everything I could to avoid hitting parked vehicles and a pond as car kept going faster. With nowhere to head but golf course or highway, I steered onto a farm field and drove a half mile until I was able to pull out the keys from the starter which stopped car. I did not think I was injured at time but I ended up with whiplash which meant I lost about six months income. Honda refused compensation, or paid for any of the repairs of the car with exception of the key interface for starter . Honda claimed thnothing wrong with car. Said had my foot on accelerator. However, Honda dealership charged me more than $3,000 to fix a completely destroyed braking system how could I have had my foot on the accelerator and destroyed the brakes? Honda refused to buy my car and decommission it because they said car was perfect. Downright rude afterward. I did not let anyone else drive the car and used it as infrequently as I could. Seven months later, I was in an underground parking garage and same thing happened. The car accelerated into thesolid concrete wall just four feet ahead. The impact destroyed car. Front end crumpled in, the engine damaged and all airbags deployed. This from a four foot collision.", "fail date": "  05/11/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The Pilot shudders going at slower rates of speed at pretty regular instances. My mechanic informed me that the torque converter, possibly the whole transmission needs to be replaced. I was also informed that this is a very common problem with 2003 Honda Pilots.", "fail date": "  09/01/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "2003 Honda Pilot ex failed motor mounts. Seems to be a common complaint.", "fail date": "  06/30/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "My 2003 Honda Pilot has been shuddering at 35-45 mph. I also have had the \"d\" light flashing. I see that this is an issue with way too many Pilots. Honda needs to take ownership of this problem and fix it! I love Honda - we also have a 2004 civic. However, I am beginning to wonder if our next car will be a Honda. I have two small children that I drive daily in the Pilot, and I am terrified after reading all of these complaints to drive them in this car. This is ridiculous.", "fail date": "  05/03/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Front and side engine mounts were broken and needed replacing.", "fail date": "  04/29/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Driving Honda Pilot 2003 with 84,000 mil onto expressway on ramp--it started bucking---like it would lurch forward and then stop---finally went forward. Drove it for 1 more week and this happened a few more times. Took to a very good mechanic. They tested the car and nothing came up as wrong. Then yellow lights started flashing--and the car would lose power when going slowly through a subdivision--and then all of a sudden regain power. Sometimes I had to pull over and put the car in park and then in drive to get it to go. Took the car to the Honda dealership. They said it was a clogged gas line. They didn't want to hear about transmission problems. Cost was $400 for \"clogged gas line\" and another 400 for something else leaking. No lights on when leaving the dealership. One day later the yellow light was back on and it sometimes loses power when going slowly. There have been no deaths or accidents yet---but if anyone had been following me onto the on ramp, they would have hit me. The car looked like a bucking bronco. I want your Honda dealership in waukesha WI ----wilde Honda to put in a new transmission---this is not normal--at your cost. I drive people around for a living---I am a realtor and it was very embarrassing when we swung into the subdivision and I had to pull over because I had no power. Imagine that on a highway with a semi behind me. This is a lawsuit waiting to happen.", "fail date": "  11/15/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "My 2003 Honda Pilot has cracked engine mounts. It causes the steering wheel to vibrate. The front and back mounts were replaced at 97,000 miles.", "fail date": "  10/29/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "2003 Honda Pilot motor mounts broken. Car only has 77k on it. Owned 5 other Hondas never had this issue. No rough driving. Cost is over 500. 00 to replace safety issue, could be a serious issue if the mounts fail. Also the key in the ignition is always getting stuck and sometimes takes 20 minutes to get it to turn the car on.", "fail date": "  07/23/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Front engine mount was broken and had to be replaced. Now, at 84105 miles, the side engine mount is broken. I have owned several cars since 1975, and have never had a problem with any engine mount until this 2003 Honda Pilot.", "fail date": "  06/29/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The motor mounts on our 2003 Honda Pilot broke, and we were alerted by our Honda dealers service department. The car has about 79,000 miles on it. The motor mounts help hold the engine in place. A google search revealed online chat boards with dozens and dozens of Pilot owners complaining that the motor mounts broke on their cars, at as little as 60,000 miles. This problem appears widespread and potentially very dangerous. We had our broken motor mounts replaced.", "fail date": "  05/22/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The front engine mount is cracked and one of the side mounts is torn and about to crack. My Honda Pilot was purchased new in February 2003 and has 84,000 miles on it. Honda claims that the engine mounts only last five years. This seems to be a defective part, especially due to the volume of similar complaints found on the web.", "fail date": "  04/21/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The contact owns a 2003 Honda Pilot. While driving approximately 5 mph on normal road conditions and proceeding from a stop sign, the engine began to rev. There was suddenly a 3-5 second delay before the vehicle was shifted into gear. The check engine warning indicator illuminated on the instrument panel and it remained lit until the engine was turned off. The vehicle was taken to an independent mechanic, but they were unable to duplicate the failure. The vehicle was previously repaired according to NHTSA campaign id number 04v176000 (power train;automatic transmission). On a separate occasion, the vehicle was taken to an independent mechanic for identical failures. The technician recommended that the transmission be replaced. The vehicle is operable and has not been repaired. The failure mileage was 100,000 and current mileage was 105,000.", "fail date": "  11/03/2008"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Driving on the interstate approx 70 mph for 150 miles. There was a smell similar to an electrical problem, noticed acrid smell and smoke out the rear view mirror. Pulled off the interstate. Lots of smoke for 5 min then stopped completely in 30 min. All levels ok, no leaks, no failures, all wiring cool, no shorts, all instrument ok. Waited approx 45min then drove 150 miles home with no problems. The next morning the car checked out ok. The fire burned approx 18 inches of insulation and scorched the passengers firewall in several places. Why did this happen?.", "fail date": "  11/23/2007"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Honda did not contact me for a year and a half I have been waiting for them to replace my air bag, no response!!! I’ve left numerous messages and still no response I gave a 1 year old daughter, we almost got hit by a car and if it had hit us something could’ve happened! because I had to swerve off road my suspension and power steering are messed up because of pot holes,just so I wouldn’t hit and impact the passenger side of me my car where airbag is bad and nothing would’ve happened to us, not that it was our fault the driver was driving almost right into us!I blame Honda for this disaster would could have been very bad! of course the other driver drove away like nothing happened! so now I am stuck at home not able to go to work and bring my daughter to doctors appointments and invade of in emergency my vehicle is not safe enough to get us anywhere! I am asking god to bless us in this case and count all the blessings he has given us! I don’t have a lot of money to pay for repairs and this is the only car I’ve ever purchased and owned. If there is any way anyone could help please! maybe a new Honda would be nice for christmas, but hey a girl can dream right! thank you for your time!.", "fail date": "  09/18/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Keep getting misfires had mechanic replace coils & plugs but still getting obd codes for misfires of cylinders why ?? also keeps jerking & I nor a mechanic do not know why.", "fail date": "  01/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Both rear axel mounts rusted away from the subframe while being driven by my teenage driver. This caused the tires to lean inward and caused mounts to rest on the muffler system. The vehicle is available for inspection, but has not been inspected since it is not mobile or safe to drive. The safety of my child and others were at risk, as this failure could have caused an accident. There were not warning lamps or messages, but rust was noticeable underneath the vehicle.", "fail date": "  10/01/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "When I accelerate to 40 mph there is a grinding sound coming from my truck. It will continue until about 45 mph and then stops. This issue is random and intermittent and the mechanics have not been able to replicate the problem to identify it. It started shortly after I purchased the used vehicle in 2011 but it was infrequent now it is happening a lot more frequently.", "fail date": "  09/14/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I found this car ad on facebook after test driving I decided to purchase it for3,000 they original asking price was $3,400 for the Honda Pilot with 131,000 miles. I offer them $2,900 and met at 3,000. When I came back to make the purchase the pink slip was already filled out. I didn't think of it. After going to the dmv to start to the registration of vehicle I had to go get a smog inspection. Thats when the car did not pass and they inform me that car battery was either disconnected or the car was not running for awhile. So I decided to drive the car enough so the computer can generate some data. Today I decided to get a carfax report and the odometer last reported was way above what was presented to me. They advertise the car at 131k and the odometer also read 131k. Since I found this ad on facebook, I noticed they had deleted the ad and block me. I realized they block me by searching the profile of whom sold me the vehicle. Then I used someone else profile and was able to see their profile. The car was located in 13657 van nuys blvd pacoima CA in a city street.", "fail date": "  12/29/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "We have owned this truck since February 2019. This situation has occurred on the city streets as well as on the highway. The speed would vary between 35mph and 65mph. While we were driving with 4 small children in our truck, the truck wouldn't switch gears. Our foot would be on the gas, but the truck wouldn't accelerate. Sometimes the truck will be in park and we'll go to shift into (d) and it won't shift. It has happened many times. (I have selected the most recent date of occurrence below, but this has happened many times on different days. I do not have photos, as this is a motion thing. I do not have documentation at the moment, but will be taking it to a mechanic this week. ) I have estimated the milles on the truck, but I believe it is less than 180k.", "fail date": "  11/06/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "While driving on the interstate the d indicator starts blinking. The next exit is still 10 miles away. . I stop the car at a gas station for about 5 minutes. I then get back on the interstate to get home without getting in an accident or fatally injuring myself or others ! this has happened a few times whenever I go over 55-60 mph. So it seems to be when the transmission is changing from 3rd to 4th gear. ?? why haven't I received a recall for this transmission/powertrain problem ?? possibly campaign # 04v176000 and recall # p30. I only have 147,000 miles on my Pilot !! how many people have to get injured or even killed for this matter to be taken care of by someone or Honda ???.", "fail date": "  07/17/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Vehicle will stall while driving and then fail to start unless left off from 15 to 30 minutes vehicle will periodically fail to start. This happened driving on the expressway and was able to drift over to shoulder while avoiding being run into. The last instance a police officer kindly helped push the vehicle off a busy city street as so I could wait for a tow to the dealership again. They continue to say they cannot replicate the problem and have replaced multiple and expensive parts but to no avail.", "fail date": "  10/19/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "My 2003 Honda Pilot's ignition switch started to fail to turn,over the past two weeks, preventing the car to start. I have to take the key out and reinsert it into the ignition, and thus far this solution is working. However over the last several days, it is happening more and more, to the point that I am afraid this malfunction of trying to get it to rotate out of position and into the \"start\" position will eventually fail to engage at all, leaving me stranded who knows where.", "fail date": "  11/02/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Ignition key metal is harder than the ignition lock destroying the locking pins. Have had ignition lock repaired twice already and will require a third repair which will likely require new lock.", "fail date": "  07/03/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "In a trip to the park (20 minutes highway trip) the d indicator start blinking, park the car and turn off, turn it back on, and the light keep blinking all the way back home. It never happened before.", "fail date": "  06/16/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Bought the car second-hand. Srs light was off during test drive in a neighbood and time of purchase. Srs light turned on in the middle of the drive home on the service road next to the highway. Unknown if it is just a sensor issue or there is a possible problem with the airbag safety response system.", "fail date": "  06/06/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Ignition third time it has broken.", "fail date": "  04/06/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I was on the hwy in the left lane an exhilarated then all of the sudden my SUV just braked suddenly without me pressing the brake causing a screech on the concrete. I moved to the right lane very cautiously. I drove about 15 miles then it happened again. I turned my emergency flasher on and drove another 5 miles when it happened again. I pulled onto the side of the road and called my husband to come drive behind me the rest of the way home. This is very scary. I just knew I was going to get rear ended. I love my Honda Pilot but now I can't drive it. I have no idea why or what is causing this problem! please help. Thanks, June williams.", "fail date": "  09/29/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The ignition switch in our 2003 Pilot has a tendency of getting stuck. At times the key will not turn when fully inserted. This has been occurring with some regularity since we got the car in 2012. Just yesterday the key partially turned to where the lights on the dashboard went on, but the engine did not turn and the key got stuck there for several minutes. From other customers sharing, it appears that this is a somewhat common problem with this models which Honda is not taking responsibility for.", "fail date": "  02/04/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "At first there was minor difficulty getting the key into the ignition where it would take two to three times to get it in. Within a week, it extremely difficult to get the key into the ignition so the car would start, taking anywhere from 5-10 each time to get the car started. I tried the spare key and it will not work at all.", "fail date": "  01/04/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Nhtsa recall number: 12v-573 mfr campaign s73 campaign description: shift interlock recall date: 12/10/2012 recall status: 17 character VIN required summary: Honda is recalling certain model year 2003 and 2004 Pilot and odyssey and 2003 through 2006 Acura mdx passenger vehicles manufactured from November 26, 2001, through August 30, 2006. The interlock lever of the ignition switch may deform, which can allow the interlock function of of a vehicle with an automatic transmission to be defeated. Safety risk: removal of the ignition key when the gear selector of a vehicle with an automatic transmission has not been shifted to the park position can allow the vehicle to roll away, increasing the risk of a crash. Remedy: Honda will notify owners and instruct them to take their vehicle to a Honda or Acura dealer. The dealer will install an updated shift interlock lever and, if necessary, replace any necessary part of the ignition switch, free of charge. The recall began on February 22, 2013. Owners may contact Honda at 1-800-999-1009. Note: complete remedy was not done. With recall brought to dealership. Key comes out ignition due to the ignition switch not being replace due to deformation per recall notice. Notified Honda corporate and local Honda dealer of incomplete work and a solution to fix the issue was denied by both. The dealership that did faulty work and denied remedy was. Honda of slidell 510 e howze beach rd, slidell, la 70461 phone:(985) 649-9091.", "fail date": "  06/24/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I was involved in an auto accident. When I came to the inside of the car was smoking. The air bags were deployed and I had a three inch burned hole in my left arm. Now I have a permanent scar because of the airbag. I have pictures, police report and hospital reports.", "fail date": "  05/05/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Driving vehicle on freeway, went to accelerate vehicle did nothing. Took my foot off gas, tried again, nothing. Got in slow lane, finally engaged but had to go slow on freeway. Engine light comes on. Next day vehicle wont shift from 3rd gear, can only go 35 mph and engine revs up. The drive light starts flashing. Next day cant shift into reverse either. Take to transmission shop, they say no reverse, no 3rd gear, fluid is full but smells burnt. Pulled codes p0730 incorrect gear ratio and p0780 shift malfunction. Recommended transmission replace. I only have 139,000 miles and don't drive it crazy. Also found there was a transmission recall on this year Pilot. I call Honda so they can look it up, he says yes it was done to my car, but doesn't show on my carfax report?.", "fail date": "  03/09/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I was driving my daughter to school and parrked my car and took her inside like I always do. When I came outside and unlocked my car (with the key) my key would not go in the iginition - leaving me stuck and late for work and having to use my aaa towing because I couldnt even drive it to the shop - this should be a recall***I have seen mannnyyyyyy compliants on this issue even my tow truck guy stated this model and year and (known) for this problem, and now will cost me 450. 00 to fix. A ignition switch is not normal ware and tare - its not like tires or timing belt or any of those things and should be replaced - this is complete disregard for consumers - this will definitly be a problem if someone gets hurt due to the fact that they cant even get the key in there ignition - lawsuits will happen if a recall is not made.", "fail date": "  03/09/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I took my 2003 Honda Pilot in to repair the ignition recall. Ever since the repair I've been having a hard time getting my key into the ignition. I never had an issue with it prior to the service. I have to literally wiggle and insert and take out the key many times for it to sit right in the ignition. I have found numerous complaints for the same issue from other Pilot owners. Something needs to be done to resolve this issue. Honda dealer wants to charge me a diagnostic fee just to see if my problem is related to the work they did for the recall. I don't think I should be charged just to check if they caused a problem with my car.", "fail date": "  01/21/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "While accelerating on the gas to pick up speed the transmission slipped and hesitated to shift to a higher gear, once it did engage it then slipped and down shifted causing speed to decelerate while driving between 40-55 mph. Later the d light came on the dash and the transmission continued to slip at various speeds and at times down shift. Had transmission serviced and the technician reset the d dash light after driving it 3 days problem has now started to occur again and light has again come on on dash.", "fail date": "  12/29/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Filed a complaint with Honda in 2011, to no avail, regarding our sticky/tacky airbag covers, probably caused by climate heat. In doing the current airbag recall work, the covers became permanently fingerprinted at the dealership. Again filed a complaint with Honda, explaining that not only are the covers even more unsightly because of the fingerprinting on the dashboard, it becomes a safety issue because you refrain from using the horn when needed because of the sticky nature of the cover, which leaves a residue on your hand. Honda offered to pay 25% of $ 2100. 00 cost to fix their problem, a problem that we did not create. Not the response we were looking for. . .", "fail date": "  12/11/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Car key goes in ignition and will not turn. This is a danger when you can not start the car and get out of a dangerous situation. I read on line many other Pilots with the same problem. Honda has a bad part. Honda wants $500 to fix a bad part that needs to be recalled.", "fail date": "  07/09/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Issue with Honda Pilot's ignition switch not fully ingaging the park position. Reiceved recall paper work ordering this issue to be fixed at local Honda dealer free of charge. Recall paper work was signed by jennifer timian chief recall management division. Local Honda dealer, williston Honda and Chrysler preformed the recall service on April 4, 2014. The recall job for a Honda Pilot was botched. The service machanic refused to fix. Requested management to investigate this issue. As of today April 18, 2014 an answer to fix or not to fix this issue from the management of williston Honda and Chrysler has not been given.", "fail date": "  03/25/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I took my vehicle to repair a recall and steve service manger said he will service all the recalls to the vehicle. The recall was something in reference to the ignition. To days later the vehicle will not shout off, the vehicle always make the sound as if the key was in the ignition. I took it back and steve service manger said the do not touch anything around the ignition. . . . Now the vehicle shout off while driving have video. Took it back and steve said I need to pay additional. . . . If all vehilce recalls where recall by the dealer.", "fail date": "  03/17/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The ignition switch for the vehicle suddenly wouldn't accept the key. . Read more...\n", "fail date": "  02/05/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Honda Pilot '03 started leaking water into the front cabin after the rains. The floor gets wet and the water needs to be vaccumed out after the rain. Not sure what else is being affected because of this water leak. . I already see rust showing up and mold smell coming out because of the water leak. I called in northamerican Honda and lodged a complaint.", "fail date": "  10/03/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Driving in a residential neighborhood, our 2003 Honda Pilot stalled and would not re-start. We had it towed to our mechanic who has been servicing our vehicle. He states that the timing belt pulley had ripped out the water pump and caused a bolt to come in contact with the cylinder head.", "fail date": "  07/22/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Broken ignition tumbler: I had just finished running errands and was starting home when the key would not turn in the ignition. I had no warning there was a problem, all of a sudden it just would not turn. . . . . . Not even after multiple attempts. This left me stranded with my five children. I had to get the car towed to nearest Honda dealership. . That alone has set me back a couple hundred dollars. . . Now dealership is telling me I have a broken ignition tumbler and is quoting me $500 to fix the problem. I have seen a lot of other complaints online concerning this same issue. To say the least, I am not too happy to be stuck holding the bag for this, not to mention being stranded with my children, which I think is every mothers worst nightmare.", "fail date": "  06/21/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Key will no longer turn in the ignition switch,it is also difficult to insert and remove the key ,take 6 min max sometimes, change keys and the same problem. I was told by service department that this is not a recall. Service department told me it going to cost me $500 or more material $200 and rest in labour I is there a recall in this area?this start to happen after I take my vehicles for a recall ,something to do with the vehicles move went the keys inside.", "fail date": "  05/20/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Key will no longer turn in the ignition. It is also difficult to insert and remove the key. Assumed this was what the ignition recall was for, but was told by the service department that this is not covered and that they cannot fix the recall item unless I first get the ignition fixed.", "fail date": "  05/15/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Key gets stuck in ignition, very frustrating when the key does not work. This effects the lock cylinders(tumblers). This should have been a very, straight forward issue Honda would address. Also have a 2011 Pilot (in addition to Honda minivan) and concerned this will occur with new car. Understand wear and tear, but this is a basic function for ignition. Honda needs to address this issue.", "fail date": "  05/01/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I have been having a problem with the key and ignition. The key will go into the ignition but won't turn. Which you can't turn the car on. I had to have it towed to the dealership in 2013, which they fixed the 2013 ignition recall part. Unfortunately the recall for the ignition didn't cover the timber or the key. The dealership wanted of $1000 to fix it. I had the car towed back to my home and the tow company put me in contact with a locksmith that was able to fix it for a lot cheaper. Now the problem has a arised again. I had to call a tow truck yet again because the key wouldn't turn in the ignition.", "fail date": "  04/29/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "This is a 2003 Honda Pilot that I had never had any problems until I had to travel almost 2 hours--one way--for my job. On the way home of my 4 hour trip my Pilot like got hot and then just stopped pulling. Honda of richmond kentucky put one transmission in already, buy the 2nd or 3rd oil change after the transmission was replaced, we had to have it replaced again. Not its about 1 thousand miles from another oil change and the transmission is slipping again. Help what do I do??.", "fail date": "  04/22/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Rear suspension mounting locations have rusted through allowing the rear suspension to hang down. The front mounting points of the rear suspension are not damaged yet. Was noticed as a noise while driving and found during tire inspection.", "fail date": "  02/12/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "I heard crunching noises coming from the driver's seat cushion. I assumed it was a spring giving way, since the car is 16 years old. I arranged to have the front seats reupholstered and repaired the following week. A couple days later, I got into the car after running an errand, and the driver's seat acted like a rocking chair! this was in the parking lot of sam's club. I slowly and cautiously drove home, since it felt like the driver's seat could let go. Online research indicated a bracket broke that holds the drivers seat down, and this is a well known issue for the Honda Pilot. They said no recall because nobody had died?? this doesn't seem right. The re-upholsterer had the bracket welded as a side-job when he did his work. Still, this isn't ok. If the seat had let go and slid forward while I was driving, it could have been a serious accident. I needed to report this.", "fail date": "  07/11/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "The attachment points on the frame where the rear subframe attaches have nearly completely rusted out. The rest of the frame appears to be in good condition. An internet search showed that this is a common issue with Honda Pilots. Given the prevalence of the issue, it appears to be a design flaw. This is a significant safety issue since complete failure of the mounting points could result in loss of control of the vehicle. The attached picture is not from my vehicle but the damage is identical to that shown in this picture.", "fail date": "  06/01/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Rear subframe mounts completely rusted out. Subframe sitting on exhaust. Just had Pilot at dealership for oil change and inspection and they did not even mention the issue to me, guess they didn't inspect it very well. Found on my own after driving home and hearing noises coming from the rear end. Thankfully the exhaust did not break from the weight of the subframe or the whole rear end would have fallen down.", "fail date": "  08/20/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "The rear driver side electric door lock mechanism is jammed not allowing the door to be locked or unlocked either manually or electrically. This, I imagine, can happen with any door. Luckily, the jam is in the unlocked position allowing the door to be opened. What is not safe is that door cannot be locked leaving the car vulnerable to theft or car jacking. If the door was jammed in the locked position, this can be unsafe for passenger exit in the event of emergency (a fire or emersion in water). Any electric door lock mechanism made by any vehicle manufacturer should be designed to fail safe allowing manual locking and unlocking of the door in the event of electrical power lock mechanism failure. This is just as much a safety issue as a jammed seat belt or faulty airbag. This should be a no cost repair by manufacturer dealerships like they do with jammed seat belts or faulty airbags. At least they should be able to free up the lock mechanism without charge to customers. This needs to be seriously reviewed and addressed by NHTSA for safety with policy and repair procedures and practices clearly spelled out. This failure happened as a result of remote key activation of the door locks with no manual physical operation of the door itself.", "fail date": "  07/09/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "The rear axle is almost detaching from the frame of the vehicle due to severe rusting of the chassis, and the axle may completely fell through.", "fail date": "  10/09/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Tl the contact owns a 2003 Honda Pilot. The contact took the vehicle to an independent mechanic because other 2003 Honda Pilot owners informed him of rust issues. The mechanic discovered rust on the rear subframe of his vehicle. The contact also heard a rattling noise coming from the rear of the vehicle. The vehicle was taken to jeff wyler Honda in florence (949 burlington pike, florence, ky 41042, (859) 283-2727) where the rust was confirmed. The dealer stated that they were unable to repair the vehicle due to the location of the rust. The vehicle was not repaired. The manufacturer was notified and a case was opened. The failure mileage was approximately 190,000.", "fail date": "  09/05/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Of the four posts where the complete rear axle mounts to the under body of the chassis, two of the posts have rusted away from the frame, leaving the rear axle only half attached to the main body of the car. The vehicle has very limited rust anywhere, so for the under body to rust to a point of separation from the rear wheel assembly is disconcerting. We had no warning and had the vehicle properly/routinely maintained. If the rear axle assembly had completely broken away, the resulting crash would have been disastrous. Certified mechanics confirm that they had never seen such a serious deterioration of a significant structural component.", "fail date": "  06/15/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Had to replace water pump and belt payed for it at homda dealer then noticed it had a recall on it dealership didnt notify me of the recall. Now I'm having problems with the transmition dealership said they couldn't find the problem but it also has a recall. But when I searched my VIN it said no recalls were found. The transmition periodically comes out of gear if I stop quickly or 1st thing in the morning or if I go over a speed bump slowly or sometimes randomly in the middle of driving in traffic. I can switch it into 1st 2nd or 3rd and get it moving again. It hasn't happend at high speeds yet. And the the metal under the seats is all rusted. At this rate the transmition will cause me to have an accident and the seats will come off and the airbags that have also been recalled will kill us im highly dissapointed in this vehicle.", "fail date": "  06/08/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "The car was moved into location, turned off, and the key removed leading to the driver thinking the car was in park, however the car was still in drive. The car was on a slight incline which caused the car to roll backwards down the driveway, across the street, roll over a tree, and crash into another tree causing significant damage.", "fail date": "  12/04/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "The contact owns a 2003 Honda Pilot. During inclement weather, water traveled through the engine compartment onto the floorboards. The failure created mold in the vehicle and electrical wiring damage. The failure recurred multiple times. The dealer stated that water was traveling through the windshield. The windshield was replaced; however, the failure persisted. The manufacturer had not been notified of the failure. The approximate failure mileage was 250,000. The VIN was unavailable.", "fail date": "  07/01/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "During normal acceleration from stop I felt my driver's side seat snap and give allowing my body to lean back and to the right. Visual inspection under seat show fatigued metal bracket at forward outbound position of seat base/bracket just above rails. I would assume integrity/safety of seat is compromised. I also believe that this should not happen during normal acceleration/use.", "fail date": "  11/01/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Owner driver was stopped on red light along with 20 other cars , the driver was last in the lane and other driver di not applied brakes, this vehicle was banged from the back. Body damage was repaired by westminster Honda in costa mesa . California, body repair cost of $ 3,500 was paid by insurance company of the person who was at fault, the auto transmission replacement cost of $ 6,500 was recovered from the me who was not at fault. The question is at that time the air bag was not deployed because of fault? after that I got recall notice from american Honda for two air bags driver side and passenger side, the notice came in the month of January 2015, first they delayed the repair task by making an excuse that they are very busy and first appointment is available on February 28 th at auto nation Honda in gilbert az then I got an e mail and a call from dealer that the parts are on back order, and they would not know when part will be available. After that I called american Honda, they have intervened and assured me that auto nation Honda will call me to schedule appointment again. Then I gave 4 - 5 calls to auto nation Honda, till today as of April 19th this repair is not fixed even though all parties know that this is critical to the life of drivers and passengers in this vehicle. Now I am in round rock texas, so I will need to see new dealer will somebody control these auto companies and dealer for compliance? thanks.", "fail date": "  12/18/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "While on my wayback on i95 from richmond, va to silver spring maryland, I suddenly heard a noise from my back window and I saw my Honda Pilot spoiler fly away and land in front of the upcoming traffic and almost causing an accident. Today, I still have not replaced this back spoiler and I have seen many other Honda Pilots on the highway or in the city without this back spoiler.", "fail date": "  06/11/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "The floor board of my 2003 Honda Pilot is very damp to the extent that if you were to leave a paper back on it, the bag would become wet. This was last observed on an 5-hour trip we were taking on June 5th. It rained all day, and we were running the air condition for the entire trip. When we returned home, we had to remove the mats (which were wet on the bottom) to allow the floors to dry out. It still is damp to this day (June 16th). I don't know if it has anything to do with the air conditioning system, or if it is outside water leaking in. This has been an ongoing problem that I first noticed approximately 3 years ago. Dealer was not able to determine cause of problem then. It is hard to attribute the problem to any event because the floor remains damp for an extended period of time that you can't really be sure what condition is causing it - you are operating the vehicle through so many conditions that it's hard to tell. From time to time I have to take out the mats when it becomes extremely damp. I'm concerned about the possibility of mold, though I've been able to prevent the vehicle from becoming too musty.", "fail date": "  06/05/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Honda Pilot leaking through and to the front floor boards.", "fail date": "  07/01/2008"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "While driving 40 mph spoiler fell off into oncoming traffic. Dealer stated the part was warping and produced one inch gap.", "fail date": "  08/14/2004"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The bracket which holds the drivers seat to the sliding base, split and broke. The bracket split and broke at the two rivet holes where the seat attches to the base. The rivets are still in place on the portion of the broken bracket which remains attached to the seat. Incident occured while parked in my own driveway. I was in the driver's seat and reached into the middle passenger area when I felt the driver's seat come loose. I do not know the mounting bracket part number, but on the internet I see other complaints of this same problem: the bracket which holds the drivers seat to the sliding base, split and broke.", "fail date": "  06/01/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The contact owns a 2003 Honda Pilot. While a passenger was seated in the front passenger seat, the brake pedal was applied and the seat inadvertently moved. The contact mentioned that the seat would rock like a rocking chair. There were no warning indicators illuminated. The vehicle was not taken to an independent mechanic or dealer for diagnostic testing or repairs. The manufacture was not made aware of the failure. The contact researched the failure online and found many complaints. The failure mileage was approximately 114,193.", "fail date": "  11/06/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "Notice when while stopped, moving the driver's electric seat either up and then forward, it began to rock. The next time, when accelerating on the highway, a rocking movement was felt. Took car to dealer and was informed that the frame was damaged, with one bolt off. Two options 1) replace for $2k or 2) get frame welded, no guarantee will fix problem. Power options may not work. A safety problem that is not currently on Honda of America's recall list. Called Honda of America to report this; no recall at this time. I asked if this is under investigation, and they said no. I asked will there have to be a death before action or recall? no answer. I am contacting this agency and my state's attorney general's office, because I fear that this is a huge safety issue that needs to be addressed by Honda of America.", "fail date": "  04/24/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "When the vehicle is in motion and I have to press down on the gas to accelerate/ speed up the vehicle quickly the driver seat bounces backwards/moves and it feels like its going to come off the frame its mounted to like some bolts may be broke or something. The car locks are messed up. The both front door locks have to be unlocked with a key. The inside unlock mechanism only unlocks the driver side passenger door and the trunk. In order to unlock the passenger front and the passenger rear locks a window has to be rolled down and you have to reach in and manually unlock it and those also have to be manually locked back when you exit the vehicle. Also, the passenger air unit does work. It does not blow out air even with the rear control on. The inside car lights have to be manually cut on and off and not set to come on when the door opens and closes because it runs the battery down. Sometimes while driving the headlights flicker. And the power port to charge phones, etc. Works but anything plugged into it gets hot real fast. All that points to electrical issues. The air bag lights kept coming on and going off. The transmission light has been flashing d and did not stop until fluid and filter was changed. So far that seems to have helped. And last but not least, the contacts in the ignition switch act defected. The key has to remain in the ignition switch and the spare key has to be used to unlock the car because if the key is removed, it does not want to go back into the switch to crank the car. The switch does not want to accept the key and turn to crank the engine once it has been removed from the switch. Even trying to turn the steering wheel and pressing the brake to release the switch doesn't work. And the gear shift stick/shaft acts almost like it's not park, but it was put in park.", "fail date": "  06/20/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "Metal bracket mounting driver's seat to base has sheared or torn and the seat now tilts and wobbles. Very unsafe situation as the seat tilts back during acceleration and shifts forward during braking.", "fail date": "  11/05/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The car was moved into location, turned off, and the key removed leading to the driver thinking the car was in park, however the car was still in drive. The car was on a slight incline which caused the car to roll backwards down the driveway, across the street, roll over a tree, and crash into another tree causing significant damage.", "fail date": "  12/04/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "Steel bracket or weld to steel bracket holding left front drivers seat to floor broke rendering seat unsafe for driving. Honda has refused to provide any assistance for the repair. However, web research shows multiple year Honda Pilots having the same issue. Honda should be held responsible. Dealer could do nothing and suggested I call american Honda which I did and the representative on the phone told me there was nothing they could due to age and mileage of vehicle. The rep said I could write and have my case reviewed. I wrote on 1/2 and just received a phone call today, 1/8 from the PA area case rep who told me, and I quote, \"common sense tells you that something almost 11 years old will break\". I do not believe a steel part or weld holding the part together should break. I was told by the PA area case rep that the phone call was my response and I would not be receiving a reply in writing. Great customer service.", "fail date": "  12/03/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "During normal acceleration from stop I felt my driver's side seat snap and give allowing my body to lean back and to the right. Visual inspection under seat show fatigued metal bracket at forward outbound position of seat base/bracket just above rails. I would assume integrity/safety of seat is compromised. I also believe that this should not happen during normal acceleration/use.", "fail date": "  11/01/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The driver's seat frame sheared off on the front bar, left side. The seat is no longer attached to the vehicle frame. If an accident occurs, I fear what will happen. There was no outside influential causal effect for this to happen, it just broke. The seat rocks back and forth while driving, a huge safety concern. This seems to problematic among 2003 - 2006 Honda Pilots. Honda needs to do a recall?.", "fail date": "  10/12/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The contact owns a 2003 Honda Pilot. The contact stated that while driving approximately 15 mph, the front driver's side seat frame fractured. The manufacturer was made aware of the failure. The vehicle was repaired. The approximate failure mileage was 66,000.", "fail date": "  12/20/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The contact owns a 2003 Honda Pilot. The contact stated that the driver's seat bracket fractured and the seat would move around while the contact was driving. The vehicle was taken to the dealer, who diagnosed that the seat frame needed to be replaced. The manufacturer was made aware of the failure. The vehicle was not repaired. The approximate failure mileage was 66,000 and current mileage was 66,595.", "fail date": "  12/19/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "Rear hatch window wiper blew the fuse. The srs light came on there was nothing wrong with my air bags or my seat sensors. A new fuse fixed the wiper but would not turn off srs light. Dealer wanted $100 plus dollars to check system and turn off light. Independant mech. Checked system found nothing wrong and reset the light. Why is a wiper motor tied into the seat sensor and air bags?.", "fail date": "  08/14/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The contact owns a 2003 Honda Pilot. The contact stated that the driver seat bracket fractured and as a result, the seat would move around while the contact driving. The vehicle was taken to the dealer who diagnosed that the seat assembly needed to be replaced. The manufacturer was made aware of the failure who did not offer any assistance. The vehicle was not repaired. The failure mileage was 160,000 and the current mileage was 165,000.", "fail date": "  08/03/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The driver's seat on my 2003 Honda Pilot has broken away from the frame or bracket in the front and right side. The seat rocks precariously when I drive or accelerate. This is certainly a safety hazard, and I'm wondering if this is a frequently reported problem, and whether Honda has an obligation to fix it. Thanks.", "fail date": "  08/05/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The plastic panel housing the driver's seat adjustment controls has become detached from the seat on my 2003 Honda Pilot. The screw that held it in place is still seated, but the plastic paneling being held by the screw has broken away from the panel.", "fail date": "  07/04/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "Traffic on a surface road came to an abrupt stop. The 2004 Ford f150 did not stop in time and rear-ended our 2003 Honda Pilot along the right half of the bumper. The impact was severe enough to shove the right frame rail forward several inches, wrinkling the roof and putting the driverside rear door in tension so that it could not be opened. The two front seats were occupied by adults. Both the driver's and passenger's seat backs failed. The driver suffered no injuries, but the passenger suffered bruising from the b-pillar and strained back from the collapsing seatback.", "fail date": "  12/06/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The 2nd row lh (drivers side) passenger seat in my 2003 Honda Pilot purchased 1/2/2003 with about 90k has had two related problems on this seat. This seat is rarely sat in and almost never moved. It became jammed in the upright at some point in time, likely much earlier than I detected it in July 2009. I attempted to fold the seat down via the top lever and was not able to. The result was the top lever plastic handle broke off the cable actuator. I paid over $200 at the dealer (priority Honda in huntersville nc, 28078 - 704. 875. 3100) to have it fixed even though I feel that it should not have jammed causing the top lever to break off. At repair, nothing was found that would cause the jam such as a foreign object or any damage. Recently I tried to move the seat forward (side lever engages both back fold down and base release) to allow my children to exit from the third row seat and found that this lever was not working as well. I brought the vehicle to the above-mentioned dealer the evening of 8/24/09 and left it with them until the evening of 8/24. Ed jenkins the service manager advised me that he personally worked with the mechanic to look at the issue spending three hours working on it and could not repair it. He also told me that a new seat frame was required to make the seat operational. A seat should not fail after 6 years with light use and in my opinion should last as long as or exceed the lifetime of the vehicle, which in the us is about thirteen years I consider this a manufacturing defect and an important safety issue as passengers may become entrapped in the third row seat. Any delay in exiting especially if the other side is occupied or somehow blocked could mean the difference between life and death in an emergency.", "fail date": "  07/08/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "We bought our 2003 Honda Pilot assuming that it would be a great family vehicle. We have three small children and another on the way so our car is full of car seats. We have a backless boaster seat in the third row on the driver's side, a boaster seat in the third row on the passenger side, and a forward facing car seat in the second row driver's side. It is incredible difficult for me to get the children in the third row buckled because the seat belts are constantly getting \"stuck\" and have to be rethread all the way back. This is difficult because they get caught on the boaster seats that then have to be picked up and moved around to get the seat belt off. Also, the seat on the seat on the passenger side is too narrow and the seat belt buckles very low, close to the seat and it ends up underneath the boaster seat. These difficulties make it nearly impossible for my preschoolers to buckle by themselves and forces me to climb back in their seat to fix the seat belts and move the booster seat forward to buckle them in. It is incredible difficult and uncomfortable for an adult to climb into the third row seat, especially one that is seven months pregnant. We have tried moving the seats around and can not find any better positions for the car seats.", "fail date": "  09/18/2008"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "Rear-ended. 2003 Honda Pilot front seat head rest is non-adjustable, and hits head about an inch down from top of my head. There is no cushioning nor protection for my head. Honda customer service stated that if I took auto to dealer, dealer would repair under warranty. Dealer stated that there was nothing they can do, this is the way it is designed. Thus this is a defect in that this is a totally unsafe head rest (constraint).", "fail date": "  04/04/2008"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The contact owns a 2003 Honda Pilot lx. The contact stated that while entering the vehicle, the driver's side front seat became slightly detached and began rocking back and forth. The vehicle was taken to the dealer but the manufacturer was not contacted. The vehicle was not repaired. The failure mileage was 30,000 and the current mileage was 76,000.", "fail date": "  02/01/2004"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "Just below the leather on the drivers seat the plastic panel that holds the electronic buttons to operate the seat motion has broken two times in less than four months, although the dealer replaced it both times, there appears to be a defect in the screws holding the panel in place.", "fail date": "  09/15/2003"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The base of the driver side leather seat was severely stretched and sagged (and also with 'pointy hairs' protruding from holes on all leather seats front and rears) , and the illed-mannered Honda dealer's service department manager(robertson Honda in north hollywood, CA) refused to replace it under the covered original Honda warranty and denied totally there is anything wrong with it although the defect is so obvious and visible.", "fail date": "  05/30/2003"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "Plastic panel housing drivers seat adjustment controls has become detached from the seat of my 2003 Honda Pilot. The screw that held it in place is still there but the plastic paneling being held by the screw has broken away from the panel. This happened in the first year that we owned it. Tried to get it fixed. Told by dealership there was no problem.", "fail date": "  01/01/2003"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Headlights problems", "description": "Lo beam headlights stopped working. Bulbs fuses and relays are good. High beams work ok. Lights stopped working and I discovered it at night when I went to drive the car home.", "fail date": "  05/12/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Headlights problems", "description": "Lighting recall. There was a recall in 2012 affecting my 2003 Honda Pilot that I did not know about until my headlights went out while driving and almost wrecked. My low beams do not work but my high beams do, me and my child could of died from this. We were just driving as normal on a highway with no other traffic around and lights just stopped working. After pulling over I realised my hi beams still work. I do not understand why my recall isn't listed when a recall was issued.", "fail date": "  12/03/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Headlights problems", "description": "The contact owns a 2003 Honda Pilot. Over time, both plastic headlight covers became very opaque, which caused the headlights to appear dim and made visibility difficult. The contact's wife called a Honda dealer who stated that they were familiar with the issue, but could not assist. The manufacturer was made aware of the issue and stated that they could not assist. The approximate failure mileage was 85,000.", "fail date": "  04/15/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Headlights problems", "description": "Both headlights went out. Vehicle has been previously recalled and repaired for this problem in 2012. Had to rely on high beams to get home. Replaced only one bulb which on inspection looked good. Both lights came on. Problem solved or so I thought. Wife drove the car yesterday and smoke began to come out from around the steering column. She drives with the headlights on even during the day. After turning off the lights and the car and allowing it to cool off, she made it home without the lights being on. Update 9/15/cw.", "fail date": "  06/28/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Headlights problems", "description": "Left work at night. Low-beams partially failed, but I didn't notice until I was going 55 mph on the highway. Had to use brights, and go to a gas station. Vehicle had to be towed, and checked by dealer. Dealer said using 3rd party headlight bulbs was the cause. Of interest, the car already had the low-beam failure recall fixed. Looks like this is still an issue after the recall, and using Honda oem bulbs is the only safe way to go. 3rd party bulbs were purchased from advance auto parts, and I'm unsure of the brand.", "fail date": "  04/02/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Headlights problems", "description": "The contact owns a 2003 Honda Pilot. While driving 35 mph, the headlights suddenly failed without warning. Neither the dealer nor the manufacturer was notified of the failure. The vehicle was neither diagnosed nor repaired. The current and the failure mileages were 160,239.", "fail date": "  11/15/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Headlights problems", "description": "Honda Pilot headlights do not provide sufficient light to safely operate the vehicle. Only a few feet in front of vehicle are illuminated, and a sharp cut-off line between light and darkness is clearly visible at a distance that is not far enough to safely drive at night.", "fail date": "  07/29/2004"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Headlights problems", "description": "Headlights on the 2003 Honda Pilot are not bright enough to illuminate the road at highway speeds. Honda knows of the situation and will not take any action.", "fail date": "  09/16/2003"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Headlights problems", "description": "The headlights on my new 2003 Honda Pilot are like a small pocket flashlight extremely dim and insufficient for night driving pleaser help me remedy this problem.", "fail date": "  05/07/2003"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Headlights problems", "description": "Headlights on the new Honda Pilot are weak and fail to adequately illuminate the road ahead. It's the difference between using a spotlight vs a floodlight. The high beams when in use just seem to disappear into the night. You can see but the light is not bright enough in my opinion. I think the high beams should be more like a spotlight in lighting up the road ahead. I think it is a definite design flaw.", "fail date": "  01/31/2003"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Headlights problems", "description": "Head light is not enough illuminate at night very risky when turn either left or right on a highway. We have stop driving at night after found out. Dt.", "fail date": "  11/26/2002"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Headlights problems", "description": "Head light too weak, cant see more than 20 feet. Not enough illumination. **dimsii ivoq entry posted after 12-12-02 cut over to artemis**770154.", "fail date": "  11/17/2002"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Headlights problems", "description": "The headlights lights were very dim and the dealership was unable to adjust the lighting projection. Which resulted in poor visibility. The manufacturer indicated it this was a design characteristic.", "fail date": "  11/16/2002"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Headlights problems", "description": "Consumer states, the head light component provide poor light obstructing the driver's view. Dealer has inspected. Please provide further information. Mr.", "fail date": "  11/06/2002"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Headlights problems", "description": "Consumer states the low beam headlights are weak or not properly aligned resulting in poor night visibility. Consumer states has to use high beams. Nlm.", "fail date": "  09/01/2002"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Headlights problems", "description": "Headlights are very weak and do not sufficeintly illuminate the road ahead. This creates a very serious driving hazard on the freeway especially at speeds as high as 70 mph. The Pilot's headlights fail to illuminate. Dt.", "fail date": "None"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Honda did not contact me for a year and a half I have been waiting for them to replace my air bag, no response!!! I’ve left numerous messages and still no response I gave a 1 year old daughter, we almost got hit by a car and if it had hit us something could’ve happened! because I had to swerve off road my suspension and power steering are messed up because of pot holes,just so I wouldn’t hit and impact the passenger side of me my car where airbag is bad and nothing would’ve happened to us, not that it was our fault the driver was driving almost right into us!I blame Honda for this disaster would could have been very bad! of course the other driver drove away like nothing happened! so now I am stuck at home not able to go to work and bring my daughter to doctors appointments and invade of in emergency my vehicle is not safe enough to get us anywhere! I am asking god to bless us in this case and count all the blessings he has given us! I don’t have a lot of money to pay for repairs and this is the only car I’ve ever purchased and owned. If there is any way anyone could help please! maybe a new Honda would be nice for christmas, but hey a girl can dream right! thank you for your time!.", "fail date": "  09/18/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "The rear sub-frame on the driver's side of this 2003 Honda Pilot is extremely rusted exposing the suspension cross-member bolt which is similarly rusted. An internet search indicates this is a common problem with Honda Pilots and a potential high-risk point of failure.", "fail date": "  07/03/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Suspension is completed rusted out from frame.", "fail date": "  09/28/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Using 4 wheel drive to pull my boat through the woods, 2 of the 4 rear axel mounts pulled out of the unibody frame after a loud clunk. Car was always maintained at the dealership. The vehicle is not repairable, this seems to be a design flaw.", "fail date": "  06/01/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "We were driving straight on the highway at ~65 mph, fully loaded for a week-long camping trip, and hit a large pothole. The rear wheel assembly of my Honda Pilot broke so that it was only partially attached to the frame because the frame of the car rusted through. The 2 back bolts were still in place, but the frame itself was crumbling apart; the 2 front bolts were the only things holding the rear wheel and axle to the car. The photo shows the steep angle of the wheels, and how low to the ground the back of the car was. I drove the car to our mechanic, they put it up on the lift, and then showed us. They told us it was unfixable. The car is 14 years old and otherwise in good shape. It has received regular maintenance (I have 9 years of maintenance records). The mechanic had done brake work 3 days prior, and I had gotten the tires rotated the previous week. None of the people who worked on the car noticed or said anything was majorly wrong with the car. We were lucky we didn't have a serious accident when the car broke on the highway.", "fail date": "  08/03/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "The truck hesitates in order to get it to move you have to take foot off the gas pedal. Happens a lot when driving. Sometimes it stalls. . . . Driver side rear body mount is rusted out.", "fail date": "  06/01/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Last month while driving vehicle seemed a little loose while going down the road, looked over front end and could find no problems. Daughter (who had driven daily) complained that problem was getting worse. While backing up slowly Monday (3/20/17) , vehicle became uncontrollable and shifted lanes. Upon inspection it has been found both rear suspension mounting points (rear most 2 of 4) have rusted loose from unibody ( completely detached). Bought this Pilot new in 2003, always kept up on all service and maintenance.", "fail date": "  03/20/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Rear suspension rusted out from the frame. Only one side as of right now.", "fail date": "  12/16/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Of the four posts where the complete rear axle mounts to the under body of the chassis, two of the posts have rusted away from the frame, leaving the rear axle only half attached to the main body of the car. The vehicle has very limited rust anywhere, so for the under body to rust to a point of separation from the rear wheel assembly is disconcerting. We had no warning and had the vehicle properly/routinely maintained. If the rear axle assembly had completely broken away, the resulting crash would have been disastrous. Certified mechanics confirm that they had never seen such a serious deterioration of a significant structural component.", "fail date": "  06/15/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "I own a 2003 Honda Pilot my rack and pinion is in bad condition so is their a recall on this year make and model? my number is 334-468-3394.", "fail date": "  05/05/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "While my wife was driving my 2003 Honda Pilot she almost lost control without any warning. She drive it the few remaining miles home and asked me to examine it for a possible loose wheel. Upon inspection I found that the entire rear suspension had separated from the body and that only the abs brake wires was holding it in place. There was no apparent reason for this. There was nothing to explain why this had occured.", "fail date": "  09/05/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "I am the original owner of a 2003 Honda Pilot. I am an older, cautious driver and have babied this vehicle, doing all regular service at the dealer's, so it would run in top shape for many years to come. Around six months ago I noticed at lower speeds (20-30 m. P. H. ) the vehicle shudders. To counter the problem I have to accelerate and then it goes away. I have had the dealer check it three times and each time they say they cannot replicate the problem, which is hard to believe. Last week the d light started to flash. I took it into the dealer right away and they said it was a sensor. I asked if that could be making the car shudder and they said probably. I had them change it and the shudder has not gone away. This morning it was particularly heavy so I called the dealer again and they gave me the american Honda number. I called them and they said the dealer should look at it. I've seen so many other people have the same complaint and I'm very concerned this is a safety issue that Honda is choosing to ignore; a little like other auto companies have done over the past few years until a fatality happens. As I carry my family in this vehicle and I am particularly concerned.", "fail date": "  08/07/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "I own a 2003 Honda Pilot with 57,000 miles on it. After taking it to a Honda specialist for scheduled service, the technician reported that the front engine mount & side engine mount are both broken, with a repair estimate of $503. 30. The vehicle has not been in a collision, has had all its scheduled services and in no way should the engine mounts be broken. This is a major issue and Honda should be looking into repair as it seems to not have been properly installed to be broken with such few miles.", "fail date": "  04/15/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "I took my Pilot in for a slipping transmission. I was told I had bad motor mounts and that was allowing the transmission to slip. I spent approx. $3600. 00 to have the motor mounts fixed, timing belt and water pump, front struts, etc. Fixed. The problem started again, this time, getting a flashing \"d\" light. Took it back in for failure to fix the problem. Had 4th gear pressure gear replaced for cost. I now have a check engine light on posting a code of p0730, \"incorrect gear ratio\". I have been into Honda 4 times for this issue including today, and I was told I need a new transmission. I am out of warranty of course, but I know there are many, many complaints regarding this particular issue. I do not have the money to replace a faulty transmission that was built poorly. I am worried I might get into a crash because of this. I am contemplating hiring a lawyer to resolve this issue.", "fail date": "  03/05/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "First, door locks automatic now have to unlock myself, along wits the outside doors. Alarm button no longer works to unlock. Door handles inside have been peeling and actually cut your fingers when opening the door, I have maswing tape in them and it's ugly, finally. . Lights inside are going out on radio, dimming on interior also.", "fail date": "  01/01/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Our 2003 Honda Pilot locked up on the highway due to transmission failure of the 2nd gear. We were traveling in the 3rd lane over 60 mph when both front tires locked and we skidded to a halt in less than 200 yards on the highway. Prior to our vehicle breaking down, there were no signs of danger, no unusual sounds, no blinking lights or any hesitation with the car. Our vehicle had 138,400+ miles and has been serviced regularly according to Honda's recommended maintenance schedules, including all transmission fluid changes. On may 7, 2004 with 36,384 miles, our vehicle had received a retrofit of the a/t oil jet kit due to Hondas 04-021b safety recall on the automatic transmission second gear. Luckily no one was injured and there were no other vehicles involved in the incident. The car behind us stopped just in time to avoid a collision. Our car could not be rolled into the breakdown lane as both front wheels were locked and we were stranded in the 3rd lane. A police officer was called to the scene and logged the incident as a disabled vehicle. The officer requested for immediate towing since we were in a dangerous location. The car was towed to a Honda dealer, who provided the following diagnosis and estimate:\n\"transmission internal failure\nboth front axles twisted\nneeds 2 tires - flat spots\nalignment $5,199. 14 plus tax\"\nwe opted not to repair the Honda and instead purchased a new non-Honda vehicle and received a trade-in value for as-is condition.", "fail date": "  08/17/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Had to replace front and side motor mounts on my 2003 Honda Pilot. This was after only 67,118 miles. Mechanic said this is a common problem with the original motor mounts. This could be very dangerous.", "fail date": "  10/16/2008"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "My vehicle vibrates at highway speeds between 70-80 mph. I have taken the car into the dealer no less than 5 times for the problem and just recently was told that Honda is aware of the problem and that the vibration is a characteristic of the vehicle. Up to this point the dealer has re-balanced the tires over and over and redone the alignment. I even purchased brand new tires and still there is the vibration. The dealer road force balanced the tires and still the vibration problem. There are many people complaining about this problem on the Hondapilot. Org website and there appears to be no resolution.", "fail date": "  03/14/2006"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "My Honda Pilot becomes unstable at speeds above 60 mph, it responds as though there is play in the steering and any small road imperfections cause the vehicle to veer left or right, I took it to cush Honda where I purchased the vehicle and they said three of four tires had 52 pounds of air in the tires, which had to have been there on delivery since I have less than 700 miles on the vehicle and it has never been serviced or had air put in the tires, the problem still exists and is unsafe at highway speeds in traffic, the service manager claims all Pilots do it and it is a design problem? please advise.", "fail date": "  06/25/2003"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "The problem has been traced to the upper shock mounts. Their design causes a rattle on small to moderate road irregularities. I was forced to make a personal modification to the mount as Honda would not acknowledge the problem. Others (national web site) have experienced the same symptoms, but Honda says this is charastic of vehicle. I have been a major supporter of Honda in purchases and their customer service is incredibily insensitive. My next purchase may be a vw or Volvo. Since I modified the bracket, the sound is not the issue. The value Honda has placed on my business is. I can document all efforts to resolve the issue, however Honda does not want to admit there is a problem. Surely I can not be the only one to have this issue with Honda as I have remained professional at all times. I will not let the issue die. There should be reasonable expectations that support should go along with product loyalty. Bill price.", "fail date": "  03/15/2003"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Since owning the vehicle in 8/2002, there has been a slight vibration at speeds around 70 mph. Since chsnging the tires recently, the problem is more pronounced, but only when cold. The vibration borders on a shake, and you can feel it in the steering wheel as well as the floorboards.", "fail date": "  07/08/2002"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "Honda did not contact me for a year and a half I have been waiting for them to replace my air bag, no response!!! I’ve left numerous messages and still no response I gave a 1 year old daughter, we almost got hit by a car and if it had hit us something could’ve happened! because I had to swerve off road my suspension and power steering are messed up because of pot holes,just so I wouldn’t hit and impact the passenger side of me my car where airbag is bad and nothing would’ve happened to us, not that it was our fault the driver was driving almost right into us!I blame Honda for this disaster would could have been very bad! of course the other driver drove away like nothing happened! so now I am stuck at home not able to go to work and bring my daughter to doctors appointments and invade of in emergency my vehicle is not safe enough to get us anywhere! I am asking god to bless us in this case and count all the blessings he has given us! I don’t have a lot of money to pay for repairs and this is the only car I’ve ever purchased and owned. If there is any way anyone could help please! maybe a new Honda would be nice for christmas, but hey a girl can dream right! thank you for your time!.", "fail date": "  09/18/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "The ignition switch on my car will not turn. A review of complaints on internet note that this is a common issue with this car as it nears 100k miles. My car is getting there and all of the sudden I have to fight with the steering wheel for it to turn and allow the key to work.", "fail date": "  04/29/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "When I driving 95 n going to connecticut there's a huge smoke on the hood and the other motorist behind me, he saw a lot of oil dripping on the street and he gave me a honk. I parked the car beside the highway and I opened the hood remove the negative battery to avoid the fire.", "fail date": "  05/26/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "I drive between 20-40mph and my Honda shakes and shudders for 8 seconds then goes away. Any idea what can that be.", "fail date": "  10/20/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "Ignition key can pull out while driving.", "fail date": "  08/02/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "Issue with Honda Pilot's ignition switch not fully ingaging the park position. Reiceved recall paper work ordering this issue to be fixed at local Honda dealer free of charge. Recall paper work was signed by jennifer timian chief recall management division. Local Honda dealer, williston Honda and Chrysler preformed the recall service on April 4, 2014. The recall job for a Honda Pilot was botched. The service machanic refused to fix. Requested management to investigate this issue. As of today April 18, 2014 an answer to fix or not to fix this issue from the management of williston Honda and Chrysler has not been given.", "fail date": "  03/25/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "I was about to turn the key in the ignition but it could not get in. The key meets resistance and gets in after I tried several times. When I attempted to turn on the ignition, it wont budge and acted as if it was locked. Since then, I do not take the key off the ignition because I am afraid I will not be able to get it in. It is a really safety issue and Honda refuses to address it voluntarily. I went on line and there are several owners who are left alone to deal with the same safety issue. Why do I have to leave my vehicle with the key stuck in the ignition. Honda should be ashamed of their flagrant irresponsibility. Please help us. Thank you.", "fail date": "  03/07/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "2003 Honda Pilot ignition - at first we were having issues inserting the key into the ignition. Then it progressed to needing to jiggle the key in order to get it to turn to any position of the ignition. The key would go in but it'd take several attempts, of a minimum of 10 to 15 minutes, before we could get the ignition to start. We read the manual and understood the importance of keeping the wheels straight - that seemed to help for a few attempts. Now the key goes in but doesn't turn at all. With everything that has been documented about this issue from Honda customers and the volume of customers it is affecting why isn't Honda doing the 'right thing' and issuing a voluntary recall?!.", "fail date": "  06/24/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "I have the same problem with the transmission and being able to remove my key even when it is not in park that has been reported by others. Its led to an accident and a near one.", "fail date": "  05/17/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "Having trouble inserting key into ignition. Have to try multiple times, turning the key upside down, right side up, repetitive in & out, eventually it goes in, but afraid that eventually it will not work. Called american Honda as I saw multiple complaints online, but Honda said they never heard of this problem and that it's not widespread enough for them to take notice. I'm afraid that I will not be able to get the key to work, so will take it to Honda dealership for repair (apparently only dealership has to fix it because new keys will need to be programmed. There are 2 different choices for cost, one to just replace the ignition and get new keys, and another choice is to also change the door locks so that the new keys will open the door. ) if you're having the same problem, please log a complaint so that it becomes \"widespread enough to take notice\" and may be those of us who pay/paid to get this issue repaired can get a refund. Thank you!.", "fail date": "  04/08/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "Vehicle will not accept key, after playing with it finally get the key into the ignition, but will not start. Play and play with ignition and car finally starts. Take to Honda dealership in el cajon CA , they say because of weight of keys, have a total of 3 keys on my chain, that it has worn out the key and the tumblers in the ignition. They make a new key, it goes right in but the ignition is still not turning over, have to get a ignition. They replace the ignition but now I have two heavy Honda keys because the \"new ignition\" is a sidewinder and it comes with a key that they can't program to fit the doors. Now my key chain is heavier than before. This cost me $850. 00.", "fail date": "  05/15/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "I was driving west on highway. I was driving in the left lane at a speed of approximately between 70 to 72 miles per hour. My vehicle swerved towards left a bit, and to compensate that I tried to steer towards right. At this time, vehicle went out of control and I had no control over the steering. The vehicle went to the next lane and spun one time and went towards the left lane. It then changed direction and was facing north, went four lanes over and hit the median head-on and this collision brought the vehicle to complete halt. Both air bags were deployed and vehicle had extensive damage. It looks like, it was a mechanical failure which led to the crash.", "fail date": "  04/21/2006"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "While backing out of the drive way and turning the steering wheel in either direction you can hear a thumping sound, it's a constant thumping. If only the back 2 windows are rolled down, the sound of the wind passing through the car is deafening. It creates a booming that immediately affects the ear drum.", "fail date": "  02/12/2003"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The gear shifter will not gauge is stuck in one position.", "fail date": "  11/04/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "I was on the hwy in the left lane an exhilarated then all of the sudden my SUV just braked suddenly without me pressing the brake causing a screech on the concrete. I moved to the right lane very cautiously. I drove about 15 miles then it happened again. I turned my emergency flasher on and drove another 5 miles when it happened again. I pulled onto the side of the road and called my husband to come drive behind me the rest of the way home. This is very scary. I just knew I was going to get rear ended. I love my Honda Pilot but now I can't drive it. I have no idea why or what is causing this problem! please help. Thanks, June williams.", "fail date": "  09/29/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "In the morning, on January 27, I had my 2 year old and 4 year old in the vehicle and I was driving my son to school. Less than a mile from home, going between 30-35mph, I tapped the brakes as I approached a bend in the road and after a brief initial pause (as you would expect), the car suddenly started rapidly accelerating - I started pressing the brakes to no avail - vehicle did not slow down - at this point I was in the curve and was unable to keep the vehicle on the road. I hit a small tree and continued careening out of control until I crashed in a ditch, hitting a wood hydro pole (thankfully not concrete) - both airbags deployed - I suffered a broken ankle, bruised ribs and seat belt abrasions - my 2 year old required stitches on her eye lid and eyebrow due to impact with her cup that she was holding at the time (we're lucky her sight wasn't affected). My son suffered no physical injuries but 1 month later is still talking about it. Vehicle was a complete write off. Had approximately 161,000 miles at time of incident. Cruise control was likely on but wasn't in use. Similar issue happened on 2 previous occasions. 1st at least 8 months ago and then again about 3 weeks before accident (was going to address with dealer at next oil change) but on two prior occurrences surge occurred when brakes were tapped to disengage cruise control - same pause/surge but not nearly as intense and stopped immediately when brakes were pressed again. After the accident I noted that there are several reports of the same thing happening to other people. No idea how fast it was going when it crashed but it \"felt\" like at least 50mph. This is terrifying when it happens, I don't want to see this happen to anyone else. I shudder to think what would have happened if this had occurred at an intersection or on the expressway - we might not be here. . . Also mailing letter to manufacturer.", "fail date": "  01/27/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Car suddenly and abruptly decelerated as if maximum brakes were applied for about half a second. Car did not jerk hard to left or right, suggesting that if brakes were the cause, both wheels probably engaged simultaneously. Removed both front wheels and inspected front brakes and lines. Nothing unusual noted. Brake fluid level checked and found to be between max and min.", "fail date": "  03/13/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Tl-the contact owns a 2003 Honda Pilot. The contact stated that while driving approximately 30 mph, the brakes was depressed and failed to respond intermittently. The contact was able to avoid a crash. The vehicle was taken to a dealer where the technician informed that the vehicle was operating as designed. The manufacturer was notified of the failure. The failure mileage was 200,000. Ss.", "fail date": "  12/15/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The vehicle has had unpredictable braking and traction for well over a year. Dealer visit on March 14, 2014 did not produce a cause. More recently I was unable to stop the vehicle from 40 mph for a red light with full brake pressure. Road conditions were good at the time. I had to accelerate through the intersection to avoid a collision. The vehicle currently displays the \"check engine\" light and \"vtm-4\" light quite consistently. Traction is also intermittently compromised by some unknown problem. It seems that when the vtm-4 light is on, the awd feature of the vehicle is disabled. When it is on, it cannot be disabled with the switch on the dash. The driver side air bag was ordered on October 29, 2014 but has not yet become available. I called the dealer again on March 2, 2014 after I received another air bag recall notice. This now includes the passenger side as well as the driver side. Air bags are not expected for another two to three months. They will call. . . . . . . . . . . . . . . !.", "fail date": "  03/14/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Noticed that the Honda Pilot would shake when driving at 60, then eventually start feeling the brakes going into effect and the speed dropping to below 40. However, driving at 25 yesterday, the brakes locked in the middle of the road. The car came to a complete stop, I had to push down the brakes and then the car moved.", "fail date": "  02/01/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "When applying the brakes they produced a noise. Dealer states that the noise is normal.", "fail date": "  11/04/2003"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "I own a Honda Pilot 2003, every time I start my SUV and press the brakes for the first time I hear a loud nocking sound. Usually happens after the SUV is not in use for a while. I took the SUV to the dealer for different issue and I asked the service person about the problem, he told me that the sound is common on Pilot. I called american Honda and they told that I need to take the SUV for an inspection and not to go by what the service person told me. I have not taken the SUV to the dealer yet. But, I have done my research and there is a lot of people that the same problem, I do not why they have not reported it. The problem is annoying because it only happens once, everytime the SUV is move after a period of time.", "fail date": "  02/19/2003"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "The car will not stop. It is at full throttle. Very scary and dangerous. Only way to stop it is to turn ignition off/start up again okay for 5 miles, then it takes off full speed, brakes cannot stop it. Please look into this ASAP before something terrible happens. Afraid to drive the car. Does not matter where it is main/y street, city or highway.", "fail date": "  01/24/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "I am the original owner of a 2003 Honda Pilot. I am an older, cautious driver and have babied this vehicle, doing all regular service at the dealer's, so it would run in top shape for many years to come. Around six months ago I noticed at lower speeds (20-30 m. P. H. ) the vehicle shudders. To counter the problem I have to accelerate and then it goes away. I have had the dealer check it three times and each time they say they cannot replicate the problem, which is hard to believe. Last week the d light started to flash. I took it into the dealer right away and they said it was a sensor. I asked if that could be making the car shudder and they said probably. I had them change it and the shudder has not gone away. This morning it was particularly heavy so I called the dealer again and they gave me the american Honda number. I called them and they said the dealer should look at it. I've seen so many other people have the same complaint and I'm very concerned this is a safety issue that Honda is choosing to ignore; a little like other auto companies have done over the past few years until a fatality happens. As I carry my family in this vehicle and I am particularly concerned.", "fail date": "  08/07/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "The contact owns a 2003 Honda Pilot. The contact stated while stopped at a red light, the vehicle began to accelerate and the driver's seat frame became fractured. The vehicle was taken to the dealer where the vehicle was diagnosed with a fractured power seat frame and needed to be replaced. The vehicle was not repaired. The manufacturer was made aware of the failure. The failure and current mileage was 107,000.", "fail date": "  05/16/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "The contact owns a 2003 Honda Pilot. The contact stated that while driving 50 mph, the vehicle abnormally accelerated. The contact applied the brakes but the vehicle did not respond. The contact had to shut the vehicle off to stop the vehicle. The contact did not take the vehicle to a dealer or mechanic for diagnostic testing. The failure mileage was 130,000.", "fail date": "  12/26/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "My Honda Pilot starts slipping when it changes from 3rd gear to 4 gear. Now it starts shaking/jugging. With speed 60mph or 65 mph, it is very dangerous if it starts jugging because you never know how the car behind you reacts and your car will do.", "fail date": "  10/05/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "The transmission suddenly starting slipping without any warning and struggled to get over a viaduct with no power to accelerate. The transmission started slipping without any warning and the engine light came on. Drove the Pilot slowly home and took to shop. The transmission fluid had been changed at 90k. The pressure switches were changed but did not work for slippage. The transmission was broke and needed replacing. This vehicle had all recalls completed.", "fail date": "  09/09/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Shuddering and jerking while shifting from 2nd to 3rd gear. Also does the same in reverse. Car would not accelerate on highway on-ramp. While at high highway speeds, car felt like it fell out of gear and lost power, until the gear engaged again.", "fail date": "  06/04/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Same issue as every other Pilot owner with the 2nd gear not wanting to shift up around 30-40 mph, a delay and rpm's go up causing safety issues.", "fail date": "  12/01/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "The contact owns a 2003 Honda Pilot. The contact stated while driving 25 mph the vehicle felt as though it was surging forward. The contact pulled over and put the vehicle into park and the rpm's started to rev-up on its own. The contact has taken the vehicle to a local mechanic for a diagnostic test. Thecontact stated the vehicle has many safety problem and thinks the manufacturer should be responsible for the repairs. The failure mileage was 120,000. Updated 05/06/10. The door lock cylindeers and ignition switch was replaced. The engine and steering locked up and the vehicle would not start. The key door lock broke and had to be replaced. The heater motor failed. Updated 07/06/10.", "fail date": "  03/04/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "During the freezing weather in jacksonville. Fl. Specifically on the 7th & 8th Jan. 2010, the gas pedal on my 2003 Honda Pilot was sticking. After starting the vehicle, I had to apply extra foot downward pressure to make the gas pedal move and make the vehicle accelerate. This happened on several occasions during the 2 weeks that it was freezing on consecutive days in this area. I bought this vehicle brand new in 2003 and never had this problem arise until this time. The problem 'seems' to disappear after the vehicle has been running & warmed up. I also called Honda 800-999-1009 and informed the Honda customer rep. About the issue. Honda informed me to take it to Honda service or mechanic for diagnostic.", "fail date": "  01/07/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Visibility", "Sub Problem": "Side/rear Glass problems", "description": "While stopped at a traffic light, the rear driver's side door window shattered as a trailer truck drove slowly by our Honda Pilot. No objects were thrown against the window, the vibrations of the heavy truck going by were enough to shatter the window. This is a major safety defect that should be recalled by Honda motors!!!. I read a similar complaint in this site where another person close the door on his Honda Pilot and the window shattered. I'm formally requesting an official investigation and assistance in this matter.", "fail date": "  10/29/2004"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Visibility", "Sub Problem": "Side/rear Glass problems", "description": "The vehicle's window shattered after the door was shut.", "fail date": "  10/17/2003"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Visibility", "Sub Problem": "Side/rear Glass problems", "description": "While driving my 2003 Honda piolt at 38 mph or faster with one of the rear windows down, I very bad turblance occures in the passenger compartment, feels like pressure in the compartment hurting our ears and hearing. Question is what damage will this do to a person with hearing problems (tubes in ear) also majior concern with new borns (not fully developed hearing). I made contact with Honda customer service several time in reff to this problem, and was advised there is no corrective solution to this problem. I was also advised by Honda customer service that they could not help me and to contact a attorney which I realy cannot aford. The vehicle is only one month old. Please contact me with advice to handle this problem. I truly beleave this is a safety problem and needs to be addressed. Also pleas let me know if other owners of the Honda piolt are having this same problem. Thank you.", "fail date": "  11/28/2002"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Visibility", "Sub Problem": "Side/rear Glass problems", "description": "While traveling on the highway the back window has a whistleling sound and vibration please fill in additional information dealer is aware of the problem. Ts.", "fail date": "  10/01/2002"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Gasoline Fuel System", "Sub Problem": "Tank Assembly problems", "description": "After coming to a complete stop, there is a loud thumping that comes from the rear of the vehicle. It scares the heck out of you and you think someone has hit you! took it to several mechanics and the Honda dealer in brantford, ontario and although Honda acknowledges the problem as a related to fuel tank design they are refusing to do anything about it.", "fail date": "  03/08/2007"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Gasoline Fuel System", "Sub Problem": "Tank Assembly problems", "description": "Hearing the annoying and pretty loud back and forth sloughing or thumping sound from the bottom or rear of the driver seat (most likely from the gas tank which is where it is located) whenever coming to a stop or accelerate from a stop.", "fail date": "  06/06/2003"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Gasoline Fuel System", "Sub Problem": "Tank Assembly problems", "description": "I owned a 2003 Honda Pilot. It's a very good SUV. Except that last year, I made a complaint with grand Honda dealership in elmhurst IL. Regarding an annoying noise coming from the fuel tank which I believe is very unusual. Splashing noise is very strong when the fuel tank is half to almost full tank. According to the dealer it is normal and there was no recall which I strongly disagree. I believe there is not enough chambers to control the splashing noise and might cause further damage. Please help!!!.", "fail date": "  05/15/2003"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Gasoline Fuel System", "Sub Problem": "Tank Assembly problems", "description": "Every time I accelerate from a stop or come to a stop I hear a thumping noise from fuel sloshing around in the tank. The location of the fuel tank is right under the floor behind the driver's seat. It is very loud and annoying to hear.", "fail date": "  05/04/2003"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Seat Belt", "Sub Problem": "Seat Belt problems", "description": "I never got recalls fixed and dealer service marked as checked but not replaced and srs light has been on since service and I had to pay to get recalled due to emergency interlock was damaged.", "fail date": "  11/25/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Seat Belt", "Sub Problem": "Seat Belt problems", "description": "Traveling south bound on nevada Ave in colorado springs a car turned in front of us. Our front right hit his rear passenger side of vehicle, he was spun around and our airbags deployed. After getting out of vehicle to check on other driver I came back and had my wife and kid get out of vehicle. Police were on scene very quickly due to accident occurring in front of hospital, the officer noticed smoke in car and a couple minutes later there was a fire on passenger side of vehicle behind center garnish pillar. I tried to put it out while officer went to get a fire extinguisher burnt my hand due to burning plastic from lower center pillar garnish melting. Looks like fire was started somewhere in the seatbelt retraction area. No medical attention was needed and my hand was ok after a few days.", "fail date": "  06/27/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Seat Belt", "Sub Problem": "Seat Belt problems", "description": "The contact owns a 2003 Honda Pilot. The contact stated that a child was sitting in the middle seat next to the driver side window. The child was able to grab the shoulder belt of the middle seat belt and the seat belt became wrapped around the child. The seat belt then locked and began choking the child. The contact had to sever the seat belt in order to remove the child. The contact took the vehicle to the dealer and was told that the seat belt could not be replaced because it had been cut. The VIN was not available. The failure mileage was unavailable and the current mileage was 165,000.", "fail date": "  02/08/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Seat Belt", "Sub Problem": "Seat Belt problems", "description": "Srs light came on while driving and stays on.", "fail date": "  06/26/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Seat Belt", "Sub Problem": "Seat Belt problems", "description": "We bought our 2003 Honda Pilot assuming that it would be a great family vehicle. We have three small children and another on the way so our car is full of car seats. We have a backless boaster seat in the third row on the driver's side, a boaster seat in the third row on the passenger side, and a forward facing car seat in the second row driver's side. It is incredible difficult for me to get the children in the third row buckled because the seat belts are constantly getting \"stuck\" and have to be rethread all the way back. This is difficult because they get caught on the boaster seats that then have to be picked up and moved around to get the seat belt off. Also, the seat on the seat on the passenger side is too narrow and the seat belt buckles very low, close to the seat and it ends up underneath the boaster seat. These difficulties make it nearly impossible for my preschoolers to buckle by themselves and forces me to climb back in their seat to fix the seat belts and move the booster seat forward to buckle them in. It is incredible difficult and uncomfortable for an adult to climb into the third row seat, especially one that is seven months pregnant. We have tried moving the seats around and can not find any better positions for the car seats.", "fail date": "  09/18/2008"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Seat Belt", "Sub Problem": "Seat Belt problems", "description": "Driver's seat belt restraint on 2003 Honda Pilot came unbuckled while driving. I thought that perhaps I had not bucked it sufficiently. When tried to put metal piece on belt back into the locking device, it would not lock. Carried it to the dealer 7-7-08, and he had to order the part.", "fail date": "  07/05/2008"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Tire", "Sub Problem": "Tire problems", "description": "Yokohama geolander h/t-s go51 p235/70r16 cracking and separation of tire tread around entire circumference of tires. All 4 tires purchased 6/26/09 and only 27k miles. These were not dry rot cracks.", "fail date": "  07/20/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Tire", "Sub Problem": "Tire problems", "description": "Our 2003 Honda Pilot locked up on the highway due to transmission failure of the 2nd gear. We were traveling in the 3rd lane over 60 mph when both front tires locked and we skidded to a halt in less than 200 yards on the highway. Prior to our vehicle breaking down, there were no signs of danger, no unusual sounds, no blinking lights or any hesitation with the car. Our vehicle had 138,400+ miles and has been serviced regularly according to Honda's recommended maintenance schedules, including all transmission fluid changes. On may 7, 2004 with 36,384 miles, our vehicle had received a retrofit of the a/t oil jet kit due to Hondas 04-021b safety recall on the automatic transmission second gear. Luckily no one was injured and there were no other vehicles involved in the incident. The car behind us stopped just in time to avoid a collision. Our car could not be rolled into the breakdown lane as both front wheels were locked and we were stranded in the 3rd lane. A police officer was called to the scene and logged the incident as a disabled vehicle. The officer requested for immediate towing since we were in a dangerous location. The car was towed to a Honda dealer, who provided the following diagnosis and estimate:\n\"transmission internal failure\nboth front axles twisted\nneeds 2 tires - flat spots\nalignment $5,199. 14 plus tax\"\nwe opted not to repair the Honda and instead purchased a new non-Honda vehicle and received a trade-in value for as-is condition.", "fail date": "  08/17/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Tire", "Sub Problem": "Tire problems", "description": "The 2003 Honda Pilot has a vibration in the tires that the dealer has had in the shop three times, since day one to try to fix the tire vibration (70 mph and up, sometimes felt at lower speeds). The tires still emits a steady and obvious vibration that eminates from the steering wheel and seats. It seems to me that there is a flat spot in the tires. Pilot owners who experience this problem are entitled to Honda's unrelenting attention and commitment to correct this mystery.", "fail date": "  08/10/2002"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Latches/locks/linkage", "Sub Problem": "Door Latch problems", "description": "The contact owns a 2003 Honda Pilot. The contact stated that the chrome plating on the door handles was peeling and causing minor injuries to the contact¿s fingers. The contact mentioned that all four doors were affected by the failure. The problem persisted for the past two years. The vehicle was taken to a dealer, where it was diagnosed that all four handles needed to be replaced. The vehicle was not repaired. The manufacturer was notified of the issue. The approximate failure mileage was 150,000.", "fail date": "  10/01/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Latches/locks/linkage", "Sub Problem": "Door Latch problems", "description": "The contact owns a 2003 Honda Pilot. The contact stated while driving 25 mph the vehicle felt as though it was surging forward. The contact pulled over and put the vehicle into park and the rpm's started to rev-up on its own. The contact has taken the vehicle to a local mechanic for a diagnostic test. Thecontact stated the vehicle has many safety problem and thinks the manufacturer should be responsible for the repairs. The failure mileage was 120,000. Updated 05/06/10. The door lock cylindeers and ignition switch was replaced. The engine and steering locked up and the vehicle would not start. The key door lock broke and had to be replaced. The heater motor failed. Updated 07/06/10.", "fail date": "  03/04/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Latches/locks/linkage", "Sub Problem": "Door Latch problems", "description": ". The contact owns a 2003 Honda Pilot. The contact stated that three of her automatic door actuators failed. As a consequence she cannot unlock the vehicle from the outside. If there is an emergency, the inability to unlock the doors increases the risk for safety hazard. She contacted the manufacturer and a representative denied responsibility because there was not an existing recall. The failure has not been remedied. The failure and current mileages were under 109,000.", "fail date": "  02/10/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Latches/locks/linkage", "Sub Problem": "Door Latch problems", "description": "Three electric door locks failed on my Pilot, along with the lock assembly for the driver door.", "fail date": "  01/05/2008"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System Tank Assembly problems", "description": "Gas leaked from the top side of fuel tank under the driver side of vehicle. It has done this two times now while being filled up at two separate gas stations. Both of which were smooth flat surfaces. It does not overflow from the nozzle insert where you pump gas at. It comes from somewhere on the top side of tank and leaks until the gas goes below the spot from which it leaks.", "fail date": "  03/24/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2003 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System Tank Assembly problems", "description": "For few years I have been noticing terrible mileage, but thought the car was getting older. For definitely an year, there is a noticeable smell of gasoline in the car, again thought its the sign of an old car. But, last weekend I realized that this is a safety issue and finally got around whats happening. The fuel started dripping at the fuel tank - fuel line and is dripping at 1 drop per minute . . Not sure if it drips at the same rate all the time. Reading at all the complaints, it seems like NHTSA would only consider anything after someone dies. Sounds like useless posting over here, but just doing it for the benefit of others. This car had been leaking for a while, though the drip started very recently, thus giving very low mileage. This is a safety issue which should result in a recall.", "fail date": "  07/30/2015"}]