[{"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owned a 2006 Honda Pilot. The contact stated that while driving at an undisclosed speed, another vehicle rear-ended her vehicle, causing her vehicle to crash into another vehicle from the driver's side front door. The rear bumper and exhaust pipe detached. The driver's side air bag did not deploy. The contact sustained a back injury and received medical attention. A police report was filed. The vehicle was towed to the residence, where it was deemed totaled by the insurance company. The manufacturer was made aware of the failure, and a case was opened. Prior to the failure, the dealer had previously performed a recall repair for the driver's and passenger's side air bags. The failure mileage was approximately 187,000.", "fail date": "  11/16/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Diver airbag exploded while vehicle was sitting in yard, while changing the radator, it popped.", "fail date": "  01/03/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "I have not had this vehicle in 10 years. I have written Honda six times and called a dozen times. If someone has this vehicle and gets injured due to non-notification of a recall, and I show how long I have been trying to stop these letters coming to my house so you can find the right person, someone will be seriously liable.", "fail date": "  06/16/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2006 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags). The part to do the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure.", "fail date": "  11/08/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2006 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags); however, the parts to do the repair were unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The dealer (hendricks Honda) was contacted and ordered the part; however, the contact was still unable to get the vehicle remedied due to the part being used to repair another vehicle. The manufacturer was not made aware of the issue. The contact had not experienced a failure. Parts distribution disconnect.", "fail date": "  10/03/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2006 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags). The part to do the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was not made aware of the issue. The contact had not experienced a failure.", "fail date": "  09/28/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2006 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags); however, the part to do the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure.", "fail date": "  09/16/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2006 Honda Pilot. The contact received notification of NHTSA campaign number: 16v346000 (air bags); however, the part to do the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure. VIN tool confirms parts not available.", "fail date": "  09/07/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "2006 Honda Pilot. Consumer writes in regards to replacement parts not available to repair recall notice.", "fail date": "  09/01/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall.", "fail date": "  08/03/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2006 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags) and stated that the part needed for the repair was not available. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure. Parts distribution disconnect.", "fail date": "  07/31/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2006 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags); however, the part to do the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The contact had not experienced a failure. The manufacturer was made aware of the issue. VIN tools confirms parts not available.", "fail date": "  07/06/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2006 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags). The part needed to repair the vehicle was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was notified of the issue. The contact had not experienced a failure. Parts distribution disconnect.", "fail date": "  07/06/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2006 Honda Pilot. The contact received a recall notification for NHTSA campaign number: 16v344000 (air bags) and stated that the part needed was unavailable to perform the recall repair. The manufacturer was notified of the issue. The contact had not experienced a failure. Parts distribution disconnect.", "fail date": "  07/06/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2006 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags); however, the part to do the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was not made aware of the issue. The contact had not experienced a failure. VIN tool confirms parts not available.", "fail date": "  07/05/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2006 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags); however, the parts for the recall were not available. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was not notified of the issue. The contact had not experienced a failure. Parts distribution disconnect.", "fail date": "  07/05/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. I received a recall notice on July 5th, 2016. Immediately after receiving the notice, I contacted my nearest Honda dealership (renner in columbus, indiana). After giving him the paper so he could look at the recall notice and schedule my car for an appointment, he told me that he could not fix the problem. He told me that the only cars it affected were in the tropics. Why would I receive a notice then??.", "fail date": "  07/05/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2006 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags); however, the part needed to perform the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The contact had not experienced a failure. VIN tool confirms parts not availalbe.", "fail date": "  07/05/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2006 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags); however, the part to do the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was not notified of the issue. The contact had not experienced a failure. VIN tool confirms parts not available.", "fail date": "  07/02/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall America Honda is unable to remedy the defect within a reasonable period of time within 60 days I first contacted the dealer for a repair appointment.", "fail date": "  07/01/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2006 Honda Pilot. The contact received notification of NHTSA campaign number: 16v346000 (air bags). The part to do the recall repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was aware of the issue. The contact had not experienced a failure. VIN tool confirms parts not available.", "fail date": "  06/23/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. I scheduled the recall replacement over 3 months ago and Honda still doesn't have a replacement air bag. Honda's recall document suggests that you avoid having a passenger sit in the front passenger's seat until the recall repair has been performed. This is a huge inconvenience to us.", "fail date": "  06/15/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2006 Honda Pilot. The contact stated that the recall notice for NHTSA campaign number: 16v344000 (air bags) was received in June of 2016. After contacting the dealer and the manufacturer on multiple occasions, the contact was informed that the parts needed for the recall remedy were still not available and no estimated time for receiving the parts could be provided. The contact had not experienced a failure. VIN tool confirms parts not available.", "fail date": "  06/01/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2006 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags); however, the part to do the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure. Parts distribution disconnect.", "fail date": "  05/24/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2006 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags). ; however, the part to do the recall repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was not aware of the issue. The contact had not experienced a failure. Parts distribution disconnect.", "fail date": "  05/23/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2006 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags). The part to do the recall repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was aware of the issue. The contact had not experienced a failure. VIN tool confirms parts not available.", "fail date": "  05/23/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2006 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags). The part to do the repair was not available. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure. VIN tool confirms parts not available.", "fail date": "  05/23/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2006 Honda Pilot. The contact stated that the recall notice for NHTSA campaign number: 16v344000 (air bags) was received in may of 2016. After contacting the dealer and the manufacturer on multiple occasions, the contact was informed that the parts needed to repair the vehicle were still not available and no estimated time for receiving the parts could be given. The contact had not experienced a failure.", "fail date": "  05/01/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2006 Honda Pilot. The contact received notification of NHTSA campaign numbers: 15v320000 and 16v344000 (air bags); however, the parts to do the repairs were unavailable. The manufacturer exceeded a reasonable amount of time for the recall repairs. The manufacturer was not notified of the issue. The contact had not experienced a failure. Parts distribution disconnect.", "fail date": "  02/08/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "611 amherst rd.", "fail date": "  06/26/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Tl- the contact owns a 2006 Honda Pilot. The contact received NHTSA recall campaign 14v351 (air bags) however the part to do the repair is not available. The contact felt the manufacturer exceeded a reasonable amount of time. The vehicle had not experienced the failure. The VIN was not available. Rl.", "fail date": "  04/03/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The Honda dealer has failed to replace/repair the takada air bag within a reasonable amount of time from my first contact for a repair appointment. We requested an appointment during February of 2015.", "fail date": "  02/28/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2006 Honda Pilot. The vehicle was included in NHTSA campaign number: 14v351000 (air bags) however, the part needed to repair the vehicle was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was not notified of the issue. The contact had not experienced a failure.", "fail date": "  02/27/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "2006 Honda Pilot. Consumer would like a copy of recall letter for his vehicle. Consumer hasn't received letter yet. It was confirmed, the vehicle was on the recalled list.", "fail date": "  02/02/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Tl-the contact owns a 2006 Honda Pilot. The contact received notification of NHTSA campaign number: 14v351000 (air bags) however, the part for the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall remedy. The manufacturer was not notified of the issue. The contact had not experienced a failure. Djr.", "fail date": "  01/22/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The contact owned a 2006 Honda Pilot. The contact stated that initially her check engine light had illuminated on her instrument panel. She then took the vehicle to an independent mechanic who replaced both her fuel injectors and spark plugs. The mechanic then took the vehicle to a dealer since the check engine light remained illuminated on the instrument panel. The pcm software was updated by the dealer; however, the light still remained. Upon picking up the vehicle, the contact was informed that her check engine light remained illuminated due to a misfire in cylinder#1. The contact was assured by the mechanic that the vehicle passed the pcm test and that the vehicle was safe to drive. While dropping her child off at school, a white smoke began to emit from the hood of the vehicle. The vehicle quickly became engulfed in flames as the contact exited the vehicle. The authorities were called to the scene and the local fire department was able to extinguish the fire. A fire and police report were filed. No injuries were reported. The vehicle was towed to an independent mechanic where it was deemed a total loss. The dealer nor the manufacturer had yet to be notified of the failure. The vehicle was destroyed. The failure mileage was approximately 256,000.", "fail date": "  04/13/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "While moving slowly in a private drive and turning steering wheel to the right the car suddenly accelerated to full throttle causing the car to crash into another parked car and a support post of a carport.", "fail date": "  11/22/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Voice commands shutting radio off putting radio on air on air off asking to repeat . Dashboard lights going haywire lost all electrical to dashboard instruments car started vibrating while driving replaced battery and alternator and battery light flashing on and off but battery and alternator testing fine car accelerates on own with cruise set all this happened while I was driving on a city street. Car accelerated on own while I was driving on highwy doing 65 my I had to apply brakes and shut down cruise. Had computer tested to see if anything wrong had computer checked to see whats wrong with engine indicated no codes everything fine. Also while making a turn steering wheel locks up but everything ok with power steering fluids. This is very unsafe I have 4 grandchildren that I pick up from school im afraid to drive my vehicle with them in car even myself I dont want anyone getting hurt or killed because of Hondas knowledge of all the problems with electrical system and engine problems that they wont do a recall because to expensive.", "fail date": "  08/26/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Engine continues to misfire no matter what repairs have been done like plugs. Runs rough and unless you restart the engine it will not run properly. Especially when the engine is cold.", "fail date": "  06/15/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The contact owns a 2006 Honda Pilot. While driving at any speed, the vehicle lost power and shook. The check engine and oil warning lights illuminated. The vehicle was taken to an independent mechanic who diagnosed that the engine was failing and needed to be replaced. The vehicle was towed to the dealer where it was diagnosed that cylinder #2 misfired and oil froze into the head of the engine. The contact was informed that the engine needed to be replaced. The manufacturer was not notified of the failure. The failure mileage was 74,000.", "fail date": "  06/06/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The contact owns a 2006 Honda Pilot. The contact stated that the engine block was fractured. The vehicle was taken to the dealer where the failure was confirmed. The vehicle was not repaired. The manufacturer was contacted about the failure. The failure mileage was unavailable. Updated 9/4/13 the engine block was cracked. However it was replaced at a cost of $ 2,400. The engine cracked also affected the catalytic converter. The engine light illuminated, and a diagnosis revealed the spark plugs were damaged. The consumer paid $500 for a tune-up and replacement of the plugs and hoses. After the vehicle was serviced, it began to overheat. The vehicle was taken back to the dealer, where they added coolant.", "fail date": "  07/16/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Attention!!! all Pilot/oddy/ridgeline/3. 5 v6 Honda owners. Check your plugs and coils just wanted to get the word spread around there is a serious issue with the Honda 3. 5 v6 engine which can lead to serious damage to the cylinder head and possibly the entire engine. I didn't learn of this until recently, when the spark plug in the #5 cylinder shot out of the head and destroyed the coil, and trashed the threads. I found a bunch of different people this has happened to, and all of the results aren't good. The extended warranty which was through Honda care denied my claim because they said it was damage from the spark plug and they don't cover spark plugs. What a load. If they want to play that game, what the heck would they ever have to cover? sorry sir, there's a short in your electrical system but it's because of the insulation in the wires and we don't cover damage from the insulation. . . Grrrrrr. . . So I called Honda and we'll see if they can do something for us as loyal Honda customers - I even mentioned that we've got a Honda crv. . . Sigh. . . Honda has a duty to manufacture and sell safe vehicles and to fix or pay for safety defects in its vehicles,\" \"instead, Honda has refused to acknowledge any responsibility for the alleged defect and forced its customers to pay for the repairs out of their own pockets. Like yours truly, engine blown and now I own money on a car that I can not drive. I want to start a class action lawsuit but without a supporting incident I would not be able to do this please responds to this message.", "fail date": "  05/31/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The contact owns a 2006 Honda Pilot. The contact stated that while traveling approximately 70 mph, the vehicle began to lose acceleration power. The vehicle was able to be driven with extreme caution to the contact's residence and was later taken to a private mechanic, where it was determined that cylinders 1-6 were misfiring. The contact was also advised that there was a computer failure. The vehicle was repaired. The manufacturer was not contacted about the failure. The failure mileage was approximately 105,000.", "fail date": "  04/20/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The contact owns a 2006 Honda Pilot. While driving at approximately 65 mph, the vehicle completely shut down and the vsa light illuminated. The vehicle was able to restart. The vehicle was taken to the dealer for diagnostic testing. The vehicle was not repaired. The manufacture was notified of the failure. The failure mileage was unknown. The VIN was not available.", "fail date": "  10/11/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Hello,I have a Honda Pilot 06 I am just going to a bad rap now my car engine had a miss fire on cylinder 2 and 5 and on top of all that my piston is blown but I had a warranty 100000. 00 what are the odds the expire because my engine just hit 100331 they would not honor it they saying it cause by the spark plug for real there something on this engine there are not telling us I made so much research that I was maze with the complain I saw and this is why I am responding to you ,and now I have no car and I can not afford a engine right now I am taking them to a small claims and bbb and anything that I can out them out there for selling a car that there is a problem with the engine but there are not admitting to it I need support on this so I can have a legit case .", "fail date": "  07/31/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The catalytic converter was replaced on the vehicle at around 60k. The check emission light was going on and off the past few weeks (starting in July 2012). Took the vehicle to the dealer. Now at around 90k (August 2012), the replaced catalytic converter needs repairs (approximately $1000 in repairs). Why is the vehicle having problems again with the catalytic converter? shouldn't the life of the catalytic converter be more than 30k-60k?.", "fail date": "  07/02/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "2006 Honda, lx, 2wd Pilot was making a slow turn in intersection and sudden acceleration was noted. Felt like cruise control had been turned on but had not been turned on. Acceleration was stopped using the brake. 2 similar instances in the past 6 months.", "fail date": "  05/24/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Engine light started coming on even though vehicle was running ok. Stopped and had a diagnostic check done. It said that all 6 cylinders were misfiring. The light stayed on for 2-3 days then went off. The auto drove fine the whole time. This has been happening off and on ever since. I keep having it checked and same thing. . . All 6 cylinders misfiring.", "fail date": "  01/01/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I was backing up out of my garage in my 2006 Honda Pilot when the vehicle suddenly accelerate. I had my foot resting lightly on the brake and I was able to stop the vehicle safely. I was then able to drive off.", "fail date": "  06/05/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "My 2006 Honda Pilot experienced sudden acceleration this morning while driving at about 25 mph. The engine suddenly reved up and the auto lunged foward. I applied the brake but this did not slow me down quickly enough. I then managed to get the car in neutral and tapped the gas pedal until the high revving stopped. The incident occurred at 11:00am eston March 01, 2011, the Pilot had 57789 miles at time of incident.", "fail date": "  03/01/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The contact owns a 2006 Honda Pilot. While driving approximately 50 mph on normal road conditions, the engine warning indicator illuminated on the instrument panel. The vehicle was taken to the authorized dealer for diagnostic testing, which indicated that the engine misfired. The technician replaced the head gasket and recommended that a specific type of fuel be placed in the vehicle. The high level of lethal build-up in the engine contributed to the failure. The vehicle was taken to an authorized dealer on six separate occasions for the same failures, but there were no resolutions. The failure mileage was 24,000 and current mileage was 39,050.", "fail date": "  05/10/2008"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Car was parked. I started it up and put it in reverse and it did not move. I put it back in drive and didn�t� move, waited for a few minutes, tried again and the brakes squeezed really tight but was back to normal. Drove to work and on the way back brakes got tight and started to overheat and smoke came out of the passenger side front wheels. Stopped by the side of the road, waited for half an hour until cooled down and called a tow service. Call local Honda dealer and they do not have a recall even though there are more than 200 complaints.", "fail date": "  11/08/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Braking system to apply braking force with no driver input at any time.", "fail date": "  06/03/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The vsa device will engage after a mile of driving and will not. Allow you to accelerate quickly you must slowly press the pedal. Models before 2006 were part of a recall (13v-092) however same issue on 2006 is not part of the recall.", "fail date": "  05/01/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "While driving the vehicle the vsa light and triangle light will come on and the brakes will apply hard with very little pressure applied to brake peddle. Sometimes the vsa light will come on as soon the vehicle is started and will have the same problem with the brakes . Turning off the vsa button after starting the vehicle does not make the problem go away , have almost been rear ended several times since this happens ,the brakes stop the car then the vsa light comes on . The Honda dealership reprogrammed the vsa module but shortly afterward the same problem occurs . Now they say it needs a new vsa module at $2000 plus dollars, seems like I am not the only 2006 Pilot having the same problem, only have 74000 miles on vehicle for having it 13 years this happens on city streets at 40 mph or so afraid to get on the highway because I wouldn't want this to happen at 60-70 mph. While this seems to be an intermittent problem it may go several months with out a problem or the vsa light coming on then it happens out of the blue.", "fail date": "  12/03/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The vsa light started to come on randomly while I was driving the car. Whenever that happened there would also be a noise and smell as metal grinding against metal. This accompanied with a fraction of a second the brakes and steering wheel would lock up.", "fail date": "  05/31/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Brakes are locking up while driving without me stepping on the brakes.", "fail date": "  06/16/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "This is the exact issue that the 2005 Honda Pilot has with its vsa the recall for this is NHTSA recall # 10694296 with over 625 complaints. As everyone describes after one mile of driving the vsa will come on if you attempt to accelerate when on it will engage the brakes but not fully so it shutters and rpm soar but you go no where causing daily near miss accidents. Honda dealers acknowledge this module is the issue but due to the 2006 not being on the govt recall list they will not repair or replace you have to pay to have it done at a cost of 1650. 00. The Honda mechanic showed me the whitepaper Honda has on how to replace this module and the issue it creates but unwilling to stand behind repairing it for free only offer a 125. 00 discount on the repair. So im clear 1. Vsa light comes on stays on and vsa switch will not turn this function off as it is designed to. 2. When you attempt to make rapid acceleration the vehicle will not respond just shutters. 3. You have to make a slow smooth acceleration up to your desired speed. 4. You also when backing the vehicle will hear a loud thud and feeling like you were rear ended due to the brakes locking and unlocking.", "fail date": "  06/01/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "My wife's Honda Pilot 06 has been experiencing almost catastrophic vsa symptoms while driving normal speeds. Brakes iwill lock up without pressing brakes and abs will come on and all vsa lights. Have towed vehicle twice to mechanic and problem clears itself and then without warning happens again thankfully no ones been killed. Contacted Honda they deny any issues with vsa system.", "fail date": "  01/30/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "When driving my Honda Pilot (2006) the check engine light will com one with indicating a problem with the vsa. What happens next is the car slows down significantly and comes to a complete stop. Which means you can be on the highway and the car slows down. I check to see if there was a recall on this issue, and there is one for the 2005 model, not the 2006. However, it is the same problem, which means the problem was not fixed in the next model year. I reached out to Honda corporate and they indicated that they had no recall for this issue for the 2006 model and could not help me. I told them it was the same issue as the 2005 and apparently the problem was not fixed in the next still no help. Please note the following concerning the 2005 model. Tsa action number: ea13002 model year 2005. Same problem. On March 14, 2013, american Honda motor CO. , inc. (Honda) submitted a defect information report to NHTSA identifying a defect in the vehicle stability assist (vsa) system in approximately 183,576 model year (my) 2005 Honda Pilot, Acura rl and my 2005-2006 Acura mdx vehicles (NHTSA recall no 13v-092). The population and failure counts provided pertain only to the my 2005 Honda Pilots that were the subject of this investigation. Honda's recall addresses two conditions in the vsa system that could result in inappropriate brake activation.", "fail date": "  08/03/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "I had just started slowing down to turn at a stop light when the vsa warning light came on and my car became hard to steer. It almost came to a complete stop but I was at a major intersection and had no choice but to try and keep driving to avoid getting hit. I somehow managed to get it turned but it didn't want to speed up when I tried to accelerate. I managed to get into a parking lot and turned it off. I let it sit for a few minutes as we caught our breath (two of my kids were with me and it had scared them too) and then cranked it up again. The vsa light was gone but when I put it in reverse to see what it would do, it wouldn't move. It was like the parking brake was on. I then realized that's what it seemed like as I was driving when it happened. I'd thought the car wasn't wanting to run but it was like the brakes were on. Anyway, the brake pedal was stiff and I couldn't push it at all. I tried pumping the pedal to see if it would release but even though I could put the car in either park or drive, it wouldn't move. It was like the parking brake was on or I was holding the brake, neither of which was true. I called a nearby shop and two technicians came to where we were. They cranked it up and everything seemed okay but it was taken back to the shop where they ran every test possible and drove it three different times but nothing happened. They're perplexed as to what's wrong. I came home and got online only to find that there are tons of postings online about the exact same thing happening to others but only the 2005 Pilot has been recalled. Honda, I love my Pilot and don't want to get rid of it nor do I not want to buy another one when the time comes. But, I'm not putting my kids' lives in danger nor my life in danger to drive the car I love. Please, please, please consider recalling the 2006 models as well since there's definitely a problem with them too.", "fail date": "  12/26/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "While attempting to slow at a traffic light, I applied pressure to the brake pedal only to have the pedal push to the floor and act as though there were no brakes. The anti-lock brake system engaged and threw me and my passenger forward. Then the vsa light came on. I was able to reset the light by turning the vehicle off and on. The problem is intermittent and very frightening.", "fail date": "  04/13/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "On three separate occasions over a two-day period, the vehicle momentarily brake hard when very light pressure was applied to the brake pedal. The vsa (vehicle stability assist) warning light came on when this occurred but did not stay illuminated after the vehicle was shut off and restarted. These incidents occurred December 23rd and 24th, 2013, and the temperature was approximately 20-30 degrees. No injuries occurred, but thankfully no other vehicles were behind us when it happened. This sounds like the same issue that the 2005 Honda Pilots were recalled for, however, the local Honda dealership will not include my model in the recall and will therefore charge me for any fix that might occur.", "fail date": "  12/24/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "I just bought a used Honda Pilot after having a baby, needing a bigger and safer car for my kids. 5 days after buying my car the vsa light came on, so I took it to the dealership and they said they fixed it. 3 weeks later it came back on and as I was driving with my kids in the car all of a sudden full brakes were applied for no reason. My foot was not even on the brake pedal, thank god no one was behind me. I had no idea why that had just happened. So I went online to research what the vsa system, not thinking the braking had anything to do with the vsa system, then I come across a Honda forum and find out this has happened to alot of other Pilot owners, and that the braking is connected to the vsa system. This is a dangerous hazard and should be addressed ASAP before someone gets killed. Unfortunately alot of people tailgate and if this were to have happened on the freeway it could have been deadly. I will also be writing a letter to Honda to see if there any kind of recourse for us Pilot owners.", "fail date": "  03/13/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "I have a 2006 Honda Pilot which I believe has a similar problem as toyotas recent recalls about sticky acceleration. I am the first owner of this SUV and noticed the problem during the very first year itself. That time my vehicle failed to stop on a stop sign. The problem I faced was when I applied brake, the car didn't stop and it continued in the acceleration mode and finally stopped after crossing the stop sign. I had reported this problem immediately to the Honda dealer, from where I purchased the vehicle. They inspected the vehicle and returned to me saying that they didn't find any problem. In fact they laughed at me that I didn't apply the brake properly. The dealer didnt document my concern. After that till now (almost 4 years) I am experiencing this kind of problem quite often. Because of this problem, I have to always make sure to brake an additional 2 or 3 feet ahead of my proposed stop as the vehicle may not stop where I think it should stop. If it does not stop, I brake harder and at that time I hear the acceleration is still on. I always ignored this problem mainly because this happens quite randomly like maybe a couple of times every month. I have not been able to figure out what exactly triggers this. Recently after reading about the Toyota recall, I have a feeling that my vehicle also has the similar problems and I notified the american Honda company. They actually didn't show much interest in addressing my problem mainly because my vehicle already has 52k miles and the warranty period (60k miles) will end soon. Should I be really concerned? are there any independent service engineers who can take a look at my vehicle?.", "fail date": "  02/15/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Hi ,\nI have 2006 Honda Pilot having problems with brakes,sometimes when it goes over pot hole or through water or little ice the brakes stop working and it may cause bad accident.", "fail date": "  01/21/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "While driving at any speed, vsa light comes on and the car comes to a stop. It feel as though the brakes are engaged and vehicle will not move. This is a serious safety hazard since we could get rear ended, especially if this were to occur oba highway. We have taken the Pilot for repair 3 times for this issue. A few months ago, the dealership reprogrammed the vsa module and now we've been told it has to be replaced for $2500. There is a recall on this part in the 2005 Pilots and some 2006. I have contacted Honda twice to request they wrvice this under the recall but was told that since my VIN does not qualify for the recall, they will not pay for the repair. This is a very serious safety risk which is clearly being experienced by many 2006 Pilot owners and Honda simply won't do anything about. May take a class action lawsuit. I pray no one is severely injured due to this malfunction.", "fail date": "  07/18/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "The vsa light comes on and the anti-lock brakes activate unexpectedly. This happens on dry roads, while accelerating, or maintaining speed, even with cruise on at 70+ mph. It caused a sudden loss of speed, and had caused the vehicle to veer in a different direction. This is ongoing, not an isolated occurrence and began within 2 weeks after we purchased the vehicle used.", "fail date": "  10/18/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "While driving the vehicle the vsa light and triangle light will come on and the brakes will apply hard with very little pressure applied to brake peddle. Sometimes the vsa light will come on as soon the vehicle is started and will have the same problem with the brakes . Turning off the vsa button after starting the vehicle does not make the problem go away , have almost been rear ended several times since this happens ,the brakes stop the car then the vsa light comes on . The Honda dealership reprogrammed the vsa module but shortly afterward the same problem occurs . Now they say it needs a new vsa module at $2000 plus dollars, seems like I am not the only 2006 Pilot having the same problem, only have 74000 miles on vehicle for having it 13 years this happens on city streets at 40 mph or so afraid to get on the highway because I wouldn't want this to happen at 60-70 mph. While this seems to be an intermittent problem it may go several months with out a problem or the vsa light coming on then it happens out of the blue.", "fail date": "  12/03/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "The vsa light started coming on intermittently while the vehicle was being driven and the brakes would engage to varying degrees. This has happened several times in the last two weeks while the car was being driven this is my wife's car and she is scared to drive it now. It can be a safety hazard to her and those around her if it occurs at the wrong time.", "fail date": "  06/06/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "The vsa system on multiple occasions has applied the vehicles brakes while driving. It has happened during stop and go driving as well as while driving above 35 mph. When it happens the vsa light as well as the ! vsa light comes on. The vehicle comes to a very abrupt stop, and I am no longer able to drive. The only way I am able to drive the vehicle is by dissableing the vsa system completely. Luckily it has only happened once while driving at highway speeds. I am very worried to drive my vehicle with my children in the car due to just simply not knowing when it will happen again. I have taken the Pilot into my local Honda dealership and they can not diagnose the problem. I have seen a recall on the 2005 model and all symptoms sound the same as the issues my 2006 Pilot is having. In doing some research online it sounds as though Honda is simply ignoring the issue to avoid there own personal loss. This issue is not a minor one I feel my as well as my families lives are in danger while driving my vehicle.", "fail date": "  12/01/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "My wife's Honda Pilot 06 has been experiencing almost catastrophic vsa symptoms while driving normal speeds. Brakes iwill lock up without pressing brakes and abs will come on and all vsa lights. Have towed vehicle twice to mechanic and problem clears itself and then without warning happens again thankfully no ones been killed. Contacted Honda they deny any issues with vsa system.", "fail date": "  01/30/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "The vsa, abs and vtm-4 lights on the vehicle come on and off and the car will stop or drive erratically. It also makes a grinding noise. I've taken it in and no one can tell me why this is happening. This has been going on since October of 2015. I'm afraid it will cause an accident.", "fail date": "  10/15/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "I had just started slowing down to turn at a stop light when the vsa warning light came on and my car became hard to steer. It almost came to a complete stop but I was at a major intersection and had no choice but to try and keep driving to avoid getting hit. I somehow managed to get it turned but it didn't want to speed up when I tried to accelerate. I managed to get into a parking lot and turned it off. I let it sit for a few minutes as we caught our breath (two of my kids were with me and it had scared them too) and then cranked it up again. The vsa light was gone but when I put it in reverse to see what it would do, it wouldn't move. It was like the parking brake was on. I then realized that's what it seemed like as I was driving when it happened. I'd thought the car wasn't wanting to run but it was like the brakes were on. Anyway, the brake pedal was stiff and I couldn't push it at all. I tried pumping the pedal to see if it would release but even though I could put the car in either park or drive, it wouldn't move. It was like the parking brake was on or I was holding the brake, neither of which was true. I called a nearby shop and two technicians came to where we were. They cranked it up and everything seemed okay but it was taken back to the shop where they ran every test possible and drove it three different times but nothing happened. They're perplexed as to what's wrong. I came home and got online only to find that there are tons of postings online about the exact same thing happening to others but only the 2005 Pilot has been recalled. Honda, I love my Pilot and don't want to get rid of it nor do I not want to buy another one when the time comes. But, I'm not putting my kids' lives in danger nor my life in danger to drive the car I love. Please, please, please consider recalling the 2006 models as well since there's definitely a problem with them too.", "fail date": "  12/26/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "The vsa system seems to be applying a small amount of brake force without any input by the driver. The small amount of break force seem to be constantly pulling the vehicle to the left. At times, the amount of brake force applied exceeds the driver's intended input. The vsa warning light and abs light are constantly on. The vehicle has been serviced and is up to date on all maintenance. Dealer and another mechanic say it is the vsa or yaw sensor in the center console that needs to be replaced at a cost of $1,000-$2,0000. It seems to be the very same issue that the recall on the 2005 model addressed.", "fail date": "  12/02/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "While driving the abs and vsa lights went on and I had to make a rapid stop when a car pulled in front and the my car swerved suddenly and I almost lost control, with the sensation that it was going to turn over. This has continued every time I put the brakes on quickly to make a sudden stop.", "fail date": "  10/09/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "While I was driving out of my husband work parking lot only going 20mpg in my truck started brakes made a loud noise and the steering wheel began going to the right which made me force to turn the wheel to the left so I can stabilize the vehicle the vsa light came on as I proceeded to check out my truck well the truck drove fine the next day after I dropped my kids off to school. Then while I was driving home the vehicle vsa warning light again turned on and my vehicle was being forced to the right where there's the ocean I gained control of my vehicle once again and steered it to the left then drove to the safety of my house which I then had my truck towed the Honda dealership and began to work on the truck and vsa sensor which the Honda dealership is charging me 1200$ to get it fixed I feel that the vsa sensor not working and going out is a safety hazard to my children and myself.", "fail date": "  10/06/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "Driving at slow speed, sometimes when just starting to move the vehicle, there is a shuddering on the brake and the vsa warning light comes on. This happened only occasionally at first and the warning light would go off. The warning light now is always on. The vehicle has been serviced and is up to date on all maintenance. Dealer and another mechanic say it is the vsa or yaw sensor in the center console that needs to be replaced at a cost of $1,000-$2,0000. It seems to be the very same issue that the recall on the 2005 model addressed. Honda says 2006 models are not part of the recall. How many complaints does it take to be added to the recall? is this a safety issue? the vehicle won't pass state inspection next year if the warning light is on.", "fail date": "  07/26/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "While attempting to slow at a traffic light, I applied pressure to the brake pedal only to have the pedal push to the floor and act as though there were no brakes. The anti-lock brake system engaged and threw me and my passenger forward. Then the vsa light came on. I was able to reset the light by turning the vehicle off and on. The problem is intermittent and very frightening.", "fail date": "  04/13/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Vsa Warning Light On problems", "description": "On three separate occasions over a two-day period, the vehicle momentarily brake hard when very light pressure was applied to the brake pedal. The vsa (vehicle stability assist) warning light came on when this occurred but did not stay illuminated after the vehicle was shut off and restarted. These incidents occurred December 23rd and 24th, 2013, and the temperature was approximately 20-30 degrees. No injuries occurred, but thankfully no other vehicles were behind us when it happened. This sounds like the same issue that the 2005 Honda Pilots were recalled for, however, the local Honda dealership will not include my model in the recall and will therefore charge me for any fix that might occur.", "fail date": "  12/24/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "While moving slowly in a private drive and turning steering wheel to the right the car suddenly accelerated to full throttle causing the car to crash into another parked car and a support post of a carport.", "fail date": "  11/22/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "We were leaving the driveway on christmas eve, we suddenly heard a loud thunk followed by a grinding noise from beneath the vehicle. We stopped immediately and exited the vehicle to see what had happened. I expected to find that we had run over a bicycle but instead found the entire rear axle hanging from the springs. Both rear suspension mounts had catastrophically failed pulling completely out of the subframe. The subframe crossmember and a number of components were found to be heavily rusted and severely structurally compromised. We had planned to drive about 80 (predominantly freeway) miles each way that day to visit family for the holiday. It is a small miracle that these failed in the driveway and not on the freeway at 70 miles per hour. A catastrophic failure like this at freeway speeds could be deadly! a quick google search revealed this to be a relatively common problem with this vehicle and should warrant a recall. Please don't wait until someone is killed by this obvious design flaw.", "fail date": "  12/24/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "My wife was turning into our garage when the engine suddenly reved up causing her to crash into several items in the garage (air compressor,gas grill,shop vac,shelving, and other things)pushing them against the back wall before stopping and allowing her to turn the car off. She had the brake fully depressed and the steering wheel turned but had no control. The car is a 2006 Honda Pilot with about 170,000 miles.", "fail date": "  07/04/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Took vehicle in for nys inspection and the mechanic called me to tell me he cannot pass the inspection. The rear sub-frame has severe corrosion. There are large sections completely rusted out. He said no one would pass this vehicle's inspection. He said there is a high risk of the rear suspension totally collapsing resulting in a loss of control of the vehicle. He said just hitting a bump in the road hard enough will cause this. Said he has never seen corrosion this bad on a 12 year old vehicle, even in nys.", "fail date": "  01/14/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "While pulling into a parking lot a loud bang happend in our 2006 Honda Pilot. We thought we had bottomed out. It turns out that the rear subframe, suspension, and drive train had fallen out of the rear crossmember. This is due to premature rust and inadequate metal used in the rear subframe. The rear subframe and suspension is only being held in with 2 more rusty bolts. This vehicle is not rusty anywhere else and is in excellent condition. It does have 165,000 miles on it. The vehicle is no longer safe to drive . I hate to think what would have happened at 70 mph on the highway with my family. This is a serious safety issue and needs to be addressed immediately. The certified Honda dealer that I took it too says they can't fix it, and the vehicle is junk. The vehicle is in excellent condition in every other aspect. The failure is obviously a manufacture defect. I have e-mailed Honda, but they have not responded to me except for a auto response e-mail. This vehicle is worth about $6000 before this happened.", "fail date": "  09/29/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Tl the contact owns a 2006 Honda Pilot. While the vehicle was being serviced at buerkle Honda (3360 hwy 61 n, st paul, mn 55110, (651) 490-6600), the technician noticed that the part located between the frame and the body was corroded. The contact was informed that the vehicle was unsafe to drive and could not be repaired. The manufacturer was not notified of the failure. The approximate failure mileage was 170,000. The VIN was not available.", "fail date": "  08/29/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "On 8/18/18, while driving on a highway at about 50 mph, we heard a loud thud. Then when the accelerator was pushed, the car made a loud noise. I called my mechanic thinking it might be the exhaust. When he looked at it on 8/22/18, he informed me the rear sub frame was pulling out of the body, and the car was not safe to drive. He said this shouldn't have happened to a car that is 12 years old, and in good mechanical condition. He said the only thing holding the rear frame up was my exhaust pipe.", "fail date": "  08/18/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Rear sub-frame mount has separated from frame of the vehicle - car has never gone off roading - all highway miles - car was well maintained - it shouldn't have happened.", "fail date": "  03/14/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Paint is shot on hood,clear coat is defective.", "fail date": "  10/17/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Noticed clear coat non existant on most of vehicle. Vehicle is white and you can wipe your hand over most any area (wet or dry) and you will have white paint on your hand.", "fail date": "  07/01/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Wet floors in footwell area. Common problems on many years of Pilot/ridgeline vehicles. Honda refuses to address this issue under factory bumper-bumper warranty and Hondacare extended warranty, yet Honda is aware and issued a TSB surrounding footwell leaks.", "fail date": "  03/29/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "The new '2006 Honda Pilot had less than 8000 miles on it, and water was somehow getting into the vehicle from the roof and underneath the car , and was soaking the front carpets. I would have never noticed it if I had not decided to vacuum the carpets. During the winter months I noticed a dark substance underneath the seats, and now I realized it was water turned to ice. I realized whenever it rained water got into the vehicle, and remained for a few weeks unless one took out the mats. . Read more...\n", "fail date": "  04/19/2007"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Latch on the rear pull down door will not hold tight. I close it so that the rear door seems closed well and tight. After driving a little while, very often, my light comes on showing rear pull down lock is not closed! when I check it out, I find that it is not closed tight. I can see it protruding slightly, compared to how it looked as I closed it initially! I can't tell exactly when it began it wasn't that often and I thought I or my husband just didn't close it tight enough.", "fail date": "  11/25/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "2006 Honda Pilot ex mileage: 144,309 I was accelerating from a stop when I felt a jolt coming from the rear of the car. Several warning lights lit up in the dashboard, there was a loud exhaust leak, and the car was no longer accelerating. There was an auto care center 50 yards away so I slowly drove it there for an inspection. The mechanic lifted the vehicle and showed me that the back two rear subframe mounts were detached from the body which made the car inoperable. There was no visible rust on the undercarriage; the subframe mounts rusted from the inside out. My insurance company would not cover the damage as it was a rust issue. The car was irreparable so I had to total the car and received 10% of what the car was worth running from the junk yard. I purchased the Pilot new in Feb. 2006 and performed all the recommended Honda maintenance. I personal performed all oil and break jobs so I was familiar with the undercarriage of the car. I did not see any rust under the car that would have alerted me there was a potentially dangerous issue with the rear subframe. A google search turned up several other Honda Pilots of this generation having the same subframe rust as mine with the same catastrophic failure of the rear mounts. I believe that this is a manufacturing defect in that water was allowed to pool between the layers of steel in the unibody. The car had 144,309 miles on it and was mechanically in great condition until I had this issue.", "fail date": "  04/14/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Vsa light and code 84-1.", "fail date": "  03/15/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The vsa device will engage after a mile of driving and will not. Allow you to accelerate quickly you must slowly press the pedal. Models before 2006 were part of a recall (13v-092) however same issue on 2006 is not part of the recall.", "fail date": "  05/01/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "When driving my Honda Pilot (2006) the check engine light will com one with indicating a problem with the vsa. What happens next is the car slows down significantly and comes to a complete stop. Which means you can be on the highway and the car slows down. I check to see if there was a recall on this issue, and there is one for the 2005 model, not the 2006. However, it is the same problem, which means the problem was not fixed in the next model year. I reached out to Honda corporate and they indicated that they had no recall for this issue for the 2006 model and could not help me. I told them it was the same issue as the 2005 and apparently the problem was not fixed in the next still no help. Please note the following concerning the 2005 model. Tsa action number: ea13002 model year 2005. Same problem. On March 14, 2013, american Honda motor CO. , inc. (Honda) submitted a defect information report to NHTSA identifying a defect in the vehicle stability assist (vsa) system in approximately 183,576 model year (my) 2005 Honda Pilot, Acura rl and my 2005-2006 Acura mdx vehicles (NHTSA recall no 13v-092). The population and failure counts provided pertain only to the my 2005 Honda Pilots that were the subject of this investigation. Honda's recall addresses two conditions in the vsa system that could result in inappropriate brake activation.", "fail date": "  08/03/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "My ignition don't work.", "fail date": "  05/11/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "On the 28th of October, while my car was parked at my residence a enterprise box truck struck the driver side my car causing a severe damage to the side mirror, bumper and the wheel of my car. I contacted enterprise of the said damage and they apologized and made a reservation for me to go to one of their location (upper darby) to pick up a rental car while they make an arrangement to fix my car. The agent on the phone told me that I won't be responsible and that because they have not set up a claim number yet I should give them my credit card and they will set up a direct billing and my credit card info will be deleted from their system. My car was then taken to the Honda shop and a claim number (r00150772) was established by enterprise through their insurance (rental insurance services). A representative from the company melissa leppert (636. 329. 9245) got in touch with me and and told me she won't authorize the direct billing until she finish her investigation. After waiting for a month 11/27/14 she calld to inform me that my car despite not having a driver side mirror and a possible off alignment and the side damage that I should have drove my car like that until the investigation is over. I askes her if she implied that I sould risk my life driving a car that wont pass safety inspection text. She insit that they wont be paying for the rental car that was given to me ealier on. , and that she is still looking into fixing my car. At this point I just called my insurance company to take care of my car since I can't continue to wait on enterprise and their insurance. On the 12/06/2014 I returned the rental car since my car will be ready on Monday and I don't need the rental for the weekend, only to find out that my credit card was charged in the amount of $1600. 00 even though I was not present at the premises nor did I give the authorization for that.", "fail date": "  10/28/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The rear door/hatch of our 2006 Honda Pilot has an issue with the latching mechanism. The actual mechanism on the rear hatch has become disconnected from the frame and is able to move freely about. This causes the rear hatch to not latch, latch partially, or latch but still allow the rear hatch to slightly move. The latching mechanism is only being held in place (in a confined area) by the plastic paneling of the car. Since the latch is no longer attached to the frame, the movement of the mechanism determines if the rear hatch is going to latch or not. When it is latched, the only item securing the mechanism is the plastic paneling. The mechanism itself is not defective or broken however; the way the mechanism has been secured seems to be the issue. The most concerning aspect is how a door latch mechanism could become disconnected and allow for an incident to possibly occur.", "fail date": "  10/20/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "While driving the abs and vsa lights went on and I had to make a rapid stop when a car pulled in front and the my car swerved suddenly and I almost lost control, with the sensation that it was going to turn over. This has continued every time I put the brakes on quickly to make a sudden stop.", "fail date": "  10/09/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "While driving on interstate, suddenly the wheel jerked to the left and my vehicle crashed into the median guard rail then veered back across the road to stop on an embankment. The cause of the wheel jerking to the left is unknown. Fortunately there were no other vehicles involved. When the driver's side curtain airbag deployed, my head became trapped between the driver's side window and the airbag, resulting in closed head injury. I believe the airbag deployed late causing this to occur. I also believe there is something wrong with the steering which caused the vehicle to jerk the way it did. The vehicle has been properly maintained and was in great condition.", "fail date": "  07/13/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Transcooler failure has flooded radiator with transmission fluid & transmission with coolant ruining both major components.", "fail date": "  07/12/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I was driving at 30 mph my Honda Pilot 2006 when suddenly the truck accelerated on its own , that was truly surprising to me , the speed was over 100mph , I remember stepping on the brake and the truck did not stop , I remain shocked and I could not react, everything happened in seconds and I was trying not to kill someone I lost the control and crashed into a big metal pole.", "fail date": "  07/17/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Right rear regulator let the window drop without warning while driving. Mileage 65300 / may, 2011. Left rear window regulator let the window drop without warning while driving. Mileage 88k / March, 2014. Neither rear window had been operated more than a few times a year. The sudden impact of the window dropping and sudden wind noise, even at low speed is very startling. Both window regulators failing in this manner strike me as being a design defect.", "fail date": "  05/14/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Voice commands shutting radio off putting radio on air on air off asking to repeat . Dashboard lights going haywire lost all electrical to dashboard instruments car started vibrating while driving replaced battery and alternator and battery light flashing on and off but battery and alternator testing fine car accelerates on own with cruise set all this happened while I was driving on a city street. Car accelerated on own while I was driving on highwy doing 65 my I had to apply brakes and shut down cruise. Had computer tested to see if anything wrong had computer checked to see whats wrong with engine indicated no codes everything fine. Also while making a turn steering wheel locks up but everything ok with power steering fluids. This is very unsafe I have 4 grandchildren that I pick up from school im afraid to drive my vehicle with them in car even myself I dont want anyone getting hurt or killed because of Hondas knowledge of all the problems with electrical system and engine problems that they wont do a recall because to expensive.", "fail date": "  08/26/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "On three separate occasions over a two-day period, the vehicle momentarily brake hard when very light pressure was applied to the brake pedal. The vsa (vehicle stability assist) warning light came on when this occurred but did not stay illuminated after the vehicle was shut off and restarted. These incidents occurred December 23rd and 24th, 2013, and the temperature was approximately 20-30 degrees. No injuries occurred, but thankfully no other vehicles were behind us when it happened. This sounds like the same issue that the 2005 Honda Pilots were recalled for, however, the local Honda dealership will not include my model in the recall and will therefore charge me for any fix that might occur.", "fail date": "  12/24/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Vibration noise/shudder/grinding between 20-50 mph while accelerating.", "fail date": "  11/01/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "This is the second time it has happened in 2 weeks. We were in our car and were accelerating after being stopped at a stop light. The car jerked forward briefly and then stopped responding. I was pressing the gas pedal, but the car did not accelerate and the vsa warning light came on briefly. Within a few seconds, the car began responding again and we were able to drive safely the last 1/4 mile to work.", "fail date": "  09/07/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Was pulling into a parking spot in a parking garage going slow and the Honda Pilot accelerated on its own, the rpms went up and slammed into the cement wall in the garage in less 5 seconds. The airbag deployed and damage to the front of the car.", "fail date": "  05/27/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "The contact owns a 2006 Honda Pilot. The contact stated that he had an issue with the engine speeding up suddenly even when he took his foot off of the gas pedal. He was forced to shift gear into neutral and turn the vehicle off. He called the dealer and was told to re-start the vehicle and see if it would happen again. The issue did not re-occur so he continued to drive it. He had a scheduled appointment with the dealer at the time the complaint was filed. He has not spoken with the manufacturer. The current and failure mileages were approximately 55,000.", "fail date": "  12/23/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "On Dec 4,2007 I took my 2006 Honda Pilot to a Honda dealership in winnipeg mb canada for engine revving issues. I explained how when going to brake at an intersection the vehicle jolted ahead as the engine started to rev high- rpm greater that 4000 - and the speedometer needle was bouncing from top to bottom erratically. I was braking lowly at first but when this started I used two feet on the brakr to prevent me from hitting the car in front of me. It just finally stopped. It never happened again but with the Toyota recalls I wonder whether Honda has the same issues with their vehicles. Please report this occurrence for me. Notice: mileage on vehicle at the time was 38000 kilometers and the speed I was going was 50-60 km per hour. I couldn't adjust that in the following pages to reflect the metric system we use up here.", "fail date": "  11/22/2007"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Headlights problems", "description": "Both low beam headlights stopped working. High beams worked fine.", "fail date": "  02/26/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Headlights problems", "description": "Low beam headlights have failed - bulbs are good, have replaced with known good bulb to no avail. Have read multiple reports of similar problems from other owners of the Honda Pilot from 2003-2008. There was a recall on the earlier (pre 2005) Pilots but the problem was not corrected by Honda in later models. This problem affects the vehicle in any state, parked, motor on or off, while vehicle is in operation or standing still. Hi-beam headlights still function properly identical to the problem in the earlier recall. Vehicle has roughly 180,000 miles on it.", "fail date": "  07/01/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Headlights problems", "description": "Headlight blows bulbs about once a month. Yesterday the passenger headlight low beam stopped working all together. Took into Honda service center and they cant find a problem.", "fail date": "  09/26/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Headlights problems", "description": "Passenger side headlight stopped working because the connector/socket had melted. Have not fixed yet but apparently this issue has been recalled on 2003 Honda Pilots, but not on 2006.", "fail date": "  11/19/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Headlights problems", "description": "The right low beam head headlight does not turn on. After buying a new bulb and checking the fuse. The fuse is fine.", "fail date": "  12/28/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Headlights problems", "description": "The contact owns a 2006 Honda Pilot. While stopped at a traffic stop, the contact noticed that the driver side headlight was not functioning. The contact had the bulb replaced but the failure continued. The vehicle was taken to the dealer for diagnostic testing. The contact was not certain of the repair that was performed but believed it was the replacement of the headlight assembly. The vehicle was taken to the dealer for the failure three different times. The vehicle was not repaired. The failure mileage was 92292 updated 04/18/bf\nthe consumer stated the passenger light failed again. Updated 05/31/12.", "fail date": "  04/26/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Headlights problems", "description": "Low beam headlights on 2006 Honda Pilot do not shine very far when going down a hill. There is a divider bar between lower (low beam) and upper (high beam) lights that limits the distance the low beam shines when at the bottom of a hill and proceeding up another hill.", "fail date": "  11/20/2006"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Headlights problems", "description": ": the contact stated the low beam headlights only illuminate 50 feet in front of the vehicle. There is no visibility above 12 inches from the bottom of the windshield. The dealership determined the vehicle meets factory specifications and no repairs are available. Updated 3/22/2006 -.", "fail date": "  03/03/2006"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Tl-the contact owns a 2006 Honda Pilot. The contact stated while driving 25 mph there was abnormal clunking noise detected. There were no warning lights illuminated. The vehicle was taken to an independent mechanic where informed the cradle mount detached from the rear axle and was hanging. The local dealer and manufacturer were no contacted. The vehicle was not diagnosed or repaired. The failure mileage was 149,000. Ap.", "fail date": "  10/07/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "I started to notice the rear of my vehicle making clunking noise and occasional metal on metal ticking noises at lower speeds and over bumps. I just assumed my rear shocks were going out. I then later realize the rear of my vehicle is sitting a lot lower especially the driver side. About a week later I took my car in for brakes and while on the hoist lifted up I see that both of the 'trailing arms\" right/left sides have completely detached from the sub frame. Now knowing the real issue at hand and doing my share of research online this doesn't seem to be addressed by the manufacture at all, possibly knowing the potential of having one of the main components for keeping your rear axle intact with the whole vehicle fail that easily!!!.", "fail date": "  09/21/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "While recently driving my 2006 Honda Pilot on the highway, the vehicle seemed a little unsteady when cornering. After arriving home, the rear suspension looked too low and the negative camber of the rear wheels looked excessive. Closer inspection revealed the rear frame crossmember had extreme internal corrosion and both rear suspension mounting bolts had completely broken away from the frame (see included photos). The rear suspension had dropped several inches below the original mounting position and was pressing on the exhaust system. I question the safety of driving the vehicle in this condition and possibly has been and is an accident waiting to happen. Overall, the rest of the vehicle is in really good shape, has been well maintained, never been driven off-road or in harsh conditions and has never pulled heavy loads. The internal frame corrossion seems excessive for a vehicle of this age and perhaps the result of poor design, poor quality and/or inadequate corrosion protection. My local Honda dealer says this problem is unknown to them, is not fixable and there was nothing they can do at this time but refer me to Honda national. Honda national also initially claimed no knowledge of this problem even though numerous identical problems can be found on the NHTSA website as well as other online sources. A complaint and case number has now been registered with Honda for this problem. Unfortunately, this once great vehicle appears to be prematurely destined for the scrap metal pile. Very sad outcome for any modern vehicle and especially one with the reputation for quality and reliability of a Honda vehicle.", "fail date": "  06/05/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "2006 Honda Pilot ex mileage: 144,309 I was accelerating from a stop when I felt a jolt coming from the rear of the car. Several warning lights lit up in the dashboard, there was a loud exhaust leak, and the car was no longer accelerating. There was an auto care center 50 yards away so I slowly drove it there for an inspection. The mechanic lifted the vehicle and showed me that the back two rear subframe mounts were detached from the body which made the car inoperable. There was no visible rust on the undercarriage; the subframe mounts rusted from the inside out. My insurance company would not cover the damage as it was a rust issue. The car was irreparable so I had to total the car and received 10% of what the car was worth running from the junk yard. I purchased the Pilot new in Feb. 2006 and performed all the recommended Honda maintenance. I personal performed all oil and break jobs so I was familiar with the undercarriage of the car. I did not see any rust under the car that would have alerted me there was a potentially dangerous issue with the rear subframe. A google search turned up several other Honda Pilots of this generation having the same subframe rust as mine with the same catastrophic failure of the rear mounts. I believe that this is a manufacturing defect in that water was allowed to pool between the layers of steel in the unibody. The car had 144,309 miles on it and was mechanically in great condition until I had this issue.", "fail date": "  04/14/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "While pulling into a parking lot a loud bang happend in our 2006 Honda Pilot. We thought we had bottomed out. It turns out that the rear subframe, suspension, and drive train had fallen out of the rear crossmember. This is due to premature rust and inadequate metal used in the rear subframe. The rear subframe and suspension is only being held in with 2 more rusty bolts. This vehicle is not rusty anywhere else and is in excellent condition. It does have 165,000 miles on it. The vehicle is no longer safe to drive . I hate to think what would have happened at 70 mph on the highway with my family. This is a serious safety issue and needs to be addressed immediately. The certified Honda dealer that I took it too says they can't fix it, and the vehicle is junk. The vehicle is in excellent condition in every other aspect. The failure is obviously a manufacture defect. I have e-mailed Honda, but they have not responded to me except for a auto response e-mail. This vehicle is worth about $6000 before this happened.", "fail date": "  09/29/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "On 8/18/18, while driving on a highway at about 50 mph, we heard a loud thud. Then when the accelerator was pushed, the car made a loud noise. I called my mechanic thinking it might be the exhaust. When he looked at it on 8/22/18, he informed me the rear sub frame was pulling out of the body, and the car was not safe to drive. He said this shouldn't have happened to a car that is 12 years old, and in good mechanical condition. He said the only thing holding the rear frame up was my exhaust pipe.", "fail date": "  08/18/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Rear suspension broken from car frame.", "fail date": "  07/04/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Vibration on 2006 Honda Pilot\nI own a 2006 Honda Pilot awd. I have made many complaints about vibration on my car to Honda dealer and Honda headquarter, however they claim they do not feel vibration I felt. I have been following what other people are complaining on line and I am not only one. There are so many other owners who has same problem and who been told it is nature of that car. I have changed my tires and add Acura mdx modifications, it improved however vibration still exist. . Read more...\n", "fail date": "  06/01/2007"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "With less than 1000 miles, I began noticing a vibration problem on my '06 Honda Pilot. Vibration felt in seats and steering wheel. Although can be felt at lower speeds, more pronounced @ 55 - 70 mph. May have been there from delivery, but did not have the opportunity to drive any smooth roads here in PA. For first few weeks. Dealership acknowledged problem and worked for two days to eliminate, checking tire balance, drive train components and run-out on rotors. Rear rotors were resurfaced and seemed to lessen the problem although problem still exists. Other dealers and Honda appear not to acknowledge that this problem exists despite numerous complaints as discussed on Honda forum boards. Scheduled another visit to dealership.", "fail date": "  03/29/2006"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Both vehicle low beams simultaneously stopped working while I was driving. I needed to use high-beams to get home. This is very dangerous!! I checked bulbs and fuses and all are in working order.", "fail date": "  07/18/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The key is stuck and wont turn or come out.", "fail date": "  01/26/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The key is stuck in the ignition an will not come out or turn.", "fail date": "  01/25/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Not one, but both rear windows fell within weeks of each other because of the cheap plastic mechanism that holds them up. Both mechanisms had to be replaced at the cost of $400 each. And they use the same parts!! clearly this is a recall issue, as I have read hundreds of reports like this one. Thank goodness we were not driving on the freeway at the time (both times we had just exited) and the glass didn't break. This could have been not only a costly repair, but dangerous for my kids in the backseat.", "fail date": "  07/08/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Most of button lights on climate control dash and cruise/vsa/sunroof stopped working. I believe they burnt out. Happened to lots of Honda owner too. Honda dealership asks for $200-300 to fix this. It's ridiculously expensive to fix their mistake.", "fail date": "  08/24/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Driver's side seat warmer gets unbearably hot! the seat seems to only warm on the right side, but it is extremely hot!!.", "fail date": "  02/02/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Loud popping noise coming from rear speaker when starting the vehicle. On and off for years now.", "fail date": "  10/01/2007"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "When we first bought the 2006 Honda Pilot, there was a loud roaming noise coming from the engine, while the car was cruising at any speed, it would just start and stop at any moment, it sounded like a racing car revving it engine to the limit. When we took the car to the dealer, they spent about 2 days trying to figure it out, they said it was some sort of speaker or sensor that was relaying information to the cars computer and what we were hearing was feedback. They said they could not fix it, so they unplugged it so that we wouldn't hear the noise.", "fail date": "  07/18/2006"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Power Train", "Sub Problem": "Automatic Transmission problems", "description": "My 2006 Honda Pilot ex-l experienced sudden unintended acceleration (sua) at 3:53 p. M. On Sunday, February 28, 2010 near our home on key biscayne, florida. We were driving at around 20 mph and as we gently braked in approach of the stop sign, the engine opened up nearly full throttle at just above 5000 rpms. My husband immediately and firmly applied the brake and placed the gear in park. With his foot on the brake, not the accelerator pedal, the engine continued to roar at 5000 rpms until he turned it off at the ignition after about 30 seconds. He restarted the engine and the engine rpm immediately shot up to 5000 rpms again, with his foot on the brake and the car in park. The tachometer stayed at the 5000 rpm level continuously until he again turned off the engine at the ignition after about 45 seconds. We waited a few more seconds and re-started the engine again. That time, the engine started at a normal rpm and we drove half a block to our house. We recorded a video of the second episode of 5000 rpms with a camera we had with us. We provided the video immediately to american Honda customer service. At the request of customer service, I took our Pilot to brickell Honda in miami on March 1. I showed the video of the sua to the service manager, george ruiz, on his computer. He was astounded by what he saw and expressed his genuine concern that the car was unsafe to operate, regardless of whether his service department was able to find the source of the problem. He said under no circumstance should the engine operate at 5000 rpms without the accelerator being depressed almost all the way to the floor. The district service manager, kevin mcclung, also inspected the car. American Honda determined the Pilot was operating within normal parameters. We were instructed to pick up the car on March 5 and did so on March 8. No repairs were performed. My husband spoke to Honda customer service manager terry nielsen on March 3 who could not explain the video.", "fail date": "  02/28/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Power Train", "Sub Problem": "Automatic Transmission problems", "description": "The contact owns a 2006 Honda Pilot. The vehicle was parked on a steep hill with the parking brake engaged. As the contact attempted to open the passenger side door, the vehicle suddenly started to roll down the hill flipping over an embankment and coming to a stop. The failure has not been diagnosed and there were no prior warnings. The current and failure mileages were 70000. Updated 12/10/09. The consumer stated the parking brake was engaged. Updated 12/10/09.", "fail date": "  08/28/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Power Train", "Sub Problem": "Automatic Transmission problems", "description": "Purchase a new 2006 Honda Pilot 2wd on 2/23/06. On 2/27/06, while driving in the rain, I stopped at a red light on a slight incline. As I took my foot off the brake and stepped on the gas, the car rolled backward several feet, and front tires kept spinning loosing traction, and the back of the car had a fish tail motion. I tested the car on a flat surface in the rain, and the front tire spinning still occurs. I tested the car on the same incline during dry road conditions, and the car rolls back once you take your foot off the brake. Took it into the dealership and took the mechanic for a test drive, he says the new 2006 Honda Pilots are all experience the same roll back and traction problems. Spoke with Honda's regional case manager on 3/6/06, his recommendations were to trade the car in for a 4 wd Pilot or learn to drive with both feet, your left on the brake and right foot on the gas so to ease the car and prevent roll back and loss of tire traction. They would report it to the Honda engineers, but I had no other options. I feel this is an extremely dangerous safety situation for me. There are many situations that I would be driving on an incline and roll back and loss of tire traction could cause an accident to cars behind me, or even pedestrians that may be crossing behind of me in a mall parking lot or any stacked parking lots that have ramps.", "fail date": "  02/27/2006"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The casing of the driver side backing just fell off for no reason. Driving on a normal street. Not doing anything but normal driving.", "fail date": "  10/05/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "After buying our 2006 Honda Pilot used, within 8 months the driver's side front seat back cover popped off while sitting in the garage. We noted that the area of the cover that holds the small clips had been previously fixed with wire. We contacted the local Honda dealership and ordered a new cover (part number 81127-s9v-a21zc) and clips (part number 91566-sp0-003). We had them installed by the dealer, but six days later the cover popped off for a second time, again while parked in the garage. We again contacted the dealer and were told to bring the vehicle in. This time, the service manager himself took care of us. He used a heat gun to attempt to melt the cover back into the proper shape, replaced the clips and assured us that this would be a permanent fix. Because we were not confident with the fix, we contacted Honda America and took out a case number (05085702). Honda America's only comment was that we needed to work through the dealership. A month later, the seat back cover came off again while in the garage. We again contacted Honda America to inform them and to follow-up on our case. They again told us that we needed to work through the dealership. When we specifically asked about our case we were told that it would be reviewed but that we would not be contacted concerning the results of their review. We then contacted the dealership and were told that the service manager would contact us. We are still awaiting his callback. Note that each time the cover failed while the vehicle was in the garage, it was during moderate temperatures ( low 60s to high 70s) so I do not feel that temperature was a factor.", "fail date": "  09/14/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The drivers-side seatback panel constantly falls off. There are two hooks at the top and two fender-plug style clips at the bottom that are supposed to snap the panel into place, but these plugs continually pop out of the pylons on the panel itself and the panel is no longer secured to the seat. I have had several passengers that found the panel dropping onto their laps or toes while driving. I finally gave up on the plugs entirely and opted for heavy-gauge wire-ties that have secured the panel to the back of the seat once and for all.", "fail date": "  01/16/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "We are original owners of this 2006 Pilot ex-l and are experiencing dangerously hot conditions with the drivers seat. On high setting it is unbearable and seems much hotter on the left side base portion. On low setting it is much hotter than normal also. I have noticed a slight electrical smell and am very concerned. Please advise.", "fail date": "  11/12/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "While driving the vehicle at approximately 40mph, the plastic support clips on the driver's seat back panel dislodged and the seat panel fell off completely. I tried to reattach the panel but that failed. I contacted the dealer (concerning this and another issue) and after being told that it was my fault, the dealer offered to replace the back panel as a \"good will\" gesture. The panel was replaced (new). I noticed that the fit was not correct and mentioned that to the dealer, but was told that was the best they could do and within three weeks the same thing happened. I, again, contacted the dealer, and they ordered a new part, again, and replaced it. I am still not happy with the \"fit\" of the part. I have had the seat panel replaced for about 3-4 weeks now and it has not fallen off yet. Hopefully this will be the end of my ordeal.", "fail date": "  05/21/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The contact owns a 2006 Honda Pilot. The contact was driving approximately 45 mph when the plastic support clips dislodged from the front driver's seat back panel and resulted in the panel becoming partially detached. The failure would occur whenever the vehicle was in motion. The vehicle was taken to an authorized dealer where the support clips were replaced. Most recently, the similar failure recurred and the contact purchased a new back panel for the front driver's seat to replace the defective one. The manufacturer was notified of the defect. The approximate failure mileage was 50,000. Updated 02/06/bf\nthe consumer stated the repair to the clips were made by the dealer twice within two years. The consumer was informed if they replaced the cheap plastic clips, it would fall again since the plastic slot where the clips slide into become bent each time it falls out. The panel falls off spontaneously without any warning. Updated 02/10/12.", "fail date": "  12/09/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "While driving down the road the back of the seat fell off. My husband bought the replacement clips and put it back on but it continues to fall off.", "fail date": "  09/16/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "Driver's side seat warmer gets unbearably hot! the seat seems to only warm on the right side, but it is extremely hot!!.", "fail date": "  02/02/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Seat Belt", "Sub Problem": "Seat Belt problems", "description": "When the seatbelt on the driver side is bucked it will pop lose . So I would try again till it locks . It was in motion and also have been in stationary position. .", "fail date": "  03/08/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Seat Belt", "Sub Problem": "Seat Belt problems", "description": "While driving on the highway the side airbag by the driver popped out and blew up. No collision no blown tires. The vehicle was in motion on a highway.", "fail date": "  11/19/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Seat Belt", "Sub Problem": "Seat Belt problems", "description": "Tl the contact owns a 2006 Honda Pilot. While driving 55 mph, the driver's side curtain air bag and driver's seat air bag deployed without warning or an impact. Also, the driver's seat belt tightened up unexpectedly. The contact swerved the vehicle slightly due to being constricted by the seat belt. There were no warning indicators illuminated. The vehicle was towed to fairfield Honda (201 lycoming mall dr, muncy, PA 17756, (570) 326-2858), but was not diagnosed or repaired at the contact's request. The manufacturer was made aware of the failure. The failure mileage was unknown.", "fail date": "  03/22/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Seat Belt", "Sub Problem": "Seat Belt problems", "description": "I was driving on the highway in florida. I had a 5 year old strapped in a booster seat in the third row of my 2006 Honda Pilot (she was sitting on the driver's side of the 3rd row). She told us that her seat belt just broke. We pulled over. Apparently the female buckle end came off the seat belt strap. I don't understand what happened, the loop in the buckle though which the strap goes through seems very corroded (not rust but a whitish powder). The buckle was loose and could simply slip off the strap. This could be very dangerous. I just looked it up and couldn't find any information on this. The buckle seems to have a serial number on 05322aahmam.", "fail date": "  05/24/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Seat Belt", "Sub Problem": "Seat Belt problems", "description": "As I entered the car the and went to buckle the seat belt. I pushed gentle back on the seat back. At that point the seat back dropped back into the rear seat. When the dealer looked at it he advised me that the seat adjuster has failed. If the car was in a accident I would have been severely hurt. Honda USA will not do anything to help fix this major safety issue with their seat.", "fail date": "  01/06/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Seat Belt", "Sub Problem": "Seat Belt problems", "description": "The contact owns a 2006 Honda Pilot. The contact's three year old child was seated behind the driver's seat. Directly behind the driver's head is a seat belt that is connected to the roof, which crosses into the middle rear seat. While the contact was driving 45 mph, the child was able to grab the seat belt. While playing with it, the seat belt somehow wrapped around the child's neck. The contact pulled the vehicle over, but was unable to unwrap the seat belt due to the connection of the seat in the vehicle. She had to cut the seat belt because the child was turning blue due to lack of oxygen. She called Honda and was informed that the seat belt was working properly and she should have been able to unlatch the seat belt. The VIN was unknown. The current and failure mileages were 34,000.", "fail date": "  08/05/2008"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Tire", "Sub Problem": "Tire problems", "description": "Front wheel vibration. The front wheel on my Honda Pilot vibrates at 65-70mph, the Honda dealership has tried to solve the problem on six (6) occasions however they cannot findout what is causing the problem. Honda, corporate service is aware of the issue however, they cannot offer a solution either. Is this going to be another Ford explorer tire-frontend problem??? please advise.", "fail date": "  07/26/2008"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Tire", "Sub Problem": "Tire problems", "description": "I recently purchased a 2006 Honda Pilot and am experiencing extremely poor traction with the factory-installed good year integrity tires. They spin on takeoff in both dry and wet conditions, and handle poorly. I also have a loud humming noise that usualy occurs between 50 and 55 mph. The noise comes from the rear of the vehicle, getting louder and louder and ending abruptly. I've noticed that a quick romp on the accelerator causes it to end quicker. The dealer claims that it is a problem with speaker feedback and Honda has no corrective measure as of yet. However, I have had passengers sit in the rearmost seats and they confirm that the noise is not from the speakers but closer to the rear of the vehicle.", "fail date": "  10/08/2006"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Tire", "Sub Problem": "Tire problems", "description": "I recently purchased a new 2006 Honda Pilot. The vehicle came equipped with goodyear integrity tires. I have had the vehicle in to the dealer service shop three times and I am going back for a fourth attempt to get the tires balanced. The dealer is working with me, but these tires are garbage. They can't be adequately balanced because they are defective.", "fail date": "  09/15/2006"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Tire", "Sub Problem": "Tire problems", "description": "Note: system did not let me put in the correct tire size 235/70/16. I purchased a brand new 2006 Honda Pilot ex and wanted to express my dissatisfaction with the tires that came with the vehicle. They are goodyear integrity tires. I purchased the Pilot for a few reasons, one being that the vehicle has a 5 star safety rating which is not common among SUV vehicles and second because of Honda's reliability and craftsmanship. This is my 5th Honda that I have purchased and I have never owned anything but Honda's. I have to say that the goodyear integrity tires that came with the vehicle are junk. I love the vehicle but hate the tires. I don't just hate the tires but I feel extremely unsafe driving my vehicle in the rain with these tires. The vehicle feels like at any moment it is going to hydroplane. Also, whenever I stop in the rain my abs brakes are constantly being activated. I do not feel safe driving with these tires. I have looked on the internet at some Pilot and tire discussion boards and found similar complaints about these tires on other Pilots and also other vehicles (so it is not the vehicle but the tires).", "fail date": "  02/14/2006"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Tire", "Sub Problem": "Tire problems", "description": "My wife and I purchased a 2006 Honda Pilot in Dec 2005. Factory installed tires were goodyear integrity. The vehicle daily looses traction and several times and lost control of vehicle. Traction is bad on wet and dry conditions. When contacting Honda corporate, they say it is the tire and that I should contact the tire manufacturer. Goodyear says that we need to work through Honda. Classic runaround. However, when I review the goodyear web site, it provides tire recommendations for various vehicle types. When I review the Honda Pilot recommendation (with an SUV classification-which is appropriate according to the Honda web site, which labels the Pilot a SUV), the goodyear web site does not recommend the goodyear integrity. However, it you label the SUV a passenger car (which it is patently not), then the integrity comes up as the recommended tire. I have almost exhausted all my options and am left with frustration and concern. My wife or I will immanently be in an accident, and I will assure you that Honda will be culpable. I have attempted to resolve the issue by offering to pay the difference (which is 2x the price to the integgrity tires-which is why I suspect they are selling the vehicle with the significantly cheaper integrity tires) for the recommended tires, Honda and goodyear are not listening.", "fail date": "  02/07/2006"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "The vsa system seems to be applying a small amount of brake force without any input by the driver. The small amount of break force seem to be constantly pulling the vehicle to the left. At times, the amount of brake force applied exceeds the driver's intended input. The vsa warning light and abs light are constantly on. The vehicle has been serviced and is up to date on all maintenance. Dealer and another mechanic say it is the vsa or yaw sensor in the center console that needs to be replaced at a cost of $1,000-$2,0000. It seems to be the very same issue that the recall on the 2005 model addressed.", "fail date": "  12/02/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "On the 28th of October, while my car was parked at my residence a enterprise box truck struck the driver side my car causing a severe damage to the side mirror, bumper and the wheel of my car. I contacted enterprise of the said damage and they apologized and made a reservation for me to go to one of their location (upper darby) to pick up a rental car while they make an arrangement to fix my car. The agent on the phone told me that I won't be responsible and that because they have not set up a claim number yet I should give them my credit card and they will set up a direct billing and my credit card info will be deleted from their system. My car was then taken to the Honda shop and a claim number (r00150772) was established by enterprise through their insurance (rental insurance services). A representative from the company melissa leppert (636. 329. 9245) got in touch with me and and told me she won't authorize the direct billing until she finish her investigation. After waiting for a month 11/27/14 she calld to inform me that my car despite not having a driver side mirror and a possible off alignment and the side damage that I should have drove my car like that until the investigation is over. I askes her if she implied that I sould risk my life driving a car that wont pass safety inspection text. She insit that they wont be paying for the rental car that was given to me ealier on. , and that she is still looking into fixing my car. At this point I just called my insurance company to take care of my car since I can't continue to wait on enterprise and their insurance. On the 12/06/2014 I returned the rental car since my car will be ready on Monday and I don't need the rental for the weekend, only to find out that my credit card was charged in the amount of $1600. 00 even though I was not present at the premises nor did I give the authorization for that.", "fail date": "  10/28/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "While driving on interstate, suddenly the wheel jerked to the left and my vehicle crashed into the median guard rail then veered back across the road to stop on an embankment. The cause of the wheel jerking to the left is unknown. Fortunately there were no other vehicles involved. When the driver's side curtain airbag deployed, my head became trapped between the driver's side window and the airbag, resulting in closed head injury. I believe the airbag deployed late causing this to occur. I also believe there is something wrong with the steering which caused the vehicle to jerk the way it did. The vehicle has been properly maintained and was in great condition.", "fail date": "  07/13/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "My 2006 Honda Pilot SUV has had a vibration in the steering wheel since day 1. I've taken it to the dealer who gladly performed 2 tire balances but the vibration doesn't go away. The vibration is felt at any speed higher than 63 mph. On long highway drives, my arms upto my elbows vibrate for very long that I have to take a break for 20 minutes and just shake the heck out of them. . Read more...\n", "fail date": "  12/09/2005"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Gasoline Fuel System", "Sub Problem": "Gasoline Fuel System problems", "description": "The contact owns a 2006 Honda Pilot. While driving 40 mph, the contact rear ended the preceding vehicle. It was a minor crash. She noticed smoke coming from the engine compartment of her vehicle followed by flames. She immediately had the vehicle towed and it is currently at the repair shop. A police report was filed. The vehicle was destroyed and she was informed that the failure was due to a design flaw. The current and failure mileages were 30,000.", "fail date": "  09/30/2007"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2006 Pilot", "Problem": "Gasoline Fuel System", "Sub Problem": "Gasoline Fuel System problems", "description": "Gas mileage for the vehicle is not as advertised. I am getting 20 mpg for mixed use driving (mostly highway). The epa estimates are 20/28.", "fail date": "  12/19/2005"}]