[{"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Approximately 6 times in the last several weeks the engine of my Pilot has auto shut off at a stop light but then it will not restart when I try to go. I have to shut down the whole car and it takes several tries to get it restarted. The most recent time it would not restart for several minutes. I am then stuck in traffic unable to move. I have to remember to disable the auto shut-off/restart or this occurs.", "fail date": "  11/18/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Auto-stop feature failed to restart vehicle after auto-stop was engaged at a stop light. When letting off the brake, the auto-stop disengaged, but the vehicle engine failed to start, posing a safety risk as the vehicle did not restart in heavy traffic. This has been reproduced numerous times by the owner, but not by a dealer or independent service center. The component has not been inspected by the manufacturer, but the owner is an ase certified mechanic. Warning lamps illuminate after vehicle fails to start, but the only way to restart the vehicle is to shift into park, completely shut off the vehicle electrical and attempt to restart. The system is receiving appropriate recharge from alternator, and battery is in acceptable condition.", "fail date": "  11/16/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "On sun Nov 13th, 2022 I was on I-75 going north and had to slow down and then stop at a 'stop and go' traffic in the beginning of or just before the construction zone. With my foot on the brake, complete stop on the highway, the Honda Pilot suddenly went into neutral and I was unable to put it in drive mode. I panicked, as there was a lot of traffic behind and I put the blinkers on, put the vehicle in park, tried to restart and didn't work. After a couple of tries, fortunately the engine restarted. In the middle of the one lane construction, I had to stop once again as the traffic was stopped. Once again the Pilot did the same thing. It stalled, and I had to restart the engine. It was very scary and a big safety problem. I have placed a call into Honda service but no response as yet. It is scary now to stop at red lights and stop signs! it happened 2 times in the same construction zone within 5 minutes.", "fail date": "  11/13/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The engine would not restart at the red light. Start/stop system was active, came to a red light and the vehicle turned off as normal with my foot on the brake, when the brakes were released the vehicle did not restart and I heard a click sound. I had to manually(push the start button) to completely turn off the car and then press it again to start the car. I had my entire family in the car including my child, with vehicles behind me on a main multi lane road. I almost got rear ended due to this malfunction.", "fail date": "  11/08/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The engine idle stop is extremely dangerous and is going to cause someone to be seriously injured or killed. Ever since I have owned the vehicle, I have had a problem with the engine auto idle stop malfunctioning. The dealership can never find an issue. It has become so bad that if I forget to disable the idle stop, as soon as I step on the brake my entire car resets/shuts down and will not turn back on for several seconds. I was left in the middle of an intersection with other drivers blaring their horns at me, scaring my children, because my car shut off in the intersection as I was attempting a left turn. As soon as I take my foot off of the brake, the car resets and the dash tells me to shift to p. Which I cannot do. Then it shuts down again and I am at the mercy of the vehicle and other drivers to not collide with me until my vehicle decides to turn back on. It is extremely dangerous.", "fail date": "  11/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "When driving the vehicle with the auto start/stop engaged upon stopping the engine will turn off at an intersection however it will not turn back on. It takes several tries for the vehicle to start back up.", "fail date": "  10/31/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Problem with the auto engine idle stop system. With the Honda stopped at a traffic light, the engine turned off completely and pressing the accelerator pedal did not restart the car. And continually pressing the start button didn’t start the engine, either.  it has happened three times so far. My family and I were unexpectedly immobile in the middle of traffic, with vehicles driving around our stranded automobile. We were nervous that an accident would occur. The brake pedal locked and I had to press the brake pedal firmly numerous times before the start button would allow the car to start.", "fail date": "  10/22/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "When at a red light the engine turns off when you press the brake. When you life you foot it should restart automatically. Multiple times my car has no restarted. It sends me a message to put the car in park, press the brake again, and restart with the push button. But it did not work immediately. I had to do the process 5-15 times before it restarted. This is a safety issue because I’m in a stalled car at a red light with traffic trying to get around my car or worse cars coming at a regular speed who don’t see I’m stopped. After researching I have seen that this issue has happened to other owners as well. I called my local dealership who said to bring it in so they could inspect it - which I have not done so yet. Just today there was a brief flash of an alert right after it restarts mentioning the collision assist or one of the other safety issues but it disappeared before I was able to fully read it.", "fail date": "  10/19/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "While the vehicle was stop, the auto shut off went off, and upon moving the foot from brake and depress accelerator, the Honda Pilot 2017 turned off and restarted requiring driver to depress engine start again.", "fail date": "  10/15/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "While driving the car has been giving quick warnings that we weren't able to capture when the start stop was active. Today while at a light at a complete stop and about to make a right the car suddenly shifts to neutral and prompts us to put in park, then once on park the car shut off completely. While at the light still on park we tried to restart the call, but it would not. It took a few tries to finally start.", "fail date": "  10/13/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "This is my third incident of being stopped at a red light and the auto idle turns on. When the light turns green, and I release my foot from the break, my car stalls and tells me put it into park. My car essentially stalls out and I have to shut it off and on. Usually takes about 30 seconds to a minute for it to start up again. I almost got rear ended today at a light and I am concerned for my safety. How can we turn this into a recall and get this fixed before somebody gets injured?.", "fail date": "  10/11/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The engine shut down at a stop light. Never started again. Had it towed to dealership (swope Honda world louisville ky). They ran diagnostics and cannot get the engine to turn over. Checked starter, battery, reset all electronics. Can't even hand turn the engine . They are recommending we replace the engine for $8200 on a Pilot that has 70k miles.", "fail date": "  10/08/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I am the owner of a 2017 Honda Pilot touring.   my car has been dealer maintained.   it was most recently in for routine maintenance less than 3 weeks ago.   on October 7, 2022 at approximately 2:00pm I was stopped at a major intersection. My auto idle stop engaged and my engine went idle.   when the light turned green, I let off the brake my car jumped 2-3 times and went dead.   the dashboard showed the car to now be in neutral and the battery indicator was lit.   I quickly attempted to restart the car and/or put the car in park.   over the course of 30+ seconds, I tried various combinations pushing the start button or the park button. There was no response.   I attempted to call my husband, he was unavailable, so I tried again and the car started immediatley (while in neutral).    I have had numerous instances of the auto idle stop not responding quickly when it should restart.   the delay can be up to 4 seconds after lifting my foot or turning the wheel.   it has become my habit to turn off auto idle stop when starting the car.   I believe 90%+ of my driving is without it due to the unreliability.   however the latest incident has me very concerned about driving the car.   this along with other transmission/computer issues have been mentioned to my dealer during routine service. Many of those issues were corrected, however an issue with the auto idle stop has not been discovered and I was advised to deactivate it when starting the car.   please keep in mind that the default setting is on. If I forget to deactivate or when someone borrows my car, this becomes a concerning issue.    I contacted my Honda dealer and made an appointment to have it looked at again.  .", "fail date": "  10/07/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Multiple times while driving with the auto start/stop engaged, the vehicle will turn off when coming to a stop at a traffic light or stop sign and then need to be restarted with the actual start/stop button. Call to purchasing dealer was met with unrealistic demand that the vehicle be left there for an undeterminable amount of time so that it could be inspected. No other lamps have come on or warned against this. Only way to make it not happen is to turn off the auto start/stop after the vehicle is started.", "fail date": "  10/07/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The issue occurs when the car is stopped (at a traffic light) and the auto engine off is engaged, when I lift the brake to press the accelerator, the car shuts off the engine completely, puts itself in neutral and requires me to put the car in park and restart (press brake and ignition button). I then struggle to start the car (attempting multiple times) and restore it to drive. This is a major safety issue that occurs in the middle of traffic.", "fail date": "  10/06/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "After stopping and the auto start-stop system is utilized to turn off the engine, the engine does not restart on its own when releasing the brake pedal. The vehicle must be shifted to park, turned off, and restarted before you can begin driving again. This has happened many times and poses a major safety risk since it happens predominantly at stop lights.", "fail date": "  10/03/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The engine fails to restart on its own from a complete stop at a traffic light or road intersection with the auto start/stop function engaged. This has happened infrequently in the past but is now occurring more often, multiple times a month.", "fail date": "  10/03/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "What component or system failed or malfunctioned, and is it available for inspection upon request? yes it is available for inspection upon request the start/stop idle feature doesnt work sometimes. The car is supposed to turn off when you come to a stop light or any stop at all. You put on your break and the car stops and then when you start to go the car turns back on and off you go. For about a year now this has been malfunctioning and my car just stalls. Twice now in the last 6 months this has happened where I have been stuck in traffic with cars yelling and honking there horns at me. How was your safety or the safety of others put at risk? countless times in the last year my life, my childrens life, and those drivers around me have been at risk. There isn't any warning before it happens and can happen at anytime. Twice I thought I would have to call the police to direct traffic and get my car towed but thank goodness after 5-10 minutes it ended up starting on its own. The problem also is when it stalls like this, you can get the car in neutral to move or anything. Your just stuck. Its so scary and unless I disable this feature every time I drive the car, I risk getting in an accident!! has the problem been reproduced or confirmed by a dealer or independent service center? no it hasnt been reproduced. It is at the dealership right now because the second incident where it completely stopped for 10 minutes in traffic happened yesterday. Took it to the dealership 6 month after the 1st very dangerous incident and they said it was the fuel injector which I got replace and it didnt have any incidents for 6 month but as I stated it started back up has the vehicle or component been inspected by the manufacturer, police, insurance representatives or others? yes, the dealership were there any warning lamps, messages or other symptoms of the problem prior to the failure, and when did they first appear? no.", "fail date": "  10/02/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "While at a stoplight, my auto start/stop feature shut the engine down. When I released the brake after the light turned green, the car didn’t restart. Instead it shutdown in put the car in neutral. This resulted in traffic being halted and me frantically attempting to get it restarted. After getting it back in park, I was able to get it restarted.", "fail date": "  09/29/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "When stopped, the engine idles off but when I go to accelerate, the engine shuts off. This is becoming a safety issue as the last two times were on a highway although it is really always a safety issue. Last year the dealer had me get a new battery. While that worked for a bit, the issue is back and worse than ever.", "fail date": "  09/28/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I stopped at a red light and the idle stop function shut down like it should. When the light turned green, I let my foot off the brake and it stalled out. Some of the dummy lights came on and it stated that I needed \"to start engine: brake + push\" and shows the break pedal and the start engine button on the dashboard. So I did. It did nothing. I had to turn the car off and try to restart it. I had to do this 3 times for it to finally start back up so I could drive off. This has happened to me a total of 6 times now. All but one time was at a red light, once being at a roundabout as I was slowing down for a car coming toward me. Today I had to restart it 4 times, open my car door, take my seatbelt off and close my door back before it finally started back up. I have taken it to the dealer once before and they told me it was because my battery was weak and would not make the connection when it went to start back up. They said they 'fixed' it to the best of their ability and just basically hoped it would not happen again. Well, it did. I just had my battery checked last week and it is fine. I have a physical video of it as it is happening. As soon as my car shut itself down \"stalled out\" I grabbed my phone and videoed it. I am keeping the video on my phone. This is not safe. If I can't move at all, it will not go into neutral or anything, so I would not be able to physically move the car into the emergency lane out of traffic or anything.", "fail date": "  09/26/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "While a stop light, the idle stop feature engaged as normal, however when the brake was released the engine failed to restart. This is not the first time this has happened, but this time following the instructions on display, place vehicle in park and press the start/stop button, didn't work. It was at night and I figured I would turn off the lights and radio to help. It took 4 or 5 attempts to get the vehicle to restart. This happens more frequently when idle stop is engaged short order, such as in a long line waiting for a left turn.", "fail date": "  09/24/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Vehicle idle or auto start /stop is not functioning. . It has happened multiple times incluiding today 09/23/2022, were the vehicle shuts of and it doesnt start. . All this codes and instructions come up to try to turn the vehicle back on. . . It always happens is a street light and most of the time is a busy intersection with cars honking and the vehicle is off. . . It is very unsafe. . . It takes a couple of minutes to start the car on. . My wife has been stranded for 10 minutes in the middle of traffic going by trying to start the car. . I had this issue at 40k miles and took it to the dealership and paid $746. 96 to get the valve adjusted to correct auto start. . . Now at 73k miles is happening again. . . It started at 60k. . Today 09/23/2022 im at the dealership and they say the cant find any code this is a safety issue. . .", "fail date": "  09/23/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "For years the stop and auto-start feature will not restart automatically. Sometimes the entire vehicle itself will shut down, lose, power, then restart by itself. It is more frequent now. Last week while on the freeway, the car shut down and failed to restart altogether. The engine did not respond. I had to put it in neutral and restart the car. I had to attempt to restart it a couple of times before it finally turned on again.", "fail date": "  09/20/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "5 times now we have been stopped in traffic and the auto stop/start function correctly stopped the engine but the car would not start back despite multiple attempts. Thankfully after about 30-40 seconds the dash lights come back on then the start button will respond and the car will crank and run normally.", "fail date": "  09/20/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "On many occasions, when the vehicle is stopped (at a light or in gridlock), when I remove my foot from the brake to apply the gas, the engine stops and the vehicle shuts down all systems (audio, nav, etc). When this happens, for a very brief time (too short to get a photo) warning lights related to the collision and/or emergency braking systems flash. After those lights go away, the dashboard lights indicate that the vehicle is in neutral (not by my doing) and that I must press the brake, put the vehicle in park, and restart the vehicle. This process does not always work the first time and the delay of turning off and restarting the car, even when it does work, causes a dangerous situation in traffic. When this happens on a downward hill, my vehicle rolls forward as it “dies” and I am sometimes stuck in the middle of an intersection as I try to restart the vehicle as quickly as I can. When it happens in heavy stop and go freeway traffic, I’m often surrounded by vehicles traveling at high speeds. I’m terrified that my baby and toddler will be hurt in this vehicle. I find it egregious that Honda has not issued a fix, a recall, or any other option for owners of vehicles with such a dangerous flaw.", "fail date": "  09/19/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "When stopped the engine shuts off. It does not always turn back on when attempting to accelerate.", "fail date": "  09/17/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "On multiple occasions now my Pilot has completely shut down while the auto-idle is on and I have been unable to restart it quickly. My young children and I have been stuck in traffic multiple times unable to move or get out of the way of oncoming traffic due to this and most recently on 9/16/22 I was almost hit due to be unable to restart my vehicle. I typically keep the auto-idle off for this reason but if I forget to turn it off, it happens again. I purchased my car on 7/06/22 and this has happened 3 times (which is a very high percentage of the time the auto-idle is accidently left on). I have tried to take it into be serviced but it does not happen every time so they have been unable to assist. There are no lights on, messages or any indication when this happens, the engine just shuts completely down and takes a minute to allow you to put it into park and restart the engine by pressing the break and the start button. This is terrifying for me, my children and everyone else on the road that has almost hit my idle car. I am scared every time I get into this car and unsure what to do at this point.", "fail date": "  09/16/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Vehicle failed to restart when stopped at signal light the idle function shut the vehicle down but I had to completely restart the engine rather than it automatically restart as usual. A real traffic hazard.", "fail date": "  09/07/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Multiple times the cars engine shuts down at a light due to the auto start/stop and then stalls immediately when trying to restart the car to proceed. It takes a few attempts to restart the car .", "fail date": "  09/06/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Auto engine start/stop has failed multiple times causing dangerous conditions in traffic. Engine will not restart for minutes after cutting off due to start/stop component.", "fail date": "  09/06/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Multiple times in the past year the car has stalled when at a complete stop. It's when the car idles down and then we try to go by stepping on the gas. The engine dies completely and we need to put the car in park and then restart the car. This is very dangerous when in traffic on the highway or starting on a green light or stop sign with cars behind us. We've talked to the dealer numerous times and they haven't had any solutions. We need this fixed but think Honda should be paying for it, not us.", "fail date": "  09/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "While driving in the highway , took an exit and slowed down and stop in a traffic and the car ‘s engine stop suddenly and iam unable to restart it, the brake pad feels stuck and the neutral and drive button does not work, when you turn it on the other electronic still works like the audio and air conditioning but the engine will not turn on . It took us about an hour before the car start working again , causing a long traffic jam in the highway due to we can’t even put the car on neutral for other cars to help us move it on the side, 2 police officers came to the rescue to help us but it didn’t work until we tried again and for some divine intervention the engine start working again. I will have my car check at the Honda service in the next few days.", "fail date": "  08/28/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Vehicle failed to restart after stopping at a stop light while auto stop feature was on (defaults on). Had to completely turn off (the) vehicle and restart it for it (for) engine to fire back up. It created a unsafe situation. It took several efforts to get car restarted while traffic had to drive around on shoulder.", "fail date": "  08/24/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Failed to restart when auto engine stop engaged in the middle of a busy intersection. Large truck with heavy duty battery jump started but it took 10 minutes of being connected to the battery for the engine ignition to start again. No lack of charge (all electronics working but turned off just in case) but a defect in the restart after cutoff.", "fail date": "  08/18/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Auto-stop feature failed to restart vehicle after auto-stop was engaged at a stop light. When letting off the brake, the auto-stop disengaged, but the vehicle engine failed to start, posing a safety risk as the vehicle did not restart in heavy traffic. This has been reproduced numerous times by the owner, but not by a dealer or independent service center. The component has not been inspected by the manufacturer, but the owner is an ase certified mechanic. Warning lamps illuminate after vehicle fails to start, but the only way to restart the vehicle is to shift into park, completely shut off the vehicle electrical and attempt to restart. The system is receiving appropriate recharge from alternator, and battery is in acceptable condition.", "fail date": "  11/16/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The engine would not restart at the red light. Start/stop system was active, came to a red light and the vehicle turned off as normal with my foot on the brake, when the brakes were released the vehicle did not restart and I heard a click sound. I had to manually(push the start button) to completely turn off the car and then press it again to start the car. I had my entire family in the car including my child, with vehicles behind me on a main multi lane road. I almost got rear ended due to this malfunction.", "fail date": "  11/08/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Car fails to restart when the engine auto shut off engages. The engine will attempt to restart, but then nothing happens. The car is essentially stalled in traffic. This has happened three times. The car has to be put in park and fully shut off before it will restart using the car’s on/off button. One time it took a few minutes before the car would restart. This happened even after having the battery replaced. I informed the dealer about the problem, and the dealer acknowledged that there is some sort of problem with the auto shut off feature.", "fail date": "  10/28/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Car alarm keeps going off randomly and the electronic dashboard flickers repeatedly while the car is parked. I recently left the car at a parking garage and apparently the alarm was triggered and ran all day - I came back to the car that evening and there was clicking sound coming from the engine (not turned on, of course). The battery was drained and when I got a jump start, the alarm went off and the dashboard went crazy again. I wonder what would might happen when the car is being driven. There's clearly something wrong with the electronics. The dealer said I needed a new body control module (bcm), but the part is hard to come by apparently. Having done some research on the the issue, this appears to be a common problem with Honda Pilots. My car only has 50k miles on it and seems out of character to have this part fail. The short-term solution is to leave the car unlocked which in turn disarms the car alarm, but I've seen the dashboard and cabin lights flicker off and on in this state. This problem has been ongoing for months now.", "fail date": "  10/22/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "When at a red light the engine turns off when you press the brake. When you life you foot it should restart automatically. Multiple times my car has no restarted. It sends me a message to put the car in park, press the brake again, and restart with the push button. But it did not work immediately. I had to do the process 5-15 times before it restarted. This is a safety issue because I’m in a stalled car at a red light with traffic trying to get around my car or worse cars coming at a regular speed who don’t see I’m stopped. After researching I have seen that this issue has happened to other owners as well. I called my local dealership who said to bring it in so they could inspect it - which I have not done so yet. Just today there was a brief flash of an alert right after it restarts mentioning the collision assist or one of the other safety issues but it disappeared before I was able to fully read it.", "fail date": "  10/19/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "While the vehicle was stop, the auto shut off went off, and upon moving the foot from brake and depress accelerator, the Honda Pilot 2017 turned off and restarted requiring driver to depress engine start again.", "fail date": "  10/15/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "1. The automatic start/stop feature sometimes fails to restart the vehicle 2. On a few occasions now I have been stranded at a stoplight trying to restart the vehicle with people trying to navigate around me. 3. I have not have it inspected by the dealer or mechanic yet. In my own research of the issue I found the there are a number of complaints about the same issue in the range of model years that includes my 2017 Honda Pilot 4. There were no lamps or warnings prior to the issue. When I take my foot off the brake the engine is supposed to restart but didn't. I had to completely power off the vehicle and open the door (so that all accessories like the radio were also powered off) and restart the car. But it took multiple tries. When I pressed the starter button the accessories would come on but the engine doesn't immediately start. There were no prior symptoms and, outside of the auto start/stop failures, I have never had a problem starting the vehicle. The auto start/stop works most of the time so, although the issue has happened a few times now, it is not consistent.", "fail date": "  10/05/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "After stopping and the auto start-stop system is utilized to turn off the engine, the engine does not restart on its own when releasing the brake pedal. The vehicle must be shifted to park, turned off, and restarted before you can begin driving again. This has happened many times and poses a major safety risk since it happens predominantly at stop lights.", "fail date": "  10/03/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The engine fails to restart on its own from a complete stop at a traffic light or road intersection with the auto start/stop function engaged. This has happened infrequently in the past but is now occurring more often, multiple times a month.", "fail date": "  10/03/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Numerous times the auto stop/start feature has failed to work. When the car tries to start back after the stop/start feature has been engaged, it does not start and will completely turn the car off. All the electronics will flash off and back on. When this happens the car has to be returned to park and can take several minutes to start back leaving the vehicle stranded in the intersection. I have complained to the dealership but they say there isn’t a problem and to just turn the feature off. In order to do that a button has to be pushed every time the car is started.", "fail date": "  10/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "When stopped, the engine idles off but when I go to accelerate, the engine shuts off. This is becoming a safety issue as the last two times were on a highway although it is really always a safety issue. Last year the dealer had me get a new battery. While that worked for a bit, the issue is back and worse than ever.", "fail date": "  09/28/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "While a stop light, the idle stop feature engaged as normal, however when the brake was released the engine failed to restart. This is not the first time this has happened, but this time following the instructions on display, place vehicle in park and press the start/stop button, didn't work. It was at night and I figured I would turn off the lights and radio to help. It took 4 or 5 attempts to get the vehicle to restart. This happens more frequently when idle stop is engaged short order, such as in a long line waiting for a left turn.", "fail date": "  09/24/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "For years the stop and auto-start feature will not restart automatically. Sometimes the entire vehicle itself will shut down, lose, power, then restart by itself. It is more frequent now. Last week while on the freeway, the car shut down and failed to restart altogether. The engine did not respond. I had to put it in neutral and restart the car. I had to attempt to restart it a couple of times before it finally turned on again.", "fail date": "  09/20/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "On multiple occasions now my Pilot has completely shut down while the auto-idle is on and I have been unable to restart it quickly. My young children and I have been stuck in traffic multiple times unable to move or get out of the way of oncoming traffic due to this and most recently on 9/16/22 I was almost hit due to be unable to restart my vehicle. I typically keep the auto-idle off for this reason but if I forget to turn it off, it happens again. I purchased my car on 7/06/22 and this has happened 3 times (which is a very high percentage of the time the auto-idle is accidently left on). I have tried to take it into be serviced but it does not happen every time so they have been unable to assist. There are no lights on, messages or any indication when this happens, the engine just shuts completely down and takes a minute to allow you to put it into park and restart the engine by pressing the break and the start button. This is terrifying for me, my children and everyone else on the road that has almost hit my idle car. I am scared every time I get into this car and unsure what to do at this point.", "fail date": "  09/16/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The auto-idle system causes the car to stall quite often and poses a major safety hazard. We bought the car brand-new in may 2018. The problem started happening approximately 2 years after buying the car. The car fails to restart when you lift the foot off the break and instead, stalls the car. My husband and I have had the car stall at red lights, at stop signs, and recently while we were in the left lane of a major highway in traffic. Just this past weekend, it stalled on me twice in less than 24 hours. It takes quite a bit of time to restart because you have to put the car in park and make sure it is completely shut down before trying to start it again, while also trying to remember to put on hazard lights. I did bring it to lia Honda in albany NY on sept. 24, 2021, 3. 5 years after buying the car, specifically for this issue. They could not recreate it in the shop. They suggested I needed a new battery and proceeded to install a new batter at a cost of approximately $500 (it is my understanding batteries should be replaced every 5 years typically). This helped for about 6 months but now the car is stalling quite often again. While they have a button to disable this system, it defaults to \"on\" every time you power the car off/on, and it is easy to forget to turn it off. This is a major safety issue as the cars behind me don't realize I have stalled. I realize this is a known issue as other Pilot owners have filed similar complaints, and I hope Honda fixes this issue because we paid a lot of money for this car and will have teenagers driving it soon. We are happy to have the car inspected further if necessary. Thank you.", "fail date": "  09/16/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The idle stop feature not working properly. Many times the engine will not restart after releasing the brake and pressing the accelerator. This has left me stranded in busy traffic situations including intersections. This is very dangerous and a hazard for me and my family.", "fail date": "  09/09/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Auto engine start/stop has failed multiple times causing dangerous conditions in traffic. Engine will not restart for minutes after cutting off due to start/stop component.", "fail date": "  09/06/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "I was stopped at a stop sign and the auto-idle engaged. When I went to start again, the entire car shut down and would not start. I told me to depress the brake to start the vehicle, but the brake would not depress. I was stuck at the stop sign in the middle of a busy intersection because the car wouldn’t restart after the auto-idle engaged. After about 10 minutes, the car was able to start and I was able to drive it home. Prior to this, I have had some instances where the auto-idle would engage and when I went to drive again, all the lights would flash and it would delay in starting. The code reader read zero codes. Previous inspections from the deal found no errors as well. We are replacing the battery, but there are no other indications the battery was dead, dying or faulty and would cause this issue.", "fail date": "  08/27/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The contact owns a 2017 Honda Pilot. The contact stated that alarm on the vehicle would activate erroneously. The contact stated that after deactivating the alarm, the alarm sounded again hours later. The vehicle was not taken to be diagnosed or repaired. The manufacturer was not contacted. The failure mileage was 100,000.", "fail date": "  08/26/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "1. The problem is linked directly to the auto start/stop capability. The car is available for inspection upon request. 2. Car shut down electrically in the intersection of the road and caused traffic and police presence, semi trucks rolling through were frightening 3. Honda west dealership in las vegas inspected the problem but had no resolution to fix it. 4. No warning lights indicated a shut off was emminent.", "fail date": "  08/26/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "On numerous occasions, when the auto engine start/stop engages, due to coming to a temporary stop, the vehicle completely shuts down. I then have to restart the car manually. Usually a notification pops up on the dash telling me there’s an issue and you have to follow the instructions. It’s very stressful because I am usually in traffic and have my children with me. This is a huge safety issue.", "fail date": "  08/25/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "We bought April 2021 and 1st issue not even 60 days after purchase, dealer removed warranty without us knowing! we have had problems ever since with warming lights coming on & flashing on multiple occasions, even while traveling @ 50 mph!. Huge safety issue as the vehicle jolts and then looses power and can't pick up speed and go with flow of traffic! someone will get in an accident because of it and that will be a huge liability for Honda as you all are ware of these issues and are doing nothing to recall them and fix the problem! this is a problem for many Honda Pilot owners from all the Honda forums I have read and research ive been doing! I want the issue resolved as this is not a random. I just read that there was a service bulletin in 8/2019 pertaining to this specific car/VIN and it references faulty fuel injectors. I have no way to know if this was completed. I feel I should be able to have the injectors serviced/replaced at no cost to me as this is a huge problem with 2016-2017 Pilots and the fact a Honda dealer pretty much sold us a lemon of a car! I want our Pilot fixed as it is a problem that Honda has been having with 2016-2017 Pilots and Honda should be liable for this! happened again today and has been happening more frequent in the past few months but have been dealing with it since we bought the vehicle. Recent mechanic said the ecm/pcm may be faulty as you cant get a viable code as everytime it happens it throws all kinds of warning lights & codes that are not accurate.", "fail date": "  08/23/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Failed to restart when auto engine stop engaged in the middle of a busy intersection. Large truck with heavy duty battery jump started but it took 10 minutes of being connected to the battery for the engine ignition to start again. No lack of charge (all electronics working but turned off just in case) but a defect in the restart after cutoff.", "fail date": "  08/18/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The auto restart feature fails to restart the car after releasing the break sitting at a busy intersection. The car information center provided information to put the car in park and hit the ignition button again. I was able to get the car to restart after several tries by putting the car in park, shutting it off and turning it back on. This the third time this has happened in the past month.", "fail date": "  08/16/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "We own a Honda Pilot 2017 touring trim. I saw your news report that there is a document out there published by the NHTSA that is investigating this issue. I’d like to add my experience to this. On or about April 2022, we started experiencing the start/stop issue while living in kansas. When the issue occurred, an error message would flash very briefly across the dash, quick enough where we could not take a picture of the message. Our Honda would stutter then start back up. At this point, we took it to the legends Honda dealership [10050 parallel pkwy, kansas city, KS 66109] and after a free diagnostic they told us they could not a) replicate the issue, b) find evidence of the error message in the system. The next week, we had a complete engine failure while at a stop light for a full 5 minutes. During those 5 minutes, the engine remained off, the transmission shifted to park on its own, and the vehicle could not be restarted manually. Traffic built up behind and around us as we were trying to figure out how to get off the road and we could not turn the hazard lights on. It seems this issue is related to an electrical component. After 5 minutes, we were able to push the ignition button to turn off the car completely and restart the engine. The vehicle operated normally afterwards. On August 12, 2022, the same issue occurred where the vehicle engine would not restart and we were prevented from manually restarting the vehicle for about 5 minutes. Once again, the transmission shifted itself to park, an error message flashed across the screen briefly this time, and after 5 mins we could manually restart the car and continue as normal. Between these catastrophic failure dates, we would experience multiple start/stop stutters with error msg the only experience we have where this would not occur is to manually turn off the auto start/stop feature when driving the car. We see this as an issue that could cause injury, aggressive drivers, and other safety concerns.", "fail date": "  08/10/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Car stalled at a busy intersection and was unable to be restarted. The auto-idle restart was on as this is the default when the car is started and it engaged while I was at a stoplight (had driven approximately 1 mile prior to stopping at stop light) when light turned green, I pressed the gas peddle but the car did not restart instead it stalled. I was unable to get the car restarted. The car was in the road at a busy intersection, ultimately the police had to respond to keep traffic moving and the car was towed. Please note that during my attempts to restart the car by engaging the brake and pushing the ignition (what dash tells you to do) my hazard lights would go off - leaving me very vulnerable. This is an incredibly scary situation to be in. I usually turn off the auto restart when I get in the car because the car has previously stalled, but in the previous situations I have been able to get it restarted. Unfortunately, I forgot to turn it off on my morning commute today. This is a huge safety hazard and needs to be addressed. I have made a formal complaint to Honda and my car is currently at a Honda dealership being evaluated.", "fail date": "  08/09/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "This vehicle is equipped with an auto stop/start feature when the vehicle is in idle and the brake is depressed. Once the brake is depressed the engine will shut off and then it should re-start as soon as the brake is released. This feature is malfunctioning on my vehicle. When the brake is released and the engine is restarted the electrical system on the car occasionally shuts down momentarily. This includes the hvac, stereo, meter, lights. On 3 separate occasions the car has stalled. The vehicle is then needed to be put in park and restarted. This has happened at traffic lights and could cause an accident if the reaction time to restart the vehicle is not quick enough. I had the dealer review the problem during an oil change but they only checked the battery level and determined it was not an issue. This issue seemed to appear around 35-40k miles on the odometer. The vehicle now has 56k miles on it. The issue does not occur 100% of the time, but occurs over 50% of the time.", "fail date": "  08/08/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Vehicle stalls repeatedly when the automatic anti-idle function is active. Whenever the air conditioning and audio is on and I stop the car, the engine stops (as the anti-idle system is intended to work), then stalls out as the engine restarts. This has been happening for about 2 years and happens almost every time the anti-idle system engages. It’s terrifying when it stalls in stop and go traffic on the highway.", "fail date": "  08/07/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "In support of NHTSA action number: pe22005 2017 Honda Pilot multiple experiences with the auto idle cutting off and not restarting. 8/4/2022 was worst experience to date. The vehicle cut off at a stop light and would not restart. The ability to roll down the windows and unlock the doors was disabled so 2 occupants were potentially trapped inside. Fortunately a door had just been opened to waive backed up traffic around the disabled vehicle. Aaa and sheriff's were called to the scene. It was successfully jumped and the aaa diagnosis was that nothing was wrong with the battery, starter, nor alternator. This is a major flaw in engineering and a fix has to be developed or the vehicle appropriately replaced.", "fail date": "  08/04/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The auto start/stop on my vehicle doesn't always work. I come to a complete stop, the vehicle turns off and when I pick my foot up off the brake to restart the car sometimes it will stall. There is no warning message or indication whether or not the car is about to stall, it just happens randomly. We cannot consistently replicate the issue. In order to restart the car I have to hit the start button, wait for the car to completely shut off and then turn the car back on creating a huge safety issue especially if I'm in the middle of an intersection waiting to make a left-hand turn. This is an accident waiting to happen. I brought my car to a Honda dealership approximately 6 months ago and brought the issue up to them. They told me they could find no issue with the car, couldn't replicate it and told me they had never heard of it before. It wasn't until I did an online search a few days ago that I realized that I wasn't the only one having this issue. I drive my children in this car and would be willing to allow anyone to inspect my vehicle to try to get to the root of the issue. This is a huge safety issue for what is supposed to be a safe family vehicle.", "fail date": "  08/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Car stalls when auto stop turns back on.", "fail date": "  08/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "I was stopped at a red light. The stop idol engaged and the vehicle did not start when I attempted to make my turn. The instrument panel indicated that I should shift to park. I did so and attempted to restart the vehicle but it did not start. After a number of attempts to restart it eventually turned on and I drove straight home. I was in the middle of a major intersection with my son in the car. Car zooming by me as my car was stuck in the turning lane. If a car failing to start as a result of a feature that was integrated by the manufacturer isn’t a safety issue then I don’t know what a safety concern would be classified as according the this institution. Permanently shutting off the feature is not an option as it renegades every time you start the car initially. The car has stalled a few times prior to today’s incident but this is the first time it failed to restart. As I drove home I reengaged the system to see what would happen, if failed to restart again and began the stall every time once the idol stop was engaged. This is unsafe. If I forget to turn off the function of this feature and I am on an expressway what happens if the car fails to restart, my brakes lights may not be pressed as I am thinking I am simply going to drive off and I could get rear ended at 60 miles an hour. This is a safety issue. This is a ticketing time bomb and further delays are putting thousands of lives at risk. I did I not know about the problem until I research the internet to find a solution. Why haven’t we been informed of this problem? is this institution waiting for the body count to be high enough to warrant a consumer alert? this is a safety issue.", "fail date": "  07/30/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The problem is that which is reported here: https://static. Nhtsa. Gov/odi/tsbs/2020/mc-10184330-0001. Pdf my problem is that I am being told that my VIN number is not included in the group eligible for the warrantee extension and fee coverage for the replacement of the keyless start sytem. Seeing how my vehicle is the model, make and year that this problem is known to effect, I am confused and frustrated by the inequitable and arbitrary use of VIN numbers as determinant of coverage. This is a known issue for 2017 Honda Pilots. My vehicle clearly demonstrated all the malfunctions described and therefore, I believe it should be provided the warrantee extension and that I should not have to pay for the replacement ($168. 17).", "fail date": "  07/23/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Vehicle does not start back up after auto shut off activates. It is also stopping suddenly on the road.", "fail date": "  07/18/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The auto start/stop feature on my 2017 Honda Pilot has had issues for the last 2 year. It started with the engine occasionally \"hesitating\" to restart after I held the brake pedal down at a stop light. As it started to happen more frequently, I took it to my Honda dealer and they told me that they could not recreate the issue and thus could not diagnose and fix it. Within the last 6 months, the issue has become more and more frequent and severe to the point that I have been worried about the car not restarting and have been manually turning off the auto start/stop feature when I drive the vehicle. It does seem to occur more frequently in hot weather when I running the a/c and there is more of load on the engine and system. On July 16, 2022, I forgot to turn off the auto start/stop feature, and at the first stoplight that I stopped at, the feature turned on, shut off my engine and then failed to restart. I had to put the car in park and then it took me a few moments to get the car to re-start. The vehicle was very slow to respond, as I was afraid of the car not restarting at all. After a couple of minutes the car did restart. I turned off the auto start/stop feature and did not have any further issues on my drive home. After the failure to restart from the auto feature, my dashboard told me to put the car in park and restart. I do not recall if any other warning lights appeared, as I was franticly trying to get car restarted in the middle of traffic and cars honking at me. Once the car restarted all warning lights disappeared. Upon returning home that day, I googled the issue before making an appointment with my dealer again. I became aware of nthsa's investigation into this issue. From my experience, Honda should recall these vehicles and fix the issue. Someone could have hit me from behind at speed, as it was a green light and not everyone is always fully paying attention, or has poor depth perception.", "fail date": "  07/16/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Without warning, the sunroof suddenly exploded/shattered while driving without current or previous damage or collision. Glass particles fell into the cabin of the vehicle on driver and passenger.", "fail date": "  11/20/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Car alarm keeps going off randomly and the electronic dashboard flickers repeatedly while the car is parked. I recently left the car at a parking garage and apparently the alarm was triggered and ran all day - I came back to the car that evening and there was clicking sound coming from the engine (not turned on, of course). The battery was drained and when I got a jump start, the alarm went off and the dashboard went crazy again. I wonder what would might happen when the car is being driven. There's clearly something wrong with the electronics. The dealer said I needed a new body control module (bcm), but the part is hard to come by apparently. Having done some research on the the issue, this appears to be a common problem with Honda Pilots. My car only has 50k miles on it and seems out of character to have this part fail. The short-term solution is to leave the car unlocked which in turn disarms the car alarm, but I've seen the dashboard and cabin lights flicker off and on in this state. This problem has been ongoing for months now.", "fail date": "  10/22/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "This is my third incident of being stopped at a red light and the auto idle turns on. When the light turns green, and I release my foot from the break, my car stalls and tells me put it into park. My car essentially stalls out and I have to shut it off and on. Usually takes about 30 seconds to a minute for it to start up again. I almost got rear ended today at a light and I am concerned for my safety. How can we turn this into a recall and get this fixed before somebody gets injured?.", "fail date": "  10/11/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I am the owner of a 2017 Honda Pilot touring.   my car has been dealer maintained.   it was most recently in for routine maintenance less than 3 weeks ago.   on October 7, 2022 at approximately 2:00pm I was stopped at a major intersection. My auto idle stop engaged and my engine went idle.   when the light turned green, I let off the brake my car jumped 2-3 times and went dead.   the dashboard showed the car to now be in neutral and the battery indicator was lit.   I quickly attempted to restart the car and/or put the car in park.   over the course of 30+ seconds, I tried various combinations pushing the start button or the park button. There was no response.   I attempted to call my husband, he was unavailable, so I tried again and the car started immediatley (while in neutral).    I have had numerous instances of the auto idle stop not responding quickly when it should restart.   the delay can be up to 4 seconds after lifting my foot or turning the wheel.   it has become my habit to turn off auto idle stop when starting the car.   I believe 90%+ of my driving is without it due to the unreliability.   however the latest incident has me very concerned about driving the car.   this along with other transmission/computer issues have been mentioned to my dealer during routine service. Many of those issues were corrected, however an issue with the auto idle stop has not been discovered and I was advised to deactivate it when starting the car.   please keep in mind that the default setting is on. If I forget to deactivate or when someone borrows my car, this becomes a concerning issue.    I contacted my Honda dealer and made an appointment to have it looked at again.  .", "fail date": "  10/07/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Vehicle idle or auto start /stop is not functioning. . It has happened multiple times incluiding today 09/23/2022, were the vehicle shuts of and it doesnt start. . All this codes and instructions come up to try to turn the vehicle back on. . . It always happens is a street light and most of the time is a busy intersection with cars honking and the vehicle is off. . . It is very unsafe. . . It takes a couple of minutes to start the car on. . My wife has been stranded for 10 minutes in the middle of traffic going by trying to start the car. . I had this issue at 40k miles and took it to the dealership and paid $746. 96 to get the valve adjusted to correct auto start. . . Now at 73k miles is happening again. . . It started at 60k. . Today 09/23/2022 im at the dealership and they say the cant find any code this is a safety issue. . .", "fail date": "  09/23/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Auto start/stop feature malfunction. Vehicle fails to restart after shutting off using auto start/stop feature.", "fail date": "  09/14/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Since purchasing my car in 2018 the idle stop sometimes seemed like it \"glitched\". It would take an extra second or two to restart, the radio would turn on and off and lights on the dash would flash, but the car still worked. Within the last few months I've had 3 occasions where the car just wouldn't start again when I hit the gas. I need to shut the entire car off, wait a few seconds, and restart the entire car. This is extremely scary when you are stopping for a quick turn and an huge safety concern when your car won't go when you hit the gas during an unexpected stop (during a turn, at a red light, stop sign, etc. ).", "fail date": "  09/09/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Vehicle failed to restart when stopped at signal light the idle function shut the vehicle down but I had to completely restart the engine rather than it automatically restart as usual. A real traffic hazard.", "fail date": "  09/07/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Was driving on a not busy road on the morning of August 30th, 2022 when I heard a large bang/ boom sound and my sunroof literally exploded with glass luckily falling onto the sunroof viser.", "fail date": "  08/30/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "While driving in the highway , took an exit and slowed down and stop in a traffic and the car ‘s engine stop suddenly and iam unable to restart it, the brake pad feels stuck and the neutral and drive button does not work, when you turn it on the other electronic still works like the audio and air conditioning but the engine will not turn on . It took us about an hour before the car start working again , causing a long traffic jam in the highway due to we can’t even put the car on neutral for other cars to help us move it on the side, 2 police officers came to the rescue to help us but it didn’t work until we tried again and for some divine intervention the engine start working again. I will have my car check at the Honda service in the next few days.", "fail date": "  08/28/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "We bought April 2021 and 1st issue not even 60 days after purchase, dealer removed warranty without us knowing! we have had problems ever since with warming lights coming on & flashing on multiple occasions, even while traveling @ 50 mph!. Huge safety issue as the vehicle jolts and then looses power and can't pick up speed and go with flow of traffic! someone will get in an accident because of it and that will be a huge liability for Honda as you all are ware of these issues and are doing nothing to recall them and fix the problem! this is a problem for many Honda Pilot owners from all the Honda forums I have read and research ive been doing! I want the issue resolved as this is not a random. I just read that there was a service bulletin in 8/2019 pertaining to this specific car/VIN and it references faulty fuel injectors. I have no way to know if this was completed. I feel I should be able to have the injectors serviced/replaced at no cost to me as this is a huge problem with 2016-2017 Pilots and the fact a Honda dealer pretty much sold us a lemon of a car! I want our Pilot fixed as it is a problem that Honda has been having with 2016-2017 Pilots and Honda should be liable for this! happened again today and has been happening more frequent in the past few months but have been dealing with it since we bought the vehicle. Recent mechanic said the ecm/pcm may be faulty as you cant get a viable code as everytime it happens it throws all kinds of warning lights & codes that are not accurate.", "fail date": "  08/23/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "On multiple occasions, while the auto idle was one, I stop at a red light or intersection and when I lift my foot off the brake the vehicle shuts completely off. One time, I called 911 for police officer assistance to alert that I was stranded in the middle of the highway. I was so afraid I was going to be rear ended by fast moving traffic. Just yesterday, while stopped at a red light, a fire engine stopped and 4 fire fighters got out to offer assistance while I sat there stranded alone on this busy highway trying to get my vehicle to start back up. The brakes lock up and the vehicle completely shuts down. Each time I try many times to get my car started and it takes many attempts to crank the vehicle. I asked my service agent about the problem and he was unaware. He said they would have to drive the car to see if it happens with them and there is a diagnostic fee for this. I declined because it does not happen every time and I felt quite sure it would not happen when they were looking for it. This malfunction is sporadic.", "fail date": "  08/14/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Emissions system problem on 8-11-2022, multiple lights came on the dashboard with multiple systems errors. Brought to dealership and they replaced the fuel injectors. The dealership stated that this was a known problem with the 2016-2017 Honda Pilot's. Honda is giving a 10-year, 150,000 mile extended warranty from the date of purchase to cover fuel injectors and pipes leading up to the fuel injectors. On 9-27-2022, dash lit up with another emissions system problem. Brought to same dealership and they stated that the vehicle needed a software update. On 10-31-2022, dash lit up for the third time showing emissions system problem. Brought to same dealership. Currently waiting on diagnosis.", "fail date": "  08/11/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "When my auto stop idle engine kicks on, and stalls when I try to depress brake and press gas. It has happened approximately 10 times over the past year and a half, always in an intersection when it’s dangerous. I have taken to the dealership more than once and they have been unable to resolve and recommended I replace my battery which I did which has not made the situation better. I also just filed a complaint with Honda but this is very dangerous and needs attention.", "fail date": "  08/10/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Car stalled at a busy intersection and was unable to be restarted. The auto-idle restart was on as this is the default when the car is started and it engaged while I was at a stoplight (had driven approximately 1 mile prior to stopping at stop light) when light turned green, I pressed the gas peddle but the car did not restart instead it stalled. I was unable to get the car restarted. The car was in the road at a busy intersection, ultimately the police had to respond to keep traffic moving and the car was towed. Please note that during my attempts to restart the car by engaging the brake and pushing the ignition (what dash tells you to do) my hazard lights would go off - leaving me very vulnerable. This is an incredibly scary situation to be in. I usually turn off the auto restart when I get in the car because the car has previously stalled, but in the previous situations I have been able to get it restarted. Unfortunately, I forgot to turn it off on my morning commute today. This is a huge safety hazard and needs to be addressed. I have made a formal complaint to Honda and my car is currently at a Honda dealership being evaluated.", "fail date": "  08/09/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Today (8/2/22) is the second time this has happened to my vehicle: the engine fails to restart on its own from a complete stop at a traffic light or road intersection with the auto start/stop function engaged. My car died, with bare components still working (windows and a few lights came on - battery and oil), but I was in the middle of a busy intersection when this happened, which is also a few feet away from a railroad crossing, which would have endangered the lives if others were behind me if they failed to pay attention to my hazard lights - which they did). My battery was replaced at the Honda dealership in April 2021, so it's less than 2 years old. A jump was required for the vehicle to restart and is now at germain Honda of dublin (again) for inspection of the issues.", "fail date": "  08/02/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The auto start/stop on my vehicle doesn't always work. I come to a complete stop, the vehicle turns off and when I pick my foot up off the brake to restart the car sometimes it will stall. There is no warning message or indication whether or not the car is about to stall, it just happens randomly. We cannot consistently replicate the issue. In order to restart the car I have to hit the start button, wait for the car to completely shut off and then turn the car back on creating a huge safety issue especially if I'm in the middle of an intersection waiting to make a left-hand turn. This is an accident waiting to happen. I brought my car to a Honda dealership approximately 6 months ago and brought the issue up to them. They told me they could find no issue with the car, couldn't replicate it and told me they had never heard of it before. It wasn't until I did an online search a few days ago that I realized that I wasn't the only one having this issue. I drive my children in this car and would be willing to allow anyone to inspect my vehicle to try to get to the root of the issue. This is a huge safety issue for what is supposed to be a safe family vehicle.", "fail date": "  08/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "When the auto off/idle shuts the Pilot off at a street light, sometimes the car will not turn back on. This has happened to me twice.", "fail date": "  08/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I was stopped at a red light. The stop idol engaged and the vehicle did not start when I attempted to make my turn. The instrument panel indicated that I should shift to park. I did so and attempted to restart the vehicle but it did not start. After a number of attempts to restart it eventually turned on and I drove straight home. I was in the middle of a major intersection with my son in the car. Car zooming by me as my car was stuck in the turning lane. If a car failing to start as a result of a feature that was integrated by the manufacturer isn’t a safety issue then I don’t know what a safety concern would be classified as according the this institution. Permanently shutting off the feature is not an option as it renegades every time you start the car initially. The car has stalled a few times prior to today’s incident but this is the first time it failed to restart. As I drove home I reengaged the system to see what would happen, if failed to restart again and began the stall every time once the idol stop was engaged. This is unsafe. If I forget to turn off the function of this feature and I am on an expressway what happens if the car fails to restart, my brakes lights may not be pressed as I am thinking I am simply going to drive off and I could get rear ended at 60 miles an hour. This is a safety issue. This is a ticketing time bomb and further delays are putting thousands of lives at risk. I did I not know about the problem until I research the internet to find a solution. Why haven’t we been informed of this problem? is this institution waiting for the body count to be high enough to warrant a consumer alert? this is a safety issue.", "fail date": "  07/30/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The auto start/stop feature on my 2017 Honda Pilot has had issues for the last 2 year. It started with the engine occasionally \"hesitating\" to restart after I held the brake pedal down at a stop light. As it started to happen more frequently, I took it to my Honda dealer and they told me that they could not recreate the issue and thus could not diagnose and fix it. Within the last 6 months, the issue has become more and more frequent and severe to the point that I have been worried about the car not restarting and have been manually turning off the auto start/stop feature when I drive the vehicle. It does seem to occur more frequently in hot weather when I running the a/c and there is more of load on the engine and system. On July 16, 2022, I forgot to turn off the auto start/stop feature, and at the first stoplight that I stopped at, the feature turned on, shut off my engine and then failed to restart. I had to put the car in park and then it took me a few moments to get the car to re-start. The vehicle was very slow to respond, as I was afraid of the car not restarting at all. After a couple of minutes the car did restart. I turned off the auto start/stop feature and did not have any further issues on my drive home. After the failure to restart from the auto feature, my dashboard told me to put the car in park and restart. I do not recall if any other warning lights appeared, as I was franticly trying to get car restarted in the middle of traffic and cars honking at me. Once the car restarted all warning lights disappeared. Upon returning home that day, I googled the issue before making an appointment with my dealer again. I became aware of nthsa's investigation into this issue. From my experience, Honda should recall these vehicles and fix the issue. Someone could have hit me from behind at speed, as it was a green light and not everyone is always fully paying attention, or has poor depth perception.", "fail date": "  07/16/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Auto stop/start feature. We have to insure to turn it off when we drive to avoid it not working properly. . . Stops completely and we have restart the car manually and it sometimes seems it doesn't want to restart. If it does work, power to other systems, radio, all blink off then on. We don't trust this feature and thought it was battery issue but shop tested battery and no issues with it. We have been lucky when this has happened, with only one car behind us when it failed to restart in the city at night. My wife was scared. I had to talk her out of the situation on my phone, the other car was patient. This could cause an accident. This has been happening since 2018 and we only avoid by shutting the feature off. Honda needs to reimburse us for this worthless and dangerous feature. They also should allow us to turn it off since it is a safety issue.", "fail date": "  07/07/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I moved into the left lane to merge onto another road. I had to come to a stop because a car had was stopped ahead of me. After that car moved, I lifted my foot from the brake and pushed the gas to make my left hand turn. The car didn’t move. A light flashed on the car that said something like “to start engine push brake and push start” I looked down at the gear shifter and noticed it was on n. I tried to hit “drive. ” the car flashed the sign again. I put the car in park. I tried to put the car back in drive. The car would not change gears. I put on my hazard lights, turned off the car, and restarted it. The car transitioned from park to drive. There have been many instances where I’m merging onto a roadway or slowing down to turn left where the car hesitates. I will be braking. I lift my foot from the brake to press the gas pedal and nothing happens. The car moves because it’s going downhill, but the gas pedal is not causing the car to move. When the car does finally move, it moves with a huge lurch. There have been times that I'm unable to move my car with the gas pedal while crossing traffic. It's terrifying and Honda says that they are unaware of the problem and unable to replicate it.", "fail date": "  06/26/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The idle/stop function stopped operating at a stop light. The car completely shut off. My wife pressed the brake and ignition but the car did not immediately restart. After a few long minutes, the function worked. This is the second incident with the Honda Pilot. In may 2022, the vehicle stopped at an intersection and cut off. I took it to the Honda service and had diagnostics ran. I was charged for the test but the service department did not find anything wrong. They recommended a new battery which I purchased. This was in may 2022. There is definitely an issue. No use taking it back to the dealer, they don't know the source of the problem.", "fail date": "  06/22/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The engine with shuts off normally when I come to a stop when I have the system engaged. The problems begin when I take my foot off the break expecting the engine to start up again. What happens consistently (though not all the time) is that when I take my foot off the brake, the engine shuts off, shifts itself into park, and I have trouble getting the engine to start up again. When I disengage the system, which I do practically every time I drive the car now, everything works fine. The dealer din't find anything when they ran a diagnostic, so I'm at a loss.", "fail date": "  06/18/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Twice now and it seems to be worse in the summer when the air conditioning is running the auto shut off at a stoplight fails to restart the engine and the car dies at an intersection. This feature is dangerous and very frustrating to the point where I turn this feature off every time I get in the car now. This is happened both to me and to my 16-year-old son. Many times when it tries to reengage it has a hard time starting right back up. This is in addition to the two times it completely died.", "fail date": "  06/15/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The auto start\\stop feature doesn't work and is extremely unsafe and dangerous. I will be sitting at a stop light and when the light turns green I take my foot off the break and the car will completely turn off and error messages will appear. Multiple times it has completely turned off the car and the car couldn't be restarted right away, leaving us stranded in the middle of the street trying to restart the car while cars are going by me. It takes at least a minute for the car to restart once it turns itself off. This has happened at least 10 times. We always turn the feature off when we drive now but sometimes we just forget because it's extremely inconvenient and difficult to remember that we have to turn off the feature every single time we start the car. When we took it to the dealership mechanic they told us we needed a new battery and that would fix the problem. Our battery was still at 50% and yet we still changed it but the problem has never gone away.", "fail date": "  06/11/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Auto engine idle stop not working correctly. Have seen others online with same issue.", "fail date": "  06/07/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The engine won’t restart on its own from a complete stop, have to disable the auto engine shutdown due to concerns of car not re-starting.", "fail date": "  06/05/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "We have had several instances when our Honda shuts off and will not restart. Several times we either a) have to leave it sit for hours b) press really hard on the brake pedal and hold the start button down for an extended period of time c) get the other set of keys which seems to then allow the vehicle to start or d) jump it to reset the issue so it will start and run. We also think this is somehow tied to the auto start stop or restart function.", "fail date": "  06/05/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The auto stop/start feature does not always restart the car when I release the brake after stopping. Mostly in town at stop signs and red lights but recently it happened while I was in stop and go traffic on an interstate. At all locations I was blocking traffic (flashers on of course) and hoping no one hit me while I sat for a few minutes trying to restart my car. From experience I have found that I have to release the brake and push my engine start button a couple times to completely turn off everything then push the brake and button to start the car. A few times it I had to do that cycle several times before it actually restarted. Meanwhile I am in the middle of the road completely blocking traffic. My dealer was “unable to replicate” so my solution has been to turn off that feature. Unfortunately, auto stop/start is automatically on every time I start my car … so this happens when I forget to turn it off. There are times that it works and the car restarts but even then the electrical system shuts down. Radio turns off and back on as the car is restarting and dash lights turn off then on, which reminds me to once again turn the feature off. I have had a lot of electrical issues with this car due to a sunroof leak so I chalked it up to my ongoing electrical problems until I saw the article today about other complaints from people having the same issue. The date listed below was the most recent incident but it has occurred many times.", "fail date": "  06/03/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Our car is 1,100 miles over warranty and the air conditioner system broke. The dealer cannot tell me anything about why it happened, just that they need to replace the entire system, including the compressor and condenser. Our ac is blowing hot air now (and we live in georgia and it's the summer), so the car is basically undriveable. It's going to be $5900 to replace.", "fail date": "  05/21/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "When exiting the interstate and stopped at stop sign, vehicle shut off due to auto stop/start feature. When I released the break to go, the vehicle did not start and completely shut down. The vehicle had to be placed in park, break pressed and ignition button pressed again. It took a little bit but it did start again. After this incident, this has also happened about 10 more times stop lights around town. It has always started again but it takes a minute to restart and multiple steps are needed for it to be restarted. Traffic has been backed up while I attempt to restart the vehicle.", "fail date": "  05/21/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The idle shut off feature has shut the car off and then not restarted when it was supposed to. This has happened in two intersections and a stoplight. When it doesn’t restart, I am unable to do anything, shift in to park or restart the car. It is extremely unsafe as it leaves you sitting in the middle of traffic or wherever it decides to leave you and you can’t do anything with the vehicle. There is no warning when it does it. I have not approached the dealer since there is a button to override the feature I figured they would not listen. However I think it is ridiculous that you have to push a button to make sure your vehicle doesn’t die on you while driving. I would like to see the auto idle feature removed from the vehicle.", "fail date": "  05/14/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The automatic start/stop killed the engine at a stop light, and took several tries to restart the engine. I always disengage this feature now to avoid being stranded.", "fail date": "  04/30/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "On Saturday, 30 April 2022, while driving approximately 65 mph on a state highway in alabama from florida, the sunroof spontaneously exploded. Thankfully, at the time of the incident the sunroof and shade were both closed. However, had the shade been open, all of the glass would’ve shattered on my two children, my husband, and myself. Being that this occurred while I was driving, it could have resulted in a serious accident. I have never had any issues with the sunroof up until this incident. There were no warning lamps or system messages that there were any problems with my vehicle. My vehicle has always been regularly serviced at a certified Honda dealership service center since I purchased it in 2017.", "fail date": "  04/30/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Warning signs pop up when it hits 65mph on the highway. It blinks, “transmission system problem” with warning sounds ever so often. I tried to take it to jiffy lube multiple times, and they could never find the problem. They checked the transmission fluid and it was okay. They ran diagnostic and nothing was found, yet, this message error appears here and there. I am not sure what else there to do but to report that it’s not safe.", "fail date": "  09/27/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Moving from a stationary position while driving under 10 mph the vehicle shifts from 1st gear to 2nd gear with a heavy jerk motion.", "fail date": "  09/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Vehicle would shift into neutral upon acceleration such as when passing and take up to a minute to reengage in a gear to continue acceleration. Generally happened at 50-60mph on the highway. Called dealer multiple times and brought in at 47,000 mi, but no codes generated by vehicle and dealer couldn't replicate. Finally at 81,000 transmission completely failed on a busy highway exit ramp and car could not be put in gear. Blocked traffic for 2 hours before car could be towed to the dealer. It appears Honda had transmission based recalls up to 2016 but not 2017 model year.", "fail date": "  08/05/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Driving on the highway, came to a stop due to high volume of traffic, car stopped completely and auto/start turned off the engine itself like it should when brake is stepped on all the way, traffic started to move, let go of the brake to have engine turn back on like it normally would, however this time the engine did not start back on itself, tried to step on the brake and would not allow to press on it. Hit the engine start button light would come on however brake still would not allow to be stepped on, its like it is stuck. Tried this for about 5min and suddenly I was able to press on the brake and start the engine by hitting the start engine button. The component that failed is the engine, auto/start feature, power train, and electrical system. This was a big safety issue and yes it would not only put myself at risk but others safety at risk too. No the problem have not been reproduced or confirmed by a dealer no the vehicle or component has not been inspected by anyone no there was no warning when it first appear, it just happen.", "fail date": "  06/21/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "At least once a week the vehicle shuts off and don’t restart at stop light/ sign.", "fail date": "  06/18/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "When the engine stops when the brake is applied, there are times when the engine shuts down completely, restarting electrical systems and not starting up again. This incredibly scary and dangerous. I have brought it to the dealer who has no idea how to fix it. I read an article that this is something the NHTSA is investigating and am very relieved that there is finally some attention being paid to this problem. I wanted to log my vehicle as being effected also.", "fail date": "  06/11/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "This car has an automatic start/stop feature/function that shuts the engine off when the brake is fully pressed. The purpose is to save fuel when stopped at a red light or in heavy traffic. As soon as you release the brake, the engine is supposed to restart automatically. Unfortunately whats been happening is either the engine does not restart or it begins to restart and then stalls. In either case, the car needs to then be put into park, fully turned off, and then restarted. In most cases, it more an annoyance for everyone involved. However, what has happened a number of times is that we’ve moved into an intersection to make a left, stopped for oncoming traffic to pass, and then started our turn. The car has stalled then. Luckily there has been no accidents, but that is by luck. As the lights change, we have to quickly restart and get out if the intersection. I’ve searched online for a solution. Many people have post about the same issue in various forums. Many have also taken their car to Honda dealership for service, but there has been no consistent response as to the cause or a solution. In more recent models, Honda has changed how this feature works, but they have not provided any solution for models preceding the change. Thank for any resolution you can bring to us the many others impacted by this point problem. Fyi this is not an issue on a single date; it is inconsistent but recurring.", "fail date": "  06/07/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "We were at a sheetz gas station last month and the auto-start/stop cut the engine off and it would not restart. We had to place the car in park and manually restart it. We have had this issue happen on another occasion and we purchased the car in April.", "fail date": "  05/20/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "I have experienced several instances where the vehicle's auto stop-start system fails to restart the vehicle's engine after a stop. This has happened 2-5 times. Specifically, when the vehicle is at a full stop (with brake fully depressed), the auto stop-start system is designed to stop the engine to conserve fuel by turning the engine off. During the episodes at issue, the system works correctly to stop the system. However, when I have released the brake pedal and attempted to resume driving, the engine has failed to restart and the power system appears to fail/reset. The vehicle then requires that I attempt to restart it using the stop/start button. On at least one occasion, I had to make multiple attempts to restart the vehicle before it finally began operating again. This situation often results in the vehicle obstructing traffic for an extended period of time and creating a dangerous situation. I have begun disabling the auto stop-start system when driving the car to avoid this problem occurring.", "fail date": "  05/17/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The contact owns a 2017 Honda Pilot. The contact stated that while the vehicle was idling at a stop light and attempting to proceed to drive, the accelerator pedal was depressed; however, the vehicle lost motive power and stalled. The contact shifted the vehicle to park(p) and restarted the vehicle. The failure only occurred whenever the auto start/stop function was activated. The contact took the vehicle to the dealer who diagnosed that the fuel injector failed and needed to be replaced. The failure persisted. The contact returned the vehicle to the dealer who then diagnosed the vehicle and determined that the torque converter and converter clutch failed and needed to be flushed or replaced. The vehicle was not repaired. The manufacturer was made aware of the failure. The approximate failure mileage was 56,000.", "fail date": "  05/04/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "At start up, both with remote start an manual start, the vehicle will lurch forward. It seems to be happening with more frequency for a total of about 10 times. My worry is that at start up the vehicle will strike nearby pedestrians or property. The transmission has had start / stop issues and “hard” shifts but the dealer has not found any issues. There are no warning lights associated with this issue.", "fail date": "  05/02/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "For the past few months, I have been having issues with my vehicle stalling. This issue occurs while stopped at red lights, stop signs, and while sitting in stop and go traffic. My vehicle is equipped with the auto start/stop feature, and while stopped at a stop sign for instance, the vehicle will auto stop but fail to auto start when taking my foot off the brake and hitting the gas. This has happened on numerous occasions, putting those in the vehicle and those in other vehicles around my vehicle at risk. I brought my vehicle to my local dealership, at which point they checked it and found nothing wrong with the vehicle. They also stated that they, and the vehicle manufacturer were aware of the issue, but have no solution for it. The first time I brought the vehicle in, the dealer told me that a possible fix was an update to the system, however I would have to pay for the update. After the service adviser spoke with the service manager a few times, the dealership paid for the $220 update. The vehicle has since continued to stall, the only thing that seems to assist is to turn off the auto start/stop feature every time the vehicle is turned on. Last Thursday, the vehicle stalled again on my wife with our son in the vehicle at a t-intersection. The vehicle failed to start for approximately 10-15 minutes. I contacted my dealer again and was advised to bring my vehicle in. I brought it in and was told that I could have a rental car, but that I would need to approve paying a $160 diagnostic fee. They were unsure of a permanent solution for the problem.", "fail date": "  03/31/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Traveling about 70 mph on the interstate using cruise control. I don’t think there was a change in steepness/grade, but if there was it was mild. Suddenly, the rpm’s were erratic and the engine and gears seemed out of sync. Pressing the gas pedal didn’t seem to effectively accelerate the vehicle. I don’t believe the brakes were affected. The “d” for drive indicator kept blinking on and off. Multiple warning lights on the dash display: transmission system problem, all wheel drive problem, and interestingly, blind spot monitor problem. The last indicator to show was emissions system problem, and this indicator remained on the screen. I exited the interstate. Shifted to reverse, then parked the car and turned engine off. After a few moments, I restarted the engine and the only anomaly I observed was the warning indicator light on the dash read: emissions system problem. There was roughly 1/4 to 1/2 tank of gasoline remaining at the time of incidence. I continued to drive approximately 350 miles more to my destination, without using cruise control and without further or other issues. I made a couple stops to add gas and both times the engine was turned off then back on again without issue. The following day, after restarting the engine, the “emissions system problem” warning indicator light was no longer showing on the display. I have yet to encounter the problem thus far, but I haven’t used the cruise control since nor have I driven at interstate speeds for any considerable length of time. I haven’t yet taken the vehicle to the dealer for inspection. But will do so.", "fail date": "  12/17/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "When slowing down to stop at a light, or pull into a parking space, the vehicle rather than braking and stopping, accelerates violently on its own, and there is no way to stop it other than putting the vehicle in park immediately, or slamming on the emergency brake. This is an intermittent problem. It happens once every few months, however last night it occurred and I did not put it in park quickly enough, and I was close to another vehicle while parking, that I slammed into the other vehicle doing extensive damage. Obviously, this is a very dangerous situation that could kill or maim myself or an occupant of another vehicle; the police officer who happened to own the other vehicle said I should not drive my vehicle until the problem is solved, which, of course, makes sense as my vehicle at present is unpredictable and dangerous. I have now taken the vehicle into the dealer, but I've found in the past these intermittent problems are difficult to diagnose. Should it not be diagnosed and fixed--I noticed that others have had this same vexing and dangerous situation, and it was not fixed or resoved to their satisfaction--I will no longer drive the vehicle as it is too dangerous. There seems to be a glitch with the drive trains/engines of the 2017 Honda Pilot and this needs to be fixed and the vehicles recalled before serious injury occurs, if it has not already. Owners of these vehicles should be compensated, or receive a comparable vehicle that is road worthy.", "fail date": "  12/03/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "In the past week, my Pilot has stalled for no known reason. Both times the vehicle was stopped and the feature that idles the car down to conserve energy was activated. When I let off the brake instead of the car restarting or gearing up and accelerating, the car just died. Warning lights went off on the dash, but the car wouldn't restart for at least a minute both times. No warning lights were on the dash before the incident and after the car restarted, no warning lights remained lit on the dash. I took my car to an automotive store and had them check the battery, the alternator and the starter - all of these came back as being in perfect condition. I was extremely scared when both of these incidents occurred. One time I was at the bottom of an exit ramp of a busy interstate and the other occurred on an interstate in stop and go traffic. In addition to these two incidents, for the past 2 years, the car has been having issues after it idles down and then should restart and accelerate. About 2-3 times per month, when the car is stopped and has idled down, when I let off the brake and accelerate, the electrical system will flash on and off. The entire dash goes dark, the audio goes off and comes back on, etc. The entire electrical system reboots. When this happens, it does not impact the ability of the car to accelerate because it is more like a flash - the car doesn't die and have to be restarted. I am taking my car into the Honda dealer on Monday to attempt to diagnose the problem, but from the research I've done, may other Pilot owners are having the same problem and their dealers aren't able to find an error code caused by these issues. I have been attempting to get a video of this when it happens, but so far, I've been unable to reproduce the issue.", "fail date": "  11/24/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "My vehicle is a 6 speed automatic transmission, which is experiencing symptoms known to affect 9 speed transmissions as documented in TSB 20-029, hard upshift with steady acceleration. The transmission has intermittent harsh or jerky upshifts with steady acceleration. The vehicle will 'clank' and jump slightly forward, while accelerating between 20-45mph. Does not happen always - have not determined a pattern.", "fail date": "  10/06/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Keyless start system malfunction.", "fail date": "  08/26/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Auto dashboard warning lights started and remained flashing. Transmission would not up shift - slipped into neutral - surged and jerked when up shifting this experience was repeated after pulling off the highway and attempting to reenter traffic. This was a dangerous experience as it occurred on a high speed interstate. I took the auto to the dealer but they were not able to reproduce the problem and their diagnostics check could not find a problem.", "fail date": "  07/16/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Car goes into neutral or no gear at all when still in drive on its own. Has done this multiple times, will end up getting us killed at some point because when you go to get on the accelerator to get out of someone’s way the engine just revs up.", "fail date": "  07/07/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The contact owns a 2017 Honda Pilot. The contact stated while driving 10-15 mph, the vehicle started shuddering inadvertently. There were no warning lights illuminated. The contact was able to continue to drive to her destination. The dealer was notified of the failure. The contact stated that the failure had been recurring while shifting into first gear. The manufacturer was not notified of the failure. The vehicle was not diagnosed nor repaired. The approximate failure mileage was 65,000.", "fail date": "  07/05/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "My car completely shuts off at stop sign/red light when engine idle feature is activated. I have to put car in park and restart it. This has been an ongoing issue since summer 2021. Vehicle was evaluated at dealership with no resolve. In addition, a new cam shaft had to be installed in fall 2022 , at Honda's expense. Car completely stalled while passing another (55mph).", "fail date": "  06/14/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Vehicle will not restart after engine auto idle engages. When lifting foot off the brake to begin driving car will not restart and says you must go into park and press brake. Radio and lights are still on. Even after shifting into park and pressing brake it will not start. After removing foot from brake and pressing stop car will completely turn off. We can then press start and car will usually start within three or four tries. This has happened about 10 times, with the last being in the center lane of a major freeway. Traffic came to a stop and when we started going again I was completely stuck in the middle lane with cars going all around me. Has also happened multiple times at stoplights and in drive throughs. I try and always disable this feature but forget sometimes.", "fail date": "  04/11/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Per pe 22-005, with auto idle stop enabled, when coming to a stop light, I stopped. When the light turned green, and I let my foot off the brake, the engine would not restart, as if the battery were dead. I put the car in park, turned it off, turned it back on, and was able to restart the engine. This happened in about March of 2021. Since that time I always disable auto idle stop, as it may create an unsafe traffic condition or accident if this were to happen in traffic. I was going to replace the battery, but have not done so since the occurrence 16 mos. Ago, and have had no other issues with the battery in that time.", "fail date": "  03/15/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Tiene un bote DE aceite y se me encendi� la se�al DE problema en la transmisi�n mientras iba rodando por la autopista.", "fail date": "  02/13/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The car would not go into reverse and when it finally did and we pulled out we received a transmission problem warning.", "fail date": "  12/24/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "After coming to a stop or slowing down to a very low speed, when I reaccelerate to build speed, the transmission stalls and then jerks into gear while in eco-mode. At times this is almost causing a collision. I reported this to the dealership almost a month after my purchase and 4 more times after the first report and each time they had no resolution except the last time to do a transmission flush which I had to pay for. In some of suggestions and questions, it appears that the dealership knows that there's an issue.", "fail date": "  11/19/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "My wife has reported on several occasions that when the idle-stop feature is turned on and the vehicle has come to a stop, the engine cuts as intended but will not restart when pressure is released from the brake. Numerous lights within the instrument panel, with the exception of the check engine light, illuminate, the transmission shifts itself into neutral. The vehicle says to shift into \"park\", press and hold the brake and restart the vehicle using the start/stop button. I have tried to duplicate this while driving the vehicle. Yesterday, this same occurrence happened to me only I was not able to readily restart the vehicle. This latest occurrence happened in heavy traffic at a busy intersection. My wife reports having had this occur at least six to seven times, once while in traffic on the freeway. I have brought the vehicle to Honda in the past because of the vehicle jjuttering at low speeds and because of this issue. Each time I was told that because no error code was found and the issue could not be duplicated, there was nothing they could do. This issue is a potential disaster waiting to happen.", "fail date": "  11/11/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Twice while car was braked at stop light the car slipped into neutral and turned off after I took my foot off the break. When I tried to compensate for car going into neutral car turns off. This almost caused an accident as I was a green turn arrow and could not turn and car behind me almost hit me. I had 2 children in the car with me.", "fail date": "  10/08/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "While accelerating between 44-48 mph, the car judders/shakes.", "fail date": "  09/12/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "I currently own a 2017 Honda Pilot with auto stop/start feature, my wife has been driving and on multiple occasions she stopped and the vehicle would stall causing a safety concern. She then stops traffic and as they have to go around her. She has to wait a few minutes for the vehicle to restart. Of course being a hazard on the road my wife is in danger of getting hit. We contacted the dealer and they stated that if there is no errors they cant fix the problem. Multiple forums I am seeing the same concern.", "fail date": "  09/11/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "For roughly the last 4 months, my car stalls at a stop (stop sign, traffic light, etc) by shifting itself into neutral. The car has a push button gear shift and the warning light says to shift the car into park. Sometimes, I can shift the car into park and sometimes I can't shift the buttons at all. If I am able to shift into park, a message on my dashboard lights up and stays �to shift from p, engine must be running�. Either way, I have to turn my car off and back on again in order to be able to drive. The first time this problem happened, I called the dealer and they thought that possibly something got lodged in the gear shift. However, as time goes on, these events become more and more common. Our local Honda dealer had my car for roughly a week in June and tried to recreate the problem. They were unable to duplicate it and did a factory reset. That worked for about a month. Now, the stalling happens at least once a week and yesterday it happened three times in the matter of an hour. When I took the car to the dealer in June, it had also stalled three times in an hour. I feel at high risk driving the vehicle because cars get impatient behind me and start moving when the light turns green even though I can't move. Or, if cars are approaching a green light, they probably won't realize that I am unable to move making this a huge safety concern. This problem happens everywhere but on the highway.", "fail date": "  09/11/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Honda knows that there is a problem with the transmission that causes the fluid to overheat. The overheating issue leads to a �judder� in the transmission. The car accelerates in a very jerky way especially between 30 and 50. This is a big safety issue if you are trying to pass someone. As soon as the vehicle reaches 80,000 miles Honda will no longer cover the so-called �repair� which is to flush the burnt transmission oil multiple times. This costs almost $400. Honda knows they have a defective transmission and, instead of fixing it, they are passing the transmission flush cost on to the buyers. A recall should be issued before someone gets killed trying to pass in a vehicle with a faulty transmission. Already happened twice on my Pilot. First time was repaired for free, second time I had to pay since my car has 86000 miles and they only cover under 80000.", "fail date": "  08/13/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The contact owns a 2017 Honda Pilot. The contact stated that while driving at slower speeds and attempting to come to a stop, the vehicle revved up and independently accelerated. The contact depressed the brake pedal with excessive force and the vehicle moved forward a little before coming to a stop. The contact had taken the vehicle to the dealer however, the mechanic was unable to diagnose the vehicle. The vehicle was not repaired. The manufacturer was made aware of the failure by the dealer however, the contact was unable to speak with a representative. The approximate failure mileage was 16,000.", "fail date": "  08/01/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The auto engine idle (aei) feature has a flaw in it that Honda has apparently not identified or explained and it is a serious safety concern. Aei shuts the engine off when the car is in drive but fully stopped and, in theory, increases fuel efficiency by reducing engine idling when the car is stopped, e. G. At a stoplight or in stop-and-go traffic. While there is a button to disable it, this button has to be pressed each time you turn the car on and cannot be permanently disabled. We try to remember to always press the button and disable the feature but occasionally forget and don't realize we haven't disabled it until we come to a stop somewhere and the feature engages and the engine shuts off. Aei would just be a nuisance if it worked 100% of the time as it is designed to work but, unfortunately, it doesn't. When it works and the brake pedal is fully depressed, the engine is automatically idled, and then as you begin to lift your foot off the brake pedal, the engine quickly turns back on, you're already in drive, and you go. However, on what seems to be a completely random and unpredictable basis, sometimes when you begin to lift your foot off the brake pedal, rather than having the engine restart automatically, the entire car just goes dead. At this point, you have to frantically put the car in park and completely restart the engine. If you're lucky, this happens quickly and you're not stuck in a compromised spot with no one bearing down on you from behind but by its design you are somewhere you need and want to be moving from quickly, and it has happened at the exact moment when you try to accelerate. This has happened to both myself and my wife a handful of times in scary situations. Read all the other complaints on the internet - no service rep anywhere has an explanation. This needs to get solved before people die, if they haven't already.", "fail date": "  05/21/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "While stopped, then starting again (eg at a stop sign), vehicle sometimes will not shift into motion, acts \"sluggish\". The first time I thought perhaps a shoe stuck, or a floor mat was in the way, but that was not the case. Dealership said just turn off eco mode. The vehicle still occasionally does this and is now very jerky to drive at all times. The vehicle has also prevented acceleration while changing lanes or overtaking on multiple occasions, happening to both drivers of the vehicle. This has primarily been interstate driving, therefore high speeds, but happened again today on a city street, very nearly causing an accident with my child in the vehicle! this is not acceptable for a vehicle, particularly a newer one, and yet it appears to be a commonly-reported problem that is not being addressed! are we waiting for someone to be killed? this vehicle also has occasional trouble with the audio system, but that's an inconvenience while the transmission is potentially life threatening!.", "fail date": "  03/04/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "On sun Nov 13th, 2022 I was on I-75 going north and had to slow down and then stop at a 'stop and go' traffic in the beginning of or just before the construction zone. With my foot on the brake, complete stop on the highway, the Honda Pilot suddenly went into neutral and I was unable to put it in drive mode. I panicked, as there was a lot of traffic behind and I put the blinkers on, put the vehicle in park, tried to restart and didn't work. After a couple of tries, fortunately the engine restarted. In the middle of the one lane construction, I had to stop once again as the traffic was stopped. Once again the Pilot did the same thing. It stalled, and I had to restart the engine. It was very scary and a big safety problem. I have placed a call into Honda service but no response as yet. It is scary now to stop at red lights and stop signs! it happened 2 times in the same construction zone within 5 minutes.", "fail date": "  11/13/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Multiple times while driving with the auto start/stop engaged, the vehicle will turn off when coming to a stop at a traffic light or stop sign and then need to be restarted with the actual start/stop button. Call to purchasing dealer was met with unrealistic demand that the vehicle be left there for an undeterminable amount of time so that it could be inspected. No other lamps have come on or warned against this. Only way to make it not happen is to turn off the auto start/stop after the vehicle is started.", "fail date": "  10/07/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "I stopped at a red light and the idle stop function shut down like it should. When the light turned green, I let my foot off the brake and it stalled out. Some of the dummy lights came on and it stated that I needed \"to start engine: brake + push\" and shows the break pedal and the start engine button on the dashboard. So I did. It did nothing. I had to turn the car off and try to restart it. I had to do this 3 times for it to finally start back up so I could drive off. This has happened to me a total of 6 times now. All but one time was at a red light, once being at a roundabout as I was slowing down for a car coming toward me. Today I had to restart it 4 times, open my car door, take my seatbelt off and close my door back before it finally started back up. I have taken it to the dealer once before and they told me it was because my battery was weak and would not make the connection when it went to start back up. They said they 'fixed' it to the best of their ability and just basically hoped it would not happen again. Well, it did. I just had my battery checked last week and it is fine. I have a physical video of it as it is happening. As soon as my car shut itself down \"stalled out\" I grabbed my phone and videoed it. I am keeping the video on my phone. This is not safe. If I can't move at all, it will not go into neutral or anything, so I would not be able to physically move the car into the emergency lane out of traffic or anything.", "fail date": "  09/26/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "We bought April 2021 and 1st issue not even 60 days after purchase, dealer removed warranty without us knowing! we have had problems ever since with warming lights coming on & flashing on multiple occasions, even while traveling @ 50 mph!. Huge safety issue as the vehicle jolts and then looses power and can't pick up speed and go with flow of traffic! someone will get in an accident because of it and that will be a huge liability for Honda as you all are ware of these issues and are doing nothing to recall them and fix the problem! this is a problem for many Honda Pilot owners from all the Honda forums I have read and research ive been doing! I want the issue resolved as this is not a random. I just read that there was a service bulletin in 8/2019 pertaining to this specific car/VIN and it references faulty fuel injectors. I have no way to know if this was completed. I feel I should be able to have the injectors serviced/replaced at no cost to me as this is a huge problem with 2016-2017 Pilots and the fact a Honda dealer pretty much sold us a lemon of a car! I want our Pilot fixed as it is a problem that Honda has been having with 2016-2017 Pilots and Honda should be liable for this! happened again today and has been happening more frequent in the past few months but have been dealing with it since we bought the vehicle. Recent mechanic said the ecm/pcm may be faulty as you cant get a viable code as everytime it happens it throws all kinds of warning lights & codes that are not accurate.", "fail date": "  08/23/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "In support of NHTSA action number: pe22005 2017 Honda Pilot multiple experiences with the auto idle cutting off and not restarting. 8/4/2022 was worst experience to date. The vehicle cut off at a stop light and would not restart. The ability to roll down the windows and unlock the doors was disabled so 2 occupants were potentially trapped inside. Fortunately a door had just been opened to waive backed up traffic around the disabled vehicle. Aaa and sheriff's were called to the scene. It was successfully jumped and the aaa diagnosis was that nothing was wrong with the battery, starter, nor alternator. This is a major flaw in engineering and a fix has to be developed or the vehicle appropriately replaced.", "fail date": "  08/04/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "When auto idle is engaged, the car should start when the brake is released after stopping. We noticed problems when we released the brake. The radio and a/c shut down and quickly come back on again. So release brake, radio and a/c shut down and then radio and a/c come back. Reported to jeff wyler Honda and I believe I have a video. As of yesterday, the engine fails to restart on its own from a complete stop at a traffic light or road intersection with the auto start/stop function engaged. You have to put your foot on the brake, shift to park and restart. This occurred twice in two days. Once at a traffic light and once after a traffic jam on the highway. It is scary especially the first time it occurs. It has the potential of leaving the vehicle in a stopped position in dangerous locations if it can’t be restarted, I. E. The highway. I’ve read that a jump is sometimes required.", "fail date": "  07/08/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "The auto start/stop system on the Honda Pilot is failing at intersections causing the car to stall out and be stuck in traffic. Dealer and Honda does not have remedy for this issue. This is a known problem that is well documented by other owners. This is now happening about three times per week and I am worried that it will cause a major traffic accident and or death if I get stuck in the middle of an intersection.", "fail date": "  06/29/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "I own a 2017 Honda Pilot elite, with 65000 miles, that was purchased new. The vehicle has repeatedly stalled at various point of operation. Upon stalling, every light appears to activate on the dashboard. The vehicle remains stalled until the computer \"recycles. \" I can usually restart the vehicle within 2+ minutes. The dealer, located in rancho santa margarita, California, has identified the vehicle’s stop-start as the problem. The dealer suggested to turn off the stop-start while driving the vehicle but that is problematic as this needs to be done each time the vehicle engine is turned off and then restarted. The dealer, upon inspection, found some errors in the ecu, but none that would create this problem. The dealer is unable to recreate the problem and admitted that many Honda Pilots have this issue. To possibly fix the problem, the dealer suggested a valve replacement at a cost of $1000+ and a new battery, even though the battery has been tested and is fine. These vehicles are dangerous, and Honda has done nothing to correct the problem.", "fail date": "  06/06/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Fuel injection pump makes really loud noise and reduction of engine power. Took it to the dealer for diagnosis and was told the fuel pump needs a replacement. Have been waiting 2-3 weeks for parts, with no loaner or estimated timeline provided.", "fail date": "  05/13/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Multiple times the vehicle has shutoff when the it has reached a complete stop at a traffic light and has not restarted on its own. Took it to dealer but they could not recreate it supposedly. In addition fuel pump issues and the Honda dealer is not able to obtain parts to the fix the vehicle. Feels like a lemon vehicle.", "fail date": "  03/02/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "I returned from work at approximately 5 pm on 03-01-22. As I prepared to enter my garage, I realized I could not pull in due to objects in the way. I put my foot on the brake, and as I planned to reverse, the car lurched forward and into the side of my house! no warnings, no air bag deployment, and a sudden lurch, stopped only by my (less than 2 year old, custom-built) house! garage door would not close after the car was backed out. Car was towed to performance Honda in fairfield, ohio. No codes were recorded and they did not indicate reproduction or attempt to reproduce the problem. They reset all computer systems in the vehicle. The included photos also show the skid mark on the driveway, indicating to us that the brakes were on when the car \"lurched\" into the house.", "fail date": "  03/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Our 2017 Honda Pilot was making some really strange noises under the hood so we took it in to our local Honda dealer service. Dealer said our low-pressure fuel pump needed to be replaced. It has now been nearly four months of Honda telling us the fuel pump replacement part is unavailable. We follow up with Honda weekly and they continue to give us an eta date, which they push out every time, so the eta is meaningless. They said we can drive our Pilot \"as is\" but cautioned us not to take it on a road trip, so we had to pay Honda a daily rate to rent a car from them. They would not provide us with a complimentary rental vehicle, even though this situation is out of our control and this fuel pump will be covered by the power terrain warranty. I drive my three children in our Pilot and I feel it a safety hazard for me to drive it on the freeway when it could break down on us at any time, which would also cause a safety hazard on the highway. There was not ever any type of error code or auto failure alert for this fuel pump problem.", "fail date": "  02/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "There is a strong smell of gasoline inside the cabin. It is very intermittent, but seems to happen most after it is warm and is restarted after sitting less than 1 hour like going in somewhere to shop or eat. Other times it has happened in the summer when idling the car with the air conditioning running for 10-15 minutes. It is not an exhaust smell, but unburnt gasoline. The dealer smelled it when I dropped it off, but couldn't find anything wrong. It has been happening for over a year. After several months we got a check engine light, it was an issue with the evaporative canister. An $1,100 repair was made outside of warranty. We hoped this would at least fix the issue. It did not fix it. The smell happens regardless of gas tank level and is not from over filling the tank.", "fail date": "  01/29/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "In my 2017 Honda Pilot elite the auto idle stop feature has more frequently failed to restart the vehicle when stopped at a traffic light. This leaves the car stalled in traffic instead of restarting after I take my foot off the brake (which is when the system should be restarting the engine). This failure occurs whether I press the gas pedal or just take my foot off the brake. It began happening around the 30,000 mile mark and the vehicle now has 56,000. I notice it most often occurs when the auto idle stop function engages at the first traffic light after a period (approx. More than 20 minutes) of freeway driving. The only way I have found to recover from the stall is to place depress the brake, place the car in park, press the engine start/stop button twice (once to shut off the car then again to restart it), and then place the vehicle in drive and release the brake. Sometimes this process needs to be repeated. My vehicle is almost always in econ mode. The issue happens whether or not the radio is on. My map is almost always displayed when I am driving.", "fail date": "  10/09/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "I had started noticing the radio clicking on/off at stoplights. After a while, it progressively got worse and noticed the car was also slightly jerking too as the car re-started. I called the dealer and they said they were not familiar with the issue. Days before my warranty expired in 2020, I took the vehicle in and they said they were not able to re-create the issue and did not see any error codes. I received the mil warranty extension letter recently and wondered if that was the same issue, but it does not appear so. However upon researching that, I found many similar complaints online about the auto idle stop issues. I am grateful my car has never stalled (yet) but that is probably because I have very low mileage. However I am scared to drive the car now and always disable the auto idle stop, hope that I don't forget which I do sometimes and am fearful should my teenagers ever have to drive my car! thankfully their Honda civics don't have this feature. This is a serious safety hazard! there are too many similar complaints so please force Honda to recall and fix the problem. I bought this new car since it was supposed to be more advanced and safer than the 15 year old car it replaced. It does have some great advances but should not be compromised or come at the cost of safety.", "fail date": "  05/13/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "The auto shut off when the brake is fully deployed fails when pressure is released and the car will not re-energize. Leaving a car dead at a light that just turned green. Requires me to put car in park, then restart then put into drive. This is a safety hazard. No error lights. Auto shop can't fix. Must remember to manually shut off the auto shut off each time the car is turned on. Not safe. I have almost been rear ended several times as the car behind expected to go at the just then green light. At one light no cars were stopped behind me but a car approached a light that had been green didn't realize I was stopped with a failed engine. Scary. It happens everyday.", "fail date": "  04/22/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "While at a red light, the auto idle engine feature completely stalls the vehicle. This has happened more times that I can count at this point. Basically, if I leave the feature on, at some point in route, it will stall. Of course, I have brought it in several times to the dealership to be told that nothing is wrong with the vehicle and the computer doesn't register/read any kind of code or error. When the brake pedal is completely depressed, the vehicle shuts down, radio, lights everything. When the brake is released, it seems to try to fire up, but stalls instead. Lights are projected onto the dash saying \"to start engine: brake + pedal\". This does not immediately start the car. It takes several tries and lately I have found that I have to keep my foot off of the pedal and hit the start button to turn \"off\" the vehicle (even though it is already stalled). Then, I can start it. I am always in a busy intersection at a red light when this occurs which is frightening. It has taken up to two minutes to get it restarted and lights have turned green, horns have been blasted and I have been swerved around by oncoming (behind) vehicles.", "fail date": "  04/10/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "While stopped at an intersection, the \"auto-idle-stop\" feature malfunctioned and: 1. ) didn't properly \"restart\" the engine; 2. ) caused the electrical systems in the car to turn off and essentially stalled the car; and 3. ) made it difficult to restart the car using the ignition button as it wasn't clear what gear the car was in. Once the car was in park, it was able to be restarted using the ignition button. This occurance has happened several times. For safety (when we remember to), we now make a point to turn off the auto-idle-stop feature when using the car as the scenarios in which the issue appears could be at an intersection or situation with cross traffic.", "fail date": "  04/05/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Auto idle stopped engine waiting in traffic and then it would not restart. I took my foot off the brake, pressed the gas and nothing would work. Eventually, I was able to get the vehicle in park, turn it \"off\" and then turn it back on.", "fail date": "  03/27/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "I got a warning on my dashboard says \"emissions system problem\" my vehicle has only 58k miles on it. I checked the recall but is not there. I chat one of the agent \"renee' told me to file complaint if I want. Is my vehicle still under warranty for this issue? thank you.", "fail date": "  03/23/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "2017 Honda Pilot, emissions light came on around 50,000. Service light came on at highway speeds. Codes were po301, po219a. Honda service confirmed 2016 Pilots and some 2017 Pilots received an extended warranty, covering repair of the fuel injectors. This specific VIN was out of range. Mechanic had to replace the fuel injectors to remedy the issue. Honda America advised me to do the repair and see if a warranty is extended.", "fail date": "  01/05/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Occasionally when stopped at a red light the car's auto engine cut off during idle will not restart as it should when I try to go. I must then put the car in park, wait 2-3 minutes, then it will finally restart. I took it to my dealership who told me they were aware of the problem and did not know how it could be fixed. Stalling at a red light while cars are beeping is dangerous and can cause an accident or road rage. Please help.", "fail date": "  12/06/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Check engine light came on at 43,000 miles. Then every other light on dash came on while driving. Error code for fuel injectors and Honda dealer charging 2,000 to replace injectors. Wife will not drive the Pilot now due to injector issues. Vehicle is only 3 years old! known issue with my model year Pilot and Honda is silent on recall. Dealer can't even fix the issue due to not having the parts (back ordered)!.", "fail date": "  12/03/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Check engine light for emissions system problem. Code p219a came up. They ended up having to replaced the fuel injectors at 25,400 miles. Our warranty is up in March. I called Honda to see if they would still fix the issue after the warranty is up. They advised that any issues would be an out of pocket expense. They are aware it is a known issue with 2016-2018 Pilots.", "fail date": "  10/06/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "For roughly the last 4 months, my car stalls at a stop (stop sign, traffic light, etc) by shifting itself into neutral. The car has a push button gear shift and the warning light says to shift the car into park. Sometimes, I can shift the car into park and sometimes I can't shift the buttons at all. If I am able to shift into park, a message on my dashboard lights up and stays �to shift from p, engine must be running�. Either way, I have to turn my car off and back on again in order to be able to drive. The first time this problem happened, I called the dealer and they thought that possibly something got lodged in the gear shift. However, as time goes on, these events become more and more common. Our local Honda dealer had my car for roughly a week in June and tried to recreate the problem. They were unable to duplicate it and did a factory reset. That worked for about a month. Now, the stalling happens at least once a week and yesterday it happened three times in the matter of an hour. When I took the car to the dealer in June, it had also stalled three times in an hour. I feel at high risk driving the vehicle because cars get impatient behind me and start moving when the light turns green even though I can't move. Or, if cars are approaching a green light, they probably won't realize that I am unable to move making this a huge safety concern. This problem happens everywhere but on the highway.", "fail date": "  09/11/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Emissions light went on and I smelled gas. Brought the car in for service at 23,391 miles. Fuel injectors needed to be replaced. This is a known problem with the Pilot, according to the service manager, who stated \"luckily it was still under warranty. \".", "fail date": "  09/09/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Emissions warning light came on while driving down the road about 30mph. Code reader shows code p0430.", "fail date": "  07/20/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "My �emissions system issue� light comes on all the time. The light comes on mostly while the car is in motion I first had this check light come in within months of owning the car. Honda has fixed this every year since. I put about 30,000 miles/yr on the car and do not have the time to continually bring the car in for service. During the last service for this issue (my car was out of warranty) and I was told it would cost almost $2000 to fix. They agreed to cover 75% of the cost as this has been a problem every year. Within days of leaving the dealership, the light came on again. The 2017 Pilot is a lemon. This is some fuel injector issue. It could cause a serious accident as the ultimate result of this issue is engine misfire. . . I have had moments of misfire when entering an intersection and could have caused a serious accident. There appears to be no permanent fix for this issue. This Honda just fixes it and it's not a big deal to the owner until you are out of warranty. This is incredibly frustrating. I love the car, but this is disappointing as I have the Pilot elite which is one of the most expensive cars they offer. The local dealership has been good about it. However, I fear the next time I return to complain about this issue, they may not be as accommodating.", "fail date": "  07/16/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Different warning problems shows up on dashboard comes on and off sometimes. Took it to a Honda dealership and they say its fuel injectors.", "fail date": "  07/01/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Car shuts down completely t a stop position and computer readout instructions are to put the car in park and then go thru initial start actions. Purchased car in Feb 2019, problem started within days of purchase. Returned it to dealer multiple times with no improvement, Feb 26th 2020 took car to dealer again due to this problem and the radio effected the last shut down time with a loud buzzing noise. Was informed they would have to keep car overnight so the valve clearance could be checked while car was cool. I have found that this problem has been ongoing for four years. It is unsafe and very nerve racking when your car dies through no failure of the driver and other impatient motorist sounding their horn because you aren't moving. One has to worry about one of those impatient drivers not paying attention to what's going on and hitting their gas pedal when the traffic light goes green and all of a sudden you are rear ended. Four years is long enough, even I realize that this problem didn't start with these cars until the introduction of the electronic computer shifting and the auto stop shut down process was introduced in these cars. This shut down of the engine has only happens on public streets and when the vehicle is stationary. Honda of gainesville, FL has an open case on my vehicle. Records are on hand if needed.", "fail date": "  02/25/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Getting an emmissions system warning on vehicle. Vehicle has under 50k miles. Issue caused vehicle to lose power at highway speeds and was unable to maintain highway speed. Vehicle is displaying two obd fault codes p2652 p0430.", "fail date": "  02/23/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Emission system problem. . P0430 code. . 45k . . Dealership had to replace fuel injector kit for $1940. . Not covered under factory warranty or powertrain. . Honda America says they won't reimburse even though this is a know issue with the 2016 model. . My vehicle falls outside the range of VIN where the issue was noted but this is not by chance I have the same issue as numerous others are. . Honda needs to admit this is a fault with the fuel propulsion system and cover these replacements on low mileage vehicles. Highly disappointed!!.", "fail date": "  02/22/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Engine hesitation at low speeds, more dramatic going uphill.", "fail date": "  02/14/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Engine light ones on. . . Codes say it is an emission problems. It is the injectors. The dealer says they repair one a week! this should be a recapitulate,.", "fail date": "  02/03/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Took my Honda Pilot elite 2017 in after having the check engine light on displaying \"emissions service problem\". It was diagnosed at our Honda dealership as p0430 and need all fuel injectors replaces. My SUV had only 39,000 miles on it and was outside the manufacturers warranty by 3,000 miles. The repair estimate was $2,100. I was shocked to hear this as the vehicle is only 2 years old. I saw online this was a common issue with both 2016 and 2017 Pilots which is concerning as Honda has not made any recalls. In the end, our dealership called Honda and got Honda to cover most of the repair with the dealership covering the remainder. I am nervous with the quality of Honda vehicles and even that the new fuel injectors will only have a life of 40,000 miles and I will be in the same spot 2 years from now. Honda needs to take care of this fully and a recall is needed.", "fail date": "  01/21/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "While the vehicle was stop, the auto shut off went off, and upon moving the foot from brake and depress accelerator, the Honda Pilot 2017 turned off and restarted requiring driver to depress engine start again.", "fail date": "  10/15/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "While driving in the highway , took an exit and slowed down and stop in a traffic and the car ‘s engine stop suddenly and iam unable to restart it, the brake pad feels stuck and the neutral and drive button does not work, when you turn it on the other electronic still works like the audio and air conditioning but the engine will not turn on . It took us about an hour before the car start working again , causing a long traffic jam in the highway due to we can’t even put the car on neutral for other cars to help us move it on the side, 2 police officers came to the rescue to help us but it didn’t work until we tried again and for some divine intervention the engine start working again. I will have my car check at the Honda service in the next few days.", "fail date": "  08/28/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Atomic breaking systems kicks on almost caused accident 2 times, and the engine shot off while driving, please investigate before death happen.", "fail date": "  02/08/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Vehicle driver is 4’11. Unable to safely reach gas pedal and brake pedal. There is no adjustments for a driver of this height.", "fail date": "  10/07/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "1. I had a routine oil change a few weeks ago and I was told by Honda dealer in san luis obispo,CA that my brakes were in good shape. But I noticed that when I am driving in the highway at around 70 mph then apply brakes, the car shakes. I brought it back to Honda and they think it is the rotor and fixed it yesterday. The other new problem is the alarm that kept going off randomly when the car is parked and locked. When I picked up my car after the oil change a few weeks ago, the technician did not mention any problems with my alarm going off while my car was at the delearship. I went back to the Honda dealer for diagnostic test yesterday and they recommend replacing the keyless access control unit. This will cost close to $ 1000 diagnostic, parts and labor. I am told if I do not replace the control unit, the problem can get worse where my car won't start anymore. So I have no choice but replace it. So I brought my car just for routine oil change weeks ago and now I have problem with rotor and control unit that cost me $ 502. 72 yesterday and another $700 plus dollars to replace the control unit. For the control unit to fail in just 3 years, suggests it may be defective to begin with or very poor quality. Unfortunately it just went out of warranty. I am reporting this in case this is a common problem for Honda Pilot that the manufacturer needs to address and fix.", "fail date": "  11/19/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Tl the contact owns a 2017 Honda Pilot. While the vehicle was stopped with the auto idle engaged and air conditioner activated, the brake pedal was released and the vehicle stalled. Also, the gear shifter went into park. The contact had to press the engine start button several times for the vehicle to restart. All the warning indicators on the instrument cluster were illuminated. The contact called Honda of covington (100 holiday square blvd, covington, la 70433, (985) 892-0001), but the vehicle was not diagnosed or repaired. The manufacturer was not contacted. The failure mileage was 53,500.", "fail date": "  08/13/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "At traffic light, car wont stop during braking, there was an abnormal vibration. Speed was +/-20 mph. I had to turn right to avoid accident and after 300ft car stop, brakes work to normal again. Incident happened in quiet fm road, about 1 miles from home. Mileage 22k.", "fail date": "  06/22/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Tl the contact owns a 2017 Honda Pilot. The contact stated that the vehicle lost power while traveling on an incline. Also, the brake pedal was soft and traveled to the floorboard when being depressed. In addition, the collision and brake warning indicators illuminated. The contact drove to ryan Honda of minot (3701 s broadway, minot, nd 58701, 701-852-1111) to be diagnosed, but no failure was found. The contact also stated that certain electrical features on her vehicle sporadically failed to operate when needed. The manufacturer was not notified. The vehicle was not repaired. The failure mileage was 25,000.", "fail date": "  05/20/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Tl-the contact owns a 2017 Honda Pilot. The contact stated that while driving at 50 mph, the vehicle would engage the collision mitigation break system causing the vehicle to break without any warning light illuminated. The vehicle was taken to the dealer billy navarre Honda 1310 e college st, lake charles, la 70605 (337)-429-2137 were a diagnosed test was performed but could not determine the failure. The vehicle was not repaired. The failure reoccurred. The manufacturer was made aware of the failure and informed the contact that she would need to contact NHTSA to place a complaint. The failure mileage was 28,000. Ck.", "fail date": "  04/09/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "On two occasions I was driving at a speed between 30-45 mph on a state highway when for no apparent reason the auto braking system slammed on the brakes nearly causing the car behind me to hit me. The second time the road was slick and I nearly lost control.", "fail date": "  02/09/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The contact owns a 2017 Honda Pilot. The contact stated while driving approximately 40 mph he went through a standing pool of water on the right side of the road, the vehicle instantly slowed as if the contact had applied the brakes with force. The contact stated no warning light was illuminated. The contact did not take the vehicle to local dealer and the vehicle was not repaired. The contact stated that the failure occurred on both sides of the vehicle while driving through standing water. The manufacturer had not been informed of the failure. The failure mileage was approximately 4,000.", "fail date": "  04/02/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "I have 2017 Honda Pilot touring. I have a reoccurring problem with the anti break mitigation system. It continually activates in multiple driving situations that do not require it to activate. This problem occurs when I'm driving at different speeds, with and without the cruise control is set, and on any type of road. I have taken it to the dealership 5 times to have this problem corrected. They have been able to duplicate the problem. They have tried to repair this problem 5 times without success. The anti break system continues to activate incorrectly on almost a daily basis. The dealership has stated that there isn't a problem and that I can turn off the anti break system and drive my vehicle without it. I paid for this feature and I do not think that I need to turn it off as it is a safety feature of my car. This is a serious safety issue and it needs to operate correctly. I also had to replace the fuel injection system.", "fail date": "  03/21/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "This might be an unknown issue, but upon startup, the brake pedal is very stiff and hard. Few times, I couldn't start the car because the brake was so stiff, I couldn't press on it with my foot, and it went into accessory mode. I took it to 3 different dealers, they keep telling me that it's normal. Advantage Honda tried replacing the battery, but that didn't help. All they could do is a multipoint diagnostic on it, where the computer won't show anything. Dealers are telling me it's normal, but why is my neighbor's 2017 Honda Pilot not giving him the same problem? it can't be normal because when I first purchased the car in Aug. 2017, and up until mid oct. 2017, the brake pedal was fine. Then after that, it only happen overnight, then now it's happening every time I start the car, it gets very frustrating when you have to slam the btrake pedal in order to start the car. I've driven other vehicles with push button starts for many years in the past, and I've never encountered an issue like this. Could this be an issue with the hydraulic brake system loosing vacuum supply where dealers don't want to bother taking a closer look at the issue because they don't make that much money if it's still under warranty? I've called Honda of America, they told me to bring it to a dealer, but dealers are not helping or even explain why is the brake pedal doing that other than say it's normal. As soon as I start the car, the car runs fine. Please help me understand why my car is like this. Thank you for your help.", "fail date": "  01/14/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Tl the contact owns a 2017 Honda Pilot. While driving 20 mph, the vehicle stalled and the check engine warning indicator illuminated. Also, the brake pedal was applied, but failed to respond. The contact stated that it was difficult to keep the vehicle aligned while driving. The vehicle was taken to scott Honda of west chester (706 autopark blvd, west chester, PA 19382, (610) 692-6000). The vehicle was repaired, but the failure recurred. The manufacturer was not notified of the failure. The failure mileage was 65.", "fail date": "  12/27/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Tl-the contact owns a 2017 Honda Pilot. While driving at various speeds the steering wheel shock without warning additionally, the vehicle shifted hard and jerked from first to second gear/. The vehicle was taking to dch paramus Honda 120 NJ-4, paramus, NJ 07652 (201) 426-4676 where diagnosed that that a system rotor and brakes needed to be replaced. The vehicle was repaired however the failure recurred. The manufacturer was contacted but did not assist the failure mileage was 30,000 . Ap.", "fail date": "  11/01/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "While driving at highway speed and applying the brake the car independently accelerated. Vehicle continued to accelerate while applying greater brake pressure in an attempt to slow down. Vehicle had to be driven onto shoulder to avoid hitting the vehicle in front of it. Acceleration stopped after several attempts at braking.", "fail date": "  08/23/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Vehicle stutters and shakes violently when accelerating. And there's noise from the transmission.", "fail date": "  04/04/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Vehicle driver is 4’11. Unable to safely reach gas pedal and brake pedal. There is no adjustments for a driver of this height.", "fail date": "  10/07/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "The contact owns a 2017 Honda Pilot. The contact stated that while operating the vehicle, the keyless warning, power steering, emissions, and hill assist warning lights activated, and the vehicle experienced unintended acceleration. The cause of the failure was not yet determined. The local dealer and manufacturer were not notified. The contact recently received a TSB notice from the manufacturer regarding the failure. The failure mileage was 60,951.", "fail date": "  09/18/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "The contact owns a 2017 Honda Pilot. The contact stated that while driving at slower speeds and attempting to come to a stop, the vehicle revved up and independently accelerated. The contact depressed the brake pedal with excessive force and the vehicle moved forward a little before coming to a stop. The contact had taken the vehicle to the dealer however, the mechanic was unable to diagnose the vehicle. The vehicle was not repaired. The manufacturer was made aware of the failure by the dealer however, the contact was unable to speak with a representative. The approximate failure mileage was 16,000.", "fail date": "  08/01/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "From a stop, at times when I take my foot off the brake with the auto-engine idle set to \"on\", when I try to accelerate, the engine will cut off. The car puts itself in either neutral or park, then I have to restart the car - depress brake and press button - after 30 seconds to a minute. I was lucky not to have been rear-ended since at a green light, other drivers go, and do not expect a driver in front of them to stop.", "fail date": "  08/01/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Without warning, the sunroof suddenly exploded/shattered while driving without current or previous damage or collision. Glass particles fell into the cabin of the vehicle on driver and passenger.", "fail date": "  11/20/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Hood flutters at highway speeds and appears that it will open and break windshield, looks as though hood is not latched causing stoppage or pull over for inspection of which the hood is latched.", "fail date": "  06/21/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "(ad - dealer info inadequate) tl the contact owns a 2017 Honda Pilot. While the vehicle was stationary, the contact noticed mold in the rear seats and in the folds of the doors. Honda of kirkland, washington diagnosed that water entered into the vehicle through a sealant gap of the firewall behind the dashboard. The vehicle was replaced with a new one by the dealer. The manufacturer was not made aware of the failure. The failure mileage was 4,500. The VIN was not available.", "fail date": "  11/24/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Rear windshield spontaneously imploded upon closing rear door of vehicle. Stationary. No extreme temperatures (santa cruz CA) , no extreme conditions. Just imploded. I read countless similar stories online. Check edmunds. Com. Hi.", "fail date": "  11/05/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "The design flaw causes the hood to move excessive during windy days. It's much more noticeable during highway speeds. The hood flexes and moves up and down as you drive in windy days. During my life time I have driven my different vehicles including vans and even RV but never seen a hood that moves this much. It's very dangerous over time as metals or bolts could simply give. This hood could one day fly off and hurt or kill someone.", "fail date": "  11/01/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "When driving at highway speeds & a truck or large vehicle passes me in the oncoming lane, my hood vibrates & lifts as if it is being blown open. It's nerve racking & distracting since the car is otherwise quiet & tight. I'm afraid that one of these times the hood will actually fly open. When parked, the hood seems to be tightly closed with little or no play. It only occurs when an on coming vehicle like a semi or bus passes me from front to back. The nearest Honda dealer to our current home is more than 50 miles away. I have owned many other Honda's but this 2017 Pilot is a new body design. This problem occurs every time we drive on highways or a fast moving large vehicle goes by. It has done it since we took delivery of it brand new.", "fail date": "  08/12/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "At highway speeds, when passing any oncoming large vehicle, the hood flexes, shudders & moves violently up & down as if it is only held by the secondary latch. When parked, there is no perceptible play or looseness at the latch or hinge area. The dealerships have been no help in resolving this problem.", "fail date": "  05/15/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "Tl-the contact owns a 2017 Honda Pilot. While his spouse was driving 65-70 mph there was an abnormal rattling noise detected. The contact stated the sunroof shattered without warning or impact. The local dealer and manufacturer were not contacted. The failure mileage was approximately 51,000. Ap.", "fail date": "  02/18/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "While driving at highway speed the driver's-side wiper stopped working. Had to stop on hard shoulder. Issue was not obvious. The rain was not going to end any time soon so my partner ended up driving their vehicle in front of me with the hazards flashing at low speed so I could follow them closely until we could get to an exit and leave the Pilot at a park-and-ride. This was very dangerous: sudden loss of visibility and then being stranded on the hard shoulder with trucks passing closely. Took the Pilot to the dealer the next day. They removed a rubber cover from the wiper mount and tightened the bolt that is underneath. The service adviser said they can come loose in the winter due to the wipers getting stuck in ice. I am amazed that this relies solely on friction to function given how dangerous it is when they fail.", "fail date": "  08/29/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "We were driving on i90 highway from chicago to michigan. Suddenly we heard loud sound on the roof of the car and than shattering sound from the glass. We opened a cover a little to see what happened and the glass of the sunroof was broken and shattered. There was very lighy traffic on the highway and there was no vehicles in front of us. We stopped to inspect the roof and there was no sign of impact or objects inside. It just broke by itself. Temperature outside is around 65, no rain, few clouds. We were driving at speed around 70. Temperature inside of the car is set on 73. Nothing unusual or different than any other day.", "fail date": "  08/24/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "My sunroon exploded on the freeway (interstate 575 going 65 mph + )- I have had the car for 6 months (brand new). No accident occurred due to it - but was driving on the freeway and it exploded. 1/3 of the glass went into the car and 2/3's of the glass fell behind and scratched the top of my car. Talked to the dealership and they said it must have had an crack already in it and noticed scratches on the roof. If this ever gets recalled - I would like to be reimbursed. The cost for repair is over $600.", "fail date": "  04/26/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "My tailgate window exploded while parked probably due to pressure. You can clearly see it exploded from the inside out. I contacted my local dealer, Honda of concord as well as Honda of America and they refused to acknowledge the issue.", "fail date": "  03/05/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "New Pilot elite just over 2 months old and with roughly 3800 miles on it had the sunroof (not panoramic moonroof) blow out on a rural highway with no cars or objects in sight. Nothing hit the car or flew into view prior to explosion. This occurred 100 miles from home and on a Sunday so the car had to be limped home to be taken to the dealer the following day. The dealer claimed they took pictures and communicated with american Honda of the circumstances. They told me it was determined that the sunroof blew out because it had been weakened by rock chips over time even though we had never seen a single blemish in the sunroof and we look through it regularly because we have small children and look at the airplanes through there. When I picked up the car after I had to pay out of pocket for the repair, the service manager showed me the alleged rock chips in the paint on the roof. . There were way too many there for a 2 month old car. When I got home and showed my wife the �rock chips�, I realizes that there wasn't a single rock chip forward of the sunroof and it dawned on me that those weren't rock chips but gouges in the paint from shatter glass all of which were behind the sunroof.", "fail date": "  03/04/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "Since purchasing my 2017 Honda Pilot in September 2017, I have had to replace two windshields due to rocks kicked up by other vehicles. On a third occasion, another rock created a minor crack and chip in the windshield. The first incident that required replacing the windshield occurred on September 8, 2017, while driving southbound on u. S. 75 in richardson, TX, near the george bush freeway. The second incident requiring windshield replacement occurred on November 21, 2017, while driving southbound on u. S. Highway 297 near vernon, TX. The latest incident that resulted in minor damage occurred on December 22, 2017, while driving northbound on u. S. Highway 75 in richardson, TX, near galatyn parkway. This 2017 Honda Pilot is the second Honda Pilot I have owned/leased, and the prior vehicle incurred no glass damage driving the same route over a three-year period. The other Honda vehicles, accords, were driven on the same general route since 2008, with no windshield damage. I am concerned that Honda may have reduced the thickness or quality of the windshield glass or other materials used in the windshield, or made a design change affecting the windshield. Windshield damage can be a serious safety hazard reducing visibility while driving.", "fail date": "  12/22/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Visibility", "Sub Problem": "Wiper problems", "description": "Front sunroof shattered spontaneously while vehicle was in motion at 45 mph on a highway. External temperature was 50 degrees.", "fail date": "  11/29/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Exterior Lighting problems", "description": "When parked, the car begins to try to turn on. The interior lights flash, systems fire and the battery drains. Twice I was left stranded having to rely on tow trucks, replacing batteries that were still functional and running car continuously in order to not drain it since it is my only car and I needed reliable vehicle to get to my kids. I could have been stranded in unsafe areas, thus impacting the safety of myself and family. There was no warnings before this happened the first time. Then, after changing the battery, it went another week without issue and then randomly happened again, without warning or indicators. It was looked at by 2 mechanics, the first (christian brothers automotive) could not find a problem. The second (Honda dealership) diagnosed it as “body control module failure-code b12d3”. They were not able to fix my car after diagnosing the problem today because they didn’t have the part in stock. So, I am now having to disconnect my battery every time I park to prevent it from draining the battery and honking. As a single mom, with only one vehicle, this will be a long wait until the part arrives and can be fixed. On top of the exorbitant wait, the repair quote is $861. 63 to correct. This is a manufacturing malfunction for which I do not believe should be my financially responsibility. Honda cars have had recalls of the bcm modules starting with the 2018 models. It is not a huge stretch to assume the 2017 Pilot bcm was flawed as well. I hope this is made right, a recall issued and my repairs expedited and paid for by Honda.", "fail date": "  04/27/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Exterior Lighting problems", "description": "When parked, the car anti-theft alarms will honk loudly waking up everyone noisily; the headlights will be turn on & keep running (even if it is manually turned off); the dashboard lights will be flickering; relays clicking; and sometimes the car will turn itself on. The noise & lights can't be turned off from the keyfob. The only way to silence it is to disconnect the battery and leave the car unlocked which is not safe when parked in the street or anywhere.", "fail date": "  04/11/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Exterior Lighting problems", "description": "Our 2017 Pilot tries to turn on by itself, with the electronics in the dashboard starting and engine compartment relays firing, along with the exterior lights turning on without any driver being present or attempting to start the car. It happens even without the keys being present. As a result, the battery drains while the car is parked. We took our car to the dealership where we bought it and they confirmed the issue and stated we needed to replace our keyless access/tpms unit to start and that we may need to a new start/stop switch. It cost $190. 83 with tax to access. The car is serviced at klein Honda in everett, wa. The r/o number for the service visit is 652453/1. . Read more...\n", "fail date": "  03/12/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Exterior Lighting problems", "description": "In the past week, my Pilot has stalled for no known reason. Both times the vehicle was stopped and the feature that idles the car down to conserve energy was activated. When I let off the brake instead of the car restarting or gearing up and accelerating, the car just died. Warning lights went off on the dash, but the car wouldn't restart for at least a minute both times. No warning lights were on the dash before the incident and after the car restarted, no warning lights remained lit on the dash. I took my car to an automotive store and had them check the battery, the alternator and the starter - all of these came back as being in perfect condition. I was extremely scared when both of these incidents occurred. One time I was at the bottom of an exit ramp of a busy interstate and the other occurred on an interstate in stop and go traffic. In addition to these two incidents, for the past 2 years, the car has been having issues after it idles down and then should restart and accelerate. About 2-3 times per month, when the car is stopped and has idled down, when I let off the brake and accelerate, the electrical system will flash on and off. The entire dash goes dark, the audio goes off and comes back on, etc. The entire electrical system reboots. When this happens, it does not impact the ability of the car to accelerate because it is more like a flash - the car doesn't die and have to be restarted. I am taking my car into the Honda dealer on Monday to attempt to diagnose the problem, but from the research I've done, may other Pilot owners are having the same problem and their dealers aren't able to find an error code caused by these issues. I have been attempting to get a video of this when it happens, but so far, I've been unable to reproduce the issue.", "fail date": "  11/24/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Exterior Lighting problems", "description": "Vehicle's led daytime running lights no longer operational. This is a known issue among owners and affects the visibility of the vehicle when operating during daylight hours. Further, the nighttime visibility is significantly decreased as those les lights add to the roadway illumination capabilities.", "fail date": "  05/21/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Exterior Lighting problems", "description": "Different warning problems shows up on dashboard comes on and off sometimes. Took it to a Honda dealership and they say its fuel injectors.", "fail date": "  07/01/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Exterior Lighting problems", "description": "The keyless start system problem light will not shit off.", "fail date": "  02/01/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "On many occasions, when the vehicle is stopped (at a light or in gridlock), when I remove my foot from the brake to apply the gas, the engine stops and the vehicle shuts down all systems (audio, nav, etc). When this happens, for a very brief time (too short to get a photo) warning lights related to the collision and/or emergency braking systems flash. After those lights go away, the dashboard lights indicate that the vehicle is in neutral (not by my doing) and that I must press the brake, put the vehicle in park, and restart the vehicle. This process does not always work the first time and the delay of turning off and restarting the car, even when it does work, causes a dangerous situation in traffic. When this happens on a downward hill, my vehicle rolls forward as it “dies” and I am sometimes stuck in the middle of an intersection as I try to restart the vehicle as quickly as I can. When it happens in heavy stop and go freeway traffic, I’m often surrounded by vehicles traveling at high speeds. I’m terrified that my baby and toddler will be hurt in this vehicle. I find it egregious that Honda has not issued a fix, a recall, or any other option for owners of vehicles with such a dangerous flaw.", "fail date": "  09/19/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "Automatic braking engaged with no apparent obstacle/reason.", "fail date": "  04/01/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Forward Collision Avoidance", "Sub Problem": "Automatic Emergency Braking problems", "description": "The camera assembly - monocular unit mounted in front of the rear view mirror just stopped working. It’s responsive for a multitude of safety systems, such automatic emergency braking, collision mitigation, lane departure warning, adaptive cruise control and lane keeping asst.", "fail date": "  03/16/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "The contact owns a 2017 Honda Pilot. The contact stated that while operating the vehicle, the keyless warning, power steering, emissions, and hill assist warning lights activated, and the vehicle experienced unintended acceleration. The cause of the failure was not yet determined. The local dealer and manufacturer were not notified. The contact recently received a TSB notice from the manufacturer regarding the failure. The failure mileage was 60,951.", "fail date": "  09/18/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "Tiene un bote DE aceite y se me encendi� la se�al DE problema en la transmisi�n mientras iba rodando por la autopista.", "fail date": "  02/13/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "Tl the contact owns a 2017 Honda Pilot. While driving 20 mph, the vehicle stalled and the check engine warning indicator illuminated. Also, the brake pedal was applied, but failed to respond. The contact stated that it was difficult to keep the vehicle aligned while driving. The vehicle was taken to scott Honda of west chester (706 autopark blvd, west chester, PA 19382, (610) 692-6000). The vehicle was repaired, but the failure recurred. The manufacturer was not notified of the failure. The failure mileage was 65.", "fail date": "  12/27/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "Steering wheel jerking left or right. Jerking occurs erratically and unpredictably; steering wheel jerks at highway speeds which could easily cause the loss of control of the vehicle on the highway and is very dangerous and stressful since it is not clear when the wheel jerking will occur while driving. It does tend to occur while on curved roads, appearing to try to jerk the wheel straight when the car steering needs to be adjusted to stay in one's lane; red and amber malfunction lights come on and off frequently. In particular, the tire pressure monitoring system (tpms) light comes on and off regularly even without the jerking steering wheel. The tpms warning light also often flashes at the same time as the jerking steering at highway speeds such as around 50 mph. Red display of brake light warning and amber display of brake system warning often occur, sometimes paired with the jerking steering wheel. The jerking occurs typically on the highway at speeds such as 50 or 55 miles per hour.", "fail date": "  10/17/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Latches/locks/linkage", "Sub Problem": "Latches/locks/linkage problems", "description": "The contact owns a 2017 Honda Pilot. The contact stated that while driving at an undisclosed speed, the hood was shaking. The vehicle was taken to the dealer where it was diagnosed that the failure was related to NHTSA campaign number: 21v932000 (structure, latches/locks/linkages). The dealer performed the recall repair by replacing the hood latch striker. The manufacturer was made aware of the failure and a case was opened. The manufacturer informed the contact that the vehicle had previously been serviced under NHTSA campaign number: 21v932000 (structure, latches/locks/linkages). The failure mileage was approximately 89,000.", "fail date": "  09/15/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Latches/locks/linkage", "Sub Problem": "Latches/locks/linkage problems", "description": "The contact owns a 2017 Honda Pilot. The contact stated that while driving at various speeds, the hood would flutter and shake. The contact called the dealer and was informed that his vehicle was not included in NHTSA campaign number: 21v932000(structures, locks/latches/linkage). The manufacturer was also notified of the failure. The vehicle had yet to be repaired. The failure mileage was unknown.", "fail date": "  08/16/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2017 Pilot", "Problem": "Latches/locks/linkage", "Sub Problem": "Latches/locks/linkage problems", "description": "The contact owns a 2017 Honda Pilot. The vehicle had previously been serviced by the dealer under NHTSA campaign number: 11v464000 (structure, latches/locks/linkages). The contact stated that the failure recurred with the hood vibrating after the recall was repaired. The manufacturer was made aware of the failure and informed the contact that they had met their obligation through the recall repair and provided no assistance. The failure mileage was approximately 70,000. The VIN was unavailable.", "fail date": "  02/26/2022"}]