[{"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "During my commute home from work my vehicle began shaking as if it was going to stall. The orange check engine light began to flash. I used my scanner and it read the code p0303. I took it to a mechanic the following day and they stated the engine is burning excessive oil and misfiring due to Honda’s variable cylinder management system. The oil is soaking the rear three spark plugs from continuously turning on/off while driving causing the engine cylinders to misfire. They stated it is not safe to drive due to possible shut off, power loss, acceleration loss, and damage to the other car systems. I have regular maintenance done to the vehicle but due to the vcm system it will continue to have the same issues. I paid a lot of money for a “reliable” car but the mechanic is saying I need a new motor.", "fail date": "  10/13/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The contact owns a 2013 Honda Pilot. The contact stated while driving at 65 mph, the check engine warning light, the vehicle stability control (vsc) warning light, and the traction control warning light illuminated. The message \"emission check\" was displayed. The contact stated that the failure reoccurred while driving. The vehicle was taken to the local dealer where it was diagnosed that the cylinder #1 was misfiring due to oil leaking onto the spark plugs. The dealer diagnosed that the piston rings were beginning to fail; however, the spark plugs were replaced as a temporary repair. The manufacturer was notified of the failure and informed the contact that the vehicle could not be repaired under NHTSA campaign number: 13v382000 (engine) as the VIN was not included. The vehicle was not repaired. The failure mileage was approximately 81,250.", "fail date": "  09/25/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The car stalled on highway while I was driving it . The check engine light went on randomly and it just stopped . Had it towed to our local gas / service station and they replaced #2 cylinder spark plug . They told us it should be seen by a mechanic bc they thought engine was bad. We took it to mechanic , ( took over 10 days to get it in ) and they said the #2 spark plug that had just been replaced was saturated in oil bc the oil was getting past piston rings . This car has only 86k miles on it .", "fail date": "  06/15/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The engine rod failed and blew apart. Car is still running but could just stop at anytime and caused an accident.", "fail date": "  02/21/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Since purchasing new in 2013, experienced ongoing issues with vcm. Noticable vibration/shudder at all speeds except during heavy acceleration. Taken to dealer mant times. They are able to reproduce but state no fix available. It's how the car was made. In addition to vibration, engine makes a chirping noise when accelerating through vibration. I believe they are related although neither have been able to be fixed. No warning lights illuminate. I purchased this car for the 4wd as I live in snow/ice climate. However, excessive vibration/shudder makes driving in these conditions (any conditions) unsafe due to constant need to fluctuate acceleration/ deceleration to help minimize vibration/shudder to regain sense of control. If you maintain speed while vibrating on snow/ice you feel like you are losing control. This vibration has to have a long-term effect on engine/car integrity. It's strong enough that some day I imagine I'll come to a stop and at that very moment, every screw will have come loose/undone from years of vibrating and I'll be left sitting in the seat holding just the steering wheel with the car in parts all around me.", "fail date": "  11/07/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "June 20, 2021 this is my third Honda Pilot. I owned a 2004, 2008 and now a 2013 Honda Pilot since September 23, 2019. And yes, both 2004 and 2008 vehicles had recalls, transmission and engine problems. Fast forward to today, my Pilot wasn't being driven on a daily basis due to covid-19 pandemic from March 23, 2020 to present (teleworking from home). However, while driving my vehicle heading home on June 11, 2021, the vsa indicator, malfunction indicator lamp and the vtm-4 system indicator lights lit up on the instruction panel. I took my vehicle to pohanka Honda in capitol heights, maryland on Saturday, June 12, 2021 but they told me that it would cost approximately $160. 00 to run diagnostic test for the lights and that they were booked for the day and to come back on Monday morning, June 14, 2021. Instead, on Monday afternoon, I took my vehicle to an independent mechanic who informed me that the oil is burning and spilling onto the engine and the engine light came on while they were test driving the car. The independent mechanic recommends that the engine and all six spark plugs be replaced. The independent mechanic also told me to researched the issues. And upon further investigation on the NHTSA website, I found that the issues are linked to the NHTSA campaign number: 13v382000 (engine). However, my VIN number is not under recall. Even though there are approximately 258 total complaints for the 2013 Honda Pilots and of those, 59 were engine complaints, I am shocked that Honda has not addressed this issue as of June 2021. That is just totally unacceptable and I am so over Hondas period. I will be contacting Honda of America for assistance with this repair. Thanks.", "fail date": "  06/11/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The car is from 2013 doesn’t have a lot miles and the transmission already starting present rallying noises when backing up. I did take to a mechanic and stated that have residue but they not sure if is that or something else. .", "fail date": "  01/04/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "While driving vehicle obd shows code p0304. Vehicle had poor acceleration while misfiring. Took vehicle into Honda dealership and they state a re-ring of four cylinders needed. This is consistent with the \"soto class action settlement\" in the \"Honda misfire case\" that resulted in a service bulletin and extension to the warranty. Dealership states although this vehicle meets the model and year criteria for this problem, the VIN shows it was built in a factory that does not qualify for the remedy to be paid for by Honda. Dealership agrees it is the same problem and same maintenance action required as the other vehicles that are covered by the class action law suit. Honda America refuses to remedy the problem. This is a safety issue that Honda refuses to take care of even though it is well known from other same model/year vehicles. Please help!.", "fail date": "  12/27/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The engine is making an idling noise only when the car starts in the morning. Takes time for car to increase speed.", "fail date": "  03/04/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Misfired 2nd cylinder, excessive carbon and oil fouling on spark plug. Ignition coil needs replaced quickly.", "fail date": "  09/18/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Tl the contact owns a 2013 Honda Pilot. While driving approximately 65 mph, the check engine and vtm-4 indicators illuminated. The dealer was not contacted. The vehicle was taken to an independent mechanic who was unable to diagnose the failure. The manufacturer was not notified. The vehicle was not diagnosed or repaired. The failure mileage was approximately 68,000.", "fail date": "  05/01/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "When my Pilot goes into eco mode there is considerable vibration that can be felt in the steering wheel, gas pedal, interior door panel if your leg is resting against it, also there is enough reverb in the cab that at times it can irritate your inner ear. Its the worst around 45 to 65 but can be felt at most speeds. It doesn't matter whether its city or highway its present whenever eco is on at cruising speed. I took my Pilot to the dealer I purchased it from to give them the opportunity to trouble shoot the issue. Initially I thought it was the transmission but they said it was the engine going into eco mode and that it was normal. I have never had a vehicles engine produce the amount of vibration that this one does and to be told its normal to me is unacceptable. I have since read many threads and complaints about this same issue on the internet. This needs to be addressed with Honda and they need to provide a solution. We bought this vehicle in the summer of 2015, have owned it less that a year and this issue makes it a very undesirable vehicle to own and if Honda doesn't provide a solution for this we will most likely get rid of this vehicle and never buy another Honda again nor recommend this manufacturer.", "fail date": "  08/01/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "My Honda Pilot vibrates and hums when the eco light comes on. I notice it at lower speeds and rpms, not sure if it is transmission or engine, mentioned to my service tech but they could not find and issue.", "fail date": "  12/22/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "This has happened several times: car is a stopped or slowly rolling and you step on the gas to get into traffic floor to the floor and the car doesn't move. The newest incident today is the car was in motion going approximately 10 mph when it completely died. All power lost, could not steer and had to pump the break several times to stop. Dealership says verbally over phone no open recalls on car and unless they can recreate, they probably can't fix anything. I am going to get killed with my baby in this car.", "fail date": "  11/07/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Cracked or damaged piston ring or rings. . . Spark plug damaged. . . . \"in my opinion\"the engine will never be reliable, it will never be right. . . At 12,000 miles. . . .", "fail date": "  05/29/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Tl - the contact owns a 2013 Honda Pilot. The contact stated that while waiting at a traffic light, there was a sudden increase in engine rpms and the vehicle hesitated. The vehicle was taken to the dealer. The technician was unable diagnosed the failure. The manufacturer was made aware of the failure. The vehicle was not repaired. The VIN was not repaired. The failure and current mileage was 1,200. Pm.", "fail date": "  05/01/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The contact owns a 2013 Honda Pilot. The contact stated that while driving approximately 5 mph and attempting to enter a parking garage, the vehicle jerked violently and crashed into a concrete barrier. There were no injuries and a police report was not filed. The vehicle was not repaired. The manufacturer was not notified of the failure. The approximate failure mileage was 16000.", "fail date": "  03/03/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Sometimes when starting out and making left or right hand turn after being stopped at a stop light or stop sign, the engine will hesitate and bog down for a few seconds before it \"kicks in\" and then there is a \"surge of power\". This is very annoying at the least and also very dangerous as one could easily get rearended or worse yet get caught in the intersection in oncoming traffic.", "fail date": "  02/01/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The vehicle starts to shudder and vibrate at various speeds. You must slow down or speed up to get it to stop vibrating. We bought this Honda Pilot because we drive on a lot of slick roads. I feel this makes it very unsafe for my family. Along with being unsafe, it is very annoying and with it being a new vehicle, we should not have to accept this. The dealership says it is a normal operation of vcm. American Honda tells me the same thing. I don't agree.", "fail date": "  12/02/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The engine vibrates and makes a noticeable noise when driving slow or when feathering the gas pedal.", "fail date": "  11/07/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Whenever I drive between 35-45 mph the car shudders and vibrates. There is no vibration thru the steering wheel. I feel it thru the car seat, back, and center storage lid. Passengers have remarked \"what's wrong with your car?\" at 35 mph the car drives very smooth. By 35 mph it's like driving a different car. The vibration is getting more pronounced as miles accrue.", "fail date": "  11/01/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I have a 2013 Honda Pilot, less than 1 month since purchase. At speeds from 20 mph to 70 mph my engine and car will, vibrate, shudder. There is also a low frequency noise that seems to vibrate in my ear which is also quite a distraction. It seems to happen most when I am on a flat or slight incline. The only way to get it to stop is to either speed up or let off the gas. This is very distracting while driving at highway speeds, and very frustrating since it is a new vehicle. I have taken it back to the Honda dealership and they said that they feel the problem, but they said that american Honda states that this is normal for this vehicle. I do not understand how this could be normal. A rough feeling, vibrating cabin and shuddering engine is not a normal operating car. It feels like something will break or come loose, which makes me very nervous as my children commute with me every day.", "fail date": "  10/21/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "When slowing down to make a left turn, as I start the turn the engine hesitates and there is no response. The car seems to have no power and coasts 4 or 5 seconds before responding normally. This is very dangerous in high traffic conditions. This problem has also occasionally occurred starting off from a traffic signal, and making right turns.", "fail date": "  10/17/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Vehicle vibration/rumbling/shuttering at speeds around 35-55mph. Apparently due to vcm(vehicle cylinder management system) most noticeable when backing off accelerator after vehicle reaches constant speed and eco light is on, but can occur weather eco light is on or not. Vibration is felt through out entire vehicle but as a driver, it is felt through the seat, steering wheel and center console. This vibration is very unpleasant and annoying. Vehicle was taken back to the dealer due to us just purchasing it with only 10 miles on it. The first time they rebalanced the tires. This did not help. Second time I took the service manager out for a test ride to show him what I meant. He felt the same vibration/shutter/rumble. We then went back to the dealership and took out another new Honda Pilot that was on the lot. The road test came back with the same results. Service manager then told me that the vibration I was feeling was due to the vcm as the different cylinders fired and that there was nothing they can do about it and that I would just have to deal with it until Honda comes out with a way to correct the problem, which as far as he knows they have no intention to do so. Apparently Honda says that this is part of normal operation. I paid over $36,000. 00 dollars for this vehicle and feel that is not normal operation, and that Honda needs to correct this.", "fail date": "  10/12/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Engine vibration in eco mode. It has grown steadily worse since new. This is completely unacceptable for a well engineered vehicle.", "fail date": "  10/03/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "When trying to accelerate at low speeds or from a stop, there is a 2-5 second hesitation and then a surge. This has happened several times a week since we bought the vehicle. The scariest part is that it is unpredictable. It is especially dangerous when entering busy traffic, which we have a lot of. We have complained to the dealer every time we have taken the vehicle in for regular maintenance. Of course they say they can't make it fail when they test drive it.", "fail date": "  09/14/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I purchased a brand new 2013 Honda Pilot in September 2013. From the first day of driving it, I noticed a vibration coming from the drive train/engine/transmission when the engine was switching into \"eco\" mode. The vibration can be felt through the steering wheel, gas pedal, and floor board. It becomes worse when cruising at a low rpm, or when climbing a hill (no matter how steep the hill is) when the eco mode is engaged. The vibration only stops when the car is required to increase the rpm, either from manually depressing the gas pedal, or the computer deciding it needs more power. The vehicle does not experience this vibration until the engine warms up and the eco mode engages. When the engine is cold, the eco mode does not kick in, and there is no vibration. I now have 5600 miles on the Pilot, and the problem seems to be getting worse. I've taken the car to the dealership, who without taking it for a test drive advised that \"this is a known problem with the eco mode on both the Pilot's and odyssey's\". They went on to tell me that there was nothing they could do to fix it, as Honda has determined that this is \"normal operation\". In addition to filing a complaint with the dealership, I have also filed a complaint with Honda customer care. No resolution to date. Had the salesman told me about this \"normal operating vibration issue\", I would not have purchased the vehicle.", "fail date": "  09/06/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Ever since I pulled off the new car lot,,,,, vehicle has vibration at 1500 to 2000 rpm. It is slight but vibrates throughout vehicle. Annoying is the perfect description. Goes away with slight acceleration. Seems to be related to eco being in operation. I see same complaint in other posts. I believe it is a rookie design flaw in power train. A $40,000 vehicle should be without this defect. I also own a 2010 Pilot that operates without any vibration at any speed or load upon engine/drivetrain. This is my second \"Honda\" company vehicle. I wish I had the 1st one back. You can imagine my frustration with my 2013 Honda Pilot. Honda. . . . . Can you own up to this flaw and fix?.", "fail date": "  08/14/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "My 2013 Honda Pilot jerks and surges when eco light engages. I have taken the vehicle to the dealer twice, with a third trip scheduled and am told, \"we can't recreate the problem. \" but, it does it all the time when I am driving, and appears to be a very common problem based on other complaints I have read online. This is extremely unacceptable and Honda needs to acknowledge the problem, as well as provide adequate repair. This impacts the value and marketability of the vehicle. I would get rid of it today if it wouldn't have such a negative monetary impact.", "fail date": "  08/06/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Accelerator pedal is depressed and there is no response from the motor for almost 2 seconds. This happens at slow speeds and also when slowing down on the freeway ( slow driver ahead ) then pressing the accelerator pedal to the floor to pass and again, no response from the motor for several seconds. This is very intermittent and I have not yet been able to duplicate it on demand. I have been driving for almost 50 years and have never experienced this type of problem. It can be a bit scary.", "fail date": "  07/24/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Vehicle constantly vibrates/shudders as engine run in eco mode and as vcm kicks in/out or is in use. I see hundreds of same complaint on Honda message boards and all have gotten the same response from Honda. They indicate it is normal operation and nothing they can do. Anyone that's driven a vehicle for more than a few hours can tell you it's not normal for a vehicle to vibrate like that. In my driving, I find it to be not only annoying, but very distracting as I'm constantly trying to change speeds/rpm, etc. To make the vibrations go away. This constant distraction is a safety concern. I implore you to get Honda to own the situation and find a fix.", "fail date": "  07/12/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I purchased a new 2013 Honda Pilot ex-l on June 15. I noticed on my first trip on the interstate that the car hesitates when driving in eco mode. This is very annoying as it feels like the engine isn't getting enough gas. Had it checked out at the dealership and was told others had complained too, but this was a normal function, nothing could be done. I feel like I'm jerking down the road. I traded a Honda odyssey, which also had eco drive, and I never had these issues with the van. I hate to drive this car!.", "fail date": "  06/19/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Everytime I reached a certain speed then try to maintain it by slightly pressing on the gas, the engine starts to shudder/vibrate. It is really annoying and it concern me a lot. The issue happens in different speed. I brought this complain to the dealership but they said that everything is working normal with the car. So, I just get a long with it. Then after a few more months, the vibration is getting worse and it is getting in my nerves. I brought it back yo them but the same they only gave me the same reason. My sister and some friends have Honda cars with eco mode also. How come that they don't experience the same thing with their vehicles. I agree with some complainants that this is a safety issue. It bothers the driver when you experience that vibration from the engine. Is Honda just waiting for someone to die from a car crash with the Pilot before they make a move to correct the issue. I just hope that they bring this issue to the higher op of Honda before someone's life will be taken.", "fail date": "  06/06/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "2013 Honda Pilot. Consumer writes in regards to severe vibration when eco drive engages. The dealer informed the consumer there was no fix for the problem, as it was a normal characteristic.", "fail date": "  06/03/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Runs very rough in eco mode. Noticeable vibration in steering wheel. Car has done it since brand new.", "fail date": "  06/03/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Since purchasing new in 2013, experienced ongoing issues with vcm. Noticable vibration/shudder at all speeds except during heavy acceleration. Taken to dealer mant times. They are able to reproduce but state no fix available. It's how the car was made. In addition to vibration, engine makes a chirping noise when accelerating through vibration. I believe they are related although neither have been able to be fixed. No warning lights illuminate. I purchased this car for the 4wd as I live in snow/ice climate. However, excessive vibration/shudder makes driving in these conditions (any conditions) unsafe due to constant need to fluctuate acceleration/ deceleration to help minimize vibration/shudder to regain sense of control. If you maintain speed while vibrating on snow/ice you feel like you are losing control. This vibration has to have a long-term effect on engine/car integrity. It's strong enough that some day I imagine I'll come to a stop and at that very moment, every screw will have come loose/undone from years of vibrating and I'll be left sitting in the seat holding just the steering wheel with the car in parts all around me.", "fail date": "  11/07/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "I was traveling at about 35mph in a city street and slowly approaching an intersection to make a right turn. Out of a sudden, the car accelerated while my foot was on the brake, crashing into another vehicle and running off the road. Both airbags deployed.", "fail date": "  03/25/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The car is making these horrible noises. The dealership claims everything was find when they sold it to us. We took it back a few days later for them to fix it and they claimed to fix it but never did. We have taken it to multiple mechanics and they can not figure out what it is after have it at least 3 or 4 days. It's like a vibration/grinding noise. The alignment is fine but it still pulls and the steering wheel is off. It always makes a grinding noise and the vibration and grinding starts when you are driving and it hits a constant speed even when you dont use the cruise control.", "fail date": "  03/04/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Engine mil illuminated. Code p3400 indicated through obd. No low oil pressure indication prior to mil, could lead to engine failure. Replaced both front and rear rocker arm oil switches.", "fail date": "  04/28/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Motor lost a cylinder at 85,000 miles driving at 60 mph.", "fail date": "  01/05/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "While driving in the freeway with my family, the radiator blew up and spilled the fluids inside the engine compartment or hood there was smoke coming out of the compartment a message popped up on the dashboard saying engine is over heating and it stopped. This car only has around 46000 miles on the car. It seems like Honda issued recall for radiator problems only on 2017 Honda Pilots. But, this problem seems to exist in other older models also. It is safety issue. It is very important that Honda and NHTSA look carefully into this problem, issue recall for other older models and fix the problem to save some life�s.", "fail date": "  12/23/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "On Thursday, March 30, 2017, I had the oil changed and fluids checked in my 2013 Honda Pilot. I drove home 26 miles away and average speed of 65 mph. The next day, I drove from summerville to rome to cave spring ~ 60 miles. Later that day I had to drive back to cave spring and then headed home. About 15 miles out of rome, driving 65 mph on a 4 lane divided hwy, my car just stopped moving. I pumped the accelerator and nothing happened. I managed to coast to a stop and pull onto the side of the hwy. The air conditioning and radio were working, the engine was running, but there was no pull from the motor. I turned the car off and was trying to find someone to come get me. After 15 minutes, I turned the engine on, again, ac and radio working fine, but no acceleration, and could not get it to move forward or in reverse. No dashboard lights came on at all. I had to get a wrecker to haul the car to the dealership. On Monday, I called about the car and the dealership said the mechanics had been out driving the car and couldn't find anything wrong with it. I often have to drive to atlanta on business, and I do not feel safe driving this car. In fact, I told the dealer to keep the car until they fix it.", "fail date": "  03/31/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Engine/piston/ring issue. Rings not aligned properly in one of pistons ( factory/assembly error) resulted in oil leaking and thrown on engine , caused 2 spark plugs to fail, this caused engine light to come on and then the vsa and vtm-4 came on and the eco light stopped working. . . We were travelling 70 miles an hour on highway. We were really afraid when the vtm-4 light came on! we had to pull off road, for fear of ruining the 4-wheel drive system, we didn't know what was happening. . We couldn't get the lights to go off, finally vtm-4 light went off and on the other lights stayed on. . . It was confusing. . . . Because the lights were false indicators due to being connected to the engine light. This malfunction caused the vsa and vtm-4 and eco light to come on falsely. Creating panic while travelling 70 miles an hour on interstate. Creating the false impresssion that the 4-wheel drive system had been activated while travelling at a speed of 70 miles an hour. Suggestion:. . . . Engine light should be separate from other warning system lights. . This incident occured approximately 300 miles from our home on a Sunday . . We took automobile to dealer Monday a. M. And had repair of piston/ring gaskets etc it was determined the other warning lights were false indicators. . .", "fail date": "  08/28/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "I purchased my 2013 Honda certified pre-owned in August 2015. Test drive was short and felt no issues. Felt the shudder on a highway drive the next day. Now I question if the salesperson knew this would be noticed and deliberately made the test ride short to avoid this being noticed. I even asked her about the vibration issue from reports I had read about before the purchase. I was told this was not an valid issue and that she had owned a Pilot and never felt anything. The car was brought back and a software update was done as well as fluid change in trans within the first month. It still had the shudder. After driving for a few weeks to give it a chance to prove itself and it not me \"looking\" for a problem I called and spoke with the service manager to report this and inform him I would coming back when my schedule allowed. It is getting more frequent and it does not seem to matter whether in eco mode or not. The shudder usually happens around 38-42 mph. But will begin anytime the vehicle cruises in any speed range continually. At higher speeds I can feel my skin shake like one of those fat burning shaking belts from years past. (just so you know I am of average build without excessive body skin. ) brought the car back a second time. That was today Feb. 3, 2016. Went for ride with the service manager. Told him it seems to be getting worse. His conclusion was that this \"shudder\" was a \"characteristic\" of my $28,000 purchase. My 1999 suburban that I traded in had a better ride. Very disappointed with Honda. I am going to another dealer to get a second opinion.", "fail date": "  02/03/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "When my Pilot goes into eco mode there is considerable vibration that can be felt in the steering wheel, gas pedal, interior door panel if your leg is resting against it, also there is enough reverb in the cab that at times it can irritate your inner ear. Its the worst around 45 to 65 but can be felt at most speeds. It doesn't matter whether its city or highway its present whenever eco is on at cruising speed. I took my Pilot to the dealer I purchased it from to give them the opportunity to trouble shoot the issue. Initially I thought it was the transmission but they said it was the engine going into eco mode and that it was normal. I have never had a vehicles engine produce the amount of vibration that this one does and to be told its normal to me is unacceptable. I have since read many threads and complaints about this same issue on the internet. This needs to be addressed with Honda and they need to provide a solution. We bought this vehicle in the summer of 2015, have owned it less that a year and this issue makes it a very undesirable vehicle to own and if Honda doesn't provide a solution for this we will most likely get rid of this vehicle and never buy another Honda again nor recommend this manufacturer.", "fail date": "  08/01/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Parked on level paved shoulder of small-town 2-lane road in upstate NY. Placed truck in park, and verified truck shifter in park. Left truck idling in park to keep a/c going during brief stop to walk to rear passenger door to hand item from rear floor back to toddler. As I approaced rear door, truck (without being touched/bumped) engaged and began driving away under power, not rolling. Chased truck and partially jumped in (short legs). Attempted to put truck in park to stop it, but shifter in park already, refocused on trying to turn off keys. Truck had enough torque to drive across 2-lane road, fully/easily drive over curb, then drive down into gully with me only partially inside. When truck got stuck at bottom and stalled, finished climbing inside and turned off truck. Re-verified shifter still in park. Witness and husband also verified shifter still in park. Managed to just avoid hitting big tree and setting off airbag. Toddler uninjured, I didn't appear injured at time, but legs and knees banged up requiring doctor's visit. Vehicle towed out of gully and superficially repaired enough to cautiously drive home to MD for full repair.", "fail date": "  07/31/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "This vehicle seems to have a design flaw. Many threads exist online discussing the same. The vehicle exhibits strange behavior when shifting from p to d and lurches forward. In addition shifting between gears is problematic at times. Lots of shuddering and vibrations. I have take. To dealer on 3 separate occasions with no success in getting repaired. Dealer does not acknowledge problems. I beleive this is a safety issue and needs to be addressed. Thank you.", "fail date": "  05/12/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Sometimes when starting out and making left or right hand turn after being stopped at a stop light or stop sign, the engine will hesitate and bog down for a few seconds before it \"kicks in\" and then there is a \"surge of power\". This is very annoying at the least and also very dangerous as one could easily get rearended or worse yet get caught in the intersection in oncoming traffic.", "fail date": "  02/01/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Vehicle shutters terrible at certain speeds/rpm. Have to adjust acceleration to get it to stop. Huge safety issue. Not normal operation for a new vehicle. It's criminal that Honda claims its normal.", "fail date": "  01/08/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "At various speeds there is a very annoying shuddering and vibrating and growling at 45 mph 68 mph. Just when your ready to have a smooth ride on the highway it begins to shudder in eco. . . On a straightaway while free wheeling and while I am on cruise control . . . If you accelerate or decelerate, it will cease for a second and begin again. . I have even stayed at 68 mph to see how long it would last on a straight away while it was shuddering. . . . And it continued . . . Until I decelerated.", "fail date": "  11/01/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "I have a 2013 Honda Pilot, less than 1 month since purchase. At speeds from 20 mph to 70 mph my engine and car will, vibrate, shudder. There is also a low frequency noise that seems to vibrate in my ear which is also quite a distraction. It seems to happen most when I am on a flat or slight incline. The only way to get it to stop is to either speed up or let off the gas. This is very distracting while driving at highway speeds, and very frustrating since it is a new vehicle. I have taken it back to the Honda dealership and they said that they feel the problem, but they said that american Honda states that this is normal for this vehicle. I do not understand how this could be normal. A rough feeling, vibrating cabin and shuddering engine is not a normal operating car. It feels like something will break or come loose, which makes me very nervous as my children commute with me every day.", "fail date": "  10/21/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "When slowing down to make a left turn, as I start the turn the engine hesitates and there is no response. The car seems to have no power and coasts 4 or 5 seconds before responding normally. This is very dangerous in high traffic conditions. This problem has also occasionally occurred starting off from a traffic signal, and making right turns.", "fail date": "  10/17/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Vehicle has rollback on inclines and transmission does not lockup to hold position when foot is taken off of brake (almost caused accident ). Told by Honda service manager where I purchased this vehicle that this is normal with Honda's. . . Have never had a vehicle do this before. How many accidents have been caused by this condition?.", "fail date": "  09/29/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Letter from constituent regarding Honda's 2013 Pilot recall (NHTSA recall 13v-382/campaign#jb5/service bulletin #13-075); he has been unable to correct the problem from american Honda motor CO. Or university motors; requesting assistance from NHTSA. The consumer stated he would like to have the long block and short block replaced. He stated he talked to three different automotive mechanics, and it was in their opinion that replacing only the short block of the engine was not a trustworthy fix. The short block repair performed under non-factory conditions, which could lead to contamination of the engine, that would cause serious issues and engine failure in the future. The consumer stated the dealer would not return his calls. Also, the consumer was not getting the proper gas mileage as advertised. The vehicle was rated between 16 and 17 mpg, and he was getting 13 mpg. The vehicle rolled backward on a slight incline, while in drive, there was a vibration/shudder coming through the vehicle, when maintaining a constant speed.", "fail date": "  09/12/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "I purchased a brand new 2013 Honda Pilot in September 2013. From the first day of driving it, I noticed a vibration coming from the drive train/engine/transmission when the engine was switching into \"eco\" mode. The vibration can be felt through the steering wheel, gas pedal, and floor board. It becomes worse when cruising at a low rpm, or when climbing a hill (no matter how steep the hill is) when the eco mode is engaged. The vibration only stops when the car is required to increase the rpm, either from manually depressing the gas pedal, or the computer deciding it needs more power. The vehicle does not experience this vibration until the engine warms up and the eco mode engages. When the engine is cold, the eco mode does not kick in, and there is no vibration. I now have 5600 miles on the Pilot, and the problem seems to be getting worse. I've taken the car to the dealership, who without taking it for a test drive advised that \"this is a known problem with the eco mode on both the Pilot's and odyssey's\". They went on to tell me that there was nothing they could do to fix it, as Honda has determined that this is \"normal operation\". In addition to filing a complaint with the dealership, I have also filed a complaint with Honda customer care. No resolution to date. Had the salesman told me about this \"normal operating vibration issue\", I would not have purchased the vehicle.", "fail date": "  09/06/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "My 2013 Honda Pilot jerks and surges when eco light engages. I have taken the vehicle to the dealer twice, with a third trip scheduled and am told, \"we can't recreate the problem. \" but, it does it all the time when I am driving, and appears to be a very common problem based on other complaints I have read online. This is extremely unacceptable and Honda needs to acknowledge the problem, as well as provide adequate repair. This impacts the value and marketability of the vehicle. I would get rid of it today if it wouldn't have such a negative monetary impact.", "fail date": "  08/06/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "SUV shudders noticeably between 45 to 74 mph when vcm engages from eco mode to 6 cylinder. Dealer inform me it is a normal feature of the vehicle.", "fail date": "  07/22/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "I purchased a new 2013 Honda Pilot ex-l on June 15. I noticed on my first trip on the interstate that the car hesitates when driving in eco mode. This is very annoying as it feels like the engine isn't getting enough gas. Had it checked out at the dealership and was told others had complained too, but this was a normal function, nothing could be done. I feel like I'm jerking down the road. I traded a Honda odyssey, which also had eco drive, and I never had these issues with the van. I hate to drive this car!.", "fail date": "  06/19/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Runs very rough in eco mode. Noticeable vibration in steering wheel. Car has done it since brand new.", "fail date": "  06/03/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Vibration, humming noise while in eco mode. At slower speeds while feather gas, eco can sometimes seems to get confused abruptly turn off causing a jolt like feeling. At times, eco seems confused whether to fire on 2, 4, or 6 cylinders and can become in almost what I call an arrhythmia type feeling, with the vibration jumping around until it finds what it wants to do. Noticed the issue since I drove it off the lot. As expected, dealer says they can't find any issue. Vibration can be so bad that I sometimes think it is the road, but it is not. Would dump car but would loose money. Very unfortunate and will not be buying a Honda again. If you are looking into one, please be sure to test drive at all speeds, especially cruising at slow and faster speeds. Cruising and feathering the gas is when you notice it most.", "fail date": "  05/16/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "My daughter was backing out of the garage onto a sloped driveway, applied the brake ,shifted into park gear selector,exited auto to retrieve something from garage. Noticed the car rolling , attempted to get in the car, as her two children were in the rear (ages 6 &9). Car rolled over her leg, resulting in major compound fracture, resulting in extensive surgery, metal rod and screws in her leg. Car rolled backwards crossing street into ditch. Police report indicates engine was still running with gear in reverse . Honda case #[xxx] information redacted pursuant to the freedom of information act (foia), 5 u. S. C. 552(b)(6).", "fail date": "  05/02/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "This report is for a new, 2013 Honda Pilot touring model with less than 100 miles on the odometer and has continued since. After the car is warmed up, and when the eco light illuminates, there is a shudder or a low frequency, rumbling vibration throughout the vehicle. This was first noticed while on the highway with cruise control set, but has since been observed at multiple speeds with or without cruise control. The vibration starts when backing off the accelerator after reaching a constant speed and continues until the engine loads down due to a hill or further acceleration. This also coincides with the eco light turning off. It does not appear to be related to a shift point, because when the accelerator pedal is depressed, the vibration stops and the engine rpms stay constant. The level of vibration is not as intense as that of riding over rumble-strips, but the frequency is similar. The level of vibration appears worse at higher engine rpms.", "fail date": "  04/15/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Intermittently when starting to drive after being stopped at light or stop sign the engine will hesitate and bog down for a few seconds before it \"kicks in\" and then there is a \"surge of power\". This is very annoying and also very dangerous as someone could easily get rear-ended or worse yet get caught in the intersection in oncoming traffic. There is also vibration and shutter at certain speeds and seems to be worst when eco mode kicks in and when driving conservatively. There is also a pull in the steering upon acceleration.", "fail date": "  03/08/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "2013 Honda Pilot brand new as I was driving home noticed a vibration coming from front end. More pronounced at higher speeds. Notified dealer and brought in too check out. Dealer started the diagnostics process by sitting in the passenger seat and we went for a ride. Honda tech acknowledge the vibrations coming from the front of the vehicle. Steering wheel shake, bangs, shuttering and low pitched humming noises. Tech and dealer document my concerns and say \" we are aware of the problem you have to take this up with Honda. \" there is nothing they can do. Contacted Honda after a week of calling daily. Which Honda's response is \"yes we starting to get a lot of similar complaints but not enough for too react. This is normal vehicle operation. \". That is unacceptable, I cannot wait for something tragic to happen before Honda reacts.", "fail date": "  02/20/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "While slowly backing out of parking place into the street, the engine suddenly and unexpectedly accelerated out-of-control to very high rate. Caught off guard, the engine rpm was not noted, but driver quickly decided that the only solution was to turn off ignition. There was no mat on pedal, and driver does not operate brake and accelerator pedals with two feet. Engine re-started and functioned normally.", "fail date": "  02/09/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The contact owns a 2013 Honda Pilot. The contact stated that the brake failed to engage at normal stopping distance and the brake pedal felt soft. When depressed, the brake pedal would travel partially to the floorboard accompanied by an abnormal vibration occurred when driving 65 mph. The failure would occur when traveling over a flat surface or when the cylinder was in third. The vehicle was taken to the dealer and a diagnostic was performed that was unable to locate a failure code for the vibration or the brake failure. The dealer loosened the engine and the transmission bolts however, the failure was not corrected. The manufacturer was made aware of the failure. The vehicle was not repaired. The approximate failure mileage was 3 and the current mileage was 2,400.", "fail date": "  12/29/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Vibration at 1500 rpm. Stops when rpm go above 2000 or less than 1400.", "fail date": "  12/24/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Brake failure at stop sign. Driver crashed into a pole, suffered severe injuries including bleeding in the brain and broken ribs.", "fail date": "  07/07/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "My 2013 Honda Pilot steering wheel shudders hard when braking. This started at around mileage 30k and the car currently has 57k on odometer. We bought the car new and have not needed any brake work on the front. Honda serviced the rear brakes so far. Honda representatives have told us that front shudder of the steering wheel most likely means the rotors are warped and need resurfacing or replacement. The shaking on downhill driving is so bad the car feels uncontrollably dangerous. You must drive very slow with hazard lights flashing when traveling downhill at 20-30 mph. Shaking and shudder happens at almost any speed above 40 mph when brakes are applied.", "fail date": "  09/07/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "When the brakes are applied the front end starts to vibrate as the car is moving on streets, roads, highways and interstate highways. Not during a turn, yet. Just moving forward. There has been no accident as of yet but, I am fearful that the vibration will not allow the car to stop in time to save my life as well as who ever I hit. This is a dangerous situation. The Pilot was taken to the local Honda dealership this morning. They called with a bill for 1,052. 00 for compliance bushings. This car is six years old with 61,026 miles, way too young to be costing me that much money for a �front / rear stabilizer�, that should be a problem at maybe 200,000 miles. Will I ever buy another Honda? let's see!!!!! hmmmm. I'm thinking about it.", "fail date": "  04/30/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "2013 Honda Pilot. Consumer writes in regards to warped rotors. The consumer stated the vehicle was repaired by the manufacturer, but the failure recurred.", "fail date": "  04/23/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "I have had shaking in steering wheel at 60-70 mph and brakes cause the car to shudder. The brakes grabbed when lightly touched them at 70 mph to avoid a truck that pulled into my lane. Afraid that vehicle will lose control due to sudden brake and shudder in steering.", "fail date": "  12/05/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "When driving on the highway between the speed of 60-80 mph, the steering wheel shakes very noticeably making it very uncomfortable to drive with the vibration. I have had tires replaced and the wheels rebalanced and nothing seems to fix the problem. I have been dealing with this for months and no service station is able to fix the problem. Fearing that something may happen when driving on the highway or when my children drive the car. Safety is my number one concern when getting into a vehicle and it is very upsetting that I bought a brand new car to avoid the unknown problems of a used vehicle. Upon doing some research on the internet to find a solution to my problem, I have discovered that every Honda Pilot owner is complaining about the same issue and that Honda does not want to fix the problem.", "fail date": "  01/09/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "It was a sunny and very hot day, temperatures above 90 degrees. The vehicle was proceeding west on a 2 lane in town street, with no curbs, with one vehicle in front, stopped at the intersection to a 2 lane highway. As the vehicle was approaching the railroad tracks, with a slight incline, the driver applied the brakes for the stop sign after the railroad tracks. As the driver applied the brakes, the car accelerated towards the highway. At this point, the driver said, �it's not stopping�it's not stopping. � to the over 2 passengers of the car. There was a car in front of the car, waiting to turn onto the highway and car getting ready to cross the highway, as well as a car on the highway near the intersection. The driver continued to apply the breaks without the car breaking and veered to the left to try to avoid the car in front. As the car accelerated, it hit the car in front and bounced off the left back bumper of the car in front and came to a stop. They cars were not moving at a high rate of speed but the car in question was not stopping even with the breaks applied, foot on the brake petal, foot not on accelerator. It was accelerating. The car was put into park. The car seemed to �have a mind of it's own� not breaking but accelerating. There was an unknown cause for this as of this time. A county deputy was in the area and came over to the accident.", "fail date": "  07/22/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Braking at highway speeds, 5-70mph, car shakes like crazy, rotors are warped after 25000 miles. When applying brakes the car front end shakes very badly. Rotors are Honda oem.", "fail date": "  04/05/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "As posted by several other customers, I have had multiple problems when the brakes are applied at moderate to high rates of speed going downhill. The car begins to vibrate or waver. I have now had the rotors shaved the third time and am sure they will need replacement soon. Each time they repair it lasts for a short period of time. I have been told in the past this is common with this vehicle. I called Honda corporation and they could not have cared less. They said it was all do to \"normal wear and tear\". The dealer service department was as helpful as possible, but they need to escalate these issues to corporation so the consumer is protected. It is very frightening to feel that vibration during downhill braking. I owned a 2011 Honda Pilot and never had this issue so it is something in the design or parts for the 2013 model. I am considering selling the Pilot and purchasing another (non-Honda) SUV.", "fail date": "  08/08/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "My Honda Pilot ex-l model has 36500 miles. It all started after 20000 miles, breaks started feeling spongy and takes longer distance to stop the vehicle. When I took it to dealership, they told me the breaks are working as designed. Now my steering is shaking vigorously when I apply break after 40 mph speed. Anything lower that speed steering is less shaky but I can feel the steering is shaking even in that speed. Now breaking distance is lot longer and during red lights I am crossing the line during intense traffic stops.", "fail date": "  07/20/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "For the past 8 months, I have been having a problem with the car excellerating while I was braking. The dealership looked at the car on 3 occasions and stated that there was no problem with the transmission. Because of a recent scare while driving, I took the car to someone who knows about cars. After a test drive, he concluded that the brakes were not engaging properly giving the feeling that the car was excellerating. He felt that the abs was not functioning correctly and raised an issue that could an accident as the brakes were disengaging when the driver expected them to stop the car. He also felt that the brake action could cause a loss of control it happens at both street and highway speed.", "fail date": "  06/23/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Honda Pilot 2013 vehicle front rotors were turned very early in vehicle ownership due to shake/shimmy/poor braking ability of vehiicle. Vehicle is now back in shop and Honda recommends replacement of front rotors due to severe warping. Vehicle skaes/shimmies and difficulty braking is again experienced. Service advisor explained Honda has manufactured the rotors with \"cheap\" materials and encourages \"no sudden braking or hard-stepping brakes \" (of course Honda refuses financial compensation for rotor replacement. ) I have serious concerns about Honda using cheap and potentially dangerous materials for braking system components. I drive very conservatively and the vehicle has never experienced \"harsh braking\". I fear for my safety and the safety of others that Honda does not stand responsibly behind the safety of it's Honda Pilot 2013 and its rotor problems.", "fail date": "  01/06/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Front brake rotors are extremely poor for this vehicle - I have re-surfaced two different sets of rotors 3 times each now and they continue to warp. The oem ones lasted 12k miles before warping then needing resurfaced. I then bought an aftermarket set from advance auto parts and they warp at less than 10k miles before having them re-surfaced. They seem to warp the easiest when traveling at highway speeds and just braking normally at an off ramp when exiting the highway, the steering wheel starts to wobble and the brakes vibrate badly. The brakes are way worse after the rotors warp. 3 times I have had those sets of rotors re-surfaced 3 times.", "fail date": "  11/29/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "When braking from highway speeds to exit off ramp, car shimmies violently. Steering. Difficult to maintain control of vehicle as steering wheel is also violently shaking. Through research appears to be common known defect of the factory installed brake rotors. Replaced tires, had aligned. Did not correct. Honda used faulty, dangerous and inferior original parts. Nhtsa should force Honda to issue recall. Failure of safe braking at highway speeds put the car occupants and all surrounding vehicles in life threatening danger.", "fail date": "  11/02/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Brakes have bad vibration when stopping at speeds around 60 mph.", "fail date": "  10/15/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "When traveling at high speeds (over 60 mph) and applying the brakes, the steering wheel begins to vibrate violently. Most likely, the rotors are warped. I contacted the dealership to see if the rotors were still covered under warranty, they said they were not covered, but a lot of people were having the same issue as me. This could be very dangerous if the brakes are compromised.", "fail date": "  07/12/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Severe vibration when braking at speeds greater than 50mph. Problem started at approximately 19,000 miles. Honda dealer cut rotors and problem recurred again at 40,000. Rotors are defective and needed to be replaced.", "fail date": "  05/15/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Brake pedal is soft, goes down several inches before the brakes engage. Took car to right Honda in scottsdale, az. They said all Honda Pilots do that. This is not safe and should be fixed. Website chat rooms have complaint after complaint on this very topic.", "fail date": "  02/13/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Rotors warped. This is a continuous problem regardless of how many times it is \"fixed\".", "fail date": "  01/12/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Tl-the contact owns a 2013 Honda Pilot. The contact stated when the brakes were applied the vehicle vibrated and the steering shimmied. The failure recurred on numerous occasions. The vehicle was taken to a dealer, where it was diagnosed the rotors needed to be replaced. The failure had not been replaced. The manufacturer was not notified of the failure. The approximate failure mileage was 12,000. The VIN was unavailable. Jb.", "fail date": "  12/01/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Premature wearing of the front brakes and rotors. Pulling, vibrating, difficulty stopping started early and increased over time. Purchased the car April 2013. Replacements done October 2014 at 24,800 miles. Honda would not reimburse us for the repairs.", "fail date": "  10/03/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The brakes started to vibrate when applied. This happened with only 16000 miles. It was very frightening to my wife. Now the car has 35000 miles and the brakes are bad again.", "fail date": "  07/03/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "I have a 2013 Pilot and I'm finding my brake pedal goes to the floor while stopped at a light. I have 5,000 miles on the vehicle and I'm being told this is normal by the dealership. My thinking is having a brake pedal going to the floor is not normal for any vehicle. I believe the dealer is not addressing the concern and pushing away from the real solution.", "fail date": "  12/03/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Upon applying the brake in an avoidance situation, I noticed the spongy feel to the brakes. What concerns me more, is that during the process of the event, the brake pedal settles down to below the height of the accelerator and if your foot isn't square on the brake pedal, you wind up hitting the gas while trying to stop the vehicle. . I need to talk with someone. This is most certainly a defect in design.", "fail date": "  10/01/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "When applying the brakes at low speed during an emergency stop, the brake pedal depressed and continued to depress further to a point where the location of the accelerator pedal was higher than the brake pedal. This position interferes with the proper application of the brake by allowing a close proximity to the higher accelerator pedal, thus the driver pushing both pedals at the same time and forward motion was not stopped until I released and reapplied the brake, paying particular attention to where my foot was located. Very unsafe ! I have a size 10 w mans shoe. I can't imagine someone with a larger foot size being safe in this vehicle. When I returned to the Honda dealer, I was told that it was just the nature of the vehicle and I need to basically retrain my brain as to the position of the pedals. I've driven for over 55 years and have never experienced such a problem with a vehicle. And to be told that an obvious defect as being acceptable and safe by the manufacturer, is unacceptable to me.", "fail date": "  10/01/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "When driving downhill on highways at 50+ mph, (the steeper the descent, the slower the speed required to initiate brake problems) the front of our 2013 Pilot starts to shudder when the brakes are applied. This shudder is so extreme that we sometimes have difficulty maintaining control of our Pilot and of slowing down in time to avoid hitting other cars, as well as staying in our lane when traversing highway curves. This shudder began right after we left the dealership with the new SUV. Various mechanics have been unable to fix the problem, even after working on our brakes, and have cautioned us to brake gradually while driving mountain roads and highways. We feel that Honda should reach out to those with this issue and make the necessary repairs free of charge.", "fail date": "  09/20/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "At various speeds there was a severe pulsation. This also occured upon breaking. The vehicle was brought to findlay Honda in las vegas, nv. This occured on 25 July 2014. The milage was 31025. On October 16, 2014 I returned my vehicle to the same location and had the identical work completed. A resurfacimg of both front and rear break discs . Milage 35128. Four thousand miles later and the same conditiion happens again! my concern is that this problem will continue and I do not know how many times these defective discs can be resurfaced before I need to have them replaced. This will result in a huge expence, I'm sure. I expect a much better product than what I currently own'. My son is currently driving my 2004 Pilot and have had almost no problem with that vehicle which currently has 136k. Miles. My rememdy should be the replacement of the both the front and rear wheels without charge, because this problem does not appear to be getting better. I expect the same problem to occur at 40k which, of course is out of warranty.", "fail date": "  07/27/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Purchased a new 2013 Honda Pilot - within 7-8 months brakes were vibrating and catching. Took to Honda dealer for repair. Dealer stated yes they were aware of this problem and it had been occurring on their vehicles. Within another 8-9 months same thing happens. Dealer stated that rotors become warped. They repaired but I had to pressure them to repair with no charge. Pilot is now just over 2 years old - has 34,450 miles and it is happening again. When I mentioned this to customer service rep he stated \"yes vehicle weights too much - is too heavy\". If Honda is aware of this problem why are they not fixing it / having better design, etc? I will not purchase another Honda.", "fail date": "  06/12/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Purchased new 2013 Honda Pilot approximately 5/15/13. Noticed over next week that brake pedal has excessive travel- requires pedal to be pushed much farther down than should be expected before the brakes begin to engage, resulting in longer stopping time/length. Took in for service at dealership on 5/28/13. Dealership returned on 5/30/13 stating they were unable to find a problem. Vehicle has not been repaired. Called another dealership- service person stated that this is a known complaint for recent Honda Pilots, caused by brake booster, and is neither adjustable nor fixable. Vehicle odometer currently 600 miles.", "fail date": "  05/23/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "My daughter was backing out of the garage onto a sloped driveway, applied the brake ,shifted into park gear selector,exited auto to retrieve something from garage. Noticed the car rolling , attempted to get in the car, as her two children were in the rear (ages 6 &9). Car rolled over her leg, resulting in major compound fracture, resulting in extensive surgery, metal rod and screws in her leg. Car rolled backwards crossing street into ditch. Police report indicates engine was still running with gear in reverse . Honda case #[xxx] information redacted pursuant to the freedom of information act (foia), 5 u. S. C. 552(b)(6).", "fail date": "  05/02/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The contact owns a 2013 Honda Pilot. The contact stated that every time the brakes were engaged, that the brakes would shutter and that there was a vibration on the steering wheel. The vehicle was taken to the dealer. The technician diagnosed that the rotors failed and needed to be re-finished. The repair was made however, the remedy failed to correct the problem. The vehicle was taken back to the dealer, who then replaced the rotors. The manufacturer was made aware of the failure. The vehicle was repaired. The failure mileage was 23,000 and the current mileage was 37,000. The VIN was not available.", "fail date": "  06/01/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I purchased my third Honda, a 2013 Honda Pilot in 2017 from my local Honda dealership. In 2019, I received a recall notice from american Honda stating that we could have the cost of repainting our recalled vehicles covered if we had damage. At that time, I did not have any issues with the paint on my Pilot. Well, a couple weeks ago, a huge amount of paint on my roof was missing all of a sudden. I contacted american Honda as it stated on the recall notice and was told the recall period and my warranty had expired. Nevertheless, I was told a claim was opened on my behalf and that I needed to take the car to my local Honda dealership for a diagnosis. I was then sent to an authorized body shop for an estimate. After having to contact american Honda and the local dealership multiple times, I was told by the body shop that Honda would only cover 60% of the $1700 cost (which was only for the roof to be repainted) and that eventually the rest of the vehicle will also start to peel. I feel cheated and this is truly a lack of customer service on the part of american Honda and proctor Honda. How do you sell vehicles knowing that there is an issue with the paint coming off and then not be willing to fix the issue??.", "fail date": "  12/01/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "My check engine light came on and my mechanic informed me that the code was covered under a warranty extension by Honda. I took my vehicle to the dealer, they agreed and replace 4 of the 6 misfiring pistons. They recommended I replace the other 2 pistons at my cost. I did not. The dealer said there was nothing wrong with them and that's why they weren't replacing them. I later found out that they also replaced scored bearings. Upon picking up my vehicle, I took it to my mechanic to fix a bushing that the dealer recommended be replaced. My vehicle was also making a tinging noise I want looked at. It was not making this noise prior to being repaired at dealer. My mechanic fixed the bushing and suggested I take it back to the dealer as the issue was a direct result of the burning oil which was a result of the bad pistons. It was then that the dealer told me about the scored bearings. They said they went to their rep because there was damage. I needed a new engine. (apparently this was known when I picked up my car the first time). The rep for the dealership informed them that because my oil changes were done at a private mechanic and not at the dealership, no good will would be given and I would be responsible for replacing the engine at my own cost, as well as the wrecked catalytic converter, also a result of the burned oil from the bad pistons. The dealer suggested I contact american Honda. I did so and after several phone calls the dealer was informed by american Honda that the decision was up to the rep. The dealer reached out to the rep again and again rep refused to fix the problem. I now have a vehicle which I still have 2. 5 years of payments (I've owned it for 2. 5 years) that cannot not be driven. Honda should fix this as the problem is a result of the the damage cause by their faulty pistons! **note: date below is approximate**.", "fail date": "  11/09/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I drove to work first thing in the morning (10 miles) and parked. I noticed 10 minutes later that my car was on fire? from my location, I could see the fire coming out of the passenger side closer to my front tire. The fire melted my whole dash and engine. Front tires seem to be partly intact from fire. The car drove fine with no troubles before this happened???.", "fail date": "  10/21/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Paint popping off top above windshield.", "fail date": "  09/23/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Isn't my vehicle. I'm trying to buy this vehicle but I found that info in the carfax. Five star automotive southbridge, MA 508-765-0257 4. 9 / 5. 0 14 verified reviews vehicle serviced oil and filter changed a/c refrigerant recharged 2/2/19 206,087 mi. Massachusetts inspection station sturbridge, MA passed safety inspection passed emissions inspection 3/13/19 207,860 mi. Five star automotive southbridge, MA 508-765-0257 4. 9 / 5. 0 14 verified reviews vehicle serviced oil and filter changed 3/19/19 207,996 mi. Lundgren Honda auburn, MA 508-832-6200 4. 6 / 5. 0 211 verified reviews vehicle serviced 3/28/19 107,178 mi. Connecticut inspection station waterbury, CT passed emissions inspection potential odometer rollback there are signs of potential odometer rollback here, so verify the mileage with the seller. I know I would.", "fail date": "  05/24/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The paint on top of Pilot just above the windshield and before the sunroof is peeling. I've seen lots of owners having the same problem. I noticed this when I washed the Pilot and saw the paint has bubbles and had chipped already. I have been driving it and noticed there is now a big part of the paint the peeled away.", "fail date": "  05/22/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Paint between the sunroof and front wind shield peeling off.", "fail date": "  05/01/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The car is making these horrible noises. The dealership claims everything was find when they sold it to us. We took it back a few days later for them to fix it and they claimed to fix it but never did. We have taken it to multiple mechanics and they can not figure out what it is after have it at least 3 or 4 days. It's like a vibration/grinding noise. The alignment is fine but it still pulls and the steering wheel is off. It always makes a grinding noise and the vibration and grinding starts when you are driving and it hits a constant speed even when you dont use the cruise control.", "fail date": "  03/04/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Paint is peeling off between windshield and sun roof, on the hood and front fenders. Vehicle is 5 years old and it clearly delaminating, which is a factory defect from the manufacturer.", "fail date": "  02/08/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Vehicle is parked in a carport in the evenings and in a carport at work during the weekdays. The paint on the roof between the sunroof completely peeled off in sheets, leaving the meta underneath exposed.", "fail date": "  12/24/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Paint on roof of car is peeling in sheets to the bare metal. The damage is on the roof between the front windshield and sunroof. It appears to be a bad paint mixture at the plant and Honda is not accepting responsibility for this manufacturing default. This car is 5 years old and should not be having issues with paint peeling all the way to the bare sheet metal. I'm concerned as the metal is now exposed and the elements will cause damage (rust/corrosion) to the metal and compromise the structural integrity of the roof and the metal that holds the windshield.", "fail date": "  12/07/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Rear door is not opening , switch does not respond to pressing , you hear the unlocking sound and light turns on but door wont open , this is not an electrical door that opens by itself , this is a main issue since I cannot open the door to put my kids strollers , etc . By doing so much pressure in the door , I took off the handle and broke one of the pins . Is anybody experiencing the same issue ?.", "fail date": "  10/22/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "While driving on i65 north of birmingham, al at 65-70 mph with no other vehicles close by, we heard a loud pop and then noticed what sounded like air coming into the cabin. We pulled back the sunroof shade slightly and noticed shattered glass. We pulled over to find about a 4 inch hold in the sunroof with shattered glass all around it. We broke off as much as we could so other vehicles would not be damaged by the debris.", "fail date": "  05/05/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I have majot paint removal on the roof of my Honda Pilot. It just comes off in sheets when we are driving. We took it to our local Honda dealer and they said we didn't wax the car enough and that was why it was happening. A car that is 5 years old should not have paint coming off in sheets. It is so bad that I now have to worry about the roof getting rust because the paint comes off down to the metal.", "fail date": "  04/01/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "When driving on the highway between the speed of 60-80 mph, the steering wheel shakes very noticeably making it very uncomfortable to drive with the vibration. I have had tires replaced and the wheels rebalanced and nothing seems to fix the problem. I have been dealing with this for months and no service station is able to fix the problem. Fearing that something may happen when driving on the highway or when my children drive the car. Safety is my number one concern when getting into a vehicle and it is very upsetting that I bought a brand new car to avoid the unknown problems of a used vehicle. Upon doing some research on the internet to find a solution to my problem, I have discovered that every Honda Pilot owner is complaining about the same issue and that Honda does not want to fix the problem.", "fail date": "  01/09/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "\"takata recall\" inflators / airbags: as per notice in mail from tk holdings, inc. , et al. , we contacted the Honda dealership in arlington TX 'vandergriff Honda & made appointment to meet with service advisor/rep. However when he listed our VIN he stated (brian stevens) that only 2 recalls were issued on our 2013 Honda Pilot but not pertaining to our vehicle's airbags. . So would u please investigate the subject as we are seniors in our age 70+ years & very nervous in driving our Honda in case of accident. Your website listed under 'safercars. Gov' states 'rivets defects' in our model 2013 Pilot but the dealership insisted there is no recall on the takata airbags/inflators for our model year 2013 Honda Pilot fwd. Your further proper review in finding out who is telling the truth or answer w/be appreciated. Thanks in advance for your reply, & our best regards. Rjbrodaudit@att. Net.", "fail date": "  10/24/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Electrical issue while stationary and extreme vibrations while driving.", "fail date": "  07/24/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The rear passenger doors have a safety issue. Everytime we open a door to get in or out of the vehicle, the door immediately closes. I believe it is a door check issue. This is concerning because when trying to get small kids in and out , the doors do not stay open, even if we are on completely flat ground. Also when trying to get out of the 3rd seat row, the door closes on ones face, causing another safety issue, especially with children. I have a nephew who had his finger badly smashed in the door due to this same issue on another Honda Pilot. I feel like this is a recurring issue that seriously needs to be addressed and fixed or recalled to be fixed. This has been an ongoing issue for past 3 years.", "fail date": "  04/05/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Paint starting coming off first small circle then more and more it goes from side to side between my sunroof and windshield.", "fail date": "  01/01/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Ever since I bought my Honda Pilot touring many many times there has been a hesitation when excelerating but after the hesitation it excelerates. Until the time I was going up a hill on the freeway I excelerated and nothing happened - absolutely no exceleration at all. I had literally a second to decide what to do. I decided to use my momentum to move into the slow lane - in front of an 18 wheeler - and kept moving to the shoulder and stopped. I tried to start my car again and it started but stilll no exceleration. I shut it off and tried again and it wouldn't start. We were 40 miles too far for the Honda towing but just a few miles short with aaa. We had aaa tow it to our home dealer. The dealer couldn't replicate the problem. They said they thought there was debris in the mass airflow sensor causing fuel trim failure. Labor for this was $120. 00. My car hasn't completely stopped again but it still does its hesitation thing. I see from reading this article that isn't just my problem. I think this should tell Honda they have a problem they need to address.", "fail date": "  12/28/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Takata recall the 2013 Honda Pilot leaks water into the passenger cabin if the car is in the rain. So much water that the carpet and padding underneath are soaked and water standing on the floorboard of the vehicle. The padding and carpet even after cleaning has begun to have problems and mold because it has happened so many times. American Honda admits/says it is a design flaw of the car, but that it is our problem to take care of and not to park the car outside ever,.", "fail date": "  09/16/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The NHTSA headrest standards are shit. Seriously, did any of you even fucking drive a car with a headrest in the position you mandate? you are incompetent at your job. Fail! quit your tax payer funded job and go work for a paycheck. Go ruin your own life instead of ruining everyone else's for a change!!.", "fail date": "  05/02/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The car hesitates and does not accelerate, especially when making a turn or slowing down and then accelerating in traffic. It does accelerate after it pauses, it is very scary to have it stop and not move. This VIN was not part of the recall announced today, but the problem is exactly what is happening with my car. Will there be more recalls for this problem? we have brought it to the Honda dealer when it was new, and again before the warranty ran out. They deny that there is a problem. It is no longer under warranty.", "fail date": "  01/11/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Stalls and hesitates when turning left especially on roundabouts.", "fail date": "  10/01/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "At about 12:05 pm, on December 7th (while driving approximately 45mph) on a flat surface street with my wife in the front seat and two children in the back seat, we heard a grinding noise coming from beneath the front passenger side of the car. Seconds later, my wife grabs her foot and screams in excruciating pain. I pull over and saw a . 25 inch¿� thick by 5 inch long abrasion that ran across the arc of her right foot that tore the top layers of her skin. After we stopped by a local target to buy gauze and bandages and dropped off our children at a local friend's house I checked my wife into urgent care at st. Jude's hospital, located within ten miles of the incident, to have the wound examined. A physician diagnosed the abrasion as a second degree electrical burn and gave her a tetanus shot and pain medications. I reported the issue to oc Honda world, the dealership where I purchased the car from while waiting in lobby. I took the car in on December on 9th and 17th and the service department at oc Honda world found nothing faulty. . Read more...\n", "fail date": "  12/07/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Turned on the car and backed out of my driveway, which is sloped so it does not require any acceleration. Shifted into gear on the street and began to roll forward. Applied pressure to the accelerator and noticed that the car was not responding at all - engine was not revving, car was not moving forward despite flooring the gas pedal. Stopped and shifted into reverse and had the same problem. Simultaneously, several warning lights appeared including vehicle stability control among others. Eventually had to leave the car disabled on the side of the road and have it towed to a local Honda dealer, where they were unable to replicate the problem. After 3 days, they \"reset all the computers\" and told me the car was fixed. Same problem occurred 2. 5 wks later. Again, dealer could not replicate the problem. However, they replaced the \"box\" which the accelerator connects to and told me the problem should be fixed. 3 days after returning the car to me, the same incident occurred a 3rd time. This time the vehicle fluids were also overheating. I left the car running until a Honda technician could come and take a look and see the problem in action. Unfortunately, he shut the car off upon arrival and then was not able to recreate the problem. Honda has now had my vehicle for 8 days with no progress. Their only suggestion is to uninstall the remote starter which came with the car when I purchased it new. They have no evidence that the remote starter is causing the problem and have not offered to compensate me in any way for its removal. Car is only 1. 5 yrs old.", "fail date": "  10/26/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Ten minutes after locking the Pilot with the drivers door power lock, we heard two booms and found the car with fire coming out from under the hood and had engulfed the dashboard. The car was engulfed in flames by the time the fire company could use foam on the car. We had not driven the car for 7 hours prior.", "fail date": "  08/15/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Ongoing disturbing shudder or vibration apparently related to the vcm/eco feature. The relationship seems to correlate with the visual eco display on the dashboard. The issue can be categorized by progressing through three stages or modes as speed and driving conditions vary. The first mode can be characterized as a howling (significant audible tone change) from the engine right before the vibration begins, which is the second mode. The second mode is the vibration/shudder most predominately around 44 mph, but can occur at other speeds - depending on the \"load\" on the engine. The shudder/vibration can vary from a high frequency vibration (like going over small narrow rumble strips) to a more pronounced shudder, both of which is can be felt by passengers and/or driver. In general, the Pilot will vibrate/shudder consistently, apparently when the vcm feature is in transition. However, on two occasions, a third mode occurred: very suddenly while driving about 45 mph or so, by surprise, the Pilot shook (front end area) to such a intense degree that it impulsively caused the driver of the Pilot to pull-over and stop. Not knowing what really is going on is causing some trepidation about whether to even drive the car. Took Pilot into the dealer and explained these modes. Dealer was aware of the vcm related vibrations and says that is the way it works and nothing they can do. But, to me this is a real safety issue. A brand new (rather costly) car should not behave this way. Moreover, it seems such regular ongoing vibration/shuddering can quickly negatively impact the integrity or longevity of the engine/drive train, etc. , as most mechanical things generally do not like vibrations which quite often is a significant source of wear and tear. As the owner one must ask things like: will the engine even \"survive\" this in the long run? will this cause more frequent repairs?.", "fail date": "  10/01/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Every time I drive the car I hear some rattle- squeaky kind of noises coming from the passenger front seat , I have taken the car 4 times already and the technician hasn't been able to fix the problem .", "fail date": "  08/17/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I was driving on hwy got a flat tire. Pulled over to get help for fixing tire. Within few minutes rear window glass shattered with very loud noise - like a blast. Vehicle was pulled over in the center median - to my right 5 lane highway and to my left 2 lanes for high occupancy vehicles. There were no objects around the car (I checked for objects that could have flew over and could have hit rear window – there were none). Window shattered completely into tiny pieces - doesnt look like it has been hit by an object. I suspect this is a defective window by the manufacturer. Honda Pilot was less than 2 weeks old and ran 1100 miles. Dealer refused to accept this could be a malfunction. I did a complete visual inspection around car and there were no objects. Request investigaion.", "fail date": "  04/05/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The problem is a noticble rumble appearing to come from the rearend but affecting every part of the vehicle. It can be felt on the steering wheel, seats, dash, etc. At first we thought it occured at only 62 and 40 mph but the more we drive the vehicle it can be felt at any speed. We had leased a touring Pilot but brought it back after 1400 miles and traded it for a ex-l Pilot hoping the rumble would be less. At first it didn't occur as much, but the more miles it has the worse it gets. The dealership was not very forthcoming with any information on this problem and has no solution or any hope for a solution. The comment was that someone had complained about a vibration but on their test drive they didn't notice it. Any passengers we have immediately notice the rumble and ask what the problem is. On a new car this is embarassing to say the least. If there were any way possible to get out of this lease without getting upsidedown on leasing another vehicle I would do it in a minute. This our fourth Pilot and we have had few problems with them. They are very stable on ice and get through the snow very well. Up until 2013 the Pilot seemed to have a very good ride on the highway and we have taken many long trips with our Pilots. Now any trip we take we our preoccupied with this rumble and are constantly asking each other \"can you feel that\". I am very disappointed with this vehicle and if a fix can't be found for this it will be the last Pilot we lease. I don't know of any safety related incidents to this problem but I can't believe that throughout the life of a vehicle there can be a rumble like this and not cause a problem in the rearend, possibly even locking up.", "fail date": "  04/01/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Vehicle hesitates/ and shakes at 45 and 60 mph, very scary. Took car to dealership in bluffton SC March 2014 and may 2014. Dealership could not reproduce problem.", "fail date": "  10/26/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "My Honda Pilot has been experiening an engine cut off after making a left hand turn -- when I step on the gas nothing happens for at least 4 seconds then I recieve a rapid acceleration == I am affraind that someone is going to run into the back of my Pilot when I am not able to accelerate after making a left hand turn --- plus, when I enter my garage after making a left hand turn the care doesn't respond for 3 to 4 seconds == then I experience a very rapid acceleratioin -- I am affraid that one day I will hit my garage door.", "fail date": "  04/30/1949"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "I purchased my third Honda, a 2013 Honda Pilot in 2017 from my local Honda dealership. In 2019, I received a recall notice from american Honda stating that we could have the cost of repainting our recalled vehicles covered if we had damage. At that time, I did not have any issues with the paint on my Pilot. Well, a couple weeks ago, a huge amount of paint on my roof was missing all of a sudden. I contacted american Honda as it stated on the recall notice and was told the recall period and my warranty had expired. Nevertheless, I was told a claim was opened on my behalf and that I needed to take the car to my local Honda dealership for a diagnosis. I was then sent to an authorized body shop for an estimate. After having to contact american Honda and the local dealership multiple times, I was told by the body shop that Honda would only cover 60% of the $1700 cost (which was only for the roof to be repainted) and that eventually the rest of the vehicle will also start to peel. I feel cheated and this is truly a lack of customer service on the part of american Honda and proctor Honda. How do you sell vehicles knowing that there is an issue with the paint coming off and then not be willing to fix the issue??.", "fail date": "  12/01/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "Paint chipping, coming right off on the hood while driving in the rain.", "fail date": "  12/14/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "Complaints involving paint peel from Honda Pilot recall. Vehicle paint is peeling at roof line common to where windshield install and sunroof install. Quality of paint is not issue. Manufacturing process is the issue. Most likely a result of poor workmanship due to preparation of metal prior to application of paint either manually or electrostatic application. Will request full repaint of vehicle from dealership at manufacture expense. Vehicle is garaged in 70-75 degree environment and is driven typical miles for age of vehicle. No known external issue such as chemical spill hail or other damage has occurred on area of concern or any other area. Original owner of vehicle. Bought new from excellent dealership. Dealership has done 100% of all maintenance and repairs including tire replacement, tune ups, etc.", "fail date": "  06/22/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "2013 Honda Pilot with only 31k miles and paint is peeling off. Honda issues a TSB bulletin and are covering roofs and tailgates that are peeling. So they have admitted there is a paint defect but the problem is its the same paint/primer used all over the car. Mine is peeling at to of back door and around front and back window. I know it's only going to get worse. Body shop said they've seen a good deal of white Hondas with this same issue and said there is obvious defect in primer causing paint adherence issues. They are 1500 people on a facebook page that have the same issue also. How can Honda continue to get away with treating customers this way. This is my 4th Honda but its looking like my last unless Honda steps up and does the right thing!!!.", "fail date": "  06/01/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "Paint peeled off on roof between windshield and moon roof while driving. Approximately 10� by 12� is the size of the peel. The area of the peel has never come in contact with any foreign objects nor were their any scratches or dent or dings.", "fail date": "  04/27/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "Paint peeling in multiple areas on vehicle. Started on inside passenger side fender along hood line and roof between top of windshield and sunroof. Paint peeling is showing up in new places and progressively peeling daily.", "fail date": "  04/13/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "Large section of white diamond pearl paint peeled away from the roof of vehicle between the windshield and the sunroof. Further searching on the internet indicates this is a widespread defect from the factory and Honda refuses to acknowledge their is an issue. This has been reported across the Honda line with white vehicles from their alabama plant. I have personally seen 2 other white Pilots with same peeling in my area alone along with many photos from other owners across the country.", "fail date": "  02/05/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "Paint is peeling down to the metal between the windshield and the sunroof. The car was parked when it was noticed. The car is garaged.", "fail date": "  01/28/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "The paint is peeling off of my Pilot. It is only 6 years old. Worried about potential rust and compromise of the integrity of the car. Honda will not take responsibility though it is a well-documented problem.", "fail date": "  01/20/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "My paint is peeling. This is happening to my mothers Honda Pilot also.", "fail date": "  01/08/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "My 2013 Honda Pilot has paint peeling off. The paint is missing off from the roof between the windshield and the sunroof. It started out small didn't think anything of it until more started falling off. I started searching online and noticed others having the same problem. I emailed Honda and they are not acknowledging the problem and said I'm out of my warrenty. There is definitely a defect in the paint that was used.", "fail date": "  01/07/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "Exterior paint: taffeta white vehicle paint fading after 4-5 years from roof top, sides, back trunk area, and hood.", "fail date": "  09/01/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "On 2018, the paint on the roof began to peel in chunks between the windshield and moonroof. Additionally, the whole body paint began to fade regardless of how often it was washed and waxed. The issue was brought up to a local dealer and they were only willing to paint the roof and side because it was the only thing that had been identified as a vehicle recall matter. The roof has been fixed but now the car looks awkward as one portion is very shiny while the rest looks horribly faded. The rest of the paint has only become worse as the time progressed. Why isn't anyone at Honda corporate not fixing this? it is a known quality defect and no fix is being done. I asked a body shop for a quote to see how much it would be to paint the rest of the vehicle. $8000. 00 to fix the issue!!!.", "fail date": "  06/18/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "Paint chipping from roof of car. You can see the gray primer. Honda refuses to acknowledge problem. Said my car has too many miles. It has 60,000. It is well taken care of.", "fail date": "  05/22/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "I have a 2013 Honda Pilot with about 85,000 miles. A few months ago we noticed paint peeling off of the hood. We contacted rusty wallis Honda about this and they covered the repairs only at 50%, which left me paying about $450 for the repair which was a total manufacturer's defect. I told them I was unhappy with this but they said the decision was final. Apparently there is some sort of regional manager that makes these decisions, called the \"dpms\". The body shop manager agreed that it was a defect and told me that they had had problems like this in the past. A few weeks after we got the hood repaired we noticed the same problem happening on the roof of the car. We contacted rusty wallis again and they stated that they would only cover this repair at 50% which leaves me paying about $650. I again told them I was unhappy with this. I called american Honda customer service and they told me that I could schedule a meeting with the dpms. So I called managers and supervisors at rusty wallis. I have even sent rusty wallis a personal email, only to get no calls or emails returned at all from anyone. Someone from american Honda customer service finally called me and said that the dpms would not meet with me and that the decision was final. I can't help but feel completely helpless in all this. It is ridiculous that a 5 year old car's paint would be uncontrollably peeling off. This could just keep happening over and over again until the entire car gets repainted. I know that Honda has had class action lawsuits about their paint in the past but apparently is hasn't happened for this model yet.", "fail date": "  05/15/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "I have majot paint removal on the roof of my Honda Pilot. It just comes off in sheets when we are driving. We took it to our local Honda dealer and they said we didn't wax the car enough and that was why it was happening. A car that is 5 years old should not have paint coming off in sheets. It is so bad that I now have to worry about the roof getting rust because the paint comes off down to the metal.", "fail date": "  04/01/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "Paint between windshield and sunroof started to peel, and has continued to deteriorate quickly. Will have to have it repainted. Recently, paint has now started to peel from the hood.", "fail date": "  03/05/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "Paint on the roof peeled off from one day to another.", "fail date": "  02/19/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "~tl the contact owns a 2013 Honda Pilot. The contact noticed that large patches of paint were peeling off the vehicle. The contact stated that the paint was cracking right above the window on the roof of the vehicle. The vehicle was taken to a dealer, but was not repaired. The manufacturer was notified of the failure and informed the contact that there was no recall on her vehicle. The approximate failure mileage was 92,000.", "fail date": "  02/15/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "A large patch of paint peeled off the roof of my car overnight while it was parked in my driveway, between the windshield and moonroof, and has increased in size over the last week, continuing to peel as I drive.", "fail date": "  01/19/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "Paint is peeling and chipping on the roof. Vehicle is garaged daily out of the sun and whether.", "fail date": "  07/15/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "The paint on my white 2013 Honda Pilot began to fail in 2017. The paint has failed and was literally peeling off in sheets between the windshield and moonroof. It's very clear this is a manufacturing issue since there are thousands of white Honda vehicles experiencing paint failure.", "fail date": "  07/14/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Structure", "Sub Problem": "Paint problems", "description": "Paint is peeling.", "fail date": "  01/01/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Since purchasing new in 2013, experienced ongoing issues with vcm. Noticable vibration/shudder at all speeds except during heavy acceleration. Taken to dealer mant times. They are able to reproduce but state no fix available. It's how the car was made. In addition to vibration, engine makes a chirping noise when accelerating through vibration. I believe they are related although neither have been able to be fixed. No warning lights illuminate. I purchased this car for the 4wd as I live in snow/ice climate. However, excessive vibration/shudder makes driving in these conditions (any conditions) unsafe due to constant need to fluctuate acceleration/ deceleration to help minimize vibration/shudder to regain sense of control. If you maintain speed while vibrating on snow/ice you feel like you are losing control. This vibration has to have a long-term effect on engine/car integrity. It's strong enough that some day I imagine I'll come to a stop and at that very moment, every screw will have come loose/undone from years of vibrating and I'll be left sitting in the seat holding just the steering wheel with the car in parts all around me.", "fail date": "  11/07/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "The engine is making an idling noise only when the car starts in the morning. Takes time for car to increase speed.", "fail date": "  03/04/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "I was traveling at about 35mph in a city street and slowly approaching an intersection to make a right turn. Out of a sudden, the car accelerated while my foot was on the brake, crashing into another vehicle and running off the road. Both airbags deployed.", "fail date": "  03/25/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "This has happened several times: car is a stopped or slowly rolling and you step on the gas to get into traffic floor to the floor and the car doesn't move. The newest incident today is the car was in motion going approximately 10 mph when it completely died. All power lost, could not steer and had to pump the break several times to stop. Dealership says verbally over phone no open recalls on car and unless they can recreate, they probably can't fix anything. I am going to get killed with my baby in this car.", "fail date": "  11/07/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Sometimes when starting out and making left or right hand turn after being stopped at a stop light or stop sign, the engine will hesitate and bog down for a few seconds before it \"kicks in\" and then there is a \"surge of power\". This is very annoying at the least and also very dangerous as one could easily get rearended or worse yet get caught in the intersection in oncoming traffic.", "fail date": "  02/01/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Vehicle shutters terrible at certain speeds/rpm. Have to adjust acceleration to get it to stop. Huge safety issue. Not normal operation for a new vehicle. It's criminal that Honda claims its normal.", "fail date": "  01/08/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Vcm (vehicle cylinder management) issue: I purchased a 2013 Honda Pilot from zimbrick Honda (madison WI) in November 2013. Since the first day I bought the vehicle I have been very disappointed and have grave concern regarding the safety of my children when in the vehicle. Driving the new vehicle home I noticed a rumbling and shuttering vibration issue at varying speeds but most consistent with rpm between 1,000-2,000 especially noticeable when backing off the accelerator or after the vehicle reaches constant speed and eco light is on. I took the vehicle to zimbrick Honda and they informed me that the vibration is part of the normal operation of the vehicle and it is due to the vcm and that there was nothing they could do about it until Honda comes out with a way to correct the problem. I have only 2,000 miles on the vehicle and am very disappointed and annoyed with the Honda Pilot and have significant concern regarding the safety of the vehicle due to the vcm issue. This should not be part of the normal operation of the Honda Pilot and I believe Honda should correct the problem.", "fail date": "  11/25/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Vehicle vibration/rumbling/shuttering at speeds around 35-55mph. Apparently due to vcm(vehicle cylinder management system) most noticeable when backing off accelerator after vehicle reaches constant speed and eco light is on, but can occur weather eco light is on or not. Vibration is felt through out entire vehicle but as a driver, it is felt through the seat, steering wheel and center console. This vibration is very unpleasant and annoying. Vehicle was taken back to the dealer due to us just purchasing it with only 10 miles on it. The first time they rebalanced the tires. This did not help. Second time I took the service manager out for a test ride to show him what I meant. He felt the same vibration/shutter/rumble. We then went back to the dealership and took out another new Honda Pilot that was on the lot. The road test came back with the same results. Service manager then told me that the vibration I was feeling was due to the vcm as the different cylinders fired and that there was nothing they can do about it and that I would just have to deal with it until Honda comes out with a way to correct the problem, which as far as he knows they have no intention to do so. Apparently Honda says that this is part of normal operation. I paid over $36,000. 00 dollars for this vehicle and feel that is not normal operation, and that Honda needs to correct this.", "fail date": "  10/12/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Upon applying the brake in an avoidance situation, I noticed the spongy feel to the brakes. What concerns me more, is that during the process of the event, the brake pedal settles down to below the height of the accelerator and if your foot isn't square on the brake pedal, you wind up hitting the gas while trying to stop the vehicle. . I need to talk with someone. This is most certainly a defect in design.", "fail date": "  10/01/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Similar to NHTSA # 10819872 (attached pdf). Vehicle gas pedal/accleration becomes unresponsive when taking foot off gas and maneuvering left/right or around a curve. Trying to re-engage will take 3 seconds or not at all. Remedy is to take foot off gas and pump the gas pedal. This causes vehicle to lurch forward. I have learned to brake torque to regain gas pedal control. This has happened since 9/2013 and it is now 3/2016. Also speed varies 10-20 mph and mileage is now 13000. Almost accidents until I got used to it.", "fail date": "  09/24/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Often when I step on the gas petal the car hesitates before accelerating. The delay in acceleration is up to 3-5 seconds. Occasionally it feels like the car is going to stall. While it has been happening in the suburban and rural areas since we bought the car in late August, this week I had to drive into and around the city. When I press the gas petal down, the car simply does not move forward and then, without warning, it jumps forward at a rapid rate. To control the car it is necessary to keep one foot on the gas and the other on the brake in case it surges forward after the hesitation. The problem is worst in stop and go driving. It is frightening , a danger to me and my passengers and to other cars near me. It should be repaired.", "fail date": "  09/03/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Everytime I reached a certain speed then try to maintain it by slightly pressing on the gas, the engine starts to shudder/vibrate. It is really annoying and it concern me a lot. The issue happens in different speed. I brought this complain to the dealership but they said that everything is working normal with the car. So, I just get a long with it. Then after a few more months, the vibration is getting worse and it is getting in my nerves. I brought it back yo them but the same they only gave me the same reason. My sister and some friends have Honda cars with eco mode also. How come that they don't experience the same thing with their vehicles. I agree with some complainants that this is a safety issue. It bothers the driver when you experience that vibration from the engine. Is Honda just waiting for someone to die from a car crash with the Pilot before they make a move to correct the issue. I just hope that they bring this issue to the higher op of Honda before someone's life will be taken.", "fail date": "  06/06/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Shortly after acquiring my new Pilot in February of this year I had and incident whereby at a low speed I lost all control of speed and the car began to slow down. Pressing the accelerator did nothing and the car behind me nearly hit me. It troubled me, but thought is was just something odd. . Until it happened again, and again. I have devised a response (remove pressure from the accelerator entirely and reapply pressure). This is a dangerous situation for anyone who does not know how to react even though one should not have to do this. I realize I am not alone, nor is this an isolated instance to my car. . Read more...\n", "fail date": "  02/28/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2013 Honda Pilot. The contact stated while driving 40 mph the contact was struck by a deer that was struck by a track trailer on the driver side. No air bag deployed but the front passenger side air bag, all the seat belt locked, and the vehicle became really heat. No one was injured. A police report was filed. The manufacturer was not contacted. The failure mileage was 98,000.", "fail date": "  11/10/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Passenger airbag fails to turn itself off when under 15 lbs is positioned on the seat.", "fail date": "  06/27/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Check fuel cap message comes on sometimes even after I tighten the fuel cap. Sometimes the message stops on its own. Don't know why. Check engine light comes on sometimes and goes off on its own. Don't know why. I noticed these alerts when the car is moving or sitting at an idle. City driving with very little highway driving. I checked Honda website today for a list of recalls on my VIN, but the website said that there were not open recalls on my vehicle. I wonder about the airbags in the vehicle.", "fail date": "  09/02/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "I thought finally I could start enjoying the luxury in a car but Honda company painted my face shame by making me feel disappointed with their product. My car steering is so hard for me a woman, the air conditioning will not blow to the right direction even when I set the mode, the belt is not properly positioned, the roof paint is peeling off in lee's than a year I bought it, this is 2013 vehicle , this really broke my heart as a single mother, I have a lot on my plate already, now add all these. Somebody please help me, I'm loosing it , please help me&#128557;&#128557;&#128557;&#128557;.", "fail date": "  05/11/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall went to Honda city of bethpage because I received an email regarding an airbag recall. Waited hours just to let me know airbag was deployed and will not fix it. I didn't know when I bought the car the airbag was deployed. Didn't even bothering asking me I wanted it to be fix or not. So I'm assuming Honda does not fix airbags.", "fail date": "  03/19/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The srs modual is defective so I have non working air bags and the left seat belt is defective. Honda says the will fix the seat belt bot not the srs modual.", "fail date": "  02/05/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Received a recall letter in the mail. Do I just take it to the nearest Honda dealership to have repaired? will there be any out-of-pocket costs, and is this something that we'll be reimbursed for in the form of a rental car until it's fixed? we also lease a 2015 Nissan leaf. VIN: 1n4az0cp2fc333476. We received a letter in the mail for this car as well.", "fail date": "  11/27/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Vtl- the contact owns a 2013 Honda Pilot. The contact stated while being operated approximately 45 mph the vehicle experienced a complete loss of power. The failure occurred without warning. The vehicle was towed to nardy Honda located 559 middle country rd, st james, NY where the failure had yet to be diagnosed. The manufacturer was notified of the failure. The failure mileage approximately 80,000. Kh.", "fail date": "  11/16/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Tl- takata recall. The contact owns a 2013 Honda Pilot. The contact received notification of NHTSA campaign number: 18v661000 (airbags) however, the part for the recall repair was not available. The contact stated the manufacturer exceeded a reasonable amount of time for the recall re[pair. The contact contacted the dealership (kuni Honda on arapahoe located at 10750 e arapahoe rd, centennial, CO 80112 phone number: 720-636-7000) who stated that the part was not available and the vehicle did not need the recall repair performed. The manufacturer was not informed. Gl.", "fail date": "  09/20/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. Traded in to briarwood Ford ann arbor mi. Unknown damage.", "fail date": "  04/01/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Honda customer service in torrance, CA gave us case # but unhelpful. 2013 Pilot's part of front suspension rear lower arm bushing warranty extension: 7yrs100k miles. This summer local dealer service depts didn't always answer their phones & couldn't always book due to covid/issues. In June the Hondacare website + other media including Honda's twitter were down for days. As loyal Honda owners we were patient as we've also been affected by the pandemic. We were finally able to have the suspension checked due to rough handling/poor performance/noise. Dealer noted that the bushings were indeed cracked as Honda knows but said that while our Pilot's under 100k mileage of warranty extension, he used excuse of our purchase date just a few weeks past 7yrs despite being well under 100k. Honda would only offer fraction of repair cost w dealers demanding $500-600+ to fix safety defect fitting nhsta criteria; should be recalled. Undue punishment for not pushing to have vehicle seen sooner or knowing exact purchase date. Honda aware of issue but doesn't publicize or update owners further compromising safety. Dealer minimized our concerns on uploaded receipt. Honda said 'request to meet dealer's district manager' but dealer claims 'can't. 'still awaiting their reply. Honda unhelpful so left voicemail for Honda ohio corporate affairs and communications official who self-identifies on social media:\"trained as company spokesperson\" but she hasn't replied tho we faxed + mailed letter. Yet Honda's all over social media offering various covid/financial/goodwill assistance. But pandemic-related delays had vehicle enter dealerships days after its 7-year purchase anniversary, we're counting on Honda to embody its widely advertised aesthetic of ethics and do the right thing by providing the repair as outlined in the original warranty extension letter Honda sent to owners five years ago without followup.", "fail date": "  06/27/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "When the brakes are applied the front end starts to vibrate as the car is moving on streets, roads, highways and interstate highways. Not during a turn, yet. Just moving forward. There has been no accident as of yet but, I am fearful that the vibration will not allow the car to stop in time to save my life as well as who ever I hit. This is a dangerous situation. The Pilot was taken to the local Honda dealership this morning. They called with a bill for 1,052. 00 for compliance bushings. This car is six years old with 61,026 miles, way too young to be costing me that much money for a �front / rear stabilizer�, that should be a problem at maybe 200,000 miles. Will I ever buy another Honda? let's see!!!!! hmmmm. I'm thinking about it.", "fail date": "  04/30/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Was told by Honda dealer compliance bushings leaking. They would be happy to replace for a fee. However, I found an sb. Sb 15-045. I think it applies.", "fail date": "  12/15/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Front suspension rear lower arm compliance bushing failure, leak. Both left and right sides started at the same time. Noticed at roughly 45k miles. Commonly known issue with Honda Pilot. TSB bulletin is out but cannot locate.", "fail date": "  01/19/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "When vehicle hits \"wash board\" areas such as small indentations in pavement or small potholes it goes airborne(65-70 mph) and when it comes down the back wheels aren't tracking the front wheels causing vehicle to lurch to one side or other. Dealer says that is just the way Pilots are, top heavy, etc. Said bushings, shocks, etc are ok. Vehicle just doesn't feel safe. To me it could lose control in wet weather!.", "fail date": "  07/05/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "The contact owns a 2013 Honda Pilot. The contact stated that there was a constant grinding and rattling noise coming from the rear of the vehicle. The vehicle was taken to the authorized dealer more than five times. The technician inspected and test drove the vehicle but was unable to diagnose the failure. The technician provided several repairs that failed to remedy the failure. The vehicle was taken back to the authorized dealer for further inspection and diagnosis. The VIN was not available. The manufacturer was notified of the failure. The approximate failure mileage was 10,000.", "fail date": "  11/15/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "This vehicle has had a rattling/scraping sound when going over rough pavement going from the right side of the dash through the right door and down the right side to the back. It occurs in all temperatures and despite the dealer regluing the floor and removing 5 lbs of air from the tires, the noise continues. The dealer thinks that it is an issue of floor panels rubbing against each other and will attempt a repair again this week, but it sounds like alot is loose. Car was bought new and has not been in an accident. The scraping sounds continue. . .", "fail date": "  11/15/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "2013 Honda Pilot brand new as I was driving home noticed a vibration coming from front end. More pronounced at higher speeds. Notified dealer and brought in too check out. Dealer started the diagnostics process by sitting in the passenger seat and we went for a ride. Honda tech acknowledge the vibrations coming from the front of the vehicle. Steering wheel shake, bangs, shuttering and low pitched humming noises. Tech and dealer document my concerns and say \" we are aware of the problem you have to take this up with Honda. \" there is nothing they can do. Contacted Honda after a week of calling daily. Which Honda's response is \"yes we starting to get a lot of similar complaints but not enough for too react. This is normal vehicle operation. \". That is unacceptable, I cannot wait for something tragic to happen before Honda reacts.", "fail date": "  02/20/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "2013 Honda Pilot. Consumers write in regards to vehicle shudders, pulsates and vibrates intermittently during normal driving conditions. The consumer stated the shudder, pulsating and vibration occurred intermittently during any and all driving conditions. The consumer was informed by Honda representatives ad technicians that vibration was caused by the variable cylinder control system and it usually started after 1000 miles. The consumer was informed Honda was working on a fix, but may or may not have a solution in the future. Also, there was a very distinct and constant pull to the left in the steering system. The fuel system alert light illuminated after the tank was filled with gas. The consumer was instructed by the dealer, to remove and replace the gas gap. The alert light went out. The consumer stated the vehicle shifted harshly and it felt as though he transmission was failing. The consumer stated the problem became worse as time went on.", "fail date": "  12/07/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "As soon as the vehicle was driven out of the lot, 17 miles on the odometer, after the vehicle was purchased, a vibration was felt coming through the seats at 75 mph. And multiple resonance frequencies can be felt through the chassis into the interior of the vehicle. This vibration is constant between 65 mph to 78 mph (highway speeds) and it get worst during longer periods of driving. These frequencies of vibrations are transmitted to your lower back causing stress and back pain. In addition the interior parts of the car (dash, panels, radio, center console, dvd, etc. ) are becoming loose and it can be felt during driving causing a distraction to the passengers. Multiple repairs attempts are being performed by Honda dealers and they decided to tell the costumers that this is part of the car design since they re-designed the chassis and suspension to be stiffer for the 2013 models. Multiple complaints are being reported by different customers around the us but not repair has been performed and will not be performed. We do no¿¿t want to wait until a tire/wheel becomes loose and kill a family or multiple families on the highways because of an unsafe condition on these vehicles. Also, power steering problems and brake issues (after longer periods of driving, 2+hrs) have been reported without being corrected after multiple attempts.", "fail date": "  10/31/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "I have had shaking in steering wheel at 60-70 mph and brakes cause the car to shudder. The brakes grabbed when lightly touched them at 70 mph to avoid a truck that pulled into my lane. Afraid that vehicle will lose control due to sudden brake and shudder in steering.", "fail date": "  12/05/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "My Honda Pilot ex-l model has 36500 miles. It all started after 20000 miles, breaks started feeling spongy and takes longer distance to stop the vehicle. When I took it to dealership, they told me the breaks are working as designed. Now my steering is shaking vigorously when I apply break after 40 mph speed. Anything lower that speed steering is less shaky but I can feel the steering is shaking even in that speed. Now breaking distance is lot longer and during red lights I am crossing the line during intense traffic stops.", "fail date": "  07/20/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "Key will either not go into ignition key lock, or it will go in but you can't turn it to start car.", "fail date": "  10/17/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "My ignition key will not turn at times. I have to insert and remove the key multiple times until it turns. It happens randomly but seems to be getting worse as time goes by. I am afraid that one day I will get stranded. I noticed that several people have reported that Honda is aware of the issue.", "fail date": "  02/16/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "My Honda Pilot stalled without any warning and without any engine lights appearing while driving on two way side roads and entering a highway. Emergency brake release handle was not working or releasing the brake appropriately same day. Honda can't replicate the issue so they say the car is to go with me. No explanation for incident. Manufacturer had them put something in the computer to read 15 second prior to and after a stall. This is an unsafe vehicle to drive for me, my family and anyone around me if it is undiagnosed and unexpected. Power steering and brakes lost so risks are high. I run the risk of causing an accident, injury, and/or death to anyone in the car or others. I filed a complaint with Honda, [xxx] case # [xxx] without resolution and wastold to pick the car up from the dealership or I be charged a fee. The car was at bernardi Honda in natick and they did all they could to replicate and work with Honda, I was told by them to pick the car up or be charged a fee. They are aware that the manufacturer is involved. I went to pick the car up on Saturday November 2, and discovered the emergency brake release cord is still broken and there were scratches on my car. I left it there so they could order parts and fix scratches. Please assist if able. I read about two recalls by Honda for the Pilot and odyssey regarding unexpected braking and how you assisted! thanks. Information redacted pursuant to the freedom of information act (foia), 5 u. S. C. 552(b)(6).", "fail date": "  10/25/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "Vehicle pulls to the left. The dealer performed an alignment after my test drive and it improved slightly though technician indicated he found nothing. Had vehicle aligned by dealer again at 5000 miles as it was pulling left again. Technician found alignment needed correction. Vehicle stills pulls to left and gets worse the more we drive it.", "fail date": "  06/26/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "Intermittently when starting to drive after being stopped at light or stop sign the engine will hesitate and bog down for a few seconds before it \"kicks in\" and then there is a \"surge of power\". This is very annoying and also very dangerous as someone could easily get rear-ended or worse yet get caught in the intersection in oncoming traffic. There is also vibration and shutter at certain speeds and seems to be worst when eco mode kicks in and when driving conservatively. There is also a pull in the steering upon acceleration.", "fail date": "  03/08/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "2013 Honda Pilot. Consumers write in regards to vehicle shudders, pulsates and vibrates intermittently during normal driving conditions. The consumer stated the shudder, pulsating and vibration occurred intermittently during any and all driving conditions. The consumer was informed by Honda representatives ad technicians that vibration was caused by the variable cylinder control system and it usually started after 1000 miles. The consumer was informed Honda was working on a fix, but may or may not have a solution in the future. Also, there was a very distinct and constant pull to the left in the steering system. The fuel system alert light illuminated after the tank was filled with gas. The consumer was instructed by the dealer, to remove and replace the gas gap. The alert light went out. The consumer stated the vehicle shifted harshly and it felt as though he transmission was failing. The consumer stated the problem became worse as time went on.", "fail date": "  12/07/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "During my commute home from work my vehicle began shaking as if it was going to stall. The orange check engine light began to flash. I used my scanner and it read the code p0303. I took it to a mechanic the following day and they stated the engine is burning excessive oil and misfiring due to Honda’s variable cylinder management system. The oil is soaking the rear three spark plugs from continuously turning on/off while driving causing the engine cylinders to misfire. They stated it is not safe to drive due to possible shut off, power loss, acceleration loss, and damage to the other car systems. I have regular maintenance done to the vehicle but due to the vcm system it will continue to have the same issues. I paid a lot of money for a “reliable” car but the mechanic is saying I need a new motor.", "fail date": "  10/13/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Check fuel cap message comes on sometimes even after I tighten the fuel cap. Sometimes the message stops on its own. Don't know why. Check engine light comes on sometimes and goes off on its own. Don't know why. I noticed these alerts when the car is moving or sitting at an idle. City driving with very little highway driving. I checked Honda website today for a list of recalls on my VIN, but the website said that there were not open recalls on my vehicle. I wonder about the airbags in the vehicle.", "fail date": "  09/02/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "My car is increasingly smelling like gasoline and exhaust. Our garage smells strongly of gasoline. When I use a/c the cabin smells like exhaust. I just made a 5 minute trip to pick up my daughter and it made me feel dizzy. We have never skipped any maintenance on the vehicle, everything is up to date. The oddly gasoline-y smell in our garage has just suddenly gotten to the point where I realize it is coming from my Honda Pilot - I can follow the scent directly to the car even with the garage door open. The interior of our car is now being affected and the smell is much stronger when a/c runs. Had to turn it off.", "fail date": "  08/26/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "On 7/5/2016, I set out to drive my parents to an appointment. I am their full-time caregiver. My father has dementia & rheumatoid arthritis and my mother has alzheimer's. My 9 yr old golden retriever was also in the car. When I tried starting the car, it didn't want to turn over. But after a few tries, it started. No indicator lights came on, so I figured it was a fluke. I pulled out of the driveway, began driving (neighborhood - 25mph speed lim) and shortly began hearing knocking noises. After less than a quarter of a mile (crossing suburban main road 35mph speed lim), the car would not respond to the gas pedal. I turned off the air conditioner and rolled down the windows, and I promptly turned around and headed back home. It continued to knock and failed to accelerate above 20 mph. Still, no indicator lights came on. I also checked the temperature gauge and oil gauges and they were also giving normal readings. We failed to make it the quarter-mile back home. Shortly after I turned the corner one street away from our house, there was a sudden explosion in the engine right in front of me in the driver's seat and the front of the car was engulfed in flames. Less than a split second before the explosion, the check oil and check engine lights came on. It didn't even give me enough time to get my finger on the key before it set ablaze. My father can't walk well and uses a scooter. Both my parents are diminished mentally and could not unlock their doors which did not unlock automatically. If I hadn't rolled down the windows, & if this had happened on the main road instead of our neighborhood where people came to help, I could not have gotten everyone out in time. Insurance CO told me there was a recall on engine piston we were never notified of - #13v382000. Neither dealership-heritage Honda westminster MD-nor local service provider shockley Honda knew about it either.", "fail date": "  07/05/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "While driving up the driveway and turning the steering wheel to the right, the car accelerated by itself, tried to apply the brakes but the brakes didn't work causing the SUV to crash thru a concrete fence and down a 40 feet cliff.", "fail date": "  07/18/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "I have a 2013 Honda Pilot, less than 1 month since purchase. At speeds from 20 mph to 70 mph my engine and car will, vibrate, shudder. There is also a low frequency noise that seems to vibrate in my ear which is also quite a distraction. It seems to happen most when I am on a flat or slight incline. The only way to get it to stop is to either speed up or let off the gas. This is very distracting while driving at highway speeds, and very frustrating since it is a new vehicle. I have taken it back to the Honda dealership and they said that they feel the problem, but they said that american Honda states that this is normal for this vehicle. I do not understand how this could be normal. A rough feeling, vibrating cabin and shuddering engine is not a normal operating car. It feels like something will break or come loose, which makes me very nervous as my children commute with me every day.", "fail date": "  10/21/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "This report is for a new, 2013 Honda Pilot touring model with less than 100 miles on the odometer and has continued since. After the car is warmed up, and when the eco light illuminates, there is a shudder or a low frequency, rumbling vibration throughout the vehicle. This was first noticed while on the highway with cruise control set, but has since been observed at multiple speeds with or without cruise control. The vibration starts when backing off the accelerator after reaching a constant speed and continues until the engine loads down due to a hill or further acceleration. This also coincides with the eco light turning off. It does not appear to be related to a shift point, because when the accelerator pedal is depressed, the vibration stops and the engine rpms stay constant. The level of vibration is not as intense as that of riding over rumble-strips, but the frequency is similar. The level of vibration appears worse at higher engine rpms.", "fail date": "  04/15/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System problems", "description": "Severe hesitation when trying to accelerate at low speeds. . . No response for 1 to 2 seconds. . . Extremely dangerous when trying to turn or pull into moving traffic. . . Problem is sporadic but frequent(2-3 times per week.", "fail date": "  01/22/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The contact owns 2013 Honda Pilot. The contact stated that when he exited the vehicle he heard a crack noise which came from under the driver seat. The contact stated he looked around the driver seat and noticed that the bottom of the driver seat frame was broken in three locations and he then also inspected the frame of the front passenger seat and noticed it had one crack. The contact stated he called the local dealer and they informed him that there was no recall associated and suggested to contact the manufacturer. The vehicle was not repaired. The manufacture was made aware and also informed of no recall being associated. The manufacturer informed the contact that the seat repairs need would be at his own cost.", "fail date": "  09/12/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The car has engine check light and traction lights are on. Mechanic diagnosed the codes to match a recall which my VIN is excluded even thought I am facing the same exact issue. Piston misfiring and the engine can lock at any time causing an accident. Codes give to me by mechanic that said that Honda should address this issue: dtc - p0301 and p0304. Bulletin -13-082. Dtc 83-11 and dtc - 83-12. Dealership never mentioned this to me I had to go to independent mechanic. Info: https://static. Nhtsa. Gov/odi/tsbs/2013/sb-10053786-6271. Pdf summary: \"the piston rings on certain cylinders may rotate and align which can lead to spark plug fouling. This can set dtcs p0301 through p0304 and cause the mil to come on\" this issue came up two times. First the dealership asked me to service all car parts which I did to get the engine light fixed - cost me $1000. Then the second time the check engine light came on they told me they cleaned the pistons and I should be good. The third time I brought the car back to them all in about three weeks, they said OH. . . You need $3k to do this procedure which Honda recommends and then I lost it. I realized I was being played and I took it to independent mechanic which brought this to my attention. I have been trying to contact american Honda over the phone and they do not answer any calls. The number rings 3 times then plays some music and then ends the call. I also sent them an email which caused mr mario representing american Honda, to call me. I missed his call and I called him back multiple times but he is never in the office. Case reference: # 11373382.", "fail date": "  05/20/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "Front seats cause terrible back, shoulder, neck and hip pain that lasts for days and forces us to visit a chiropractor for treatment, repeatedly. They cause shoulders to hunch and force neck forward in an unnatural and unhealthy position. The pain is a distraction while driving.", "fail date": "  07/17/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "Whenever I drive between 35-45 mph the car shudders and vibrates. There is no vibration thru the steering wheel. I feel it thru the car seat, back, and center storage lid. Passengers have remarked \"what's wrong with your car?\" at 35 mph the car drives very smooth. By 35 mph it's like driving a different car. The vibration is getting more pronounced as miles accrue.", "fail date": "  11/01/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2013 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "Every time I drive the car I hear some rattle- squeaky kind of noises coming from the passenger front seat , I have taken the car 4 times already and the technician hasn't been able to fix the problem .", "fail date": "  08/17/2013"}]