[{"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Power Train", "Sub Problem": "Automatic Transmission Torque Converter problems", "description": "Purchased a 2004 Honda Pilot used at 136k miles. Within a week of driving the check engine light came on. Engine codes p0700, p0705, p0740 were all present, which are all in relation to the automatic transmission. The transmission shop confirmed that this is a common issue across Honda & Acura vehicles in the '03-'04 range (see 2003-2004 Acura mdx service bulletin 06-003). A design flaw in the torque converter causes it to break down & shed metal fragments, which compromises the rest of the transmission. The only real fix is to rebuild or replace the transmission. Honda americas customer service refused to review my case any further, even under goodwill consideration.", "fail date": "  02/07/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Power Train", "Sub Problem": "Automatic Transmission Torque Converter problems", "description": "Torque converters get stuck and causes vehicle to \"shudder\" or vibrate quite badly in the 40-50 mph range.", "fail date": "  08/15/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Power Train", "Sub Problem": "Automatic Transmission Torque Converter problems", "description": "Intense shudder emanating from underneath the car causing the whole car to shake. Typically occurs between 20-30 mph during slight acceleration. Abates somewhat if take foot off of accelerator. From my reading, this appears to be a very common issue involving the torque converter.", "fail date": "  05/01/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Power Train", "Sub Problem": "Automatic Transmission Torque Converter problems", "description": "The contact owns a 2004 Honda Pilot. While driving approximately 35 mph, the vehicle shook and shuttered without warning. The vehicle was taken to an independent mechanic who diagnosed that the torque converter was worn out. The technician advised the contact to continue driving the vehicle, but to be prepared to replace the transmission when a warning indicator illuminated. The manufacturer was made aware of the failure and stated that there was no recall. The failure was not remedied. The failure mileage was approximately 132,500.", "fail date": "  12/20/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Power Train", "Sub Problem": "Automatic Transmission Torque Converter problems", "description": "Intermittent, audible vibration/shudder between 35-50 mph while accelerating. Dealer inspection believes it's the torque converter.", "fail date": "  07/22/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Power Train", "Sub Problem": "Automatic Transmission Torque Converter problems", "description": "Yesterday my Honda Pilot started acting irregular as I was pulling into a controlled intersection turning left. My Pilot would not accelerate as normal and left me stranded in middle of intersection as oncoming traffic approached. Traffic did slow down and I shifted into 2nd gear, and that allowed my to move through safely through the intersection. No accident, just a angry young man shaking his hand and screaming through his windshield. I called Honda and open a case # this morning. Interestingly, I call Honda and opened up a case in 2010, with shuddering and vibration problems at 50-55 mph. I bought new tires (only 34k on bridgestones), changed differential fluid ,vtm-4, egr value, even had drive shaft inspected for vibration, anything that was suggested to me. Nothing fixed issue, spoke with several other Pilot owner (2003-2004) and they suggested it was normal operation and theirs does that too. Only item left in my mind was torque converter. Ask Honda for help. Gave me the 3yrs/36,000 mile speech. Now the \"d\" indication light flashes green. Indicating a transmission problem. Taking to dealer this morning to inspect. Being very careful at stop and go lights.", "fail date": "  05/12/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Power Train", "Sub Problem": "Automatic Transmission Torque Converter problems", "description": "My 2004 Pilot ex-res started a faint whining noise around 73k miles. The noise became progressively more pronounced with time/miles. The noise is only audible when pressing on the gas pedal and in third gear. As soon as the gas pedal is depressed the noise disappears. I have 93k miles on the odometer as of may 2013 and the noise is now a high pitched whining noise; it is very annoying and easily audible inside the cabin even with the windows closed. I took it to the Honda dealership to diagnose this noise and they told me it is the torque converter and that it will eventually fail with the transmission; they advised me not to do anything at this time since the fluid and transmission pressure lines all checked out good. I was surprised to hear this recommendation from the service adviser. I take immaculate care of my car with on the spot oil/filter/transmission/vtm-4 fluid changes using Honda oem parts and quality motor oil. I am concerned one day my Pilot will leave me and my family stranded on the road with a huge bill to replace the transmission and torque converter. I have 2 small kids and this is the last thing I need to worry about; my vehicle was not part of the recall to install the oil jet kit. I believe Honda should fuss up about this issue and issue a proper fix to all affected owners, otherwise lots of people will look elsewhere for their next vehicle.", "fail date": "  04/08/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Power Train", "Sub Problem": "Automatic Transmission Torque Converter problems", "description": "To start off I bought my Pilot used from Honda with about 83,000 miles on it a year ago. When I drive my car at a steady 30mph to 45mph it shutters and makes noises as if I'm driving over road turtles. It's very violent until I let off the accelerator. I talked to Honda and they said it was the torque converter. I asked if it had been recalled and they told me there had never been a recall for the transmission. I know that's not true and they won't do anything about it. It's mine and my wife's only car right now. It's a serious issue that is very unsafe for my family and could cause a crash. There faulty transmission puts my families life in danger every time we drive it. Honda should take care of us free of cost do to there defective parts that are not because of normal wear. They also should have never sold us the Pilot without fixing the known faulty transmission. I believe it's illegal by federal law to sell it knowing there is a faulty transmission and recall with out addressing it and fixing it.", "fail date": "  10/22/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Power Train", "Sub Problem": "Automatic Transmission Torque Converter problems", "description": "I have noticed when my Pilot gets below 50 mph it gets a shuddering to it (not always but most times driving in the city), almost like its driving over a washboard. During a visit to the dealership I talked to another Honda Pilot owner who was experiencing the same thing but the dealership could not tell her what the issue was. So after more investigating she took it to a non-Honda repair person who told her the problem lies with the torque converter and to use a product called shudder fixx. My question is if Honda is having these complaints why are they not fixing this issue and still selling these vehicles with this problem? I love my Honda other than that, but feel this is a defect in the workmanship.", "fail date": "  06/06/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Power Train", "Sub Problem": "Automatic Transmission Torque Converter problems", "description": "My 2004 Honda Pilot has a shuddering sound when I go above around 35 miles an hour. It is very intermittent but can be loud. My local dealer said they had to get a Honda engineer out to look at it and it is verified to be the torque converter. This seems to be a very common issue researching it here and on the internet. I am frustrated that Honda has not recalled these knowing that it is such a wide sweeping issue with Pilots.", "fail date": "  03/01/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Power Train", "Sub Problem": "Automatic Transmission Torque Converter problems", "description": "I took my Honda Pilot to the Honda dealership because the d light was flashing. They found code p1740 indicating a 4th pressure switch failure. I received an estimate for $5,109 + tax to replace the transmission and torque converter. I discovered the recall issued for the transmission on the 2003-2004 Honda Pilots, but when I called Honda, I was told that there was no recall for my vehicle for the transmission. My vehicle is having the same problem that is described in the recall, so I do not understand why Honda would deny servicing my vehicle in accordance with the recall.", "fail date": "  02/06/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Power Train", "Sub Problem": "Automatic Transmission Torque Converter problems", "description": "The contact owns a 2004 Honda Pilot. The contact stated that the vehicle would violently shake while driving approximately 40 mph and above. The vehicle was not taken to have the failure diagnosed or repaired. The manufacturer was made aware of the failure and offered no assistance. The failure mileage was 100,700. Updated 02/22/lj\nthe consumer stated the torque converter needed to be replaced. Updated 03/01/12.", "fail date": "  01/20/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Power Train", "Sub Problem": "Automatic Transmission Torque Converter problems", "description": "I am an owner of a 2004 Honda Pilot with 123000 miles and have been experiencing an automatic transmission/torque converter shudder/vibration that occurs between 30-50 mph. The vibration began occurring at about 98,000 miles. At speeds of 30-50mph the vibration occurs under light acceleration and continues until I either push down harder on the gas pedal or let off it completely. I researched the issue on the internet and have found numerous similar complaints on Honda vehicle owner forums. Apparently this problem is due to a defective transmission that is similar to the one on the Honda made Acura and has been the subject of an Acura recall. The defect will ultimately result in a vehicle safety hazard when the transmission fails. Even though my vehicle is no longer under warranty, the transmission problem is a result of a defective part rather than normal wear and tear and Honda should issue a recall or initiate an owner notification/resolution program to prevent potential harm to passengers when the transmission fails on the road. This is a dangerous defect that should be publicly adressed by Honda.", "fail date": "  12/01/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Power Train", "Sub Problem": "Automatic Transmission Torque Converter problems", "description": "While driving at a steady speed of 35-45 mph the car experiences shuddering for about 5 seconds at irregular intervals. It sounds and feels like it is coming from the front of the vehicle, perhaps on the driver side and at first I thought it may be bad wheel bearings. Those turned out to be fine. I took it to a repair shop who said it needed the rear differential serviced. That did not stop the shuddering. Subsequent research has shown that the Honda Pilot / Acura mdx with the 3. 5l v6 in the 2003 - 2008(?) range experience this problem on a large scale, resulting from a faulty torque converter. Nhtsa item number 10022468 addresses this problem specific to the 2003-2004 Acura mdx but my experience and that of hundreds of Honda Pilot / Acura mdx owners shows that the issue is much broader in scope.", "fail date": "  07/01/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Power Train", "Sub Problem": "Automatic Transmission Torque Converter problems", "description": "Last year our Honda Pilot began occasionally having a shuddering sound, like driving over a metal grate. This would occur when decelerating slightly around 40 mph. Over the past year this has begun to occur regularly rather than occasionally and for a longer duration and louder. Now the d light has begun flashing. From research I am expecting to find that the transmission is failing due to torque converter problems.", "fail date": "  05/27/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Power Train", "Sub Problem": "Automatic Transmission Torque Converter problems", "description": "My 2004 Honda Pilot has a shudder at 30 mph. It feels as though you are driving over the rumble strips. I am starting to experience poor shifts at other speeds now as well. I understand that the problem is most likely the result of a faulty torque converter. Repairs include replacing the torque converter and the transmission as well as updating the pcm. Honda recalled over a million 2003/2004 Pilots but my VIN is just passed the last VIN recalled. However, there are many 2005 Pilot owners experiencing the exact same failure. Acura also issued a service bulletin that repairs the faulty components for all 2003 and 2004 mdx owners (inside and outside of warranty). Honda should take responsibility for the failed transmissions in the later 2004 Pilots and 2005 years as well.", "fail date": "  05/09/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Power Train", "Sub Problem": "Automatic Transmission Torque Converter problems", "description": "We are having issues with our 2004 Honda Pilot. We took it to the dealership where after charging us for each and evry item to find the problem. They have concluded it is the torque converter. We have just over 70,000 miles and our certified warranty expired in January 2011. The worst is that our extended warranty is basically worthless. Glas we paid for that one.", "fail date": "  03/01/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Power Train", "Sub Problem": "Automatic Transmission Torque Converter problems", "description": "I own a 2004 Honda Pilot which was purchased new and has been well maintained with 106000 miles and have been experiencing an automatic transmission/torque converter shudder/vibration that occurs between 35-45 mph. The vibration began occurring at about 90,000 miles. At speeds of 35-45 mph the vibration occurs under light acceleration and continues until I either push down harder on the gas pedal or let off it completely. Research on the internet thru NHTSA has found 43 similar complaints. Apparently this problem is due to a defective torque converter or automatic transmission that is similar to the one on the Honda-made Acura and has been the subject of an Acura recall. The defect will ultimately result in a vehicle safety hazard when the transmission fails. My Honda Pilot is no longer under warranty. The transmission problem is a result of a defective part rather than normal wear and tear and Honda should issue a recall or initiate an owner notification and goodwill consideration for transmission replacement to prevent potential harm to passengers when the transmission fails on the road. Average cost to the customer for such a repair is between $3,000-$5,000 according to the complaints filed. This is a dangerous defect that should be publicly addressed by Honda and should not be a burden that Honda customers should bear.", "fail date": "  03/01/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Power Train", "Sub Problem": "Automatic Transmission Torque Converter problems", "description": "Not sure if this is consider a power train problem, but no option regarding a transmission or torque converter in the box. My 2004 Honda Pilot shudders very bad when I am going between 35 to 40 mph. I am so embarrassed when someone else is in the vehicle with me and it does it. I have 116,352 miles on my vehicle now and it shudders alot. I have been reading the consumer report and this seems to be very common in the 2004 Honda Pilot. There should have been a recall regarding this problem. It appears this is not an isolated issue. Please help me in resolving this issue. I feel it is a manufactured malfunction and not the owner's fault, but I am a female and it is assumed females do not know anything about their vehicle that they drive everyday to work. Other than this problem, I am very pleased with my Honda Pilot. I do not abuse my vehicle in any way. Please respond and help me correct this problem in the best way possible without a lot of cost to the consumer. Thank you.", "fail date": "  01/04/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Power Train", "Sub Problem": "Automatic Transmission Torque Converter problems", "description": "Torque converter shudder /vibration between 35 and 40 mph. I have taken my 2004 Honda Pilot to the service department for over 18 month now trying to get someone to hear or experience what I was with my vehicle. Finally when the vibration was so bad it could be heard and felt. It was finally heard/felt by the service manager at local Honda dealer. When I was told what the problem was and that it would cost $2500 to fix, I got a second opinion, when that opinion was confirmend, I went online to see if there was a recall that I had not been notified of. I did not find any recalls but found the numerous complaints on the manufacturer of powe train/automatic transmissions:torque converter. I was livid that there were so many complaint with the same problems that I don't know how the dealership did not know or if they conveniently chose not to acknowledge my problems. . Until I experience this problem I loved my vehicle.", "fail date": "  12/18/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Power Train", "Sub Problem": "Automatic Transmission Torque Converter problems", "description": "Shutter in the tranny from 25-45 mph\nit has been described as the torque converter.", "fail date": "  12/11/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Power Train", "Sub Problem": "Automatic Transmission Torque Converter problems", "description": "2004 Honda Pilot transmission shudders while driving. Only 90,000 miles on vehicle. Dealer says torque converter needs to be replaced and possibly transmission. Upon research found this to be a large ongoing problem with many consumers.", "fail date": "  11/17/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Power Train", "Sub Problem": "Automatic Transmission Torque Converter problems", "description": "Problem: at low rpm in 4th gear and speeds 25 to 35 mph, there is sporadic vibration of the vehicle when the gas pedal is slightly depressed. The issue goes away if pressure is applied or removed from the gas pedal. The problem has recently started to occur at highway speeds of 65+ mph as well, also at low rpm. The failure was identified as a torque converter issue by the dealer that has resulted in requiring the replacement of the entire transmission in the Pilot. If the problem is not rectified, users have reported that it could result in a sudden change of gears to a lower gear which could result in severe consequences. The dealer has recommended that the transmission be replaced in its entirety in order to rectify the problem.", "fail date": "  11/16/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Power Train", "Sub Problem": "Automatic Transmission Torque Converter problems", "description": "My 2004 Honda Pilot ex-l is having a torque converter issue (vibration/shudder/grinding between 20-50 mph while accelerating). I have not had the problem fixed yet, but I have read numerous complaints regarding this issue at different internet sites.", "fail date": "  10/09/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Power Train", "Sub Problem": "Automatic Transmission Torque Converter problems", "description": "2004 Honda Pilot driveline vibration. The 2004 Honda Pilot we own shudders and vibrates very loudly when accelerating between 25-50mph. This has been ongoing throughout the life of the car. (family owned since new) the vehicle has been taken to Honda on several occasions for diagnosis and repair for the problem. Honda has stated they can not reproduce the issue or said they find no problem. Honda did complete a recall and installed an oil jet kit at 12k miles. This was their attempt to quell the problem. After research I have found Honda has issued TSB 06-003(9 June 2007) and is fully aware of the problem. American Honda has diagnosed the problem as a faulty torque converter, thus causing premature destruction of the vehicle's transmission. Due to the vehicle's age/mileage american Honda refuses to cover the repair of the torque converter and or transmission, even though the problem was reported/documented while still under warranty.", "fail date": "  08/20/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Power Train", "Sub Problem": "Automatic Transmission Torque Converter problems", "description": "Transmission noise/vibration at low rpms while driving in 4th gear. Does not make noise while driving in d3. Recall work was supposed to have been done by dealer when vehicle was purchased new. Recall stated that trans could \"lock up\" while driving. Have seen other complaints online for same problem with Acura mdx which uses the same transmission. The problem appears to be faulty torque converters.", "fail date": "  07/30/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Power Train", "Sub Problem": "Automatic Transmission Torque Converter problems", "description": "Our 2004 Honda Pilot began making noises every once in a while a couple of months ago. At first, the noise sounded like we had run over a paper cup with the rt front tire. This small sound got more frequent. We noticed it happened most often when we were moving at a slow speed -- between 30 and 40 mph. We called the dealership and the mechanic determined the torque converter is malfunctioning. The dealer says we need to replace both the torque and transmission at $3,500. Our Pilot has 78,000 miles. When I pull up information for our VIN, it shows 3 safety notices/recalls including the one for the transmission (recall number: 04v176000)the recall began on Apr 21, 2004 and I remember getting a notice to take the vehicle to the dealer, but Honda America says the recall did not include my VIN no. And there are no recalls for our Pilot at all. The recall involved 1099796 units -- including the 2003 and 2004 model yr Pilots. Honda America does not want to acknowledge that our VIN was -- or at the very least should have been -- in the recall. The Honda America rep was abrupt and repeated the same scripted line over and over . . . \"your VIN is not under any recall. . . \" the dealership has been supportive. We don't know if there will be any discount from either Honda America or the dealer. Our 1999 odyssey had to have transmission replaced just out of warranty -- and this was the vehicle Honda promised to be the best of the best for quality and safety. We will be selling or trading the Pilot and looking for something out of the Honda line. The powertrain should have 100,000 miles -- not the 36,000. I want Honda America to look into our problem , step up and say this issue is the same issue in the recall. Our Pilot was serviced on schedule through the dealer. The Honda America rep said they don't look at what websites say about Honda issues (edmunds, safecar. Gov. . . ). Perhaps Honda should ask Toyota how that worked for them. . . --[xxx]\ninformation redacted pursuant to the freedom of information act (foia), 5 u. S. C. 552(b)(6).", "fail date": "  07/16/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Power Train", "Sub Problem": "Automatic Transmission Torque Converter problems", "description": "I am an owner of a 2004 Honda Pilot (purchased new and meticulously maintained) with 89,000 miles and have been experiencing an automatic transmission/torque converter shudder/vibration that occurs between 30-50 mph. The vibration began occurring at about 75,000 miles. At speeds of 30-50mph the vibration occurs under light acceleration and continues until I either push down harder on the gas pedal or let off it completely. I researched the issue on the internet and have found numerous similar complaints on Honda vehicle owner forums. Apparently this problem is due to a defective transmission that is similar to the one on the Honda made Acura and has been the subject of an Acura recall. The defect will ultimately result in a vehicle safety hazard when the transmission fails. Even though my vehicle is no longer under warranty, the transmission problem is a result of a defective part rather than normal wear and tear and Honda should issue a recall or initiate an owner notification/resolution program to prevent potential harm to passengers when the transmission fails on the road. This is a dangerous defect that should be publicly adressed by Honda.", "fail date": "  06/01/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Power Train", "Sub Problem": "Automatic Transmission Torque Converter problems", "description": "The contact owns a 2004 Honda Pilot. The contact stated that a burning odor was coming from the transmission. The vehicle would also shake excessively while driving at various speeds. The vehicle was taken to a private mechanic, who was unable to duplicate the failure. The vehicle was then taken to an authorized dealer where the contact was advised to have the torque converter replaced. The manufacturer was aware of the failure. The vehicle was not repaired. The approximate failure mileage was unknown and the current mileage was 90,000.", "fail date": "  01/01/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Power Train", "Sub Problem": "Automatic Transmission Torque Converter problems", "description": "Torque converter stutters at 25-30mph. Very disturbing and can result in transmission damage while driving.", "fail date": "  05/01/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Power Train", "Sub Problem": "Automatic Transmission Torque Converter problems", "description": "Transmission and torque converter causing serious shudder and possible lock-up.", "fail date": "  05/01/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Power Train", "Sub Problem": "Automatic Transmission Torque Converter problems", "description": "Purchased a used 04 Pilot from a car dealer and during the first week of operation I heard shuttering noises like going over a rumble strip. I researched this on line and was horrified to find hundreds of similar complaints (torque converter) and a recall by Acura for same reason. I took it back to dealer to get my money back and luckily was able to get out of the Pilot by trading it for another truck on the lot. I feel sorry for the next person who unknowingly (not like Honda) purchases this with their hard earned money to drive their kids around in and are in a possible death trap! shame on Honda, do the right thing and recall before you kill people.", "fail date": "  02/11/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Power Train", "Sub Problem": "Automatic Transmission Torque Converter problems", "description": "Torque converter shudder /vibration between 35 and 40 mph. I have taken my 2004 Honda Pilot to the service department for over 18 month now trying to get someone to hear or experience what I was with my vehicle. Finally when the vibration was so bad it could be heard and felt. It was finally heard/felt by the service manager at local Honda dealer. When I was told what the problem was and that it would cost $2500 to fix, I got a second opinion, when that opinion was confirmed, I went online to see if there was a recall that I had not been notified of. I did not find any recalls but found the numerous complaints on the manufacturer of power train/automatic transmissions:torque converter. I was livid that there were so many complaint with the same problems that I don't know how the dealership did not know or if they conveniently chose not to acknowledge my problems almost two years now. I want to know what I can do when I confront the dealership with my complaint. Until I experience this problem I loved my vehicle, now everytime it vibrates/shudders I am just sick about it.", "fail date": "  01/05/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Power Train", "Sub Problem": "Automatic Transmission Torque Converter problems", "description": "2004 Honda Pilot that makes a \"washboard\" sound between 30 - 45 mph. Dealership failed to diagnose problem as torque converter which has now damaged the transmission. Problem started in late 2008 when vehicle was only 4 years old. I am aware of numerous problems with this transmission in Hondas and acuras. Honda is not making the situation right and leaving the consumer with a substantial expense for something that certainly appears to be a defect.", "fail date": "  11/01/2008"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Power Train", "Sub Problem": "Automatic Transmission Torque Converter problems", "description": "I now have been the victim for the 2nd time of what is unquestionably a major design flaw in the transmission / torque converter of the shared power train for Honda Pilots ('03 ,'04) Honda odyssey vans ('02 to '04) & Acura mdx ('01, '02). I owned a pristine 2001 Acura mdx with just over 100k miles on it which experienced the all too common trans. / torque converter failure only a few months after I purchased it from a Honda dealer. This happened in spite of the fact that the power train recall (sanctioned by NHTSA) had been completed in 2004. I parted ways with the vehicle, incurring a substantial loss. But the nightmare continues, as unfortunately, my other vehicle is a 2004 Honda Pilot. Right after I purchased it new in 2004, I took it back to the dealer since the model was subject to a nearly identical power train recall as the mdx and odyssey. My dealer said my VIN was not included in the recall, & that my new Pilot should be fine. Yet @ 60k, the \"d\" light on the shifter display started to blink from time to time. Each time the dealer said everything was fine; shuttering on downshifting over the years was passed off by the dealer as normal for the vehicle. Then last week, the power train failed on this vehicle as well. This time my son was driving, & the car shuttered so badly that it nearly went out of control. This car has been well maintained & I have all service records. Clearly the recall \"remedy\" for this major design flaw has not solved the issue, and these power trains still present a major safety hazard for the vehicle operator & others on the road who may need to avoid a disabled vehicle in front of them. Please do something! if you total all the power train complaints for the recall yrs. On these 3 models, you get nearly 3000. The legitimacy of NHTSA is at stake. This \"solution\" was a good deal for Honda, but it has not protected the public!.", "fail date": "  10/01/2007"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "Upon entering the vehicle and sitting in the driver's seat, I heard a loud pop and then noticed that the seat was extremely loose and would rock backwards as if something was broken. I removed the side cover and found that there was a failed seat mount bracket that had broken in half. The vehicle is currently undriveable until the seat is fixed since the seat sways backwards on acceleration which could lead to an accident. I am not aware of any active recall for this issue but I believe it should be investigated as it is a major safety concern!.", "fail date": "  11/27/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "Tl the contact owns a 2004 Honda Pilot. While accelerating and braking, the driver's seat unintentionally moved forward and backwards. Spreen Honda (25050 redlands blvd, loma linda, CA 92354, (909) 799-7070) was contacted, but no assistance was offered. The vehicle was not taken to a dealer for diagnostic testing or repairs. The vehicle was taken to an independent mechanic who stated that the mounting bracket fractured and needed to be replaced. The vehicle was not repaired. The manufacturer was not made aware of the failure. The VIN was not available. The failure mileage was 150,000.", "fail date": "  10/24/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "On 06/21/2014, I was entering my vehicle when a bracket connected to the adjuster assembly (part# 81630-s3v-a30) broke. This occurred on the drivers seat. Due to this, the seat was no longer secure to the floorboard and started rocking back and forth. I searched Honda part records and I was unable to find a specific part number assigned to this bracket. The vehicle was parked at the time of the break. But, while driving the vehicle the seat was unstable and hard to keep it still. A search of NHTSA records found the following complaints regarding the same issue - 10583003, 10578612, 10567737, 10541789, 10505250, 10489089, 10488805, 10466947, 10455702. I took pictures of the broken bracket. It appears metal fatigue may be an issue.", "fail date": "  06/21/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "When accelerating away from a stop light, I heard a \"pop\" sound and my driver seat suddenly had a \"rocking\" issue. The driver seat now rocks backward when accelerating, after researching online and doing a visual inspection I found that a metal \"l\" shaped bracket that mounts the seat bottom to the seat frame has sheared off at the rivet points. This creates a hazard when driving and I fear in a crash, the seat could become unattached from vehicle interior completely putting occupant at increased risk of injury or death from airbag deployment or ejection from vehicle! during an online search, I found several other reports of the same issue to NHTSA. . . Those report numbers are 1058303; 10578612; 10567737; 10541789; 10505250; 10489089; 10488805; 10466947; 10455702. I contacted Honda and was told since the warranty was expired, there was nothing they would do. This is a safety hazard!!! why does someone have to be killed before the issue is fixed?!? with so many reports already being logged stating this same problem, I would think something would be done about it. This is just as dangerous at the airbag issue that resulted in a recall.", "fail date": "  06/01/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "This afternoon as I entered my city street parked, 2004 Honda Pilot, from the driver's side, I heard a loud snapping sound as I sat down. The driver's seat, simultaneously with the sound, rocked back, obviously no longer securely mounted. Upon inspection I found the front left �l� shaped seat mounting bracket had sheared in two, in line with the two holes that the securing rivets pass through. The bracket failed and tore, apparently the metal is not thick enough to resist the forces placed on the seat. Perhaps related to the size of the rivet holes.", "fail date": "  05/23/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "Leaned back and turned around to back out of parking space and left front seat bracket on the driver's side front broke. Have to brace myself while accelerating forward something needs to be done have read multiple occasions of this happening to other people. Afraid the other brackets will break shortly after. I have not been able to find anything to fix this problem.", "fail date": "  10/27/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "While driving approximately 35 mph down a city street, the drivers seat began to move- specifically began to shift backwards upon acceleration. Upon acceleration, the seat leans back away from the steering wheel significantly. Inspection by mechanic showed the seat brackets have sheered off detaching the front left corner from the seat frame.", "fail date": "  07/21/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The drivers seat has been so hot that it feels like it can burn your skin. Today on the way to work my daughter said she smelled something burning. She looked down on her seat and it was smoking and burned the leather. The seat was actually catching on fire. I have looked this up and see numerous complaints on this and people have reported this to you. I don't see what you are reporting no complaints or recalls. We were on the highway when the incident happened.", "fail date": "  12/20/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The drivers seat has a bracket that broke when I was driving and I almost control of the vehicle because it caused me to lean back very far in the seat and my steering and acceleration was affected. I was exiting onto a freeway and almost collided with other vehicles. This bracket is located on the drives side that holds a motor that moves the seat up and down; in close proximity to the left side panel for the seat controls. Bracket has two rivets holding in place. Was hoping their was a recall on this defect because I found lots of incidents reported on various websites. Thank you.", "fail date": "  11/24/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The vehicle was stationary, not in any accidents or driving off-road. Sat down and found driver's seat unexpectedly will now tilt back, raising the left front of the seat. The seat is obviously not secure, nor would it be safe in an accident. Took it to the dealer, and they said the seat frame is broken inexplicably (part 81660-s3v-a30). This does not appear to be a wear part - one of the metal bracket pieces holding the seat bottom to the body I guess just sheared off along the rivet line. A brief web search found this is a common problem, so I'm surprised there has not been a recall by Honda. The dealer quoted a repair price of approximately $1,850.", "fail date": "  11/20/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "Front left bracket that holds the drivers seat to the frame of the vehicle snapped. This is a common, known defect and is a safety issue.", "fail date": "  10/02/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The contact owns a 2004 Honda Pilot. Upon entering the vehicle, the front driver side of the vehicle was leaning. Upon inspection, the contact noticed that the weld was fractured. The vehicle was taken to the dealer where it was confirmed that the driver's seat bracket was fractured and the seat would need to be replaced. The vehicle was not repaired. The manufacturer was not notified of the failure. The failure mileage was not provided.", "fail date": "  12/05/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "While leaning back in the driver's seat to remove my wallet to purchase gasoline I heard \"pop\" and then the seat seemed to become dislodged from the body of the vehicle. The front left of the seat was no longer connected to the body of the vehicle. Upon further inspection it was revealed that the steel bracket holding the top assembly of the seat to the bottom assembly of the seat tore clean through.", "fail date": "  10/17/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The contact owns a 2004 Honda Pilot. The contact stated that while driving at various speeds, the driver seat would move independently. The contact stated that the seat felt as though it would dislodge from the vehicle. The vehicle was taken to the dealer where it was diagnosed that the seat bolt had fractured and that drivers seat would have to be replaced. The vehicle was not repaired. The manufacturer was not made aware of the failure. The approximate failure mileage was 150,000.", "fail date": "  07/18/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The drivers seat lower metal bracket broke causing the drivers seat to be unstable when sitting in the SUV and when accelerating. I have seen at several other complaints both on this web site and in the Honda Pilot forum. I called the dealer about asking for a repair who referred me to Honda USA. I called and reported the problem to Honda and they are unwilling to fix this safety issue which is a safety defect because there is no recall issued for this problem. If this vehicle were to be in an accident the seat would likely break loose and throw the driver and the seat out of the vehicle. I just noticed this problem while driving the vehicle .", "fail date": "  07/07/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "I am the original owner of a 2004 Honda Pilot ex-l and have had only very minor issues up until now. Yesterday, while entering the vehicle, I noticed a great deal of play in the driver¿s seat back. Assuming an anchor bolt was loose, I checked the left front seat area where the movement was the greatest and discovered the left adjuster assembly arm almost completed sheared from the main adjuster assembly. The structural integrity of the seat is now severely compromised and is a safety hazard as the seat will become detached in any accident. I¿ve noted numerous complaints of this exact same piece on this and other websites.", "fail date": "  05/17/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "I am the original owner of my 2004 Honda Pilot. Overall, good vehicle but has always been a problem with the driver side heated seat. It gets too hot and felt like a burn to your skin. I mentioned to the dealer early on and was told to decrease the use. So, I have decreased the use of the heated seats or used on low for a short time until the SUV was warm and completely turned off. The seat is not heating at all now. It has approx. 175,000miles and has been well maintained. I feel that there has been too many complaints and this issue never addressed or a recall done.", "fail date": "  01/04/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The seat began moving earlier today and then when my husband was getting out of the car there was a loud pop and the seat started rocking. It seems to have become detached from the car on the front left. When accelerating it rocks back and when breaking it rocks forward. My husband looked and the metal bracket has broken completely. It seems very unsafe and would be extremly worried that in an accident the air bag would cause serious injury when you are thrust even farther into it or if the other side were to break and you be thrown out regardless of having a seatbelt.", "fail date": "  09/28/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "When sitting down in my vehicle this morning, there was a snapping noise and the seat rocked back toward the right rear. Removing the plastic cover, it was plainly visible that a metal part that holds the upper seat to the lower seat assembly has snapped where it attaches with two industrial rivets. Seat now tips backward rather easily, and does so when I climb in or out of the vehicle, and upon acceleration. Clearly the structural integrity of this seat is destroyed until I can have it fixed/replaced. I am fearful that if I were to have an accident, the seat will come completely detached. In a 5 min web search I have found dozens of other instances of this occurring; this is not a rare problem and needs to be fixed! compounding my problem, I am in the usaf stationed in the uk, and getting this fixed will be difficult to say the least, as this vehicle is not sold here.", "fail date": "  08/14/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "We noticed that the plastic panel covering the driver's seat controls came detached. Shortly after the seat began rocking slightly. Finally, there was a loud pop and the seat now rocks freely. It is scary and dangerous to have to drive a vehicle while the seat responds to all movement. It will no longer allow you to increase the incline of it, so it's reclined at the same time. What started as two screws breaking free from the decorative lever cover quickly turned into a major structural issue.", "fail date": "  07/01/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "Front left structural bracket on driver's seat failed, allowing seat to tip backward. Bracket failed along a line with two rivet/fasteners, detaching seat tray from power fore/aft positioner rails. Apparently design defect, as there are 12 other essentially identical NHTSA complaints on file for this make/model/year.", "fail date": "  04/25/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The contact owns a 2004 Honda Pilot. While the contact was seated in the driver seat, an abnormal sound emitted from the vehicle without warning. The contact discovered that the seat bolt was fractured. The vehicle was taken to an independent mechanic where it was diagnosed that the bolt between the seat and seat frame assembly was fractured and needed to be replaced. The vehicle was not repaired. The manufacturer was not notified of the failure. The failure mileage was 210,000.", "fail date": "  10/15/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "Noticed an extreme hot spot on drivers side lower seat cushion when heated seats are on hi or lo. Spot is so hot that you cannot let it touch your pants without burning you. I have read many accounts of this same issue with other Honda owners that ultimately resulted in a fire. Now drivers side lower seat cushion heating element no longer works. Drivers side back and passenger side heating elements still work.", "fail date": "  10/01/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "Husband parked car leaned forward to get wifi off dash and left front of driver seat detached from the adjuster. Seat now leans to front left and rocks around.", "fail date": "  07/07/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "We were on another summer trip and the airbag warning light came on. This is the big red light to the far left of the panel. Calling Honda in franklin TN they had no idea what could happen while continuing to drive the vehicle. Calling another dealership they assured me that it was most likely a sensor and the airbags would simply not deploy. Honda as recalls now for bad airbags. 1- our 2004 does not fall into the recall period 2 - Honda should pay for any issue related to bad airbag technology regardless of how old the car is, just like they do with seat belts. If we would have been in a wreck during the time that light was on, the airbag would not have deployed. 3- any part of the airbag/sensor/ seatbelt system should not be merely covered under a limited warranty. It should be covered for the life of the car. This is a safety issue. If they cannot stand behind the safety of the car they need to get out of the business.", "fail date": "  06/20/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "Front, driver seat, seat warmer was on high. Seat was getting very warm. Seat began to smoke, leather was melting. This occurred under the driver's right leg. The seat getting very warm has been ongoing for some time now on both low and high, but I turn the seat warmer off. This is the first time it has started smoking. Contacted dealership. Was told to just not use seat warmer. Will no longer use seat warmer as it is a fire hazard.", "fail date": "  02/28/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "A lower seat support on drivers seat has failed. Causing the front of the drives seat to not be held in place. On acceleration the front of drivers seat lifts up causing the seat to lay back in a more reclined position.", "fail date": "  02/19/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The contact owns a 2004 Honda Pilot. The contact stated that the drivers side seat warmer was activated and became extremely hot. In addition, there was a burning odor throughout the vehicle. As a result, the driver sustained a burn. The failure occurred on numerous occasions. The vehicle was not diagnosed or repaired. The manufacturer was not made aware of the failure. The failure mileage was 110,000. The VIN was not available.", "fail date": "  12/12/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "When the driver side heated seat is turned on the seat gets so hot that it literally burns the skin on anyone sitting in the seat. It happens on both low or high setting. The seat then begins to emit smoke.", "fail date": "  10/15/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "When we turn on the seat warmer in the front passenger seat of our Honda Pilot 2004, we smell a strong odor of rubber or foam burning. Now our seat warmer will not work at all. We've stopped using the seat warmer due to concerns of a fire starting.", "fail date": "  09/07/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "When turning on the driver's side seat warmer it got extremely hot. Recently it actually burned the seat foam and began to smoke. I will not use it anymore for fear of a fire. Thank you for looking into this issue.", "fail date": "  01/02/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The driver's side heated seat got extremely hot under the right leg. It got so intense that I had to turn it off for fear of burning my leg.", "fail date": "  12/26/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The driver's heated seat got so hot it melted the foam backing causing a horrible smell. The heated seat was turned off or it is possible it would have caught on fire. The seat heated still works but gets much too hot.", "fail date": "  12/19/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The drive side seat warmer gets incredibly warm and feels as though it could burn. Called Honda for service, and the representative was very rude. He said just don't use it. Very concerned for safety issue.", "fail date": "  12/12/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The drivers seat over heats to the point of being uncomfortable on my right leg. It is now inoperable. The dealer said it was not covered under warranty or recall. There seems to me a number of similar complains on edmunds threaders discussion board. The bottom point is they will not act on this issue unless they are required to do so by your organization.", "fail date": "  12/12/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "It do not work at all.", "fail date": "  07/02/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall airbag issue, airbag will not inflate upon impact according to service center.", "fail date": "  11/07/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "2004 Honda Pilot. Consumer writes in regards to defective takata airbag. The consumer stated the air bag was replaced, but the dealer advised the airbag failure may recur.", "fail date": "  11/01/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. Called dealer after getting notice on 7/11/16. Called back 7/18/16. Stonewalled. Told to bring letter. Did on 7/19/16. Called 8/1/16. Called 9. 23/16. Told \"part ordered\". Dealer uncooperative. Advantage Honda, manhasset, NY.", "fail date": "  09/23/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2004 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags); however, the part to do the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was notified of the issue. The contact had not experienced a failure. Parts distribution disconnect.", "fail date": "  07/12/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2004 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags); however, the parts for the recall repair were not available. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was not notified of the issue. The contact had not experienced the failure. Parts distribution disconnect.", "fail date": "  07/07/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2004 Honda Pilot. The contact stated that the passenger side of the dashboard had disintegrated. The vehicle was taken to the dealer, but was not diagnosed or repaired. In addition, the contact received notification of NHTSA campaign number: 16v344000 (air bags), but the dealer stated that the part was not available. The manufacturer was notified. The failure mileage was 180,000. VIN tool confirms parts not available.", "fail date": "  07/07/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall I got a recall notice from Honda telling me to have the passenger air bag replaced as soon as possible and not to have a passenger in the front seat until I do. However, my local Honda dealer says that michigcan cars are not at risk and Honda told them they would not be receiving any replacement airbags until 2018. Whast do you recommend.", "fail date": "  07/05/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2004 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags); however, the parts to do the repair were unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was notified of the issue. Parts distribution disconnect.", "fail date": "  06/24/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Tl- takata recall. The contact owns a 2004 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags) however, the part to do the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall. The manufacturer was notified of the issue. The contact had not experienced a failure. Parts distribution disconnect. Wh.", "fail date": "  06/10/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2004 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags); however, the part to do the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure.", "fail date": "  06/01/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2004 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags); however, the parts to do the repair were unavailable. The manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was not notified of the issue. The contact had not experienced a failure. Parts distribution disconnect.", "fail date": "  05/26/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2004 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags); however, the part to do the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was not made aware of the issue. The contact had not experienced a failure. The VIN was unavailable. Parts distribution disconnect.", "fail date": "  05/16/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall after getting the recall in 2015 I had the airbags checked and replaced on 10/15/2015 at Honda of valley stream service station. Despite this I have been getting letters incorrectly stating that I didn't get it repaired yet. I have uploaded the documentation showing the airbag repair done on 10/15/2015. Please correct the record so I stop getting the mailings regarding this. I also want to correct the record so there is no problem if I want to sell the car.", "fail date": "  10/15/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "In early April, 2015 I received notice of air bag recall. On April 8, 2015 I contacted lancaster Honda re having the part replaced. I was told within 2 weeks they would call me back. They didn't. About may, 2015 I called them back, they apologized and said the part hadn't come in, but should be in by the end of the month. On July 3,2015 I called american Honda. They also apologized, but stated they had been unable to obtain the part, but that it should be available by the end of July. It is now August 3rd, 2015 and I have not heard anything from anyone. In my area we've been having unusual humid and hot weather which is supposed to be the most dangerous for this particular defect. When is this going to be resolved?.", "fail date": "  08/03/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "I called Honda plaza bklyn NY in July in reference to the recall letter I received. They said they would get back to me. I called 2 more times & was told someone would call me. No one ever called. They say I'm on the list but will not tell me what # on the list I am. According to the letter I received the airbag recall should be taken care of within 60 days. It is now over the 60 days. I was going to go to bay ridge Honda but they can't promise me how long it will take & don't offer loaner cars. They have a shuttle bus but it will only get me home. I still need a car to go to work. I leave my home at 3. 30p. To work nights so the shuttle they offered will not help me. I bought 2 cars from plaza Honda and any time I have to deal with the service dept. At plaza it's always a problem but now it's a really big problem because it has to do with my safety. I need someone's help to see why plaza Honda is - a. Not getting back to me when I'm told someone will call me. -b what number am I on there list. -c why this is taking over the 60 day period. Any help you can give with this will be greatly appreciated.", "fail date": "  07/15/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2004 Honda Pilot. The contact received notification of NHTSA campaign numbers: 14v315000 (air bags) and 14v353000 (air bags); however, the part needed to do the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure.", "fail date": "  05/01/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2004 Honda Pilot. The contact received a notification for NHTSA campaign number: 14v700000 (air bags); however, the part needed to do the repair was still not available. The contact felt the manufacturer exceeded a reasonable amount of time. The manufacturer was made aware of the issue. The contact had not experienced a failure.", "fail date": "  04/21/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2004 Honda Pilot. The contact received notification of NHTSA campaign numbers: 14v351000 (air bags) and 14v700000 (air bags); however, the parts needed to do the repairs were unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was not made aware of the issue. The contact had not experienced a failure.", "fail date": "  04/14/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Tl-the contact owns a 2004 Honda Pilot. The contact received notification of NHTSA campaign number: 14v351000 (air bags) however, the part needed to repair the vehicle was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was notified of the failure. The contact had not experienced a failure. Oo.", "fail date": "  03/27/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Tl- the contact owns a 2004 Honda Pilot. The vehicle has 2 open recalls which are under the NHTSA campaign number (14v-700) and (14v-3510. The contact received a notice recall letter in feburary 18th but the part is still not available. The contact stated that the vehicle was not taken to the dealer. The manufacturer was notified of the failure. The failure mileage of the vehicle is 131,000. Sl.", "fail date": "  02/18/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2004 Honda Pilot. The contact received notification of NHTSA campaign numbers: 14v700000 (air bags) and 14v351000 (air bags); however, the parts needed to do the repairs were unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repairs. The manufacturer was not made aware of the issue. The contact had not experienced a failure.", "fail date": "  02/10/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2004 Honda Pilot. The contact received a recall notification for NHTSA campaign number: 14v700000 (air bags) and stated that the part needed was unavailable to perform the recall repairs. The manufacturer was notified of the issue. The contact had not experienced a failure.", "fail date": "  02/05/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2004 Honda Pilot. The contact received notification of NHTSA campaign number: 15v320000 (air bags) and stated that the part was not available within a reasonable timeframe to schedule the recall repair. The dealer did not give a specific date for when the part would become available. The manufacturer could not provide an estimated date for when the contact's vehicle would receive the recall repair. The contact had not experienced a failure.", "fail date": "  02/02/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2004 Honda Pilot. The contact received notification of NHTSA campaign number: 14v700000 (air bags). However, the part to do the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure.", "fail date": "  01/13/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2004 Honda Pilot. The contact received notification of NHTSA campaign number: 14v700000 (air bags). However, the part needed to do the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure.", "fail date": "  01/06/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "2004 Honda Pilot. Consumer writes in regards to recent recall warnings related to its airbags.", "fail date": "  12/01/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2004 Honda Pilot. The contact received recall notices for NHTSA campaign numbers: 14v351000 (air bags) and 14v353000 (air bags). The contact received the initial recall notification in October of 2014, but the parts were unavailable. In addition, the contact stated that another recall notification was received in December of 2014, but the parts were still unavailable. The contact had not experienced a failure.", "fail date": "  11/04/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2004 Honda Pilot. The contact received notification of NHTSA campaign number: 14v700000 (air bags) however, the part needed to do the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was notified of the issue. The contact had not experienced a failure.", "fail date": "  11/01/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2004 Honda Pilot. The contact received a recall notification for NHTSA campaign id numbers: 14v351000 (air bags) and 14v353000 (air bags) and stated that the part needed was unavailable to perform the recall repair. The manufacturer was not notified of the issue. The contact had not experienced a failure.", "fail date": "  10/13/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2004 Honda Pilot. The contact received notification of NHTSA campaign number: 14v351000 (air bags); however, the part needed to perform the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was not notified of the issue. The contact had not experienced a failure.", "fail date": "  10/08/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2004 Honda Pilot. The contact received notification of NHTSA campaign numbers: 14v351000 (air bags) and 14v700000 (air bags) however, the part needed to do the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was notified. The contact had not experienced a failure.", "fail date": "  09/15/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Tl-the contact owns a 2004 Honda Pilot. The contact stated while driving approximately 45 mph, the vehicle was involved in a roll over vehicle crashed the air bags deployed and broke wife back. The vehicle has not been prepared. The manufacturer was not notified of the failure. The approximate failure mileage was 195,000. Kw.", "fail date": "  09/06/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Tl-the contact owns a 2004 Honda Pilot. The contact stated that while driving approximately 30 mph, another vehicle crashed into the passenger side of the vehicle causing the contact to crash into the median. The air bags deployed. The contained sustained a bruised eye brow and a black eye caused by objects that was ejected from the air bag that required medical attention . The vehicle was destroyed. A police report was filed. The manufacturer was notified of the failure. The failure mileage was 123,000. Ss.", "fail date": "  07/29/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Nhtsa recall #14v-353 issued on 19-June-2014, within 30 days of that date my vehicle was taken to my local Honda dealer who routinely performs my scheduled maintenance, I was advised at that time that the part was on order. I've been waiting for over one year and no change in availability has occurred. On 15-July-2015 I received a letter from Honda automobile division in California that if american Honda or my dealer has failed to remedy the defect in my vehicle \"within a reasonable period of time” (60 days after the date I first contacted the dealer for a repair appointment), I should then submit to the national highway traffic safety administration. Considering Honda has continued to manufacture this vehicle and since there does not seem to be a shortage of airbags for \"new\" vehicles, I find it concerning that I and many other loyal consumers should be needlessly placed in jeopardy.", "fail date": "  07/19/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "My car was running just fine I've had no issues the whole entire time I have owned it till now and I cannot put the key in the ignition it takes me like 10 minutes or more to put the key in and if I take the key out when I get to my destination it takes me 10 minutes or more to put the key in again just to drive somewhere else or back home. I'm pretty sure that it should be on a recall but I don't know what it would be. And it doesn't matter which way I put the key in it will not go in and I have three keys and each key does the same thing.", "fail date": "  11/26/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Key will not not turn in ignition to start car. Tried spare key and all suggestions from google, turning steering wheel, brakes, disconnecting battery. Locksmith charge to repair $300+, per comments on google better to replace or will happen again. Cost to replace $600+. Tried tapping around key hole with screwdriver & hammer while someone turned key, did not work.", "fail date": "  12/26/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Okay I've only owned this vehicle about 5 or 6 months when I first got it didn't have any trouble after about 2 weeks I noticed when I would back up and made like a growling sound but no trouble with the transmission drove it no trouble except for some electrical trouble for some reason my battery kept going dead at night it had a garage check it out and they said there's a short somewhere and we started pulling bulbs and fuses didn't find anything so I had to unhook the battery each night so I don't have to get a jump in the morning okay on to the next issue is no problems until this past Sunday the 7th of October and I had pulled into a country exxon station left it running ran inside the door for 2 seconds back out my car was gone hear it had jumped gear roll backwards and thank god it didn't hit anybody or hit the pump is stop within inches so I got in it put it back in park it was still running and try to put it in drive it when go so I shut it off waited 325 minutes started it up again it went into drive drove only about a thousand feet and then it would move and had to be towed home now I don't have any documents but I can but I can get them for murphy's garage but I can get them for murphy's garage and my.", "fail date": "  10/07/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "My 2004 Honda Pilot has been losing power. While I'm out on the road! three times in one month and then no lights are on on the dash. Runs great but it just loses power. While I'm driving! it almost killed me and my children while taking them to school.", "fail date": "  12/19/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The contact owns a 2004 Honda Pilot. While driving various speeds, the vehicle independently shifted into neutral without warning and the engine stalled. When the key was inserted in the ignition, it was able to be easily removed. The vehicle was taken to a local dealer (colonial Honda of dartmouth, 225 state road, dartmouth, MA, 02747), but could not be diagnosed because no warning indicators illuminated. The vehicle was not repaired. The failure was persistent. The manufacturer was notified of the failure and stated that the VIN was not included in any recalls. The failure mileage was approximately 130,000.", "fail date": "  06/14/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "When I stop, and turn off the motor, the key will not come out of the ignition. When it finally does, it sometimes (most of the time) wont go back in. When it does, it will not turn, thus, you cannot start the car. Sometimes it will turn on, and start the car, but most of the time, you have to sit in one spot, and wait til it gets ready. Im afraid that im going to get stranded every time I am able to leave the house. Especially with the upcoming cold weather.", "fail date": "  11/04/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Keys can be take out of the ignition key cylinder at any time, engine on or off, in park or reverse or drive. Seems like a worn out ignition cylinder.", "fail date": "  07/15/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Had my car serviced for 4 recalls: 12-056 -manufacturercampaignid:12-056 lighting switch harness wear, mfr campaign/safety recall notice:13-011 -manufacturercampaignid:13-011 shift interlock, mfr campaign/safety recall notice:16-047 -manufacturercampaignid:16-047 passenger airbag inflator. I went to pick up my car at the dealership and it was driven to me. I went home and it drove perfectly fine. Yesterday, I tried starting it and a couple things happened, as I inserted my key, it got stuck halfway or so. I pulled the key out and reinserted. It worked again. I headed out to work. Leaving work, it happened again, the key got stuck, I pulled it out, reinserted it, and repeated that a few times. The key finally went in. Later that evening, I was going to the store. The key inserted just fine, but then it wouldn't turn. The next morning, a repeat. This should be a recall.", "fail date": "  07/11/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "In 12/2015, the engine and vtm4 light turned on and concurrently, the car was difficult to drive as the engine revved and transmission shifted. Upon inspection by Honda, they found that the electrical wires in front and back were chewed on by rodents. They stated that the soy coated wires were a known issue and it should be covered by my insurance. State farm stated that it was not covered. I had to pay the total bill of $1,543. 33.", "fail date": "  12/21/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Tl- the contact owns a 2004 Honda Pilot. The contact stated that there was a progressing failure in which the key would not turn over to start the vehicle. The gears also failed to shift into park multiple times. The vehicle was taken to a dealer for diagnosis and repair. The contact was not included in NHTSA campaign number: 12v573000 (electrical system) and was unable to determine if the failure may randomly happen again. The manufacturer was notified of the failure. The approximate failure mileage was 174,171. Dyd.", "fail date": "  09/10/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Tl-the contact owns a 2004 Honda Pilot. The contact stated that while parked the key was inserted but failed to the start the ignition . The failure was persistent. The vehicle was able to restart after several attempts. The vehicle was not diagnosed or repaired. The manufacturer was made aware of the failure. The failure mileage was approximately 175,000. Ec.", "fail date": "  06/19/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Noticed an extreme hot spot on drivers side lower seat cushion when heated seats are on hi or lo. Spot is so hot that you cannot let it touch your pants without burning you. I have read many accounts of this same issue with other Honda owners that ultimately resulted in a fire. Now drivers side lower seat cushion heating element no longer works. Drivers side back and passenger side heating elements still work.", "fail date": "  10/01/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "We were on another summer trip and the airbag warning light came on. This is the big red light to the far left of the panel. Calling Honda in franklin TN they had no idea what could happen while continuing to drive the vehicle. Calling another dealership they assured me that it was most likely a sensor and the airbags would simply not deploy. Honda as recalls now for bad airbags. 1- our 2004 does not fall into the recall period 2 - Honda should pay for any issue related to bad airbag technology regardless of how old the car is, just like they do with seat belts. If we would have been in a wreck during the time that light was on, the airbag would not have deployed. 3- any part of the airbag/sensor/ seatbelt system should not be merely covered under a limited warranty. It should be covered for the life of the car. This is a safety issue. If they cannot stand behind the safety of the car they need to get out of the business.", "fail date": "  06/20/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Ignition lock-cylinder/assembly was defective and a recall was issued which the dealer did not honor. Ignition key could not be extracted. The vehicle was park in driveway and turned off to open gate. The key could not turn nor be extracted.", "fail date": "  05/03/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "When the driver side heated seat is turned on the seat gets so hot that it literally burns the skin on anyone sitting in the seat. It happens on both low or high setting. The seat then begins to emit smoke.", "fail date": "  10/15/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "When we turn on the seat warmer in the front passenger seat of our Honda Pilot 2004, we smell a strong odor of rubber or foam burning. Now our seat warmer will not work at all. We've stopped using the seat warmer due to concerns of a fire starting.", "fail date": "  09/07/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "On July 25 ,2013 around 8:00am am starting my 2004 Honda Pilot , to move my car to avoid parking tickets at 8:30am. After 5 minutes of warming the engine I decided to drive around to find a parking space to avoid a ticked. Around 8:14am I found a parking space and the car is parked. Later around 3:00pm I decided to go to my girlfriend house ,I see the my car parked and a free parking space in front of my apartment. To avoid tickets the next day I moved the car. Around 3:02 the car is parked in front of my apartment. Around 9:50 pm am walking home and I see the hood of my car open. The engine was all burned including headlights there was no wire everything melt. Neighbors where sitting outside as usual ,they told me that it started around 3:30 and that small amount of smoke was coming out of the left side of the engine . Fire department took like 15m !!!!to arrived. Car had 105,000 miles. I wasn't using the car that often ,the night before the fire I drove the car for 15 miles back and forward. My ensures don't cover fire . No more Honda thanks!!!.", "fail date": "  07/25/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The key was difficult to insert into the ignition. Once in, the key was then virtually impossible to remove. Furthermore will not turn as it is stuck in between off and accessory positions. Hours were spent jiggling, bringing a locksmith to make attempts at removing without success. The Honda Pilot had to be towed to dealership. This happened within 1 day of a serviced recall for the interlock lever which involves the ignition and the steering column shifter.", "fail date": "  03/29/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Tl- the contact owns a 2004 Honda Pilot. The contact stated that she received notification of NHTSA campaign id number: 12v573000 (electrical system) and took the vehicle to the dealer for service. The dealer advised that they would not repair the vehicle because the shifter interlock did not need to be replaced. The vehicle was not repaired per the recall. The manufacturer was not notified. The contact had not experienced a failure. The current mileage was 113,000. Kmj.", "fail date": "  02/14/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The contact owns a 2004 Honda Pilot. The contact received notification of NHTSA campaign numbers: 12v573000 (electrical system) and 14v700000 (air bags); however, the parts needed to perform the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was notified of the issue. The contact had not experienced a failure.", "fail date": "  02/08/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "When turning on the driver's side seat warmer it got extremely hot. Recently it actually burned the seat foam and began to smoke. I will not use it anymore for fear of a fire. Thank you for looking into this issue.", "fail date": "  01/02/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Drivers side back powered window does not work. It went down automatically and does not go up while driving automatically. Almost caused a car crash.", "fail date": "  11/20/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Driver seat heater gets extremely hot to the point that burns are possible. Afraid that a fire may occur so stopped using. There appears to be a widespread occurrence when searching the internet. No recall by Honda.", "fail date": "  11/01/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Pilot rolled away while it was parked, I had key in my hand, it hit a concrete flower pot. Damaging my right fender bumper mirror. Policeman got inside Pilot took key in and out of ignition several times,while it was in gear. I drove the car to Honda dealership told them what happened. They admitted it should not do that, but did nothing to help. After hearing of recall in Jan. I contacted Honda about the incident telling them they should fix my Pilot since it was there fault this accident happened. They had me send them information about what happened. The police report ect. They had me take the Pilot to dealership and leave it 5 hours. When Honda called me back a week later they refused to take responsibility for accident because the key does not come out of ignition when dealership had it, it does not do this all of the time , but it did happen in July 2012 long before I knew about recall and I have police report and witness to prove it did. My insurance has gone up because of accident plus I have to pay deductible, when this was not my fault. Honda has recall on Honda so how could they not be responsible? could you please help me with this?.", "fail date": "  07/12/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The contact owns a 2004 Honda Pilot. The contact stated that while stopped in a parking space, the key was removed from the ignition and the contact noticed that she had not shifted the gear in park. The vehicle was taken to an independent mechanic for diagnostic testing. The mechanic stated that the brake switch would have to be replaced. The vehicle was repaired however, the failure persisted. The vehicle was not further repaired. The approximate failure mileage was 180,000.", "fail date": "  02/15/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Drivers heated seat caught the seat on fire.", "fail date": "  11/02/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "On my 2004 Honda Pilot, the srs (airbag) warning indicator light on the dashboard mysteriously remains on even though there have been no other changes to the vehicle. The Honda dealer wants $80 just to look at it! this is outrageous; it's clearly a failed component that should be covered under the safety portion of the vehicle's warrantee for the lifetime of the vehicle. There are many other Honda owners who have experienced this warning light and they report it is nearly always a failed passenger seat sensor that Honda is replacing under a TSB; however my local dealer claims to know nothing of the TSB and want me to pay for this.", "fail date": "  07/05/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Key could be removed without vehicle being in park. No damage occurred, but car did roll at times. Vehicle was repaired by dealer at a cost of $446. 03, (10/05/11, 163538 miles). Dates and mileage of first occurrence are approximate.", "fail date": "  02/08/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Overheating of drivers side seat heating elements, followed by failure of units.", "fail date": "  12/19/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "I have a 2004 Honda Pilot and I am having the same problem that a lot of the Honda cars are getting recalled for but my vehicle is not listed. You can remove the key while the gear selector is not in park. My wife rolled forward and hit a safety pole. She is always afraid of doing it again with our kids in the car. I called Honda about the repair and they said it was not a recall. I don't understand how some Honda cars can get recalled but mine will not. I called Honda and asked about the cost of the repair and they told me it was going to be expensive.", "fail date": "  04/01/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Dear sir/madam,\nmy 2004 Honda Pilot has 58k miles on it. I scheduled a 60k major maintenance on 3/19/2010. But on 3/18/2010 on my way back home, the check engine light was on, the car got vibration and smoke. I sent my car to the dealer immediately at about 7:00 pm on 3/18/2010. On 3/19/2010, the dealer called me and said the no. 5 spark plug came out and burned out the coil, it's a very unusual situation. I went to the dealer to check the damages: the spark plug only has the metal portion left, the coil burned out and only 1/3 or 1/2 left, the cylinder head got some damage too and some metal chips remained in the cylinder head and cylinder. I did the oil changes and maintenance at dealership regularly and drove the car gently. I don't think this incident is related to my driving style. It has to be quality issue on either the coil or the spark plug. But I am not a mechanics and don't know if this happened to other cars. Although the car is out of warranty (3 years/36k miles), I really think it's a serious quality issue. Honda needs to take care of this issue. I am unlucky, this happened to me, I am lucky, it happened to me not on highway. Hope the authority can do some investigation and urge Honda to resolve this issue. Thanks.", "fail date": "  03/18/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "2004 Honda Pilot SUV 9/9/2008 front ac blower resistor replaced $230 (miles 68,197, also had 100 miles bumper to bumper warranty but was told by dealer it was not covered. 1/25/2013 (miles 134,000) front ac air mix motor replaced $501,rear ac/heat does not work was still in 100 mile warranty it has a bad blower resistor I still have not replaced it. To top it off when it rains my driver and now front passenger floor mats are getting wet from the underneath the protective mat (miles 105,000)! your attention to this above matter is most appreciated.", "fail date": "  09/09/2008"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Honda Pilot engine light keeps coming on. Since purchase date of 10-12-04 it has been in the Honda service dept 3 times. Engine light keeps coming on and cylinders are misfiring causing the Pilot to lose power while driving. After stopping and turning off the engine for awhile it will start up again and usually the engine light will not come on again. This has happened 3 times since it was in the Honda service dept.", "fail date": "  10/16/2004"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Consumer experienced hard starting and other mechanical problems. The dealer indicated that this was normal and made no repairs to the vehicle.", "fail date": "None"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Transmission failure. Will not change gears or accelerate.", "fail date": "  05/23/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Car accelerating on its own.", "fail date": "  04/18/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Engine motor mount failed at 16 years and 70000 miles.", "fail date": "  07/26/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The contact owns a 2004 Honda Pilot. The contact stated that the engine warning light illuminated and when the vehicle was in first gear and attempting to place the vehicle in second gear, the gear would seize in first gear and was unable to shift into second. The contact stated the vehicle was previously repaired for NHTSA campaign number: 04v176000 (power train) however, the failure recurred. The contact took the vehicle to the dealer who diagnosed the automatic system, the automatic transmission, system, and the clutch failed. As a result, the transmission needed to be replaced. The vehicle was not repaired. The manufacturer was made aware of the failure. The approximate failure mileage was 200,000.", "fail date": "  04/18/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Hello. After smelling gasoline type fumes off for some time (no one else in the family could smell it) and after consulting the Honda Pilot forums, I decided to replace the factory ngk pzfr5f-11 spark plugs at 99,430, rather than the Honda recommended 105,000 miles. I was surprised to discover that the middle rear plug was only finger tight and as a result combustion gasses were escaping between the plug and the head. According to what I read, loose plugs are an issue with this engine and can eventually damage the cylinder head and coil packs, leading to costly repairs. A second plug (passenger rear) was excessively tight when I removed it but the replacement plug appeared to thread back in fine. ) I believe this issue deserves further investigation. Thank you. Frank j. Leskovitz.", "fail date": "  05/08/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The contact owns a 2004 Honda Pilot. While driving at various speeds, the rpms revved and the gauge reading fluctuated without warning. In addition, when the brake pedal was depressed, the vehicle violently jerked forward. The vehicle was taken to an independent mechanic, but the cause of the failure was unable to be determined. The failure recurred on three separate occasions. The manufacturer was not notified of the failures. The failure mileage was 133,000.", "fail date": "  07/12/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Steering wheel locked, key would not turn nor come out, gear could not be changed. Vehicle would not start. Pilot's ignition would not work at all.", "fail date": "  05/02/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Having manufacturer's recommended maintenance done was given notice that both front motor mounts are cracked and need to be replaced. This seems to me to be unusual and while no incident has occurred it does not seem to be a safe development and could cause some significant problem if not replaced or is not discovered and the vehicle were involved in a crash.", "fail date": "  01/09/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "While vehicle is at idle,vehicle mis-fires and shakes entire vehicle. Placed on o. B. D. Scanner and no errors or codes found. Brought to dealer and dealer also cannot find problems. Changed spark plugs twice,no leaks,no cross contamination nothing. . . But poor gas mileage and bad shaking at idle. . .", "fail date": "  08/01/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "On July 25 ,2013 around 8:00am am starting my 2004 Honda Pilot , to move my car to avoid parking tickets at 8:30am. After 5 minutes of warming the engine I decided to drive around to find a parking space to avoid a ticked. Around 8:14am I found a parking space and the car is parked. Later around 3:00pm I decided to go to my girlfriend house ,I see the my car parked and a free parking space in front of my apartment. To avoid tickets the next day I moved the car. Around 3:02 the car is parked in front of my apartment. Around 9:50 pm am walking home and I see the hood of my car open. The engine was all burned including headlights there was no wire everything melt. Neighbors where sitting outside as usual ,they told me that it started around 3:30 and that small amount of smoke was coming out of the left side of the engine . Fire department took like 15m !!!!to arrived. Car had 105,000 miles. I wasn't using the car that often ,the night before the fire I drove the car for 15 miles back and forward. My ensures don't cover fire . No more Honda thanks!!!.", "fail date": "  07/25/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Transmission fail-description of problem: heat build up between the countershaft and secondary shaft second gears in the automatic transmission, eventually leading to gear tooth chipping or gear breakage. Contacted Honda and was told that there were no recalls for this VIN and because the service work was not completed by Honda they claim no responsibility for their design flaw. A very expensive engineering/design problem that was flawed from the beginning and then burdened/blamed by Honda on the consumer.", "fail date": "  06/03/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Honda service advisor reviewed the completed shift interlock recall service with me and said the front and side engine mounts were broken. He informed me that this is a safety issue and they needed repair. Cost to repair is $435 for front mounts and $220 for side mounts. There are a number of engine mount failures reported on this website. This is a safety issue as well as a design/engineering defect/flaw and should be repaired on a recall at Honda's expense.", "fail date": "  04/09/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Noticed slight vibration of the engine while sitting in driver's seat at idle. I thought it was an ignition problem. No engine problems were diagnosed at a repair facility. At a later date while my vehicle was at an authorized Honda dealer being serviced for an unrelated NHTSA safety recall notice 12v-573, I was informed that the front, side, and rear engine mounts were broken. I had them replaced at my own expense. I later read on the internet that there are an alarming number of Pilot owners with similar mileage reporting broken engine mounts. This appears to be a serious manufacturer safety defect. A recall should be issued and owners who have already replaced the engine mounts should be reimbursed.", "fail date": "  03/19/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "My 2004 Honda Pilot has a shudder at 30 mph. It feels as though you are driving over the rumble strips. I am starting to experience poor shifts at other speeds now as well. I understand that the problem is most likely the result of a faulty torque converter. Repairs include replacing the torque converter and the transmission as well as updating the pcm. Honda recalled over a million 2003/2004 Pilots but my VIN is just passed the last VIN recalled. However, there are many 2005 Pilot owners experiencing the exact same failure. Acura also issued a service bulletin that repairs the faulty components for all 2003 and 2004 mdx owners (inside and outside of warranty). Honda should take responsibility for the failed transmissions in the later 2004 Pilots and 2005 years as well.", "fail date": "  05/09/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "My engine mounts on my 2004 Honda Pilot went for the second time. My car has 115,000. I purchased this car new from the Honda dealership and kept up with all the maintenance.", "fail date": "  02/09/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Went to dealer and they said vehicle has bad engine mounts, and need to be replaced. Note that we also have a 2003 Acura mdx, and the dealer also told us that some engine mounts needs replacement. We checked some blogs for Acura mdx and Honda Pilot owners, and found a lot of owners with same issues. Some are being replaced every two years. We onwed a v6 Toyota for 15 years, never had this issue. We hope NHTSA will check this, because it is a known issue to owners and Acura/Honda will never admit. I'm sure if NHTSA will get repair records for this \"engine mount\" issues, it will be a lot. From what I read, this affects drive shafts due to excessive movement of the engine.", "fail date": "  01/31/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Front engine mount found damaged and recommended replacement at $450 by Honda service. Driven 91k miles, and seems like a lot of others are reporting same issue at same mileage.", "fail date": "  08/23/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Honda dealer indicated during routine oil change that front engine mount is cracked and needs to be replaced. The engine mount is one of the very important parts that secure the engine and Honda must take action to ensure that the part is safe and not creak and get weak. This is a serious safety hazard and Honda should make an effort to investigate and recall and replace the engine mount in all those vehicles which are affected.", "fail date": "  08/19/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Front and side motor mounts on 2004 Honda Pilot need replacement after only 89k miles of city driving.", "fail date": "  06/01/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Tl-the contact owns a 2004 Honda Pilot. The contact stated the throttle assembly was replaced due to sticking. The contact stated the throttle assembly made it difficult to accelerate due to the accelartor getting stuck. The contact did not have inform the manufacturer. The failure mileage was 136,000. The VIN was not avaiable. Jo.", "fail date": "  04/14/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I own a 2004 Honda Pilot and was told when I got an oil change at 90k that the engine mounts were cracked and needed to be replaced. Seems like this should be a recalled part if it is that common.", "fail date": "  10/01/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I have a 2004 Honda Pilot. Honda dealer technician informed me that the front and side engine mounts are cracked and need to be replaced. I never heard of this from anyone. I checked internet for other Honda owners. There are a number of reporting with the same problem. Should this not be a part defect?.", "fail date": "  09/19/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Honda Pilot 2004; motor mounts failure noted in 8/09.", "fail date": "  08/27/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Informed by the dealer that the motor mounts on my 2004 Pilot were cracked and that I would start to notice this in vibration of the vehicle. Dealer told me that this was something seen quite often in the Pilot and odyssey. 2004 Pilot with 91k miles.", "fail date": "  07/09/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I have 2004 Honda Pilot ex-l with 100,000 miles. Today I noticed the drive light blinking on my way home from work. After I arrived home, I stopped the engine and restarted and I did not blink again. What should I do with this?.", "fail date": "  06/18/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Engine motor mount needed replaced to pass pennsylvania inspection.", "fail date": "  06/14/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Broken engine mounts front & passenger side.", "fail date": "  05/06/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Dealership service staff informed me that my 04 Honda Pilot needs two motor mounts (front and right side) replaced. I have heard that many other Pilot owners have had the same issue. With just 75k miles, and the knowledge that this sounds like a common issue, I would think that a recall is in order. I have never had to replace motor mounts on any other vehicles I've owned: 72 opel manta; 79 chevy malibu; 80 and 88 Toyota corolla's; 83 olds cutlass; 94 Geo prism; 98 Toyota camry. I have not had them replaced as yet, but the dealership replacement charge is estimated at $547. 00.", "fail date": "  04/22/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I've had vibration/noise issues around 40 mph while in top gear, I've noted accelerating forces a downshift, or I can manually shift to d3. Either action gets rid of the problem.", "fail date": "  03/02/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "2 engine mounts requiring replacement at 85k miles on 04 Honda Pilot. Honda dealership cost to repair is $499. Discovered many other Honda Pilot owners with same problem and questioning whether this is a defective part and should be a recall.", "fail date": "  01/03/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Told by Honda technician that two of the four motor mounts are damaged and need replacement.", "fail date": "  12/10/2008"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Defective motor mount 2004 Honda Pilot - severe steering wheel vibration.", "fail date": "  03/11/2007"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The contact owns a 2004 Honda Pilot. The contact stated that the vehicle failed to start. The contact also stated that the air bag warning light illuminated. The vehicle was taken to a dealer, but was not diagnosed or repaired. The failure recurred on numerous occasions. The VIN was included in NHTSA campaign number: 14v351000 (air bags); however, the part needed to repair the vehicle was unavailable. The manufacturer was not notified of the failure. The failure mileage was unknown.", "fail date": "  04/15/2006"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Confirmed with local mechanic that the rear cross member of the sub-frame needs to be replaced immediately. Badly rusted and is a safety issue.", "fail date": "  10/03/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "My hood latch isn't holding when I'm highway driving at 60mph. The hood will pop open. I've seen the new recall on the news for the newer vehicles but it is also happening on my 2004. I believe that year needs to be added to the list.", "fail date": "  11/04/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "While on the 605n freeway close to the 10 freewaysplit our entire sunroof which the glass and cover ditached from our vehicle and flew off. Luckily the car behind was not hit from what I see in the recording but we can't see if it flew on the other side of the freeway. My children were seating in the middle row and small debri hit their face. We pulled over to the emergency side of the freeway to check damage. All that's left from the sunroof is the glue.", "fail date": "  12/08/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Major rear end corrosion. Frame & where rear end connects to body. Told by 2 body shops & an auto mechanic to stop driving. The back end could drop out.", "fail date": "  10/30/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Floor on driver side and passenger side is soak.", "fail date": "  02/10/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Takata recall. The contact owns a 2004 Honda Pilot. The contact stated that the passenger side of the dashboard had disintegrated. The vehicle was taken to the dealer, but was not diagnosed or repaired. In addition, the contact received notification of NHTSA campaign number: 16v344000 (air bags), but the dealer stated that the part was not available. The manufacturer was notified. The failure mileage was 180,000. VIN tool confirms parts not available.", "fail date": "  07/07/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Rear spoiler (with 3rd tail light and washer nozzle) fell off while driving.", "fail date": "  07/02/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Our Pilot front passenger floor gets soaking wet when it rains! our car is parked in a driveway and stationary. After a rainstorm is when we find the soaked carpeting on the passenger side of the car. The water seeps under the passenger seat where mold can form. The seats are difficult to remove and the area can't be vacuumed effectively. There seems to be either faulty harness plugs or another area in front tire flaps that the company didn't seal resulting in soaking wet carpets that can show signs of mold. I have very bad allergies and this is not acceptable. I also have my children, grandchildren and sometimes great grandchildren in this car and I'm afraid that any mold could compromise our health! why isn't Honda taking care of this issue when there are literally hundreds of complaints online concerning this issue? we have been having this issue for the last three years and it's getting ridiculous. There are hundreds if not thousands of this same complaint online!.", "fail date": "  10/30/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "The rear hatch has to be lifted manually and held up at all times or it will crash down on you with the full weight of the hatch. I had to use both of my hands to get it opened. I had to physically hold it up to access anything in the back. It's extremely heavy. I was worried it would come crashing down on my back, head or arm, causing serious injury. The vehicle was parked, no engine running. This is not a remote open hatch.", "fail date": "  10/08/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Accident on the freeway the car sped out of control hit the center divider. Front and side air bags went off! the steering wheel airbags scarred the inside od my wrist.", "fail date": "  03/15/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "On July 25 ,2013 around 8:00am am starting my 2004 Honda Pilot , to move my car to avoid parking tickets at 8:30am. After 5 minutes of warming the engine I decided to drive around to find a parking space to avoid a ticked. Around 8:14am I found a parking space and the car is parked. Later around 3:00pm I decided to go to my girlfriend house ,I see the my car parked and a free parking space in front of my apartment. To avoid tickets the next day I moved the car. Around 3:02 the car is parked in front of my apartment. Around 9:50 pm am walking home and I see the hood of my car open. The engine was all burned including headlights there was no wire everything melt. Neighbors where sitting outside as usual ,they told me that it started around 3:30 and that small amount of smoke was coming out of the left side of the engine . Fire department took like 15m !!!!to arrived. Car had 105,000 miles. I wasn't using the car that often ,the night before the fire I drove the car for 15 miles back and forward. My ensures don't cover fire . No more Honda thanks!!!.", "fail date": "  07/25/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "We first noticed in oct. 2012 that the carpet and mat floor boards on both the front driver and passenger sides of our car were wet with water. It is now Dec. 2012 and the problem has worsened. The wet carpet is causing a mildew smell in our car which we cannot get rid of, as the carpets are getting wetter each time it rains. The car also fogs up constantly due to the inside moisture, making visibility extremely difficult. Once the temperature drops the wet floors are sure to freeze, thus causing another hazard: slippery feet near the break and accelerator. It is reasonable to suppose that there will be rust and eventual deterioration if the problem is not fixed. There seems to be a structural problem with the car on both sides where there is water dripping in from possibly the wheel well or right above the wheel well. In looking on line, we see several Honda Pilots and ridgelines with exactly the same problem, improper structural seals breaking down and causing water to drip onto the floorboards of the car. Honda is aware of the problem (we called our dealership) but will only fix it if the car is still under warranty. Seeing that this is a safety issue, and a known common structural problem with the car, it would seem to me that Honda should fix the problem.", "fail date": "  10/01/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Vehicle veered of the road and struck a tree, dead on the front left headlight and destroyed the bumper and front left fender, pushed the hood into the windshield, which cracked. The air bag did not deploy. Bruising from seat belt.", "fail date": "  05/24/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "My 2004 Honda Pilot started to leak water in both passenger and driver side. Both the passenger and driver carpet is getting soak and wet. I took it to david mcdavid Honda dealer, at irving, TX. They could not figure out where the water is coming from . They want to keep the car for an entire day to see what causing this issue. They want to charge $99. 00 per hour. (very expensive option. . . I would say). I went online, there are hundreads of people seems to having the same issue with water leakage with Honda Pilot. I am trying my best to keep the car dry but my concern is that water leackage might cause to get mold inside the car, which is major health hazard. I already saw the rust under the carpet( some part of carpet look red rust spot). Was there a recall on that issue? is Honda treating this problem as a structural defect? thanks.", "fail date": "  12/01/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "One of the two nuts that hold on the rear license plate onto the car sheared off due to normal usage, I. E. Normal closing of the rear door. The two nuts are tack welded directly to the thin body metal and apparently the repeated shock of closing the rear door can cause metal fatigue and the nuts to shear off with the body metal, resulting the license becoming unsecured to the vehicle. Potential safety hazard since if the owner does not notice the first failure, the metal fatigue will be accelerated by the additional torque stress and failure of the second nut could cccur while the car is in motion. Multiple incidents of this failure have been reported on the internet blogs since 2007.", "fail date": "  10/12/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "I took my 2004 Honda Pilot for service today and during the inspection the Honda dealer found that the front engine mount and the passenger side engine mount had both failed. The engine mounts should last the entire life of the car. It is a non-moving/non-wearing part. I read several websites where people complained about the Honda Pilot's engine mounts failing. This problem seems to be a failure in engineering and should be corrected by Honda. Your assistance is appreciated.", "fail date": "  05/11/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Severe corrosion appeared around the vehicle's front windshields and I am very concerned that this will loosen the adhesive and cause the windshield to come loose unexpectedly. The corrosion is clearly a manufacture defect since it came from the inside of the windshield frame and there is no external damage to it and windshield has never been replaced.", "fail date": "  04/01/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Water leaks in every time it rains and gets both front carpets wet. Honda denies the problem; I know im not along because others can be found on the web. I also know that this is a body seem failure but Honda wants to charge you hundreds because it's out of warranty.", "fail date": "  03/06/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "I and my family have been loyal Honda owners since 1984. In those 25 years we have purchased 8 Honda automobiles. Until recently the service and support provided by Honda and its dealers has been exceptional. That was all until our most recent vehicle, a 2004 Honda Pilot. It is a vehicle my wife and I love but one that has had a high level of irritating small problems. The latest problem involves the mounting structure for the rear license plate. The metal holding the two welded on mounting nuts is so thin that after several years of vibrating the metal backing simply breaks away. In seeking a repair to the problem my local Honda dealer had no clue as to how to repair the problem and his only remedy was to send me to a local retail body shop for a $234. 00 repair. My local dealer indicates he was not able to obtain repair support from the factory because these problems are due to the use of heavy license plate holders. In response to that defense let me state the following:\n1. Research on the internet quickly reveals that the Honda Pilots have had this problem for several years. Dozens of Honda owners have had the same problem. 2. Honda regional representatives have accepted responsibility in some cases and not in others. 3. The heavy license plate frame being blamed is an item supplied by the dealer at time of purchase and does not represent an extra heavy burden. 4. The license plate has vibrated upon closing the rear hatch from day one of purchase. It is the nature of the design using only two mounting points. 5. The fact that the license plate and frame can suddenly fall from the vehicle and bounce into the following traffic represents a safety hazard which Honda should have warned owners of when they first discovered this problem.", "fail date": "  06/28/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "2004 Honda Pilot - inside compartment water leak. For 2 years we have had water coming in the front foot wells. We have had the car looked at by different dealerships and private repair shops. The dealerships said it was the windshield, which we have replace twice, and the private repair shop sealed all areas that come into the car. I've call Honda corporation twice and have complained. They said that they haven't had enough calls on this problem to make it a recall. There are plenty of people on line (Honda. Org) that have complained about the same problem. Most people don't realize that the water is coming in until the carpets are soaked.", "fail date": "  01/01/2008"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "There is a audible vibration in my '04 Honda Pilot when I drive at about 1400 rpm. It sounds like a strong wind noise, like some sort of cover vibrating. It is intermittent. Once the rpm goes beyond 1600rpm, these vibrations rarely happen. I took the car to the dealer and they replaced the entire exhaust line, including the catalytic converter. The vibrations continue to happen. The vibration seems to come from the underbelly of the car, right in front of the passenger compartment.", "fail date": "  11/12/2006"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "2004 Honda Pilot - purchased a brand new vehicle from the dealer that I am referring to in this complaint - the problem: a serious water leak problem on passenger side floor. It has gone through warranty work within first 10000 miles but the dealer could not find the water leakage problem after 8 hours of work in their body shop. The vehicle experiences a severe water leak problem in to the passenger floor every winter season (in pacific northwest, rainy season is the winter season) ever since the warranty work (that they could not find any root cause) was done in 2004. I recently called the same dealer and they said it is out of warranty and I need to pay a considerable deposit even for the dealer service department to take a look at something that they could not fix back in 2004 as a warranty work. With this serious interior water leak condition, the vehicle starts to smell bad inside and takes a lot of effort (my own time in every winter) to soak up water off the carpet floor inside of my Pilot every time it rained. I am not sure what the extend of the residual damage it may have on my vehicle that I cannot visibly see where the leak is coming into inside of the vehicle but it certainly will bring down the value of my Honda Pilot in case I want to trade or sell. This is totally unacceptable situation for the Honda Pilot owners to tolerate. I need to go out there and soak up more water out of my Pilot after I submit this complaint.", "fail date": "  09/15/2004"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Confirmed with local mechanic that the rear cross member of the sub-frame needs to be replaced immediately. Badly rusted and is a safety issue.", "fail date": "  10/03/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "I bought this 2004 Honda Pilot new in 2004 in louisville. In 2018 I drove to florida without incident. While here in florida I have had a problem with oil leaking. Than the compressor for the air went out and I took it straight to the dealer here. They told me it was not worth fixing. Since then I have had 2 mechanics look underneath the car and said it was so rusted that the frame was dangerous and they could not risk fixing it. I have checked with other Honda owners only to find out this is a problem with numerous Honda years and no one fix this problems because of liability . I have photos of the rusted out rearend and the frame is not attached. You can find owners trying to weld the rearend back on. No one will repair my compressor because of the rust and damage. When I had it at the dealers they did not mention this problem at all. They just said it was not worth fixing. My car has about 200000 miles but has has its service. This has to be a major recall or replacement. We could have had a major accident over this and didnt know dena feima smith 9554 routt rd louisville ky 40299 502 645 1338. Please call or forward communication. Kylawpublishing@msn. Com.", "fail date": "  05/12/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Rinsing with water of the undercarriage after exposure to salted roads after snowfall (routine practice) I noticed flakes of rust beneath the rear of the vehicle. I crawled under the vehicle to observe extensive corrosion of the cross member that the rear suspension struts are attached to. The rear driver side area where the strut is connected is corroded to the extent where the mount is partially eaten away and a large hole has formed. The other strut mounting area is charting the same course and is substantially corroded. Should a strut disconnect from the vehicle a loss of control would occur. The approximate mileage of the vehicle is 107000. No other parts of vehicle appear to be corroded to a level approaching the rear. I will look at the front end to inspect more closely for corrosion damage and to take pictures. Vehicle was parked (stationary) when the corrosion was observed.", "fail date": "  02/17/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Rear suspension cross member support rusts out due to design. Over time water is thrown from tire and rests in the support nut area. Over time rust builds up and the support breaks through the rear cross member. No way for the water to escape. I am supplying one picture of my car showing where rust has started. Two additional pictures are from the shop fixing my car for another issue showing another customer with the same issue, but much worse. You cannot buy the cross member due to how the car is made. So the fix is to cut out the rust and weld in a new support. The car shop will rust proof and put a water resistant foam over the new support nut ensuring the rust will not return. My cost of this repair for both sides is just shy of $2000. My opinion is this is a factory design flaw that should be addressed by Honda. No recalls for this issue exist, and you are talking about the back end support potentially collapsing as you are driving. The issue was caught by the transmission shop doing other work on 12/18/2018. They just fixed the other customer's Pilot (2004) with the same issue (pictures I attached) and had the foresight to look at my 2004 Pilot. So for safety reasons I have no choice but to have them apply the same fix.", "fail date": "  12/18/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Rear strut mount on frame is torn, when driving and hit small bumps makes a clunk noise.", "fail date": "  12/08/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Tl-the contact owns a 2004 Honda Pilot. The contact stated that while driving a unknown speeds there was a abnormal popping noise. The contact stated that upon inspecting underneath the vehicle noticed the rear axle was detached. There were no warning lights illuminated. The local dealer was not contacted. The vehicle was not diagnosed or repaired. The manufacturer was notified of the issue and provided case number 08790702 and referred the contact to the local dealer. The failure mileage was approximately 300,000. Ap.", "fail date": "  06/25/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Rear end suports totally fell out from rust.", "fail date": "  06/10/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Driving on over railroad tracks and heard loud clunk . Control was a major issue after. When I stopped the vehicle to inspect , I saw the following. Both rear wheels tilted inward at the top. I inspected underneath to find the rear sub-frame anchors had pulled through the uni-body. Called the manufacture and no assistance due to mileage and age and living in a salt belt state. Other manufacturers are recalling vehicles for frame rust issues . This is basically the frame of this vehicle. . . . . And the overall condition otherwise is great. This should not happen!.", "fail date": "  05/27/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "While driving over a bridge expansion joint I heard a loud bang, the abs and vtm 4 lights came on ,and it started having a severe vibration . The rear uni body frame ,for the rear sub frame, mounting points pulled out of the frame. The rearward sub frame had dropped down about 6 - 8 inches. The inside of the frame has rusted away, on the inside.", "fail date": "  03/17/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Rear mounting points for rear suspension subframe rusted out, allowing the subframe to become detached at two of four mounting points. Subframe rotated down until stopped by exhaust system, detaching wiring for anti lock braking system. Failure occurred while driving on secondary road at 40-50 mph.", "fail date": "  11/18/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "I had a very serious mechanical failure after hitting a bump on a dirt road only going 25 mph. All 4 of the rear axle mounts failed causing the rear of the vehicle to drop and the tires to spread. This could have been very dangerous if I was going faster or hit the bump on the highway. We had been noticing a clunking sound coming from the rear of the vehicle but couldn't figure out what it was. So, perhaps one or two for the mounts had all ready failed before this final failure. We bought this vehicle new in 2004 and it has never been in any accident nor driven off road. It is a michigan car so it has been exposed to road salt perhaps contributing to the rusting of the mounts. But, under no circumstance should this occur. After doing an internet search I was only able to find two other instances of this happening. As these vehicles get older more may happen if it is a design flaw.", "fail date": "  03/20/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Accident on the freeway the car sped out of control hit the center divider. Front and side air bags went off! the steering wheel airbags scarred the inside od my wrist.", "fail date": "  03/15/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "2004 Honda Pilot driver side rear subframe crossmember rusted and falling apart. Started to rust around 2010 then worst at 2019. Only the driver side is rusted and bad. The passenger side has no issues.", "fail date": "  01/29/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "The contact owns a 2004 Honda Pilot. The contact stated that while driving 20 to 40 mph the front of the vehicle shudders violently. The vehicle was taken to the dealer multiple times but they were not able to diagnose the problem. The manufacturer was made aware of the failure who did not offer any assistance since the vehicle was no longer under warranty and advised the contact to take the vehicle back to the dealer. The failure mileage was 125,000.", "fail date": "  10/26/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "Started at approx. 70,000 miles. Car shutters/vibrates (as though going over a soft rumble strip) when going approx. 45 mph. Stops once I let off gas or accelerate. Initially happened only once in a while. Now it happens consistently.", "fail date": "  01/01/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "In approximately early 2006, I noticed the front wheels would shimmy when I applied the brakes at higher speeds. Typically it would occur as I was driving down steeper grades in the mountains. I brought this to the attention of the Honda dealer in April 2006 when the vehicle had 35,418 miles. The Honda dealer dismissed it and said it was probably due to the front wheel still wanting to provide power while the brakes were applied. Consequently, the brake system checked out fine during their inspection. Unfortunately, the problem still persists and is getting worse. I've also now noticed the problem when I drive on flatter surfaces as well. The problem is most noticeable when stopping at speeds over 50 mph and is even more pronounced when driving down hills. My concern at this point is that the vehicle will become unstable because of the excessive shimmy that occurs in the front wheels while braking at higher speeds or on an incline.", "fail date": "  02/01/2006"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "When ever I hit the brakes on my 2004 Honda Pilot exl there is a thumpping noise. I have complained to the dealer about it and he says that is normal. I have researched on the web and there are severral people complaining about the same problem.", "fail date": "  02/16/2005"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "My 2004 Honda Pilot has a continuous vibrating problem at 75 mph. Several solutions have been attempted, but nothing fixes this problem.", "fail date": "  02/01/2005"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "At speeds exceeding 70 mph there is a vibration which can be felt through the steering wheel, gas pedal, and at times the floor of the whole vehicle. This usually occurs at 73-74mph. After repeated services and balancing of tires the dealership took the tires to perform a road force test. This ruled out the tires causing the problem. After the 4th attempt to correct the vibration a Honda case manager said that it could be a \"characteristic of the vehicle\". This was not mentioned by the sales person at the time of purchase and I believe it is a defect in the suspension or drivetrain. I found many others have had this complaint. . Read more...\n", "fail date": "  04/30/2004"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Went to go trade my car in and I was told that the car-fax is showing a potential odometer rollback indicated, I have made a few calls and I am not getting any help. I am very concerned and would like some help with this please thank you.", "fail date": "  07/10/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "When getting work done by licensed mechanic, I was told that there was a problem with the rear frame being soo rusted that the shock absorber was not attached because there was nothing left to attach it to. I was told they couldn't fix it and I should consider getting rid of it.", "fail date": "  05/12/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Convertor spitting metal which lead to my transmission going bad.", "fail date": "  08/23/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "While driving my Honda Pilot I noticed the mileage was reading more then I went. I'm not sure how to go about this but I think this is unfair. ,.", "fail date": "  03/02/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Malfunction lamp is on and airbag light coming on when hooked up to a device it said nothing was wrong for the maintence light to be on then the malfunction lamp came on. It was stationary.", "fail date": "  11/23/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Ignition. I am unable to get my key to turn in the ignition to turn the vehicle on. Sometimes I cannot even get my key to go all the way in as well. Stationary.", "fail date": "  10/01/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Odometer fraud, this vehicle was auctioned on Mar 14,2017 with odometer reading 222,805m and sold to second owner by tampering the odometer to 122,927 on Apr 17,2017. I purchased this Honda Pilot on Sep 23,2017 with the odometer reading 125,715. I have not registered the vehicle to dmv, this need to investigate and seeking help to get out of this deal. I tried calling odometer fraud services 202-366-4761 but no one is receiving my call.", "fail date": "  09/23/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Hasn't been in an accident that I know of. Just bought it in March of 2017.", "fail date": "  03/09/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Ignition key gets stuck in the ignition and does not turn. Several people have complained about this problem, but Honda is charging for the known defect in the tumbler system used with their special key system. People are told that this is normal wear, but this does not make sense that all cars expire at the same time and the fix involves replacing the entire ignition including the keys, leaving the owner with one set of keys for the doors and a new set for the ignition. My question, if the keys are worn, how do they still work for the doors. Once the switch is broker, the car will not start and the key feels like it is the wrong key.", "fail date": "  09/08/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "While driving to work this morning (cold morning, on city street) I turned my driver seat heater on high. The driver side seat heater was on for about 20 minutes when suddenly the back became very hot. It started to smell and my back was slightly scalded before I realized what was happening. I quickly turned my seat heater off and soon after turned my car off to investigate. The back portion of the seat (middle spot) was still very hot to touch and remained that way for at least 15 minutes in 35 degree weather! my car and especially the driver side seat has a burnt rubber odor. I truly feel that if I had not turned my seat heater off when I did, that it would have caught fire with me driving! no I'm afraid to utilize the seat heater. Honda needs to do something about this via replacement of faulty wiring or element before something more serious happens to someone!.", "fail date": "  02/05/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Suddenly car started making bad noise from engine. I went to store to fix it. They saying its factory recall and we can't fix it. I didn't find any information from your website. Also it's very risky. I suppose to drive my car from michigan to virginia but the auto technican told me wil be risk it's will stop your wheel and you will in big accident. Sears auto didn't fix my car. They refer me to go Honda dealer for recall issue. Please advice me. Thanks.", "fail date": "  06/10/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The 2004 Honda Pilot had a recall notice affecting the ignition (NHTSA reference #12v573000). My key was able to be removed without the vehicle being in park. The exact symptoms of the recall. I checked with Honda and they said my vehicle was already fixed. I took it in and they did fix the car, but claimed it had nothing to do with the recall. Either there is a secondary issue that needs to be addressed or they are being less than truthful. I had to pay over $500 for what I believe should have been covered under the recall.", "fail date": "  09/12/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Steering wheel locked, key would not turn nor come out, gear could not be changed. Vehicle would not start. Pilot's ignition would not work at all.", "fail date": "  05/02/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I have 2004 Honda Pilot lx. When traveling at about 30-50 mph. Hear and feel a vibration when at consistent speed. Seems as if it's coming from the bottom of the vehicle. Maybe from a drive shaft or propeller shaft or something. It's getting much and much worst as days goes by. I am worried something can come loose when vehicle in moving motion.", "fail date": "  03/28/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "When the driver side heated seat is turned on the seat gets so hot that it literally burns the skin on anyone sitting in the seat. It happens on both low or high setting. The seat then begins to emit smoke.", "fail date": "  10/15/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I was driving in the highway then my car wouldn't go fast when I stop to se what happen there was smoke coming out of my engine took it to mechanic he told me it was a transmission problem we goggle around before trying to fix it and it says thus type of situation is been recall already.", "fail date": "  06/17/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "In may 2013 I received a letter stating that the sunroof had a defect. Claim #13002294p was opened and I was directed to s & c in hiawatha (319-393-2591) and on may 31, 2013, I took my vehicle in for the recall. The sunroof started to leak when it rained so I had it checked by safelite auto glass who inspected the drain tubes and confirmed they were not clogged. I tried to contact s & c to correct the issue with the webasto sunroof and the business was closed. I contacted webasto to see if they could confirm that the service center (s & c) had actually replaced the sunroof. Webasto directed me to the next nearest service center, mid iowa truck & upholstery, 1628 s. Duff avenue, ames, IA 50010 (515-232-4343) which is 2-hours away and webasto could not guarantee that the service call would be covered under the warranty. When driving the vehicle you can hear an increase in the air coming through the sunroof. I frequently transport my granddaughter and I'm concerned that the glass may come out of its frame as stated in the recall.", "fail date": "  05/06/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I'm having trouble with my 2004 lx, no keyless remote on this model. The drivers side door lock quit working, the key goes in with difficulty and won't turn, won't unlock the door. Resorted to using the rear door lock to get in and now that lock has developed the same problem. Now have just the passenger side door to unlock from the outside. Now the ignition. Same problem. What the hell is going on?.", "fail date": "  05/09/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Went to dealer and they said vehicle has bad engine mounts, and need to be replaced. Note that we also have a 2003 Acura mdx, and the dealer also told us that some engine mounts needs replacement. We checked some blogs for Acura mdx and Honda Pilot owners, and found a lot of owners with same issues. Some are being replaced every two years. We onwed a v6 Toyota for 15 years, never had this issue. We hope NHTSA will check this, because it is a known issue to owners and Acura/Honda will never admit. I'm sure if NHTSA will get repair records for this \"engine mount\" issues, it will be a lot. From what I read, this affects drive shafts due to excessive movement of the engine.", "fail date": "  01/31/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "The accelerator sometimes freezes and I cannot press it down. When I press very hard it releases and goes too fast from the stop position. I was in the school zone stopped when I tried to start again, it froze. The guard was trying to make me go, I was trying but pedal was frozen. When I pushed very hard, it went very fast from stop. The cop saw me clocked me and gave me a $360. 00 ticket. I tried to explain the problem. Did not believe me. This has happened several times but never this bad. I have sent to the shop and was told it was the throttle body.", "fail date": "  08/17/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Upon taking off at the stop light I accelerated to 35 miles an hour then changed lanes as I was nearing my destination ,the car sped out of control and reached speeds over 65 miles an hour,I stood on the brake and stepped on the emergency brakes while steering the vehicle away from other vehicles, the emergency brakes stopped the vehicle, I had a new ignition switch put in at a cost to me of 700. Dollars six month in the fall of 2013. . This was a most dangerous incident, people must know this. , I tried to re[port it online to NHTSA it said ''25 '' complaints only. ???.", "fail date": "  06/02/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "I was parked in the driveway on a completely flat surface. I put the car in reverse to back out of the driveway. I touched the accelerator pedal lightly to get the car moving, the car accelerated wildly. I stomped on the brake, which went to the floor. I had time to look down and see that my foot was on the brake pedal and to stomp on the emergency brake. The car did not slow down at all. The vehicle continued accelerating until it smashed into a tree going approximately 30 mph (estimated). A couple hours before the wreck a previously unseen brake error light came on the dash. The shop it was taken to refused to look into the brakes, accelerator, master cylinder or the transmission. They stated there were no codes triggered, though they could provide no proof that they even had the necessary equipment to read the codes. State farm insurance refuses to investigate because the vehicle was a total loss. This from a stand still on a flat surface. It was horrific. I would like the vehicle inspected to determine if there was a mechanical failure.", "fail date": "  08/04/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "The contact owns a 2004 Honda Pilot. When the driver of the vehicle engaged the brake pedal the vehicle accelerated into the store window causing bricks to fall off of the building. The vehicle was towed to a Honda dealer who stated that they could not find anything wrong with the vehicle. There were no prior warnings or failures. The failure mileage and current mileages were 102600.", "fail date": "  08/07/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "The contact owns a 2004 Honda Pilot. While the contact's wife pulled into a parking space at 5 mph, with her foot on the brake pedal, the vehicle lunged forward and the engine revved. The contact drove over a curb and crashed into a wall. The air bags deployed and two occupants were injured. A police report was filed. The contact has yet to take the vehicle to the dealer or a mechanic. The current and failure mileages were 22,000. The brakes would not stop the vehicle. The vehicle had a defective air control valve and throttle. The consumer stated he experienced the problem 1 year prior to the accident. The vehicle was totaled. Updated 09/18/07.", "fail date": "  07/27/2006"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Tachometer surges upward but the vehicle doesn't go any faster and I am not pressing the accelerator. Then some times it will drop dramatically. First visit dealer said could not duplicate, second trip they replaced egr valve. It is better but still does not drive like a new vehicle.", "fail date": "  05/24/2004"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "I have a 2004 Honda Pilot with roughly 174,000 miles on it. It has been well cared for and the engine seems to run great. I acquired the car about a month ago and upon driving it I noticed a faint shuddering between gears upon acceleration from 2-50 mph. The weeks went on and it is now very scary to drive it shudders terribly while accelerating and decelerating from 2-50 mph. It feels as if the vehicle is going to just stall or possibly lock up and crash off the road I have an infant son and im afraid to have him in the vehicle. The car was bought outright from a certified Honda dealership for over 10,000 $ a few years back,. And like I said the car is barely drivable the steering is very unpredictable and wild it is unresponsive at times when im turning the steering wheel the car continues to go straight. The noise from the front differential area along with the brakes are so loud when going down hill that they can be heard over the radio on level 24-27. I can feel the constant vibration and upset in the front end so bad while driving that I have to mute the radio at times to make sure the vehicle isn't scraping and sparking along due to a transmission lock up cause it just feels like something is terribly wrong. I m too afraid to even go on the freeway unless absolutely necessary because im afraid of being injured or killed by this all too common problem I've been reading about. This fact is very troublesome because I live where the only way to get anywhere is to go on the freeway so I don't know what im going to do. With the amount of complaints on this exact issue im surprised there is no law suit. . . I am going to try to see what I can do to get one started. . . If your product has been proven defective like this obviously has then Honda really needs to own up its not fair how much money we all lose by purchasing this pos for the high resale prices we pay!!!.", "fail date": "  10/14/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "I was approaching a light where a vehicle was moving but suddenly stopped because of traffic ahead. When I applied my brakes, the brake when immediately to the floorboard and there was a click. My car did not slow down but slid directly into the car in front of me causing front end damage to my car. My rate of speed was 25-30 miles per hour.", "fail date": "  10/05/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The contact owns a 2004 Honda Pilot. While driving at various speeds, the rpms revved and the gauge reading fluctuated without warning. In addition, when the brake pedal was depressed, the vehicle violently jerked forward. The vehicle was taken to an independent mechanic, but the cause of the failure was unable to be determined. The failure recurred on three separate occasions. The manufacturer was not notified of the failures. The failure mileage was 133,000.", "fail date": "  07/12/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Upon taking off at the stop light I accelerated to 35 miles an hour then changed lanes as I was nearing my destination ,the car sped out of control and reached speeds over 65 miles an hour,I stood on the brake and stepped on the emergency brakes while steering the vehicle away from other vehicles, the emergency brakes stopped the vehicle, I had a new ignition switch put in at a cost to me of 700. Dollars six month in the fall of 2013. . This was a most dangerous incident, people must know this. , I tried to re[port it online to NHTSA it said ''25 '' complaints only. ???.", "fail date": "  06/02/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Several incidents of gas pedal sticking upon acceleration. On may 14, 2009, I informed Honda dealership and they did a fuel induction cleaning service. However the problem continued. Then on November 10, 2009, I informed the Honda dealer that gas pedal continued to stick and it was hard t push the pedal also. Dealership cleaned throttle body and plate. This problem continues and I have seen on customer Honda websites that this problem is widespread. My wife and I are both in our 70's and are worried about an accident occurring because of the gas pedal sticking. There should be a recall.", "fail date": "  05/14/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "In approximately early 2006, I noticed the front wheels would shimmy when I applied the brakes at higher speeds. Typically it would occur as I was driving down steeper grades in the mountains. I brought this to the attention of the Honda dealer in April 2006 when the vehicle had 35,418 miles. The Honda dealer dismissed it and said it was probably due to the front wheel still wanting to provide power while the brakes were applied. Consequently, the brake system checked out fine during their inspection. Unfortunately, the problem still persists and is getting worse. I've also now noticed the problem when I drive on flatter surfaces as well. The problem is most noticeable when stopping at speeds over 50 mph and is even more pronounced when driving down hills. My concern at this point is that the vehicle will become unstable because of the excessive shimmy that occurs in the front wheels while braking at higher speeds or on an incline.", "fail date": "  02/01/2006"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "While driving at any speed consumer heard a noise coming from the rear of vehicle when braking. Service mechanic informed the consumer that they were aware of the problem and not to be alarmed.", "fail date": "  11/18/2003"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "When getting work done by licensed mechanic, I was told that there was a problem with the rear frame being soo rusted that the shock absorber was not attached because there was nothing left to attach it to. I was told they couldn't fix it and I should consider getting rid of it.", "fail date": "  05/12/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "Key will not not turn in ignition to start car. Tried spare key and all suggestions from google, turning steering wheel, brakes, disconnecting battery. Locksmith charge to repair $300+, per comments on google better to replace or will happen again. Cost to replace $600+. Tried tapping around key hole with screwdriver & hammer while someone turned key, did not work.", "fail date": "  12/26/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "I have a 2004 Honda Pilot with roughly 174,000 miles on it. It has been well cared for and the engine seems to run great. I acquired the car about a month ago and upon driving it I noticed a faint shuddering between gears upon acceleration from 2-50 mph. The weeks went on and it is now very scary to drive it shudders terribly while accelerating and decelerating from 2-50 mph. It feels as if the vehicle is going to just stall or possibly lock up and crash off the road I have an infant son and im afraid to have him in the vehicle. The car was bought outright from a certified Honda dealership for over 10,000 $ a few years back,. And like I said the car is barely drivable the steering is very unpredictable and wild it is unresponsive at times when im turning the steering wheel the car continues to go straight. The noise from the front differential area along with the brakes are so loud when going down hill that they can be heard over the radio on level 24-27. I can feel the constant vibration and upset in the front end so bad while driving that I have to mute the radio at times to make sure the vehicle isn't scraping and sparking along due to a transmission lock up cause it just feels like something is terribly wrong. I m too afraid to even go on the freeway unless absolutely necessary because im afraid of being injured or killed by this all too common problem I've been reading about. This fact is very troublesome because I live where the only way to get anywhere is to go on the freeway so I don't know what im going to do. With the amount of complaints on this exact issue im surprised there is no law suit. . . I am going to try to see what I can do to get one started. . . If your product has been proven defective like this obviously has then Honda really needs to own up its not fair how much money we all lose by purchasing this pos for the high resale prices we pay!!!.", "fail date": "  10/14/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "Suddenly car started making bad noise from engine. I went to store to fix it. They saying its factory recall and we can't fix it. I didn't find any information from your website. Also it's very risky. I suppose to drive my car from michigan to virginia but the auto technican told me wil be risk it's will stop your wheel and you will in big accident. Sears auto didn't fix my car. They refer me to go Honda dealer for recall issue. Please advice me. Thanks.", "fail date": "  06/10/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "We have been having problems with the steering wheel getting locked. We have to regularly take a part off of the steering wheel and push a screw driver in the space until the steering wheel unlocks. This happened too often. There is no reason for this to happen. We do the usual: place foot on brake, turn wheels, make sure gear is in place, etc. But the wheel stays locked.", "fail date": "  10/15/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "The shift interlock allowed the key to be removed without the Pilot being in park. This caused the Pilot to roll backwards in a parking lot. Luckily the lot was fairly flat, so it didn't roll far or hit anything (or anybody!). A Honda dealer confirmed the issue, and contacted Honda about it. Honda said they wouldn't fix the issue due to the mileage, and the fact that I purchased the vehicle used (from carmax).", "fail date": "  08/01/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "The contact owns a 2004 Honda Pilot. While driving speeds ranging from approximately 25 to 55 mph, the vehicle began pulling to the right. The vehicle changed lanes within seconds. The contact had to use extreme force to steer the vehicle back into the correct lane. The failure caused the tires to wear before the normal mileage. The dealer replaced the tires at 27,000 miles due to the extreme wear. The steering in the vehicle was repaired by two mechanics; however,the failure continued to occur. The VIN, number of cylinders, and engine size are not available. The current and failure mileage was 33,000.", "fail date": "  09/16/2004"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Steering", "Sub Problem": "Steering problems", "description": "I purchased a 2004 Honda Pilot and ever since we have owned it we have a problem with vibration at speed approaching and over 65mph. We have had it to the dealer two times and the have offere no solution and taken the stance that it is the characteristic of the vehicle.", "fail date": "  12/01/2003"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System Tank Assembly problems", "description": "Fuel tank will not accept fuel in a timely matter, acts as though there is a plug in the tank.", "fail date": "  12/11/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System Tank Assembly problems", "description": "Fuel tank-- the fuel tank will not fill at a normal rate, it continues to shut off as if the tank is full. Very annoying as it takes lots of time to fill the tank please advise roger iveson.", "fail date": "  10/20/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System Tank Assembly problems", "description": "Gas can be empty and when you attempt to fill up tank it shuts off as if tank is full. Spent 400. 15 on 10/25/13 for fuel vapor control valve yonder dealer thought this might be causing it. This worked for few weeks then it began again but seemed to let us fill it up if we drove for a few miles before attempting to fill up the gas tank. Now it doesn't matter how far we drive the car the gas will not pump into the tank it can take us up to 30 minutes to pump a few gallons of gas. The Honda dealer is as much of a loss as to what is causing this to take place. The car has not been involved in any accidents and is causing extreme stress as to how and what it will take to get the gas to pump correctly.", "fail date": "  10/07/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System Tank Assembly problems", "description": "The contact owns a 2004 Honda Pilot. The contact stated while adding gasoline to the fuel tank it would spill out preventing the contact from adding fuel to its capacity. While inside the vehicle the contact also smelled a strong odor of gasoline. The vehicle was taken to the dealer for diagnostic testing where they stated that the gasoline valve caused the failure and needed to be replaced. The vehicle was repaired; however, the failure recurred immediately. The manufacturer was later contacted and advised the contact to have the dealership diagnose the failure. The failure mileage was approximately 105,000. The current mileage was approximately 120,000.", "fail date": "  06/01/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System Tank Assembly problems", "description": "Often during refueling of my vehicle the gas pump shuts off after a few moments of refueling. At times, the gasoline backs up in the tube and spews back out onto the vehicle and the ground despite having a near empty fuel tank . It has become necessary to squeeze the pump handle lightly and trickle the gasoline into the fuel tank. I have also found this to occur at different gas stations as well. Thank you for your assistance into this matter.", "fail date": "  06/01/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Other Fuel System", "Sub Problem": "Other Fuel System Tank Assembly problems", "description": "Fuel filler neck on my 2004 Pilot had a fuel leak. My check engine light came on and when the vehicle was serviced a leak in the neck of the gas tank filler tube was detected and replaced. The vehicle had about 95,000 miles.", "fail date": "  01/12/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Visibility", "Sub Problem": "Power Window problems", "description": "Drivers side back powered window does not work. It went down automatically and does not go up while driving automatically. Almost caused a car crash.", "fail date": "  11/20/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Visibility", "Sub Problem": "Power Window problems", "description": "The window regulators and power door locks on the Honda's I own keep failing and cost more than 300 dollars to repair. This seems to be a systemic problem on the Honda's. I have had this happen on all 4 doors of my 2000 Honda accord and 2 doors on my 2004 Honda Pilot. Honda needs to do a recall and fix this issue. People shouldn't have to pay for a systemic issue in the car, which can be a safety issue as well as you can't put the windows down or up once this happens.", "fail date": "  06/22/2008"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Visibility", "Sub Problem": "Power Window problems", "description": "Brand new Honda Pilot experienced electrical problem in that the interior cab light for no apparent reason will turn itself on and shut its self off after approximately 5 to 10 seconds. Automatic door locks not functioning as well as front passenger window gets stuck and will not go down. Dealer service says possible ghost in vehicle!! will bring into service on Jan 10, 2004.", "fail date": "  01/03/2004"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seat Belt", "Sub Problem": "Seat Belt problems", "description": "Seat belt shoulder restraint did not engage on front passenger side when our vehicle was rear ended. . This resulted in the front passenger hitting her head on the dashboard. She sustained a contusion and concussion and had to receive treatment at a hospital for the injuries. Vehicle was stopped when hit from behind.", "fail date": "  08/21/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seat Belt", "Sub Problem": "Seat Belt problems", "description": "Tl-the contact owns a 2004 Honda Pilot. The contact stated that the right side rear seat belt failed to to engage. The vehicle was not diagnosed or repaired. The manufacturer was not notified of the failure. The failure mileage was 100,000. Aw.", "fail date": "  01/02/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seat Belt", "Sub Problem": "Seat Belt problems", "description": "Airbag (srs) light is on. Dealer indicates vehicle needs complete srs unit total cost of $743. 23 plus tax. Dealer did not indicate that part was under warranty or covered by any recall.", "fail date": "  05/22/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seat Belt", "Sub Problem": "Seat Belt problems", "description": "The contact owns a 2004 Honda Pilot. The contact stated that the third row drivers rear safety seat belt failed to unlatch and release the passenger. The seat belt was cut in order to release the passenger. The vehicle was not taken to a dealer for inspection. The manufacturer was not notified of the failure. The vehicle was not repaired. The approximate failure mileage was 166,000. The current mileage was 175,000.", "fail date": "  02/12/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seat Belt", "Sub Problem": "Seat Belt problems", "description": "The contact owns a 2004 Honda Pilot. The contact stated that the rear middle seat belt became tangled around a two year old child’s neck while seating in a child seat. The contact was unable to remove the seat belt and had to cut it with scissors. The vehicle was not taken to the dealer. The manufacturer was not made aware of the failure. The vehicle was not repaired. The VIN was not available. The failure and current mileages were 110,000.", "fail date": "  03/25/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seat Belt", "Sub Problem": "Seat Belt problems", "description": "Srs light came on. Honda dealer said opds unit need replacing. Was replaced 5/6/09. Drove about a month and srs light comes back on. Honda dealer said unit may be defective. Unit replaced. Drove about 2 weeks and srs light comes back on. Honda dealer stumped. They just keep resetting the unit but srs light just comes back on. It stays on all the time now.", "fail date": "  05/06/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Seat Belt", "Sub Problem": "Seat Belt problems", "description": "On Sunday night my 9 year old child was sitting in the back seat of my Honda Pilot. When she tried to put her seat belt on it got caught around her neck. She then turned to try and fix it and it got wrapped again. It locked around her neck and would not release. Even as I tried to lift her to get room around her neck the belt kept taking in the slack. She had to be cut out of the seat belt by a onlooker who had a knife. By that point she had quit breathing. She had to be hospitalized and have numerous tests run on her to access her condition. She has massive swelling to her face and her right eye was swollen completely shut. She has broken blood vessel from her neck up all over her face and even in the back of her throat. She has so many broken blood vessel in her eyes that you cannot even see the whites of her eyes. At the time all of this happened the truck was at a stand still in a fast food drive through.", "fail date": "  11/11/2007"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Headlights problems", "description": "Tl-the contact owns a 2004 Honda Pilot. The contact stated that while driving at approximately 40 mph, the low beam headlights on the driver side failed to illuminate intermittently. The failure recurred several times. The vehicle was not diagnosed or repaired. The manufacture was not made aware of the failure. The approximate failure mileage was 240,000. Jw.", "fail date": "  12/07/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Headlights problems", "description": "Low beam headlights failed due to some wiring issue. I note that a recall was recently announced on the 2003 Honda Pilot and 2002-2004 Honda crv. My 2004 Honda Pilot had the exact same issue as described in the recall notice, but is not included in the recall. Please review this issue and see if the recall should be expanded to cover the 2004 Honda Pilot as well as this is an obvious safety issue.", "fail date": "  04/02/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Headlights problems", "description": "The headlight plastic cover has become very cloudy and prevents the headlights from properly illuminating the road at night. This causes improperly lighting when driving at night. This is a problem on all cars with this type of cover over the headlights. The problem is acknowledged by all manufactures as they offer cleaning of the lenses for a cost. This problem should be corrected by the manufacturer at no cost to the owner as this is a safety problem.", "fail date": "  05/10/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Headlights problems", "description": "Head lights burn out every 2-3mo. S darrel waltrip tells me there is nothing they can do and that they know of no recalls on the very expensive halogen lights. I have spent approx. 200. 00 dollars on headlight replacement. I think this would warrant a free check and repair of the problem.", "fail date": "  04/25/2005"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Headlights problems", "description": "The 2003 Pilot headlights are very weak and do not sufficiently illuminate the road ahead. This creates a very serious driving hazard on the freeway especially at speeds as high as 70 mph. The Pilot's headlights fail to illuminate the curves in the freeway, and consequently, Pilots can veer off the highway and get into crashes. Apparently, the Honda company is aware of this problem but has chosen not to take any action. We appeal to NHTSA to urge Honda to recall and replace the defective headlights.", "fail date": "  01/20/2004"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Headlights problems", "description": "Low beam headlights do not sufficiently illuminate road.", "fail date": "  12/15/2003"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Latches/locks/linkage", "Sub Problem": "Latches/locks/linkage problems", "description": "The contact owns a 2004 Honda Pilot. The contact stated that both the driver and passenger side automatic exterior door locks failed to operate. The vehicle was taken to an independent locksmith where the driver's side door was repaired. The manufacturer was notified of the problem. The approximate failure mileage was 90,000. The VIN was unavailable.", "fail date": "  01/11/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Latches/locks/linkage", "Sub Problem": "Latches/locks/linkage problems", "description": "Key will not turn the ignition.", "fail date": "  07/10/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Latches/locks/linkage", "Sub Problem": "Latches/locks/linkage problems", "description": "3 of 4 electronic door locks unresponsive\none by one, almost simultaneously (within a month or two), each door lock became unresponsive to the master/driver's seat controls. Also do not work using key fob. Doors must be manually locked and unlocked and key does not work in front passenger door to lock or unlock. The only door left where the lock works properly is the driver door. The \"broken\" locks sound like they are working, but they do not move. Dealer wants $200 per door to fix.", "fail date": "  03/15/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Latches/locks/linkage", "Sub Problem": "Latches/locks/linkage problems", "description": "The window regulators and power door locks on the Honda's I own keep failing and cost more than 300 dollars to repair. This seems to be a systemic problem on the Honda's. I have had this happen on all 4 doors of my 2000 Honda accord and 2 doors on my 2004 Honda Pilot. Honda needs to do a recall and fix this issue. People shouldn't have to pay for a systemic issue in the car, which can be a safety issue as well as you can't put the windows down or up once this happens.", "fail date": "  06/22/2008"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Latches/locks/linkage", "Sub Problem": "Latches/locks/linkage problems", "description": "All four door lock actuators have failed. None of the vehicle doors lock or unlock when using a remote or using the power lock buttons on each door. The problem is now permanent on all four doors. The problem first started on the front two doors and eventually to the rear two doors. All four door actuators have failed. I am concerned a door will be left unlocked and my personal belongings will be stolen. In addition, there is no way for me to automatically lock all four doors while I am driving, such as if I feel unsafe in a location I am driving and want to immediately lock all the doors while in the drivers seat (for example, sitting at a stop light and someone approaches my car).", "fail date": "  05/01/2008"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Gasoline Fuel System", "Sub Problem": "Tank Assembly problems", "description": "When driving or when applying the brakes, a thump noise would be present in the rear. The consumer was informed that the noise was coming from the fuel tank.", "fail date": "  07/13/2004"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Gasoline Fuel System", "Sub Problem": "Tank Assembly problems", "description": "Since the vehicle was new, there was a sloshing sound from the gas tank when the car starts or stops (as if I'm carrying an aquarium). Honda said (7/15/05) it's the tank's alloy composition, and is a normal condition. Since safety is not an issue, Honda will not replace the gas tank, and I will just have to live with the annoyance. Honda is sorry; most Pilots don't behave like this.", "fail date": "  06/04/2004"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Gasoline Fuel System", "Sub Problem": "Tank Assembly problems", "description": "While driving the vehicle at any speed, the consumer heard noise coming from the rear of the vehicle. The vehicle was taken to the dealer where the technician indicated that noise was coming from the fuel tank. In addition, dealer said that they're aware of the problem and it's normal.", "fail date": "  04/30/2004"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Gasoline Fuel System", "Sub Problem": "Tank Assembly problems", "description": "While driving at 65 mph consumer heard a noise from under the vehicle. Consumer continued to drive until another motorist indicated that there was a problem with the fuel tank. Consumer pulled into a gas station and found that a hole was in the plastic fuel tank. Manufacturer and the dealer were aware of the problem.", "fail date": "  12/29/2003"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Wheel", "Sub Problem": "Wheel problems", "description": "The contact owns a 2004 Honda Pilot. While driving 70 mph, a loud bang sound emitted from the vehicle and the wheels seized without warning. The vehicle was towed to the contact's residence. The vehicle was not diagnosed or repaired. The manufacturer was not notified of the failure. The failure mileage was 207,584.", "fail date": "  09/17/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Wheel", "Sub Problem": "Wheel problems", "description": "Suddenly car started making bad noise from engine. I went to store to fix it. They saying its factory recall and we can't fix it. I didn't find any information from your website. Also it's very risky. I suppose to drive my car from michigan to virginia but the auto technican told me wil be risk it's will stop your wheel and you will in big accident. Sears auto didn't fix my car. They refer me to go Honda dealer for recall issue. Please advice me. Thanks.", "fail date": "  06/10/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Wheel", "Sub Problem": "Wheel problems", "description": "This vehicle from original purchase has had a wheel vibration that seems to be incorrectable by dealer. I believe it is a defect from the manufacture Honda. The vehicle has also needed brake rotors resurfaced at less than 20,000 miles and is currently waiting for parts to have two tie rods replaced.", "fail date": "  07/01/2005"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Child Seat", "Sub Problem": "Child Seat problems", "description": "Superlatch loosening immediately after installation, every time. Harness straps slipping and becoming loose/adjuster plate not locking properly approximately 50% of the time. Discontinued use of car seat due to lack of safety. (related vehicle information: model year=2004, make=Honda, model=pilot).", "fail date": "  08/01/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2004 Pilot", "Problem": "Child Seat", "Sub Problem": "Child Seat problems", "description": "Cosco model # 22269crk, dom 02/11/2004. The strap between the legs hold the buckle strap from unraveling. Consumer contacted the manufacturer for a replacement part.", "fail date": "  10/06/2004"}]