[{"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Tmy vehicle, a 2007 Honda Pilot is subject to a recall, and I only, in the last two days, became aware of same. I called a local dealer but the person advised that they could not make any repairs at no cost to me.", "fail date": "  01/28/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Driving car and passenger side curtain airbag deployed without incident.", "fail date": "  12/29/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. I bought the car, used, on or about June 20, 2017 fully aware of the takata airbag recall. I brought the car to everett Honda on July 1, 2017 for the recall. Air bag inflater replaced. I then brought the car to cambridge Honda on October 20, 2017 for oil change. Cambridge Honda informs me that the incorrect airbag inflater was installed by everett Honda. Cambridge Honda replaces defective recall airbag inflater with new one.", "fail date": "  10/20/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2007 Honda Pilot. The contact received notification of NHTSA campaign numbers: 16v344000 and 15v320000 (air bags). The part needed for the repair was not available. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The vehicle was taken to auto jarov (osikova 2, prague, czech republic 130-00, phone number: (420) 251-002516), but was not repaired due to lack of parts. The manufacturer informed the contact that they would search to see where the air bags were distributed. The contact had not experienced a failure. VIN tool confirms parts not available.", "fail date": "  06/21/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "2007 Honda Pilot. Consumer writes in regards to replacement parts not available to repair recall notice 16v-344.", "fail date": "  09/01/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2007 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags); however, the part to do the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experinced a failure.", "fail date": "  08/18/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2007 Honda Pilot. The contact received notification of NHTSA campaign number: 16v346000 (air bags); however, the part to do the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure.", "fail date": "  07/28/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall made appointment with dick brooks on July 26, 2016 in which they had to order the parts and they would contact me for an appointment. Over 60 days still no contact was made from dick brooks for recall.", "fail date": "  07/20/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2007 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags). The dealer scheduled a repair more than twice and indicated that the parts had been slowly supplied from the manufacturer to the dealer. The dealer indicated that they would order the part and contact the vehicle owner when they arrive. The manufacturer was unable to provide a specific time frame to supply the parts to the dealer. The contact had not experienced a failure. Parts distribution disconnect.", "fail date": "  07/19/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2007 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags) however, the part to do the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure. Parts distribution disconnect.", "fail date": "  07/09/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2007 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags) and stated that the part needed for the repair was not available. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure. Parts distribution disconnect.", "fail date": "  07/05/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2007 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags); however, the part to do the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was not notified of the issue. The contact had not experienced a failure. Parts distribution disconnect.", "fail date": "  07/02/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall / propellant wafers I received a safety recall from Honda in June, 2016, regarding my 2007 Pilot. I promptly called the dealership, in June 2016, to schedule an appointment. I was notified that I could not make an appointment and they would call me. That was 9 months ago. According to the recall notice, the definition of reasonable period of time is 60 days. The notice says Honda suggests that I avoid having a passenger sit in the front passenger's seat. That is not a reasonable suggestion for nearly a year and counting.", "fail date": "  06/30/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2007 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags); however, the part to do the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was notified of the issue. The contact had not experienced a failure. Parts distribution disconnect.", "fail date": "  06/24/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2007 Honda Pilot. The contact received a recall notice for NHTSA campaign number: 16v344000 (air bags). The contact stated that the parts needed for the recall remedy were still not available. The dealer never called the contact back to confirm an appointment. The contact had not experienced a failure. Parts distribution disconnect.", "fail date": "  06/22/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2007 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags); however, the part needed to perform the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was not notified of the issue. The contact had not experienced a failure. VIN tool confirms parts not available.", "fail date": "  06/20/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2007 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags); however, the part needed for the repair was not available. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure. Parts distribution disconnect.", "fail date": "  06/20/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2007 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags); however, the parts to do the repair were unavailable. The manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was notified of the issue. The contact had not experienced a failure. Parts distribution disconnect.", "fail date": "  06/19/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2007 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags); however, the parts to do the repair were unavailable. The dealer stated that the parts were on back order. The manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was not notified. The contact had not experienced a failure. Parts distribution disconnect.", "fail date": "  06/01/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2007 Honda Pilot. The contact received notification of NHTSA campaign number: 16v344000 (air bags); however, the part to do the repair was not available. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact had not experienced a failure.", "fail date": "  05/24/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Takata recall. The contact owns a 2007 Honda Pilot. The contact received notification of NHTSA campaign numbers: 16v344000 (air bags) and 15v320000 (air bags); however, the parts to do the repairs were unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repairs. The manufacturer was made aware of the issue. The contact had not experienced a failure. Parts distribution disconnect.", "fail date": "  05/24/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2007 Honda Pilot. The contact stated that the recall notice for NHTSA campaign number: 106v3440000(air bags) was received in may of 2016. After contacting the dealer and the manufacturer on multiple occasions, the contact was informed that the parts needed to repair the vehicle were still not available and no estimated time for receiving the parts could be given. The contact had not experienced a failure.", "fail date": "  05/01/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Tl-the contact owns a 2007 Honda Pilot. The contact received notification of NHTSA campaign number: 15v3200000 (air bags) however the part to do the repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the repair. The manufacturer was made aware of the issue. The contact had not experienced a failure. Kc.", "fail date": "  10/06/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Tl-the contact owns a 2007 Honda Pilot. The contact stated that NHTSA campaign number 15v320000v (air bags) had exceeded a reasonable time for repair. The contact stated that he received the recall notification July of twenty fifteen. The dealer was contacted numerous times and the dealer continued to advise the part was not available for repair. The vehicle did not experience the failure. Li.", "fail date": "  07/01/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Tl-the contact owns a 2007 Honda Pilot. The contact stated that NHTSA campaign number 14v351000 (air bags) had exceeded a reasonable time for repair. The contact stated that his VIN was included in the recall however he didn't received a notification letter. The dealer advised the part will be available within three weeks. The vehicle did not experience the failure. Li.", "fail date": "  05/29/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "I received a safety recall notice from Honda and called my local dealership, autopark Honda, on may 14, 2015 to schedule an appointment for the air bag repair. I was told that the part needed to be ordered and that someone would call me back when the part was in to schedule an appointment. I did not hear anything back from autopark Honda. I received another safety recall notice from Honda and called autopark Honda again on August 14, 2015. They stated that the part ordered for me back in may 2015 had not yet been received and asked me to call back in another week to check on it. For a safety recall that is supposed to involved potentially fatal malfunctioning of the air bags, I think that a 3 month delay in parts is unacceptable. It is not acceptable to notify vehicle owners of serious concerns but then not offer them a repair within a reasonable amount of time, no greater than 60 days.", "fail date": "  05/14/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2007 Honda Pilot. The contact stated that the VIN was included in NHTSA campaign number: 14v351000 (air bags); however, the part needed to repair the vehicle was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was notified of the issue. The contact had not experienced a failure. The VIN was not available.", "fail date": "  05/05/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "I am very upset and disgusted with the safety of the vehicles customers are allowed to drive while companies including this complaint website is aware and not too concerned to take action. I was told that the airbags are on back order not just by Honda but also on our Dodge vehicle. So many families are expected to drive a vehicle and risk their lives daily and companies feel they are covered because they warned us with a recall, this is unexceptable that we are warned but there is nothing that can be done to fix the problems until the back order is current and we receive a call back!!!!! if there is a faulty vehicle the customer should either be able to turn in the vehicle and be freed of their loans so they can go somewhere else to purchase one with some type of credit (that is safe) , receive a loaner vehicle until the problem is fixed or given another vehicle as a swap. How can you blame other countries for trying to kill americans when it is happening within our own country-how can someone sleep at night knowing so many people are driving unsafe vehicles. 1 life is too many, how many other lives are you willing to risk before you make them do something so people are safe. I expect a reply as soon as possible since this is a complaint process. Thank you,.", "fail date": "  04/29/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Honda dealers are unable to replace fatally defective airbags due to lack of replacement parts. I attempted to schedule recall repair and was told it could be months until parts are available.", "fail date": "  02/09/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "My Honda Pilot is on your list for recall due to faulty and deadly airbags. However Honda has still not put my car on their recall list. According to national and local (boston) news stations it is because we don't live in an area that has a warm/hot climate most of the time. Having lived in both florida and boston - it gets just as hot here in the summer. As a government agency in charge of looking after our safety issues. Why is it you haven't made Honda recall all of the vehicles on your list - picking & choosing who you protect? I am completing this form in the hope that I can file this complaint. Tried end of last week and earlier this week only to find site wasn't functioning. You finally fixed the VIN site, hope this one is fixed.", "fail date": "  10/29/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "My complaint is that a review of high humidity states some are not listed. . . . Arkansas my state, has higher humidity than florida or louisiana I do not feel comfortable having Honda self pick what states are high in humidity. . . . . Some body please explain???? am I supposed to wear a football helmet when I drive my Honda!!!!!! a concerned Honda purchaser for over 25 years.", "fail date": "  10/27/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Tl- the contact owns a 2007 Honda Pilot. The contact stated his VIN was not affected by NHTSA campaign number: 14v351000 (air bags) because the contact lives in north carolina. The contact does not feel comfortable being that he lives in close proximity to the affected vehicles. Both dealer and manufacturer have been made aware of the contacts concerns. The vehicle was no repaired. The vehicle was 83,789. Az.", "fail date": "  10/24/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Air bags of 2007 Honda Pilots, along with millions of other cars, have been recalled. There has been articles stating that it only affects cars in high humid and/or hot states. My VIN # does not bring a recall up but it is a 2007 Honda Pilot. If I do a search of 2007 Honda Pilot, the car comes up as airbag recall. Maybe this is because I'm in nc and it is not considered a high humidity state??? how can it be determined that my vehicle is safe and another one is not safe. I will not feel safe until my airbags are replaced but the dealership says there is no recall. I think about it every time I drive and especially when I am carrying my grandchildren or other passengers.", "fail date": "  10/24/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "The contact owns a 2007 Honda Pilot. The contact received notification of NHTSA campaign id number: 14v351000 (air bags) however, the parts needed were not available for the repairs. The manufacturer was not notified of the issue. The contact had not experienced a failure.", "fail date": "  09/25/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Air Bag", "Sub Problem": "Air Bag problems", "description": "Tl-the contact owns a 2007 Honda Pilot. The contact received notification of NHTSA campaign number :14v351000 ( air bags) however, the part to do the recall repair was unavailable. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the failure. The contact had not experienced a failure. Pp.", "fail date": "  09/11/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "After repair shop done $2,600. 00 in work, vehicle while in motion on I-40 east, misfired and blow the head gasket, head, and motor according to Honda shop. Repairs estimate are know at $6,000. 00. The repair shop had said nothing about mileage in repairing the vehicle the first and now states something different.", "fail date": "  03/12/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Tl the contact owns a 2007 Honda Pilot. The contact stated that the stability assist indicator illuminated and, shortly after, the vehicle started to jerk. Mcconnell Honda (2840 eastern blvd, montgomery, al 36116) was contacted and stated that there were no recalls on the vehicle. The manufacturer was not contacted. The vehicle was not diagnosed or repaired. The failure mileage was 134,174.", "fail date": "  04/16/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "The contact owns a 2007 Honda Pilot. When the contact depressed the brake pedal, all the warning indicators illuminated and the engine revved as if the accelerator pedal was being depressed. The vehicle was taken to the dealer (south motors Honda, 16165 s dixie hwy, miami, FL 33157 (305) 256-2250), but was not diagnosed or repaired. The manufacturer was not notified. The VIN was unknown. The failure mileage was 150,000.", "fail date": "  01/10/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Extreme shaking in the steering wheel when I reach driving speeds of 68-70 mph. The entire engine appears to be shaking as well. I've heard that this is a common issue with Honda Pilots.", "fail date": "  06/01/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Random misfire on all 6 cylinders despite routine maintenance (coil pack replacement and new spark plugs), vehicle stability control light; I have only 112k miles on the car. These are persistent issues on vehicles Honda j-series engines, yet my year was not included in the recall and service, parts, and costs associated is not covered by the dealer while other years are. The misfire issues continue to reoccur. I had a certified mechanic look at the vehicle and now the vsa light comes on. I would like the car repaired by Honda and my warranty and powertrain warranty extended, as well, if this is a known issue that other vehicles were repaired by Honda. . Read more...\n", "fail date": "  01/01/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "Takata recall. The contact owns a 2007 Honda Pilot. The contact stated that the check engine warning indicator illuminated. The vehicle was taken to an independent mechanic where the failure could not be diagnosed. The contact received notification of NHTSA campaign number: 16v344000 (air bags); however, the part to do the repair was unavailable. The manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was not notified. The failure mileage was approximately 300,000. Parts distribution disconnect.", "fail date": "  06/01/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Engine And Engine Cooling", "Sub Problem": "Engine And Engine Cooling problems", "description": "I was driving on a masspike (I-90) at 60 mph around 5 pm westbound. All of a sudden, without any warning, everything just went out in the car, the engine just died on me, all the lights on the dashboard, navigation, etc. Neither the accelerator nor the brake worked on me. I was lucky enough to pull the car over to the far right lane. But I couldn't turn the emergency signal on because there was no power. In addition, windows didn't operate either so I couldn't even let other drivers on the road that I was stopped in the middle of the highway. I called aaa and the state trooper. While I was waiting for them to come out, about 10 minutes later, the power came back on by itself. So I finally turned the key to the off position and tried starting the car again. And it started and I dropped off the car at the service department at the dealer. I was very lucky that I didn't get into an accident and also lucky my 7-month-old daughter was not in the car with me. This is a serious safety issue to me and therefore, I filed a complaint to Honda. After 4 days, case manager finally called me back telling me they will fix the car. The mechanic thinks it's a battery cable problem. I bought that car brand new and drove it for about 18 months with about 40,000 miles on it now. According to the case manager, because the car is out of warranty, there is nothing they can do other than fixing the car \"out of courtesy. \" I don't want to be in that car, not especially with my little girl. They can't even guarantee me that this won't happen again when they \"fix the problem\" they think is the cause.", "fail date": "  10/23/2008"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Exterior Lighting problems", "description": "We were traveling the freeway and as we drove down the road the low beams turned off. Fortunately high beams were still functional.", "fail date": "  08/25/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Exterior Lighting problems", "description": "On 09/09/2019 1:00 am I was awakened by neighbors that my 2007 Honda Pilot was on fire, police and fire dept. Responded and put out the flames, flame were in side dash board, ceiling, left and right quarter panels, sun roof and hood burned, front burned, plastic melting and fire everywhere, flames were 1 to 2 ft. High, all front lights in vehicle burned and melted, wires hanging, half the front vehicle totaled, during day light it was visible to see half the dash burned colapsed melted, you can see fuse box protruding hanging under dash. Wire harness, electronics, computer, burned. This does not even include damage inside engine under hood, flames were reaching out of hood. Neighbor has security cameras right in front of car, when she gets back from trip we'll see how it started I hope. I have police report available and pictures attached; you are welcome to visit and inspect vehicle. It's a total loss.", "fail date": "  09/09/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Exterior Lighting problems", "description": "Low beam will not activate. . . . Hi beam works. . . Both low beam bulbs are good. I have 175k miles on it and both low beams stop working. Low beam will not activate while moving or srationary.", "fail date": "  07/15/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Exterior Lighting problems", "description": "Very frequent burn-out of low-beam head-lamps (2-3 times per year). Multiple complaints about issue on internet.", "fail date": "  03/31/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Exterior Lighting problems", "description": "The bulbs for the climate control buttons prematurely burnt off. Cannot see the buttons when driving at night.", "fail date": "  01/03/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Exterior Lighting problems", "description": "Most of the climate control lights on my 2007 Honda Pilot have been out for a while. I bought this vehicle new and have taken excellent care of it; no wrecks, etc. The climate control lights continue to go out a few at a time. This causes night driving to be dangerous due to being unable to adjust anything with a quick glance. I've actually had to turn on the overhead light to see which button to push. Obviously, this takes my attention from the road, causing distracted driving. I've researched and found that this seems to be a common problem with Honda Pilots. It's hard for me to believe that such a wonderful vehicle and company would have sub par parts or a problem that causes this to happen. I've had other cars (much older models) that have never had an interior light go out. I'd just like to know if there is any way that I can remedy this situation. I plan on keeping this Pilot for many more years and would like to be safe when driving. Thank you for any help or advice.", "fail date": "  08/14/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Exterior Lighting problems", "description": "We bought my 2007 Honda Pilot ex-l in 2009. Soon after purchasing we noticed interior lighting issues. Specifically, the lights for the buttons in the ac head unit are all out. In addition, the dome light works sometimes and not others. Everything else works just fine on the vehicle. I have read numerous complaints on forums from others on this issue and feel it is a manufacturer defect as the interior lights typically last many many years on most vehicles.", "fail date": "  03/18/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Exterior Lighting", "Sub Problem": "Exterior Lighting problems", "description": "07 Honda Pilot ex, the climate control lighting, radio button lights and the door ajar on/off, cruise control and sunroof button lights have all gone out. I bought this brand spanking new and within 2-3 years these lights went out. Seems to be something that Honda hasn't mastered because I see forums that this is an on going issuue. I don't have $300-400 to take it to the service dept to replace bulbs. Maybe a manufacture recall should be set in place.", "fail date": "  03/17/2008"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "While driving the vehicle home after purchase on 6/11/2022 the vehicle experienced automatic, minor brake application. However, when we applied the brakes it was as if they fully locked up. By the time we got to the side of the road all of the brakes were smoking. It has been returned to the dealership 3 times for the same issue and they currently have the vehicle. They have experienced the same issue when they were trying to fix the issue but they cannot seem to figure it out. While I was investigating, I noticed that the 2005 Honda Pilot had the same issue, and the recall was started for the 2007 Honda Pilot also but was never issued. It makes it very unsafe to drive.", "fail date": "  06/11/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Tl the contact owns a 2007 Honda Pilot. While driving 55 mph, a burning rubber odor was detected and the brakes did not respond normally when the brake pedal was depressed. There were no warning indicators illuminated. The vehicle was taken to an independent mechanic who determined that the vehicle stability assist module failed and needed replacement. The mechanic recommended that the vehicle be taken to a dealer. The vehicle was not taken to a dealer. The manufacturer was notified of the failure. The vehicle was not repaired. The approximate failure mileage was 200,000.", "fail date": "  12/24/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Tl the contact owns a 2007 Honda Pilot. While driving 40 mph, the vehicle independently braked without the brake pedal being depressed. Also, the stability control warning indicator illuminated. The failure recurred on another occasion. The vehicle was taken to legends Honda kansas city (located at 10050 parallel pkwy, kansas city, KS 66109, (913) 871-9483) where it was diagnosed that the vsa module (code 841) needed to be replaced. The vehicle was not repaired. The manufacturer was notified of the failure and provided case number: 09644189. The approximate failure mileage was 24,000.", "fail date": "  06/05/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Vsa,check engine lights came on, looks like same problem 2005 Pilots were recalled for. Vehicle brake on its own, complete loss of power, happened 2months a go and again 2/3/15. Had towed to shop to have scanned. Very scary situation.", "fail date": "  12/15/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The contact owns a 2007 Honda Pilot. The contact stated that while traveling 25 mph, the brakes engaged erroneously. The vehicle was able to be driven to the contact's residence. The vehicle was taken to the dealer where the failure could not be replicated. The vehicle was not repaired. The manufacturer was not contacted about the issue. The failure mileage was unavailable and the current mileage was 93,000. The VIN was not available.", "fail date": "  11/26/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "I just merged on the highway getting off the on-ramp. I saw ahead of me that the cars were slowing down. I stepped on the brake and the car wasn't slowing down I felt some kind of vibration in the brake. I just kept my foot on the brake and I saw that the car is not slowing down and just kept going. I kept telling the car to stop, stop, stop. . . And it didn't stop and I knew it I will hit the car in front of me. . . And it did.", "fail date": "  01/29/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "Inconsistent brake pedal on 2007 Honda Pilot. Amount pf pressure applied to the brake pedal to stop the truck varies at almost every instance. At times, the pedal is spongy and goes to the floor. Other times it barely moves at all and the truck stops. This has been going on for quite a while now. I had the front brakes replaced in November 2009. When I had the vehicle inspected 1/2010 I had the mechanic check the front brakes but he said they were new and there was no problem. I was greatly surprised to hear about the recall of the 2007 odyssey and ridgeline and cannot believe the Pilot was not included. My daughter frequently drives my Pilot and has also noticed the same problem. This vehicle should be included in the odyssey and ridgeline recall. I believe the basic mechanics are the same so how can a problem that occurs on two truck based vehicles not apply to a third?.", "fail date": "  09/01/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The contact owns a 2007 Honda Pilot. While driving fast or low speeds, the contact heard a clunking noise coming from the vehicle. He took the vehicle to the dealer at least four times, but they could not locate the cause of the failure. The dealer informed him to continue driving the vehicle because the brakes were working normally. The Honda manufacturer would not assist and stated that the vehicle could not be repaired under warranty. The VIN was unknown. The failure mileage was 29,875.", "fail date": "  11/20/2008"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Service Brakes", "Sub Problem": "Service Brakes problems", "description": "The contact owns a 2007 Honda Pilot. The contact stated that when depressing the brake pedal, the vehicle would erroneously surge forward. The contact mentioned that the failure only occurred when the air conditioner was activated. The vehicle was taken to the dealer, who diagnosed that the brake fluid needed to be changed. The vehicle was repaired. The manufacturer was not notified of the failure. The VIN was not available. The failure mileage was 17.", "fail date": "  12/03/2007"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "We were traveling the freeway and as we drove down the road the low beams turned off. Fortunately high beams were still functional.", "fail date": "  08/25/2022"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "While driving, both low beam headlights stopped working. High beams and all other bulbs still work. Checked filament of low beams and no burn or black residue.", "fail date": "  09/09/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "On 09/09/2019 1:00 am I was awakened by neighbors that my 2007 Honda Pilot was on fire, police and fire dept. Responded and put out the flames, flame were in side dash board, ceiling, left and right quarter panels, sun roof and hood burned, front burned, plastic melting and fire everywhere, flames were 1 to 2 ft. High, all front lights in vehicle burned and melted, wires hanging, half the front vehicle totaled, during day light it was visible to see half the dash burned colapsed melted, you can see fuse box protruding hanging under dash. Wire harness, electronics, computer, burned. This does not even include damage inside engine under hood, flames were reaching out of hood. Neighbor has security cameras right in front of car, when she gets back from trip we'll see how it started I hope. I have police report available and pictures attached; you are welcome to visit and inspect vehicle. It's a total loss.", "fail date": "  09/09/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "While we were driving on the highway. Going 55 mph when the lights of the radio and then the lights on the console began to flicker then they stayed dim my vertical would lose power and then would get power lime the gear was slipping then catching. It would make the car lunge foward then stop then lunge toward again . Then the a/c started turning off and on.", "fail date": "  08/03/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The contact owns a 2007 Honda Pilot. When the contact depressed the brake pedal, all the warning indicators illuminated and the engine revved as if the accelerator pedal was being depressed. The vehicle was taken to the dealer (south motors Honda, 16165 s dixie hwy, miami, FL 33157 (305) 256-2250), but was not diagnosed or repaired. The manufacturer was not notified. The VIN was unknown. The failure mileage was 150,000.", "fail date": "  01/10/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Random misfire on all 6 cylinders despite routine maintenance (coil pack replacement and new spark plugs), vehicle stability control light; I have only 112k miles on the car. These are persistent issues on vehicles Honda j-series engines, yet my year was not included in the recall and service, parts, and costs associated is not covered by the dealer while other years are. The misfire issues continue to reoccur. I had a certified mechanic look at the vehicle and now the vsa light comes on. I would like the car repaired by Honda and my warranty and powertrain warranty extended, as well, if this is a known issue that other vehicles were repaired by Honda. . Read more...\n", "fail date": "  01/01/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "The hazard,vtm 4 lock, and cruise control buttons do not have any led illumination thus while driving at night these buttons are impossible to locate unless turning on the cabin light to locate.", "fail date": "  02/20/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Vehicle battery indicator illuminated and car died. Repair shop attempted to jump start the vehicle and smoke and burning smell came from dashboard. Vehicle towed to dealer.", "fail date": "  02/22/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Climate control bulbs inoperative. Cruise control and various other instrument/dash bulbs inoperative.", "fail date": "  07/01/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Srs indicator illuminates periodically for no obvious reason. Dealership read code 92-20 open/short in passenger airbag cutoff circuit; stated could be interference with ac inverter but don't use that in vehicle; did not attempt to fix the problem, sent me back home to monitor if it happened again. With nothing in passenger seat, srs illuminates as well as with items in seat. As of 11/26/12, illuminated steadily for multiple trips (usually does not illuminate on every road trip). Honda defaults to no airbag deployment if srs indicator is illuminated, so I am driving with no active airbags and two children with me in the car.", "fail date": "  11/01/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "Burned out light bulbs for the on/off indicator switches for air condition.", "fail date": "  11/22/2011"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Electrical System", "Sub Problem": "Electrical System problems", "description": "2007 Honda Pilot ,numerous complaints about stalling and drivable issues, took Pilot to dealer with same complaints of engine light, stalling,dealer found several codes in system drove Pilot home on the evening of the 24th drove to work on the 25th and that when I experienced the same problems and within several hour of that the Pilot caught fire while running! fire was in the engine compartment concentrated near cowl of Pilot then consumed whole engine compartment and heavily damaged interior.", "fail date": "  06/25/2008"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Tire", "Sub Problem": "Tire problems", "description": "The relatively new tire (29000 miles driven) did burst on the side. The discount tire store representative couldn't explain why? I have pictures that I can send you. In addition to the bills I incurred in the repair and replacement. Total cost $140. 30 in total. The dealer believes it is a manufacturing defect.", "fail date": "  02/28/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Tire", "Sub Problem": "Tire problems", "description": "I have a 2007 Honda Pilot ex. There were a couple of incidents that the brake/ oem tires (goodyear made integrity) are not responsive well during sudden braking on dry road. The tires was not able stop the car from slipping and cause the abs brake to be active. I contact Honda dealer a couple times and were told that the condition was normal for this car, no problem found. I then replaced all tires to michelin. Now the car braking is much more responsive.", "fail date": "  10/25/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Tire", "Sub Problem": "Tire problems", "description": "2007 Honda Pilot vibration at speeds 65 and higher. Bought new tires, had them balanced three times by 2 different tire companies. Dealer (frank ancona Honda-olathe, KS)said they have never heard of this before on the Pilots. They said that the tires were the problem. There are thousands of people that have written on internet threads and blogs about this same problem. Honda basically said I'll have to live with the vibration & told me it was a waste of time for me to bring it back again.", "fail date": "  02/15/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Tire", "Sub Problem": "Tire problems", "description": "Tires slip consistently upon right turn in rain, causing the vehicle to hydroplane and lose control. No matter how slow I make the turn. This occurs even when stopped before slowly turning right. I have never owned a vehicle that did this before. Extremely unsafe.", "fail date": "  01/23/2008"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Tire", "Sub Problem": "Tire problems", "description": "I have goodyear integrity tires as oem on Honda 2007 Pilot with 14k miles. I was only vehicle of 8 with 2 blowouts while traveling rocky road to camping site. Tires were properly inflated, vehicle was not overloaded, and I was traveling at same speed (slow) as all other vehicles.", "fail date": "  07/21/2007"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Tire", "Sub Problem": "Tire problems", "description": "Ever since I bought the car on 5/25/2007 the tires always slip in wet weather. No matter how slow you stop or how slow you start out from a stop they slip 90 percent of the time. There has been lots of complaints about the \"goodyear integrity\" tires that Honda puts on the Pilot's. All the complaints are about it slipping in wet weather and how unsafe it is. . Read more...\n", "fail date": "  05/25/2007"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Tire", "Sub Problem": "Tire problems", "description": "Ever since I bought the car less then a year ago the tires always slip in wet weather. No matter how slow you stop or how slow you start out from a stop they slip 90 percent of the time. There has been lots of complaints about the \"goodyear integrity\" tires that Honda puts on the Pilot lx's. All the complaints are about it slipping in wet weather and how unsafe it is. . Read more...\n", "fail date": "  01/01/2007"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Tire", "Sub Problem": "Tire problems", "description": "The tires on the 2007 Honda odyssey -- touring model -- are michelin pax -run flat tires. You cannot take the vehicle to just any tire repair shop to fix a flat, you must go to a dealership that has the appropriate equipment. This means making an appointment (waiting a day) and hopefully you are close to a major city. I spoke with a representative at michelin tires and they said if I were to be in a remote location they would send a tire out to me & pay for accommodations until I received the tires. Honda & michelin are not set up to provide the consumer with service/accessibility to maintain this tire. I feel Honda should have informed about the problems associated with this product and given me a choice. I would not have purchased a car with these tires. I have 3 small children and now have to be concerned about getting a flat tire in a remote location, and fear for our personal safety. I choose now to only travel near major cities. Honda said I would need new rims & tires. . . And they do not seem to want to help. I am hoping you can provide me with a contact or give me some info on how to get these tires off my vehicle. Also shouldn't Honda be willing to replace a product that has issues associated with it. When I had my flat tire I took my car to 3 tire shops and was told they would not touch the pax-tire & they had no plans on acquiring the equipment to fix them because it was too expensive and not enough vehicles have the tire system to make it cost effective. Honda first needs to better inform the consumer what they are getting into and the issues associated with this tire system. . . Second they need to provide those of us who don't want the tires a way to switch them out. It cost about $150. 00 to fix a flat!\nplease help me get these tires replaced!!!!.", "fail date": "  11/01/2006"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "While driving on highway rear driver side window fell all the way down past where it should even stop. This window is seldom used if ever. Bought new retractor, it happened again while changing it.", "fail date": "  10/11/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "The driver side door lock does not work, which, by what I read on the internet, is a very common problem.", "fail date": "  05/22/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "On April 4, 2018, I idled into narrow driveway and coasted left to park in parking spot. Upon transitioning from gas pedal to brake, the vehicle accelerated forward at full force pulverizing the cement parking block, jumping the curb and landing on top of the hedgerow beyond the curb. The engine was revving and the brake was ineffective in stopping the vehicle. The front tires were in the hedges up off of the ground while the rear of the vehicle remained in the parking space. I turned off the car. After composing myself I reversed the car back down into the parking lot. I was alone in the vehicle at the time. This is the second time this vehicle had an acceleration issue while attempting to transition from the gas pedal to the brake. The first time 3 people were in the vehicle and the incident resulted in an accident whereby we rear-ended another vehicle causing significant damage. Police were called to the scene and an accident report was recorded on June 17, 2017 in springfield twp. Nj.", "fail date": "  04/04/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Vsa light stays on (the triangle stays on ) engine light s stays on. I was driving and the vsa. Light stays on (the triangle stays on ) engine lights stays on. And the problem was that I could not get the 3 or 4 stear gear speed and the vehicle doesnt get spead.", "fail date": "  01/02/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "I was driving on the interstate no where near any other vehicles or overpasses when I heard what sounded like a gun shot and debris flying off the hood of my Pilot. I pulled off the road and discovered that my sunroof had exploded. The rubber seal wasn't attached to the rear any more as if it had popped upward.", "fail date": "  09/03/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Extreme shaking in the steering wheel when I reach driving speeds of 68-70 mph. The entire engine appears to be shaking as well. I've heard that this is a common issue with Honda Pilots.", "fail date": "  06/01/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Ignition switch has failed. Cost of repairing is prohibitive. Service department says the tumblers in the ignition lock wear out. Mechanic says only happens in Honda cars. Seems like Honda should fix the problem. Stranded without ability to turn key suddenly.", "fail date": "  07/04/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "In 2009 I had a spark plug blow out of the housing and I lost pressure. Tried to change plugs to be able to drive to dealership. Car was towed to Honda and top manifold was replaced and I was charged $3500. Since these were the original oem plugs it was not time to change them. Honda was contacted and they offered to pay half. I have had nothing but problems with this car since. Car was maintained regularly and had reg oil changes. There have been many diagnostics performed and it would say that car was misfiring on all cylinders. I have had the pistons repaired elsewhere even though Honda said it was fixed. Three weeks ago my check engine light came on, then the vsa and warning triangle came on and I lost power. Took it and the diagnosis is as follows: damaged lifter from low oil pressure, vtec solenoid replacement, corrected oil pressure issues, still getting bleed-back from one lifter. Ts1145 variable camshaft timing solenoid, remove and replace variable valve timing solenoid. This cost $736. 00. What has to be done to fix this recurring problem. I am on a small fixed income and you would think if you buy a $30,000 car new you should count on dependability. For heaven's sake, \"it's a Honda\".", "fail date": "  02/20/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "In our 2007 Honda Pilot there is no room for the driver to extend their left leg. There's a raised platform to rest the left foot on, but I find that uncomfortable after just a short time. When we first bought the used vehicle, I had both legs extended equally but experienced a situation where I had to stop abruptly. When I stepped on the brake, I found my left foot was under the brake. This seems like a significant design flaw. Our Toyota camry also has a raised platform but allows sufficient room for me to extend my left leg without interfering with proper vehicle operation.", "fail date": "  05/15/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Equipment", "Sub Problem": "Equipment problems", "description": "Consumer has a problem with the Honda music link. *****\na Honda rep said the music link system could search and play music from an I-pod . The Honda service department stated it would not work as it was advertised . The consumer stated know one told him the particular music link system he wanted was being discontinued. The consumer took the vehicle to the dealer to have the navigation system fixed which had been faulty for 2 years.", "fail date": "  04/03/2008"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Loss of acceleration while driving on highway.", "fail date": "  06/10/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Our 2007 Honda Pilot on three separate occasions accelerated out of control when applying breaks to slow down and stop. I could not stop the vehicle. The first time the car went through a stop sign and nearly caused a serious accident. The third time I had the presence of mind to slip the car into neutral when the car accelerated. As I had the brakes on the car immediately stopped as it should, but the engine rpm increased significantly for a couple seconds and then returned to normal idle rpm. This establishes this problem as an engine acceleration issue and not a braking problem. Of course being an intermittent problem they could find nothing wrong. I see both the Honda Pilot and the odessey have a history of this type of problem. Honda is refusing to acknowledge this as a problem and is refusing to deal with it. Someone will get killed with this problem if they haven't already.", "fail date": "  02/25/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Tl- the contact owns a 2007 Honda Pilot. The contact was driving approximately 5 mph and pulling into a parking space when the rpms suddenly increased to 6000 and the vehicle surged forward. The shifter was switched to neutral but the engine continued to rev. The vehicle was taken to an independent mechanic who was unable to determine the cause of the failure. The manufacturer was not notified. The failure mileage was 120,000. Jft.", "fail date": "  11/05/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "The SUV traveled down a gently sloped driveway. The driver's foot was on the brake pedal the entire time so that the vehicle would move slowly. Approximately 5 feet from the garage entrance, with the right foot still gently depressing the brake pedal and no pressure on the accelerator pedal, the car suddenly and violently accelerated. The driver depressed the brake pedal to the floor but this did not stop acceleration or forward motion. The vehicle crashed into the back wall of the garage, causing significant structural damage to the house and deploying the driver-side airbag. The driver's right shoulder and hand experienced soft tissue injuries. A child was in the room struck by the car. This child suffered a fractured tibia/fibula, a mild traumatic brain injury (concussion), and multiple abrasions as a direct result of the collision. A second child outside of the vehicle experienced an abrasion to the left knee as a direct result of the collision.", "fail date": "  04/18/2015"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Several months ago the vsa light began to come on momentarily, for no reason. This has happened 50-100 x. Several weeks later, the steering wheel began to be sometimes (daily) not true (at one oclock), though the car was moving straight. (turning the wheel turned the car. ) the abs began momentarily firing, for no reason, and the car would slow, sometimes severely. (we were not braking. ) the car would lose power momentarily, for no reason, though the engine continued to run, and everything else was normal, with no noise (e. G. , no abs). Recently the above happen every day. Sometimes the vsa and abs happen at the same time. All happened when driving straight or turning. We were not driving fast. There were no emergency conditions. On Dec 20, we began a left turn at 5 mph. The abs fired for 4 or 5 secs. Then there was a loud noise (not abs). The vsa light came on. The wheel was as much as 270 degrees from true. Sometimes it took effort to turn the wheel. Sometimes it took no effort but the car did not respond. On Dec 21, at their recommendation, the car was towed to a Honda dealer. The dealer told us the 2 steering bolts were sheared off. They do not know the cause. They note: the bolts are not visible during inspections. The steering and subframe must be replaced. The vsa etc. Are probably fine but we cannot know until everything else is fixed. The dealer has declined to put this in writing. They say there is not anybody at Honda with whom we can discuss this. When asked, they knew of no relevant recalls. There has been no accident or other damage to the car. It is kept in our garage. We have maintained it (last service was Sep 2013). We are fortunate we did not have an accident. Even after the proposed fixes, will the car be safe? on the NHTSA site, we found 2012/2013 recalls for the 2005 Pilot for the same subsystems and similar symptoms.", "fail date": "  12/20/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "This has happened 2-3 times during the past month prior to February 27, but I don't know exact dates. When approaching stop sign and applying the brakes, my engine started to accelerate and I really had to jam on the brakes in order to stop. Thankfully, I had sufficient time and space between me and the car in front of me. I geared down to d3 and that seemed to get it out of that high acceleration.", "fail date": "  02/27/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "Car accelerated and brakes failed completely. This was a fatality accident. When approaching a red light the car did not slow down at all. This accident occured in the middle of a clear day. Reports showed the driver had no alcohol or drugs in their system. I have the black box data that was recovered from the scene and can forward it to you as an attachment.", "fail date": "  04/29/2008"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Vehicle Speed Control", "Sub Problem": "Vehicle Speed Control problems", "description": "2007 Honda odyssey continues acceleration with no contact to gas pedal. Cause has not been diagnosed.", "fail date": "  02/15/2007"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "Driver's seat rocks back and forth when in motion.", "fail date": "  10/01/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The driver seat metal bracket broke while driving normally. I was shocked to learn about this. I have been driving for more than 23 years and had never heard about this situation. It is loose and a very serious safety concerns. As a consumer I expect that a car seat should last a lot longer than the car itself especially the driver seat.", "fail date": "  08/07/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The contact owns a 2007 Honda Pilot. The contact stated that after seating in the driver seat, the seat was rocking. The vehicle was taken to a dealer where it was diagnosed that the bracket and the driver seat needed to be replaced. The vehicle was not repaired. The manufacturer was not notified of the failure. The approximate failure mileage was 202,000.", "fail date": "  01/19/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "Drivers side heated leather seat gets unbearably hot under right leg.", "fail date": "  01/22/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "The contact owns a 2007 Honda Pilot. While parked, the contact activated the heated seat warmer for the front driver side seat. The contact stated that the seat became abnormally hot. The manufacturer was made aware of the failure and referred the contact to the dealer for diagnostics. The vehicle was not taken to the dealer for diagnostics or repairs. The approximate failure mileage was 140,000.", "fail date": "  01/01/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Seats", "Sub Problem": "Seats problems", "description": "Nylon side panel of the back portion of the driver seat has a row of empty stitch holes just under the pleat where the side and the leather seat panels are stitched. The holes started to expand and become larger eventually causing a tear. Other holes are just beginning the process and are starting to expand. Went to my dealer and service manager told me it is happening because of getting in and out of the car. Unsatisfied, he told me he would have regional inspector look at it. She said she could not make a determination and would send picture to a Honda engineer. Service manager took picture with his cell phone. Three weeks later after checking back with them I'm told it's not under warranty and they won't fix it with goodwill. Honda advertises 3 yr, 36000 mile bumper to bumper but for some reason, this is not covered. No explanation was given.", "fail date": "  03/15/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "While driving with six on board (car holds up to 8) I hit a moderate bump. The car made a loud bang, and felt unstable. At the same time, abs, vtm-4, and stabilty warning lights came on. I was in a construction zone with no place to stop, so I kept going. The instabilty seemed manageable, so I kept going to an exit. On the ramp, while cornering even slightly, there was a rubbing sound from the rear wheel area. In a straight line, it sounded okay, but didn't feel right. When we were able to park and get out, the rear wheels were splayed out (extreme negative camber) as if the car was grossly overloaded, even though if was empty. Upon inspection, I found that the two rear mounts for the subframe had completely pulled out of the unibody. The subframe had rusted from the inside, so there was no appearance of structurally significant rust until it failed. When the suspension subframe pulled away, it pulled apart the wiring for the abs, etc. This is a very unsafe condition that appeared with no warning. A quick internet search shows that it's also quite common.", "fail date": "  05/22/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "I had been hearing a noise as I turn the vehicle and it was inspected in July 2019. Two weeks ago I stopped for a quick checkup before a long trip and was told that it was dangerous to drive. The undercarriage near the wheels has cancerous rust beyond repair.", "fail date": "  10/20/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "On 09/09/2019 1:00 am I was awakened by neighbors that my 2007 Honda Pilot was on fire, police and fire dept. Responded and put out the flames, flame were in side dash board, ceiling, left and right quarter panels, sun roof and hood burned, front burned, plastic melting and fire everywhere, flames were 1 to 2 ft. High, all front lights in vehicle burned and melted, wires hanging, half the front vehicle totaled, during day light it was visible to see half the dash burned colapsed melted, you can see fuse box protruding hanging under dash. Wire harness, electronics, computer, burned. This does not even include damage inside engine under hood, flames were reaching out of hood. Neighbor has security cameras right in front of car, when she gets back from trip we'll see how it started I hope. I have police report available and pictures attached; you are welcome to visit and inspect vehicle. It's a total loss.", "fail date": "  09/09/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "The contact owns a 2007 Honda Pilot. The contact noticed that after rainy weather conditions, a puddle of water was present on the driver and passenger side floorboards. The water caused the pedals to become slippery and created mold throughout the vehicle. The failure recurred multiple times. The vehicle was not diagnosed or repaired. The manufacturer was notified. The approximate failure mileage was 97,635.", "fail date": "  10/27/2014"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "I got the letter from Honda. Based on the letter, the car has problem with the airbag module on the handle. I made appointment with one of dealer. However, it takes 5 months to replace the airbag in order to schedule.", "fail date": "  03/15/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Structure", "Sub Problem": "Body problems", "description": "Abnormal discoloration and corrosion on front grill as well as the front and rear chrome Honda emblems. Vehicle has only 2,750 miles. Dealer replaced the defective components as a one time warranty goodwill\". The service manager stated that an investigation by Honda pointed to use of mag chloride on roads. Dealer was not aware of any improvement plans by Honda. Pictures available at Hondapilot2007. Blogspot. Com.", "fail date": "  03/26/2007"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "I was a driving down a road at 35 miles an hour and I noticed that the d indicator started blinking. Soon after that my Pilot lost al power and it started to vibrate violently . I pulled over because I was holding up traffic and I was able to get it home because fortunately I was only blocks away.", "fail date": "  03/19/2020"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Tl the contact owns a 2007 Honda Pilot. The contact stated that the stability assist indicator illuminated and, shortly after, the vehicle started to jerk. Mcconnell Honda (2840 eastern blvd, montgomery, al 36116) was contacted and stated that there were no recalls on the vehicle. The manufacturer was not contacted. The vehicle was not diagnosed or repaired. The failure mileage was 134,174.", "fail date": "  04/16/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The contact owns a 2007 Honda Pilot. When the contact depressed the brake pedal, all the warning indicators illuminated and the engine revved as if the accelerator pedal was being depressed. The vehicle was taken to the dealer (south motors Honda, 16165 s dixie hwy, miami, FL 33157 (305) 256-2250), but was not diagnosed or repaired. The manufacturer was not notified. The VIN was unknown. The failure mileage was 150,000.", "fail date": "  01/10/2018"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "Transmission oil cooler leaked coolant into transmission stopping forward motion of vehicle wife was driving with young daughter left stranded on dark highway. A well known problem with this vehicle. Have read many incidents of this. Dealer passes cost of repair on to consumer Honda just ignores problem.", "fail date": "  08/02/2017"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The transmission in my Honda Pilot broke at 100k miles. The same thing happened to my 2002 Honda odyssey and Honda covered the repair because they knew that there were defects. Well the same defects caused the Pilot's transmission to become fully inoperable. But this time Honda will not cover it. Please note that the Pilot and odyssey are made on the same platform and have the same parts. Honda knows they have a faulty transmission and won't extend the warranty as they have in the past.", "fail date": "  01/14/2013"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "The contact owns a 2007 Honda Pilot. The contact stated that while driving approximately 50 mph, the vehicle began to jerk without warning. The vehicle was taken to a dealer where the failure was unable to be diagnosed. The technician informed the contact that the failure might be related to the transmission. The manufacturer was notified of the failure. The vehicle was not repaired. The approximate failure mileage was 110,000 and the current mileage was 148,000. The VIN was not available.", "fail date": "  05/09/2012"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Power Train", "Sub Problem": "Power Train problems", "description": "This is regarding my Honda Pilot lx 4wd 2007 model. 5 out of 10 times when I put my car in reverse it will move forward by a few feet, I have to then break and after this the car will reverse properly. This happens even if I am trying to reverse on a downward slope.", "fail date": "  01/01/2010"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "Tl the contact owns a 2007 Honda Pilot. While driving 55 mph, a burning rubber odor was detected and the brakes did not respond normally when the brake pedal was depressed. There were no warning indicators illuminated. The vehicle was taken to an independent mechanic who determined that the vehicle stability assist module failed and needed replacement. The mechanic recommended that the vehicle be taken to a dealer. The vehicle was not taken to a dealer. The manufacturer was notified of the failure. The vehicle was not repaired. The approximate failure mileage was 200,000.", "fail date": "  12/24/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "While we were driving on the highway. Going 55 mph when the lights of the radio and then the lights on the console began to flicker then they stayed dim my vertical would lose power and then would get power lime the gear was slipping then catching. It would make the car lunge foward then stop then lunge toward again . Then the a/c started turning off and on.", "fail date": "  08/03/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "Tl the contact owns a 2007 Honda Pilot. While driving 40 mph, the vehicle independently braked without the brake pedal being depressed. Also, the stability control warning indicator illuminated. The failure recurred on another occasion. The vehicle was taken to legends Honda kansas city (located at 10050 parallel pkwy, kansas city, KS 66109, (913) 871-9483) where it was diagnosed that the vsa module (code 841) needed to be replaced. The vehicle was not repaired. The manufacturer was notified of the failure and provided case number: 09644189. The approximate failure mileage was 24,000.", "fail date": "  06/05/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "Tl the contact owns a 2007 Honda Pilot. The contact stated that the stability assist indicator illuminated and, shortly after, the vehicle started to jerk. Mcconnell Honda (2840 eastern blvd, montgomery, al 36116) was contacted and stated that there were no recalls on the vehicle. The manufacturer was not contacted. The vehicle was not diagnosed or repaired. The failure mileage was 134,174.", "fail date": "  04/16/2019"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Electronic Stability Control", "Sub Problem": "Electronic Stability Control problems", "description": "Stability control (vsa) engages while driving automatically on all wheels locking the vehicle up and rendering the vehicle unmovable. This has been recalled in 2005-06 models.", "fail date": "  04/04/2016"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Visibility", "Sub Problem": "Side/rear Glass problems", "description": "No crash, however I question the strength of the glass used in windshields on 2007 Honda Pilots. I have replaced my third windshield in 3 years.", "fail date": "  03/31/2009"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Visibility", "Sub Problem": "Side/rear Glass problems", "description": "Heavy steering wheel vibration in the brand new vehicle purchased on 21st July 2007 taken back to the dealer for replacement of vehicle instead try to repair on 22nd July 2007 which vibrates the arms and chest of the driver. Sharp high frequency noise created by side windshields of driver and passenger causes irritation in the ears which causes psychological hearing of sound even while we sleep silently. No care has been taken to rectify the sound by the dealer nor ready to exchange the vehicle.", "fail date": "  07/21/2007"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "While driving with six on board (car holds up to 8) I hit a moderate bump. The car made a loud bang, and felt unstable. At the same time, abs, vtm-4, and stabilty warning lights came on. I was in a construction zone with no place to stop, so I kept going. The instabilty seemed manageable, so I kept going to an exit. On the ramp, while cornering even slightly, there was a rubbing sound from the rear wheel area. In a straight line, it sounded okay, but didn't feel right. When we were able to park and get out, the rear wheels were splayed out (extreme negative camber) as if the car was grossly overloaded, even though if was empty. Upon inspection, I found that the two rear mounts for the subframe had completely pulled out of the unibody. The subframe had rusted from the inside, so there was no appearance of structurally significant rust until it failed. When the suspension subframe pulled away, it pulled apart the wiring for the abs, etc. This is a very unsafe condition that appeared with no warning. A quick internet search shows that it's also quite common.", "fail date": "  05/22/2021"}, {"Vehicle": "Honda", "Model": "Pilot", "Model Year": "2007 Pilot", "Problem": "Suspension", "Sub Problem": "Suspension problems", "description": "I bought a 2007 Honda Pilot ex-l 2wd. I am disabled, so I require a hitch, electric chair lift to carry my electric wheelchair. I previously had a 2003 Toyota highlander 2wd, 4 cyl, with the exact same configuration. Since I have adapted my 2007 Honda Pilot with the equipment, I have found this vehicle is not capable of carrying the tongue weight load of about 350 lbs, which Honda published is adequate (I. E. Honda states a 2wd Pilot is capable of towing 3,500 lbs and a 4wd is capable of towing 4,500 lbs, which equates to an allowable tongue weight of 10% of towing weight which is 350 lbs for the 2wd and 450 lbs for the 4wd). I have spoken with the chief mechanic at hollywood Honda; the hitch experts; professionals at my wheelchair/lift facility and everyone agreew the 2007 Honda Pilot can not carry the tongue weight of 350 lbs in a safe and effective manner. The vehicle starts to lower the back end and the front end starts to lift upwards as the weight of the wheelchair on the lift starts to ascend. When the back end of the Honda Pilot has \"bottomed out\", then the wheelchair and lift start to ascend. When the wheelchair and lift ascend to its proper height as designed by the lift manufacturer, the lift and wheelchair are in a very vulnerable position which is not high enough to keep the lift from bottoming out and the entire wheelchair and lift from \"bouncing\" in manner which is uncontrollable, whcih gives the sensation of being out of control. Meanwhile, the front end of the Honda Pilot has escalated about 6 - 8 inches above its normal level plain. If Honda has conducted its evaluations in a satisfactory and safe manner as they publish a 2wd Honda Pilot can tow 3,500 lbs and a 4wd Honda Pilot can tow 4,500 lbs, then why can't the Honda Pilot effectively maintain the normal tongue weight of 10% of the towing weight which they stipulate? if you can assist me in making some determination pertaining to this issue, I will be gratefully appreciative.", "fail date": "  01/11/2007"}]